                                           
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
Функция ПолучитьНастройкиСоединения(Профиль) Экспорт
		
	МассивНаименованийПараметров = Новый Массив;  
		
	МассивНаименованийПараметров.Добавить("OzonApiKey");
	МассивНаименованийПараметров.Добавить("OzonClientID");
	МассивНаименованийПараметров.Добавить("OzonАдресСервисаAPI");
		
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_Профили.КоличествоОшибокЗапросов КАК КоличествоОшибокЗапросов,
	|	ИС_WB_Профили.КоличествоЭлементовНаЗапрос КАК КоличествоЭлементовНаЗапрос
	|ИЗ
	|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
	|ГДЕ
	|	ИС_WB_Профили.Ссылка = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Настройки = Неопределено Тогда
		Настройки = Новый Соответствие;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Если Выборка.Следующий() Тогда
	
		Для Каждого Элемент Из РезультатЗапроса.Колонки Цикл
			Настройки.Вставить(Элемент.Имя, Выборка[Элемент.Имя]);	
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат Настройки;		
	
КонецФункции //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127

//+ ИнфоСофт Украинцева А.А. 20.11.2023 УА #61911
Функция СоответствиеСтавокНДС() Экспорт

	СоответствиеСтавокНДС = Новый Соответствие;
	
	//@skip-check empty-except-statement
	Попытка
		//Соответствие значения ставки перечислению УТ, КА, ERP
		СоответствиеСтавокНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"), "Не облагается");
		СоответствиеСтавокНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0"), "Не облагается");
		СоответствиеСтавокНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10"), "10%");
		СоответствиеСтавокНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18"), "20%");
		СоответствиеСтавокНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20"), "20%");
	Исключение
	КонецПопытки;
	
	//@skip-check empty-except-statement
	Попытка
		//Соответствие значения ставки перечислению УНФ
		//@skip-check wrong-string-literal-content
		СоответствиеСтавокНДС.Вставить(ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.БезНДС"), "Не облагается");
		//@skip-check wrong-string-literal-content
		СоответствиеСтавокНДС.Вставить(ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.Нулевая"), "Не облагается");
		//@skip-check wrong-string-literal-content
		СоответствиеСтавокНДС.Вставить(ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.Пониженная"), "10%");
		//@skip-check wrong-string-literal-content
		СоответствиеСтавокНДС.Вставить(ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.Общая"), "20%");
	Исключение
	КонецПопытки;
	
	//@skip-check empty-except-statement
	Попытка
		
		//Дополнить соответствие значениями справочника для УТ 11.5  КА 2.5 ERP 2.5
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК Ссылка,
		|	СтавкиНДС.ПеречислениеСтавкаНДС КАК ПеречислениеСтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС";

		РезультатЗапросса = Запрос.Выполнить();
		Выборка = РезультатЗапросса.Выбрать();

		Пока Выборка.Следующий() Цикл
			Если Выборка.ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
				СоответствиеСтавокНДС.Вставить(Выборка.Ссылка, "10%");
			ИначеЕсли Выборка.ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18")
				Или Выборка.ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
				СоответствиеСтавокНДС.Вставить(Выборка.Ссылка, "20%");
			Иначе
				СоответствиеСтавокНДС.Вставить(Выборка.Ссылка, "Не облагается");
			КонецЕсли;
		КонецЦикла;

	Исключение
	КонецПопытки;
	
	
	//Соответствие значения ставки представлению
	СоответствиеСтавокНДС.Вставить("Не облагается", "0.0");
	СоответствиеСтавокНДС.Вставить("10%", "0.1");
	СоответствиеСтавокНДС.Вставить("20%", "0.2");
	
	//Соответствие представления ставки значению
	СоответствиеСтавокНДС.Вставить("0", 	"Не облагается");
	СоответствиеСтавокНДС.Вставить("0.000000", 	"Не облагается");
	СоответствиеСтавокНДС.Вставить("0.100000", 	"10%");
	СоответствиеСтавокНДС.Вставить("0.200000", 	"20%");
	 
	Возврат Новый ФиксированноеСоответствие(СоответствиеСтавокНДС);

КонецФункции

//- ИнфоСофт Украинцева А.А. 20.11.2023 УА #61911
#КонецОбласти
