
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстанавливатьОтбор = Истина;
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		УстанавливатьОтбор = Ложь;
	Иначе
		ИС_МП_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если УстанавливатьОтбор Тогда
		УстановитьОтборПоПрофилю();
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	УстановитьОтборПоПрофилю();
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура УстановитьОтборПоПрофилю()
	
	Если ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Профиль", Профиль);
		Элементы.Профиль.Видимость = Ложь;
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Профиль");	
		Элементы.Профиль.Видимость = Истина;
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти
