
#Область ОбработчикиСобытий

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(Профиль) Тогда
    	Возврат;
    КонецЕсли;
    
    Если Профиль.УдалятьОстатокПриПометкеНаУдалениеНоменклатуры И Не ЭтоНовый() Тогда
    
    	Если ПометкаУдаления И Не Ссылка.ПометкаУдаления Тогда
		
			Запрос = Новый Запрос; 
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИС_WB_РазмерыНоменклатур.Владелец.ТипТовара КАК ТипТовара
			|ПОМЕСТИТЬ ВТ_ТипТовара
			|ИЗ
			|	Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
			|ГДЕ
			|	ИС_WB_РазмерыНоменклатур.Ссылка = &Размер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИС_WB_ШтрихкодыРазмеров.Штрихкод КАК Штрихкод
			|ПОМЕСТИТЬ ВТ_Штрихкоды
			|ИЗ
			|	РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
			|ГДЕ
			|	ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль
			|	И ИС_WB_ШтрихкодыРазмеров.Размер = &Размер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИС_ВБ_Склады.Код КАК Код
			|ИЗ
			|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
			|ГДЕ
			|	ИС_ВБ_Склады.Профиль = &Профиль
			|	И НЕ ИС_ВБ_Склады.ПометкаУдаления
			|	И ИС_ВБ_Склады.ЗагруженИзЛК
			|	И ИС_ВБ_Склады.ТипТовара В
			|			(ВЫБРАТЬ ПЕРВЫЕ 1
			|				ВТ.ТипТовара
			|			ИЗ
			|				ВТ_ТипТовара КАК ВТ)
			|				
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ИС_ВБ_Склады.Код
			|ИЗ
			|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
			|ГДЕ 
			|	ЗНАЧЕНИЕ(Перечисление.ИС_ВБ_ТипыТоваров.КГТ) В (ВЫБРАТЬ ВТ.ТипТовара ИЗ ВТ_ТипТовара КАК ВТ)
			|	И ИС_ВБ_Склады.Профиль = &Профиль
			|	И НЕ ИС_ВБ_Склады.ПометкаУдаления
			|	И ИС_ВБ_Склады.ЗагруженИзЛК
			|	И ИС_ВБ_Склады.ТипТовара = ЗНАЧЕНИЕ(Перечисление.ИС_ВБ_ТипыТоваров.СГТ)
			|	И ИС_ВБ_Склады.ИспользоватьКГТ";

			Запрос.УстановитьПараметр("Профиль", Профиль);
			Запрос.УстановитьПараметр("Размер", Ссылка);

			РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
			
			ВыборкаШтрихкодов = РезультатыЗапроса[1].Выбрать();
			
			МассивШтрихкодов = Новый Массив;
			Пока ВыборкаШтрихкодов.Следующий() Цикл
				МассивШтрихкодов.Добавить(ВыборкаШтрихкодов.Штрихкод);
			КонецЦикла;
			
			ВыборкаСкладов = РезультатыЗапроса[2].Выбрать();
			
			Пока ВыборкаСкладов.Следующий() Цикл
				ИС_ВБ_Сервер.УдалитьОстаткиПоСкладу(Профиль, МассивШтрихкодов, ВыборкаСкладов.Код);	
			КонецЦикла;
			
    	КонецЕсли;
    
    КонецЕсли;
     
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

#КонецОбласти
