
#Область ОбработчикиСобытийФормы
 
//+ ИнфоСофт Стояк Ю.К. 18.09.2023 УА #61980
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОформление();	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 18.09.2023 УА #61980

//+ ИнфоСофт Стояк Ю.К. 18.09.2023 УА #61980
&НаКлиенте
Процедура ВыгружатьОстаткиИзГруппыСкладовПриИзменении(Элемент)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 18.09.2023 УА #61980

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
	    Элемент,
		Объект.АдресДоставки,
		Объект.АдресДоставкиЗначенияПолей);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтруктураПараметров = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки();
	СтруктураПараметров.ИмяРеквизитаАдресаДоставки 				= "АдресДоставки";
	СтруктураПараметров.ИмяРеквизитаАдресаДоставкиЗначенияПолей = "АдресДоставкиЗначенияПолей";
	СтруктураПараметров.ИмяРеквизитаАдресаДоставкиЗначение 		= "АдресДоставкиЗначение";  
	
	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	    Элемент,
		Объект,
		СтруктураПараметров,
		СтандартнаяОбработка);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	ДоставкаТоваровКлиент.ОчиститьПредставлениеАдреса(
		Объект.АдресДоставки,
		Объект.АдресДоставкиЗначенияПолей,
		Объект.АдресДоставкиЗначение);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресДоставкиПриИзменении(Элемент);	
	ДоставкаТоваровКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
	
	Модифицированность = Истина;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #76413
&НаКлиенте
Процедура АвтоматическиСоздаватьОрдерНаОтгрузкуПриИзменении(Элемент)
	УстановитьВидимостьОрдернойСхемы();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #76413

//+ ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95672
&НаКлиенте
Процедура СкладскоеПомещениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборПомещение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина); 
	
	ОткрытьФорму("Справочник.СкладскиеПомещения.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеВыбора);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95672

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 18.09.2023 УА #61980
&НаКлиенте
Процедура УстановитьОформление()
		
	Если ЗначениеЗаполнено(Объект.ОбщаяГруппаСкладов) Тогда
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Ложь;
		Элементы.ГруппаСкладов.Видимость = Ложь;
	Иначе
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Истина;
		Элементы.ГруппаСкладов.Видимость = Истина;
		Элементы.ГруппаСкладов.Видимость = Объект.ВыгружатьОстаткиИзГруппыСкладов;	
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 30.01.25 УА #88005
	Если Объект.ВыгружатьОстаткиИзГруппыСкладов Тогда
		Элементы.ИспользоватьОсновнойСкладВЗаказах.Видимость = Истина;	
	Иначе
		Элементы.ИспользоватьОсновнойСкладВЗаказах.Видимость = Ложь;
		Объект.ИспользоватьОсновнойСкладВЗаказах 			 = Ложь;
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 30.01.25 УА #88005
	
	УстановитьВидимостьОрдернойСхемы();
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 18.09.2023 УА #61980 

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #76413
&НаКлиенте
Процедура УстановитьВидимостьОрдернойСхемы()

	Элементы.СкладскоеПомещение.Видимость 			= Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;
	Элементы.СтатусРасходногоОрдера.Видимость 		= Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;
	Элементы.СтатусСтрокиРасходногоОрдера.Видимость = Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #76413

//+ ИнфоСофт Конышев А.Е. 03.12.24 УА #73126
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СоответствиеПараметровЗаписи = Новый Соответствие;
	СоответствиеПараметровЗаписи.Вставить("ЯндексСтандартнаяДоставка", Объект.СтандартнаяДоставка);
		
	ИС_MP_Сервер.ЗаписатьНастройкиСправочника(Объект.ЛичныйКабинет, СоответствиеПараметровЗаписи);
	
КонецПроцедуры //- ИнфоСофт Конышев А.Е. 03.12.24 УА #73126

//+ ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95672
&НаКлиенте
Процедура ОбработатьВыборПомещение(РезультатЗакрытия,ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СкладскоеПомещение =  РезультатЗакрытия;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95672

#КонецОбласти
