
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 13.11.23 УА #55166
//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
Функция СоздатьИлиДополнитьЗаказ(Шапка, Товары, ФукнциональныеОпции, Маркетплейс, Заказ = Неопределено, Назначения = Неопределено) Экспорт
//Функция СоздатьИлиДополнитьЗаказ(Шапка, Товары, ФукнциональныеОпции, Маркетплейс, Заказ = Неопределено) Экспорт
//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	
	Событие = ПолучитьИмяСобытия("СоздатьИлиДополнитьЗаказ");
	
	Если Заказ = Неопределено Или Заказ.Пустая() Тогда
		НовыйДокумент = Документы.ЗаказКлиента.СоздатьДокумент();
	Иначе
		НовыйДокумент = Заказ.ПолучитьОбъект();
	КонецЕсли;
	
	ГруппаСкладов = Шапка.ОбщаяГруппаСкладов;	
	Организация = ФукнциональныеОпции.Организация; 
	Партнер = ФукнциональныеОпции.Партнер; 
	Соглашение = ФукнциональныеОпции.Соглашение;
	Контрагент = ФукнциональныеОпции.Контрагент;
	Договор = ФукнциональныеОпции.Договор;
	
	ПродажаОблагаетсяНДС = ПолучитьПрименениеНДСОрганизации(Организация);
	
	Если ПродажаОблагаетсяНДС = Неопределено Тогда
	    ВызватьИсключение("Не заполнена учетная политика организации");
	КонецЕсли; 
	
	Если Заказ = Неопределено Тогда				
	    
	    Если ФукнциональныеОпции.РежимСозданияЗаказов = 2 Тогда
			НовыйДокумент.Дата = ТекущаяДатаСеанса();
		Иначе
			НовыйДокумент.Дата = Шапка.Дата;
		КонецЕсли;

		НовыйДокумент.Организация = Организация;
		НовыйДокумент.Подразделение = ФукнциональныеОпции.Подразделение; 
		
		НовыйДокумент.Партнер = Партнер;
		НовыйДокумент.Контрагент = Контрагент;      
		
		НовыйДокумент.НеОтгружатьЧастями = Ложь;
		
		ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
		
		Если ИспользоватьСоглашенияСКлиентами Тогда
			НовыйДокумент.ПорядокРасчетов = Соглашение.ПорядокРасчетов;
			НовыйДокумент.Менеджер = Соглашение.Менеджер;
			//+ ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
			Если ЗначениеЗаполнено(Соглашение.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Соглашение.НаправлениеДеятельности;            
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
		Иначе
			НовыйДокумент.Менеджер = Договор.Менеджер;
			//+ ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
			Если ЗначениеЗаполнено(Договор.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Договор.НаправлениеДеятельности;            
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
		КонецЕсли;
		
		НовыйДокумент.Договор = Договор;
		НовыйДокумент.Соглашение = Соглашение;
					
		НовыйДокумент.Статус = ФукнциональныеОпции.СтатусЗаказаКлиента; 
		НовыйДокумент.Приоритет = ФукнциональныеОпции.ПриоритетЗаказа;
	     
	    НовыйДокумент.ЦенаВключаетНДС = Соглашение.ЦенаВключаетНДС;
		
		Если ЗначениеЗаполнено(Соглашение.Валюта) Тогда
			НовыйДокумент.Валюта = Соглашение.Валюта;
		ИначеЕсли ЗначениеЗаполнено(Договор.ВалютаВзаиморасчетов) Тогда
			НовыйДокумент.Валюта = Договор.ВалютаВзаиморасчетов;
		Иначе
			НовыйДокумент.Валюта = Справочники.Валюты.НайтиПоКоду("643");
		КонецЕсли;		

		Если ЗначениеЗаполнено(Договор) Тогда
			НовыйДокумент.ХозяйственнаяОперация = Договор.ХозяйственнаяОперация; 
		ИначеЕсли ЗначениеЗаполнено(Соглашение) Тогда                                                                       
			НовыйДокумент.ХозяйственнаяОперация = Соглашение.ХозяйственнаяОперация; 
		КонецЕсли;
		
		//+ ИнфоСофт Заварин К.В. 05.12.24 УА #79415 
		Если ЗначениеЗаполнено(Соглашение) И Не Соглашение.ИспользуютсяДоговорыКонтрагентов Тогда 
			
			Если ЗначениеЗаполнено(Соглашение.ГруппаФинансовогоУчета) Тогда
				НовыйДокумент.ГруппаФинансовогоУчета 			= Соглашение.ГруппаФинансовогоУчета;            
			КонецЕсли;
			Если ЗначениеЗаполнено(Соглашение.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Соглашение.НаправлениеДеятельности;            
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Договор) Тогда 
			
			Если ЗначениеЗаполнено(Договор.ГруппаФинансовогоУчета) Тогда
				НовыйДокумент.ГруппаФинансовогоУчета 			= Договор.ГруппаФинансовогоУчета;            
			КонецЕсли;
			Если ЗначениеЗаполнено(Договор.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Договор.НаправлениеДеятельности;            
			КонецЕсли;
			
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 05.12.24 УА #79415
		
		Если ФукнциональныеОпции.РежимСозданияЗаказов = 0 Тогда
			НовыйДокумент.Комментарий = "Создан на основание заказа " + Маркетплейс + "а "; 
		Иначе
			НовыйДокумент.Комментарий = "Создан на основание заказов " + Маркетплейс + "а ";
		КонецЕсли;
	    
		Если ПродажаОблагаетсяНДС Тогда
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;			
		Иначе
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Шапка.СпособДоставки) Тогда
			НовыйДокумент.СпособДоставки = Шапка.СпособДоставки; 
		Иначе
			НовыйДокумент.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;	
		КонецЕсли;
		
		НовыйДокумент.ЗонаДоставки = Шапка.ЗонаДоставки;
		
		Если ЗначениеЗаполнено(Шапка.АдресДоставки) Тогда
			НовыйДокумент.АдресДоставки = Шапка.АдресДоставки;
			НовыйДокумент.АдресДоставкиЗначение = Шапка.АдресДоставкиЗначение;
			НовыйДокумент.АдресДоставкиЗначенияПолей = Шапка.АдресДоставкиЗначенияПолей;
		КонецЕсли;                
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах") Тогда
			НовыйДокумент.СкидкиРассчитаны = Истина;
		КонецЕсли;    
		
		НовыйДокумент.Грузополучатель = Шапка.Грузополучатель;
		НовыйДокумент.Грузоотправитель = Шапка.Грузоотправитель;
		НовыйДокумент.ПеревозчикПартнер = Шапка.ПеревозчикПартнер;
		
		Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Соглашение) Тогда 
			НовыйДокумент.ЗаполнитьУсловияПродажПоСоглашению();	
		КонецЕсли;
		
		//+ ИнфоСофт Заварин К.В. 09.01.25 УА #90561
		Если ПродажаОблагаетсяНДС Тогда
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;			
		Иначе
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 09.01.25 УА #90561
		
	КонецЕсли;	
	
	//+ ИнфоСофт Заварин К.В. 05.12.24 УА #88585
	Отбор = Новый Структура;
	
	Отбор.Вставить("Дата", НовыйДокумент.Дата);
	Отбор.Вставить("Организация", Организация);
	ТЗОтветственныеЛицаОрг = ОтветственныеЛицаСервер.ПолучитьТаблицуОтветственныхЛицПоОтбору(Отбор);
	
	НовыйДокумент.Руководитель = "";
	НовыйДокумент.ГлавныйБухгалтер = "";
	
	Для Каждого Результат Из ТЗОтветственныеЛицаОрг Цикл
		
		Если Строка(Результат.ОтветственноеЛицо) = "Руководитель" Тогда
			НовыйДокумент.Руководитель = Результат.Ссылка;
		ИначеЕсли Строка(Результат.ОтветственноеЛицо) = "Главный бухгалтер" Тогда
			НовыйДокумент.ГлавныйБухгалтер = Результат.Ссылка;
		КонецЕсли;		
	КонецЦикла;
    //- ИнфоСофт Заварин К.В. 05.12.24 УА #88585
	
	//+ ИнфоСофт Заварин К.В. 12.12.24 УА #89604
	Если ЗначениеЗаполнено(Договор) Тогда
		НовыйДокумент.БанковскийСчет = "";
		НовыйДокумент.БанковскийСчет = Договор.БанковскийСчет;		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 12.12.24 УА #89604
	
	Номер = СтрЗаменить(Шапка.Номер, Символы.НПП, ""); 	
	НовыйДокумент.Комментарий = СтрШаблон("%1%2; ", НовыйДокумент.Комментарий, Номер);
	
	НовыйДокумент.НомерПоДаннымКлиента = Номер;
	НовыйДокумент.ДатаПоДаннымКлиента = НовыйДокумент.Дата;
	
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99444
	ПострочнаяОтгрузка = Константы.ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента.Получить();
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99444
	
	Для Каждого Строка Из Товары Цикл
	
		Если Строка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
			ЭтоНабор = Истина;
		Иначе 
			ЭтоНабор = Ложь;
		КонецЕсли;
		
		ТоварыЗаказа = Новый ТаблицаЗначений;
		ТоварыЗаказа.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТоварыЗаказа.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		
		//+ ИнфоСофт Мурсалимов Д.Р. 26.08.24 УА #82005
		ТоварыЗаказа.Колонки.Добавить("Упаковка");
		//- ИнфоСофт Мурсалимов Д.Р. 26.08.24 УА #82005
		
		ТоварыЗаказа.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10, 0)));
		ТоварыЗаказа.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
		ТоварыЗаказа.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
		
		//+ ИнфоСофт Заварин К.В. 11.02.25 УА #93503
		ТоварыЗаказа.Колонки.Добавить("ОстатокНеСвободен", Новый ОписаниеТипов("Булево")); 
		//- ИнфоСофт Заварин К.В. 11.02.25 УА #93503
		
		СтрокаТовары = ТоварыЗаказа.Добавить();
		СтрокаТовары.Номенклатура = Строка.Номенклатура;
		СтрокаТовары.Характеристика = Строка.Характеристика;
		
		//+ ИнфоСофт Мурсалимов Д.Р. 26.08.24 УА #82005
		СтрокаТовары.Упаковка = Строка.Упаковка;
		//- ИнфоСофт Мурсалимов Д.Р. 26.08.24 УА #82005
		
		СтрокаТовары.Количество = Строка.Количество;
		//+ ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208  
		Если ФукнциональныеОпции.Свойство("ЦенаЛотаВЗаказ") И ФукнциональныеОпции.ЦенаЛотаВЗаказ Тогда
			СтрокаТовары.Цена = Строка.Цена;
		ИначеЕсли ФукнциональныеОпции.Свойство("ЦенаЛотаВЗаказ") Тогда
			СтрокаТовары.Цена = Строка.ЦенаДоСкидки;            
		Иначе
			СтрокаТовары.Цена = Строка.Цена;
		КонецЕсли;                                    
		//- ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208
		СтрокаТовары.Сумма = Строка.Количество * СтрокаТовары.Цена;
				
		Если ЭтоНабор Тогда
													
		ТоварыЗаказаТЗ = ПолучитьТаблицуТоваровНабора(ТоварыЗаказа);
		
		МассивКоэфф = РассчитатьДолюСтоимости(ТоварыЗаказаТЗ, ФукнциональныеОпции.ВидЦены, НовыйДокумент.Дата);
		Если ТоварыЗаказаТЗ[0].ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям Тогда				
			СуммаПродажиПриДолях = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТоварыЗаказаТЗ[0].Сумма, ТоварыЗаказаТЗ.ВыгрузитьКолонку("ДоляСтоимости"));
		ИначеЕсли МассивКоэфф <> Неопределено Тогда
			СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТоварыЗаказаТЗ[0].Сумма, МассивКоэфф);
		Иначе
			
			МассивКоэфф = Новый Массив;
			
			Для Каждого Элемент Из ТоварыЗаказаТЗ Цикл				
				МассивКоэфф.Добавить(Элемент.Количество);			
			КонецЦикла;
			
			СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТоварыЗаказаТЗ[0].Сумма, МассивКоэфф);

		КонецЕсли;                                  

		Иначе  			
			ТоварыЗаказаТЗ = ТоварыЗаказа;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГруппаСкладов) Тогда
			
			НовыйДокумент.Склад = ГруппаСкладов;
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083			
			//РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, ГруппаСкладов);
			РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, ГруппаСкладов, Назначения);
			//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
			СтрокаРезультат = РезультатПроверки[0];
			
			Если СтрокаРезультат.ОстатокВНаличии Тогда
				СкладСОстатком = СтрокаРезультат.Склад;
			Иначе 
				СкладСОстатком = Шапка.Склад;
			КонецЕсли; 
			
			//+ ИнфоСофт Заварин К.В. 02.04.25 УА #97851
		ИначеЕсли Шапка.СкладМП.ИспользоватьОсновнойСкладВЗаказах Тогда
			
			Если ЗначениеЗаполнено(Шапка.СкладМП.Склад) Тогда
				НовыйДокумент.Склад = Шапка.СкладМП.Склад;
			Иначе
				НовыйДокумент.Склад = Шапка.СкладМП.ГруппаСкладов[0].Склад;
			КонецЕсли;	
			
			СкладСОстатком = НовыйДокумент.Склад;
			
			РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, СкладСОстатком, Назначения);			
			//- ИнфоСофт Заварин К.В. 02.04.25 УА #97851
			
		ИначеЕсли Шапка.ВыгружатьОстаткиИзГруппыСкладов И ФукнциональныеОпции.РежимСозданияЗаказов <> 2 Тогда
			
			Склады = Шапка.СкладМП.ГруппаСкладов.ВыгрузитьКолонку("Склад");			
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083			
			//РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, Склады);
			РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, Склады, Назначения);
			//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
			
			СкладСОстатком = Шапка.Склад;
			
			Для Каждого СкладСписка Из Склады Цикл
				
				НайденныйСклад = РезультатПроверки.НайтиСтроки(Новый Структура("Склад", СкладСписка));
				Если НайденныйСклад.Количество() > 0 Тогда
				
					Если НайденныйСклад[0].ОстатокВНаличии Тогда 
				    	СкладСОстатком = НайденныйСклад[0].Склад;
				    	Прервать;
				    КонецЕсли;
				    
				КонецЕсли;
				
			КонецЦикла;
					   	
		   	НовыйДокумент.Склад = СкладСОстатком;
			
		Иначе 

			НовыйДокумент.Склад = Шапка.Склад;
			СкладСОстатком = Шапка.Склад;			
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083			
			//РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, СкладСОстатком);
			РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, СкладСОстатком, Назначения);
			//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083

		КонецЕсли;
		
		//+ ИнфоСофт Заварин К.В. 02.04.25 УА #97851
		//+ ИнфоСофт Заварин К.В. 31.01.25 УА #88005
		//Если Шапка.СкладМП.ИспользоватьОсновнойСкладВЗаказах Тогда
		//	Если ЗначениеЗаполнено(Шапка.СкладМП.Склад) Тогда
		//		НовыйДокумент.Склад = Шапка.СкладМП.Склад;
		//	Иначе
		//		НовыйДокумент.Склад = Шапка.СкладМП.ГруппаСкладов[0].Склад;
		//	КонецЕсли;	
		//КонецЕсли;			
		//- ИнфоСофт Заварин К.В. 30.01.25 УА #88005
		//- ИнфоСофт Заварин К.В. 02.04.25 УА #97851
		
		Для Каждого Элемент Из ТоварыЗаказаТЗ Цикл
			
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
				
			//+ ИнфоСофт Заварин К.В. 12.02.25 УА #93503
			//Если ЭтоНабор Тогда
			Если ЭтоНабор И Не Элемент.ОстатокНеСвободен Тогда
			//- ИнфоСофт Заварин К.В. 12.02.25 УА #93503

				НоваяСтрока.НоменклатураНабора = Элемент.Набор;
				//+ ИнфоСофт Мурсалимов Д.Р. 28.05.24 УА #76561
				НоваяСтрока.ХарактеристикаНабора = Элемент.ХарактеристикаНабора;
				//- ИнфоСофт Мурсалимов Д.Р. 28.05.24 УА #76561
				
				Если Элемент.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям Тогда
					Элемент.Сумма = СуммаПродажиПриДолях[0];
					СуммаПродажиПриДолях.Удалить(0);	
				Иначе					
				
					Если МассивКоэфф = Неопределено Тогда
						ОбщегоНазначения.СообщитьПользователю("Проверьте наличие цены на набор/его комплектующие " + Элемент.Набор);
						Элемент.Сумма = Элемент.Сумма / Элемент.КоличествоОбщее * Элемент.Количество;
					Иначе
						Элемент.Сумма = СуммыПродажи[0];
						СуммыПродажи.Удалить(0);
					КонецЕсли;
				
				КонецЕсли;
				
				Элемент.Цена = Элемент.Сумма / Элемент.Количество;
			
			КонецЕсли; 
			
			//+ ИнфоСофт Мурсалимов Д.Р. 05.06.24 УА #77046
			НоваяСтрока.ВидЦены = ФукнциональныеОпции.ВидЦены;
			//- ИнфоСофт Мурсалимов Д.Р. 05.06.24 УА #77046
			
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;
			НоваяСтрока.Характеристика = Элемент.Характеристика;		
			
			НоваяСтрока.Склад = СкладСОстатком;
			
			НоваяСтрока.КоличествоУпаковок = Элемент.Количество;
			НоваяСтрока.Количество = Элемент.Количество;
			
			//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
			СтрокаСОстатком = РезультатПроверки.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад", Элемент.Номенклатура, Элемент.Характеристика, СкладСОстатком));
			
			ЕстьОстаток = ?(СтрокаСОстатком.Количество() > 0, СтрокаСОстатком[0].ОстатокВНаличии, Ложь);
			
			//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
			ИспользованВариантОбеспеченияПриНехватке = Ложь;
			//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
			
			//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99444
			Если Не ПострочнаяОтгрузка И НовыйДокумент.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению") Тогда				
				НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;								
			ИначеЕсли Не ПострочнаяОтгрузка 
				И НовыйДокумент.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОтгрузке") Тогда
				НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;				
			//Если Не ЕстьОстаток И ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияПриНехватке) Тогда
			ИначеЕсли Не ЕстьОстаток И ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияПриНехватке) Тогда
			//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99444			
				НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспеченияПриНехватке;						
				//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
				ИспользованВариантОбеспеченияПриНехватке = Истина;
				//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
			Иначе
				НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспечения;
			КонецЕсли;  
			//НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспечения;				
			//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801		    
			
			//+ ИнфоСофт Заварин К.В. 12.02.25 УА #93503
			Если ФукнциональныеОпции.ОтделятьТоварыПриНехватке Тогда
				
				Если Не Элемент.ОстатокНеСвободен Тогда
					
					Если ЕстьОстаток И Элемент.Количество > СтрокаСОстатком[0].Свободно  Тогда			
						
						СтрокаТоварыЗаказаТЗСвободные = ТоварыЗаказаТЗ.Добавить();
						
						ЗаполнитьЗначенияСвойств(СтрокаТоварыЗаказаТЗСвободные, Элемент);
						СтрокаТоварыЗаказаТЗСвободные.Количество 	 	 = Элемент.Количество - СтрокаСОстатком[0].Свободно;
						СтрокаТоварыЗаказаТЗСвободные.Сумма 	 	 	 = Элемент.Сумма - Элемент.Цена * СтрокаСОстатком[0].Свободно; 
						СтрокаТоварыЗаказаТЗСвободные.ОстатокНеСвободен  = Истина;
						
						НоваяСтрока.Сумма = Элемент.Цена * СтрокаСОстатком[0].Свободно;
						НоваяСтрока.Количество = СтрокаСОстатком[0].Свободно;
						НоваяСтрока.КоличествоУпаковок = СтрокаСОстатком[0].Свободно;
						
					КонецЕсли;	
					
				КонецЕсли;
				
				Если Элемент.ОстатокНеСвободен И ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияПриНехватке) Тогда
					НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспеченияПриНехватке;	
				КонецЕсли;
				
			КонецЕсли;
			//- ИнфоСофт Заварин К.В. 11.02.25 УА #93503
			
			//СуткиВСекундах = 86400;
			//Если ФукнциональныеОпции.РассчитыватьДатыОтгрузки Тогда
			//	
			//	ВремяОтсчета = ФукнциональныеОпции.ВремяОтсчета - Дата(1, 1, 1);
			//	ВремяЗаказа = НовыйДокумент.Дата - НачалоДня(НовыйДокумент.Дата);
			//	
			//	Если ВремяОтсчета > ВремяЗаказа Тогда
			//		НоваяСтрока.ДатаОтгрузки = Шапка.Дата + СуткиВСекундах;		
			//	Иначе	
			//		НоваяСтрока.ДатаОтгрузки = Шапка.Дата + СуткиВСекундах * ФукнциональныеОпции.КоличествоДнейКОтгрузке;	
			//	КонецЕсли;	
			//
			//Иначе
			//	НоваяСтрока.ДатаОтгрузки = Шапка.Дата + СуткиВСекундах;	
			//КонецЕсли;
			
			НоваяСтрока.ДатаОтгрузки = Шапка.ДатаОтгрузки;	
			
			Если ПродажаОблагаетсяНДС Тогда					
				
				НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС;
				
				НДС = ПолучитьПроцентНДС(Элемент.Номенклатура.СтавкаНДС);
				
				//+ ИнфоСофт Мурсалимов Д.Р. 24.01.25 УА #91921
				//Если НДС = 0 Или НДС = Неопределено Тогда
				//	НоваяСтрока.СуммаНДС = Элемент.Сумма;						
				//Иначе
				//	НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(Элемент.Сумма, НДС, Истина);						
				//КонецЕсли;                                     
				
				Если НДС = 0 Или НДС = Неопределено Тогда
					НоваяСтрока.СуммаНДС = 0;						
				Иначе
					НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(Элемент.Сумма, НДС, Истина);						
				КонецЕсли;
				//- ИнфоСофт Мурсалимов Д.Р. 24.01.25 УА #91921
				
				НоваяСтрока.Сумма = Элемент.Сумма;
				НоваяСтрока.СуммаСНДС = Элемент.Сумма;
				
			Иначе 					
				
				НоваяСтрока.СуммаНДС = 0;
				НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
				НоваяСтрока.Сумма = Элемент.Сумма;
				НоваяСтрока.СуммаСНДС = Элемент.Сумма;	
							
			КонецЕсли;	
			
			НоваяСтрока.Цена = Элемент.Цена;
			
			//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			НоваяСтрока.Количество 	= Строка.КоэффициентУпаковки * НоваяСтрока.Количество;
			НоваяСтрока.Упаковка 	= Элемент.Упаковка;	
			//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			
			Если Соглашение.ОбеспечиватьЗаказыОбособленно тогда
				НоваяСтрока.Обособленно = Истина;	
			КонецЕсли;
			
			//+ ИнфоСофт Заварин К.В. 25.11.24 УА #79380
			Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
				
				Если ФукнциональныеОпции.Свойство("СоздатьЗаказНаСборку") И ФукнциональныеОпции.СоздатьЗаказНаСборку Тогда	
					
					НовыйДокумент.Записать();
					ИС_MP_РаботаСЗаказами.ПроверкаНаличияКомплектов(Маркетплейс, НовыйДокумент, СкладСОстатком,,НоваяСтрока);
					НовыйДокумент = НовыйДокумент.ПолучитьОбъект();
					
				КонецЕсли;
				
			КонецЕсли;                                     
			
			Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
				
				Если ФукнциональныеОпции.Свойство("АлиСоздатьЗаказНаСборку") И ФукнциональныеОпции.АлиСоздатьЗаказНаСборку Тогда
					
					НовыйДокумент.Записать();
					ИС_MP_РаботаСЗаказами.ПроверкаНаличияКомплектов(Маркетплейс, НовыйДокумент, СкладСОстатком,,НоваяСтрока);
					НовыйДокумент = НовыйДокумент.ПолучитьОбъект();
					
				КонецЕсли;
				
			КонецЕсли;                                     
			//- ИнфоСофт Заварин К.В. 25.11.24 УА #79380
			
		КонецЦикла;
	
	КонецЦикла;
	
	Если ФукнциональныеОпции.СтатусЗаказаКлиента = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Тогда
		Статус = "КОбеспечению";
	ИначеЕсли ФукнциональныеОпции.СтатусЗаказаКлиента = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда	
		Статус = "КОтгрузке";		
	ИначеЕсли ФукнциональныеОпции.СтатусЗаказаКлиента = Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда	
		Статус = "НеСогласован";
	Иначе
		Статус = "КОтгрузке";
	КонецЕсли;
	
	НовыйДокумент.УстановитьСтатус(Статус, Неопределено);
	
	НовыйДокумент.ДатаОтгрузки = Шапка.ДатаОтгрузки; 
	
	//+ ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	//+ ИнфоСофт Мурсалимов Д.Р. 12.03.24 УА #67173	
	//Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
	//	
	//	//+ ИнфоСофт Заварин К.В. 27.09.24 УА #77549
	//	//Если ФукнциональныеОпции.Свойство("СберСоздатьЗаказНаСборку") И ФукнциональныеОпции.СберСоздатьЗаказНаСборку Тогда
	//	Если ФукнциональныеОпции.Свойство("СоздатьЗаказНаСборку") И ФукнциональныеОпции.СоздатьЗаказНаСборку Тогда	
	//	//- ИнфоСофт Заварин К.В. 27.09.24 УА #77549
	//		
	//		НовыйДокумент.Записать();
	//		ИС_MP_РаботаСЗаказами.ПроверкаНаличияКомплектов(Маркетплейс, НовыйДокумент, СкладСОстатком);
	//		НовыйДокумент = НовыйДокумент.ПолучитьОбъект();
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;                                     
	//
	//Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
	//	
	//	Если ФукнциональныеОпции.Свойство("АлиСоздатьЗаказНаСборку") И ФукнциональныеОпции.АлиСоздатьЗаказНаСборку Тогда
	//		
	//		НовыйДокумент.Записать();
	//		ИС_MP_РаботаСЗаказами.ПроверкаНаличияКомплектов(Маркетплейс, НовыйДокумент, СкладСОстатком);
	//		НовыйДокумент = НовыйДокумент.ПолучитьОбъект();
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;                                     
	//- ИнфоСофт Мурсалимов Д.Р. 12.03.24 УА #67173
	//- ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	
	ЗаписыватьДокумент = Ложь;
	Если ФукнциональныеОпции.ПроводитьЗаказы Тогда
		
		Попытка
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			ЗаписыватьДокумент = Истина;
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
		
	Иначе
		ЗаписыватьДокумент = Истина;	
	КонецЕсли;

	Если ЗаписыватьДокумент Тогда	
		
		Попытка
			НовыйДокумент.Записать();			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			Возврат Документы.ЗаказКлиента.ПустаяСсылка();
		КонецПопытки;
		
	КонецЕсли;
	
	//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
	Если ИспользованВариантОбеспеченияПриНехватке Тогда 
		Текст = СтрШаблон("%1 создан с использованием варианта обеспечения при нехватке товара", НовыйДокумент.Ссылка);    
    	ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст, УровеньЖурналаРегистрации.Информация);
	КонецЕсли;
	//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
	
	Возврат НовыйДокумент.Ссылка;
    	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.11.23 УА #55166  

//+ ИнфоСофт Мурсалимов Д.Р. 28.02.24 УА #67173 

//+ ИнфоСофт Заварин К.В. 25.11.24 УА #79380
//Процедура ПроверкаНаличияКомплектов(Маркетплейс, ЗаказКлиента, Склад, Профиль = Неопределено) Экспорт
Процедура ПроверкаНаличияКомплектов(Маркетплейс, ЗаказКлиента, Склад, Профиль = Неопределено, ТоварЗаказа) Экспорт
//- ИнфоСофт Заварин К.В. 25.11.24 УА #79380

	ЗаказКлиента = ЗаказКлиента.Ссылка;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		
		ЗапросНазначений = Новый Запрос;
		ЗапросНазначений.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
		|ИЗ
		|	Справочник.ИС_ВБ_Склады.НаправленияДеятельности КАК ИС_ВБ_СкладыНаправленияДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|		ПО ИС_ВБ_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности 
		|			И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|ГДЕ
		|	ИС_ВБ_СкладыНаправленияДеятельности.Ссылка = &Ссылка"; 
		
		ЗапросНазначений.УстановитьПараметр("Ссылка", Склад);
	
		РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
		
		Назначения = Новый Массив;
		
		ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
		
		Пока ВыборкаНазначения.Следующий() Цикл
			
			Назначения.Добавить(ВыборкаНазначения.Назначение);
			
		КонецЦикла;  
		
		Если Назначения.Количество() = 0 Тогда
			
			Назначения = Справочники.Назначения.ПустаяСсылка();
			
		КонецЕсли;
		
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда 
		
		ЗапросНазначений = Новый Запрос;
		ЗапросНазначений.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
		|ИЗ
		|	Справочник.ИС_Ozon_Склады.НаправленияДеятельности КАК ИС_Ozon_СкладыНаправленияДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|		ПО ИС_Ozon_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|ГДЕ
		|	ИС_Ozon_СкладыНаправленияДеятельности.Ссылка = &Ссылка"; 
		
		ЗапросНазначений.УстановитьПараметр("Ссылка", Склад);
	
		РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
		
		Назначения = Новый Массив;
		
		ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
		
		Пока ВыборкаНазначения.Следующий() Цикл
			
			Назначения.Добавить(ВыборкаНазначения.Назначение);
			
		КонецЦикла;  
		
		Если Назначения.Количество() = 0 Тогда
			
			Назначения = Справочники.Назначения.ПустаяСсылка();
			
		КонецЕсли;
		
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда 
		
		ЗапросНазначений = Новый Запрос;
		ЗапросНазначений.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
		|ИЗ
		|	Справочник.ИС_ЯМ_Склады.НаправленияДеятельности КАК ИС_ЯМ_СкладыНаправленияДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|		ПО ИС_ЯМ_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|ГДЕ
		|	ИС_ЯМ_СкладыНаправленияДеятельности.Ссылка = &Ссылка"; 
		
		ЗапросНазначений.УстановитьПараметр("Ссылка", Склад);
	
		РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
		
		Назначения = Новый Массив;
		
		ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
		
		Пока ВыборкаНазначения.Следующий() Цикл
			
			Назначения.Добавить(ВыборкаНазначения.Назначение);
			
		КонецЦикла;  
		
		Если Назначения.Количество() = 0 Тогда
			
			Назначения = Справочники.Назначения.ПустаяСсылка();
			
		КонецЕсли;
		
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		
		ЗапросНазначений = Новый Запрос;
		ЗапросНазначений.Текст = 
		"ВЫБРАТЬ
		|	ИС_MP_Настройки.Хранилище КАК Хранилище
		|ИЗ
		|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
		|ГДЕ
		|	ИС_MP_Настройки.ЛичныйКабинет = &Профиль
		|	И ИС_MP_Настройки.Наименование = ""Назначение""";
		
		ЗапросНазначений.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
		
		Назначения = Новый Массив;
		
		ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
		
		Пока ВыборкаНазначения.Следующий() Цикл 
			
			СписокЗначений = ВыборкаНазначения.Хранилище.Получить();
			
			Для Каждого Элемент Из СписокЗначений Цикл
				
				Назначения.Добавить(Элемент.Значение);	
				
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		
		Назначения = Новый Массив;
		
		Назначения.Добавить(Справочники.Назначения.ПустаяСсылка());                             
		
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	//+ ИнфоСофт Сумин Д.В. 07.04.2024 УА #67384	
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика
	//+ ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	//+ ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689	
	//|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки
	//- ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689 
	//- ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	|ПОМЕСТИТЬ ВТ_ТоварыВЗаказе
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО (ЗаказКлиентаТовары.Ссылка = ЗаказКлиента.Ссылка)
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ЗаказКлиента
	//+ ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689
	|	И ЗаказКлиентаТовары.ВариантОбеспечения <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	//- ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВариантыКомплектацииНоменклатурыТовары.Номенклатура ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЭтоКомплект,
	|	ВТ_ТоварыВЗаказе.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыВЗаказе.Характеристика КАК Характеристика
	//+ ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	//+ ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689
	//|	ВТ_ТоварыВЗаказе.НомерСтроки КАК НомерСтроки
	//- ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689
	//- ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	|ПОМЕСТИТЬ ВТ_Комплектация
	|ИЗ
	|	ВТ_ТоварыВЗаказе КАК ВТ_ТоварыВЗаказе
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|			ПО (ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка)
	|		ПО (ВариантыКомплектацииНоменклатуры.Владелец.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор))
	|			И ВТ_ТоварыВЗаказе.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
	|			И ВТ_ТоварыВЗаказе.Характеристика = ВариантыКомплектацииНоменклатуры.Характеристика
	|ГДЕ
	|	(ВариантыКомплектацииНоменклатуры.Владелец, ВариантыКомплектацииНоменклатуры.Характеристика) В
	|			(ВЫБРАТЬ
	|				ВТ.Номенклатура КАК Номенклатура,
	|				ВТ.Характеристика КАК Характеристика
	|			ИЗ
	|				ВТ_ТоварыВЗаказе КАК ВТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыВЗаказе.Номенклатура,
	|	ВТ_ТоварыВЗаказе.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспределениеЗапасов.Свободно КАК Свободно,
	|	ВТ_Комплектация.Номенклатура КАК Номенклатура,
	|	ВТ_Комплектация.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_КомплектОстаток
	|ИЗ
	|	ВТ_Комплектация КАК ВТ_Комплектация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО ВТ_Комплектация.Номенклатура = РаспределениеЗапасов.Номенклатура
	|			И ВТ_Комплектация.Характеристика = РаспределениеЗапасов.Характеристика
	|ГДЕ
	|	РаспределениеЗапасов.Склад В ИЕРАРХИИ(&Склад1С)
	|	И РаспределениеЗапасов.Назначение В(&Назначение)
	|	И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_КомплектОстаток.Свободно, 0) КАК КомплектСвободно,
	|	ВТ_Комплектация.ЭтоКомплект КАК ЭтоКомплект,
	|	ВТ_Комплектация.Номенклатура КАК Номенклатура,
	|	ВТ_Комплектация.Характеристика КАК Характеристика
	//+ ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	//+ ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689
	//|	ВТ_Комплектация.НомерСтроки КАК НомерСтроки
	//- ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689
	//- ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	|ИЗ
	|	ВТ_Комплектация КАК ВТ_Комплектация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомплектОстаток КАК ВТ_КомплектОстаток
	|		ПО ВТ_Комплектация.Номенклатура = ВТ_КомплектОстаток.Номенклатура
	|			И ВТ_Комплектация.Характеристика = ВТ_КомплектОстаток.Характеристика
	|ГДЕ
	|	ВТ_Комплектация.ЭтоКомплект
	|	И ЕСТЬNULL(ВТ_КомплектОстаток.Свободно, 0) < 0.1"; 
	//- ИнфоСофт Сумин Д.В. 07.04.2024 УА #67384 
	
	Запрос.УстановитьПараметр("Назначение", Назначения); 
	Запрос.УстановитьПараметр("Склад1С", ЗаказКлиента.Склад);
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента); 
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ДанныеКомплектов = РезультатЗапроса.Выгрузить();
	
	Для Каждого Элемент Из ДанныеКомплектов Цикл 
		
		//+ ИнфоСофт Заварин К.В. 22.11.24 УА #79380
		
		//+ ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689
		//СоздатьЗаказНаСборкуКомплектов(Маркетплейс, ЗаказКлиента, Склад, Элемент); 
		//СоздатьЗаказНаСборкуКомплектов(Маркетплейс, ЗаказКлиента, Склад); 
		//Возврат;	  
		//- ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689
		
		Если ТоварЗаказа.Номенклатура = Элемент.Номенклатура И ТоварЗаказа.Характеристика = Элемент.Характеристика Тогда
			СоздатьЗаказНаСборкуКомплектов(Маркетплейс, ЗаказКлиента, Склад, ТоварЗаказа); 	
			Прервать;	
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 22.11.24 УА #79380
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.02.24 УА #67173 

//+ ИнфоСофт Мурсалимов Д.Р. 28.02.24 УА #67173
Процедура СоздатьЗаказНаСборкуКомплектов(Маркетплейс, ЗаказКлиента, Склад, Элемент) Экспорт
	
	Событие = ПолучитьИмяСобытия("СоздатьЗаказНаСборкуКомплектов");
	
	ЗаказНаСборку = Документы.ЗаказНаСборку.СоздатьДокумент(); 
	ЗаказНаСборку.Комментарий = ЗаказКлиента.Комментарий; 
	ЗаказНаСборку.Дата = ЗаказКлиента.Дата;
	ЗаказНаСборку.Подразделение = ЗаказКлиента.Подразделение; 
	
	//+ ИнфоСофт Заварин К.В. 22.11.24 УА #79380
	//+ ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689	
	//МассивСтрок = Новый Массив; 
	//Для Каждого Строка Из ЗаказКлиента.Товары Цикл 
	//	Если Строка.НомерСтроки = Элемент.НомерСтроки Тогда
	//		МассивСтрок.Добавить(Строка); 
	//	КонецЕсли;
	//КонецЦикла; 
	//ТЗ = ЗаказКлиента.Товары.Выгрузить(МассивСтрок); 	
	//- ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689
	//- ИнфоСофт Заварин К.В. 22.11.24 УА #79380
	
	СтруктураДанных = Новый Структура;          
	
	//+ ИнфоСофт Заварин К.В. 22.11.24 УА #79380
	
	//+ ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689
	//СтруктураДанных.Вставить("АдресТовары", ПоместитьВоВременноеХранилище(ЗаказКлиента.Товары.Выгрузить(), Новый УникальныйИдентификатор)); 
	//СтруктураДанных = Новый Структура; СтруктураДанных.Вставить("АдресТовары", ПоместитьВоВременноеХранилище(ТЗ, Новый УникальныйИдентификатор));
	//- ИнфоСофт Стояк Ю.К. 02.11.2024 УА #86689
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(ЗаказКлиента.Товары[Элемент.НомерСтроки - 1]);	
	
	СтруктураДанных.Вставить("АдресТовары", ПоместитьВоВременноеХранилище(ЗаказКлиента.Товары.Выгрузить(МассивСтрок), Новый УникальныйИдентификатор));
	//- ИнфоСофт Заварин К.В. 22.11.24 УА #79380
	
	СтруктураДанных.Вставить("Основание", ЗаказКлиента.Ссылка);
	СтруктураДанных.Вставить("Склад", ЗаказКлиента.Склад);
	
	ЗаказНаСборку.Заполнить(СтруктураДанных);
	
	ЗаказНаСборку.Организация = ЗаказКлиента.Организация;
	
	ЗаказНаСборку.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;  
	
	ЗаказНаСборку.ДокументОснование = ЗаказКлиента.Ссылка;
	
	ЗаказНаСборку.Подразделение = ЗаказКлиента.Подразделение;
	
	ЗаказНаСборку.НачалоСборкиРазборки = ЗаказКлиента.Дата;
	ЗаказНаСборку.ОкончаниеСборкиРазборки = ЗаказКлиента.Дата; 
	
	ОбеспечиватьОбособленно = ЗаказКлиента.Соглашение.ОбеспечиватьЗаказыОбособленно;
	//+ ИнфоСофт Сумин Д.В. 10.04.2024 УА #74033
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Или Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Или Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда 
		НаправленияДеятельностиИспользуются = Склад.НаправленияДеятельности.Количество() > 0;	
	Иначе
		НаправленияДеятельностиИспользуются = Ложь;	
	КонецЕсли;	
	//НаправленияДеятельностиИспользуются = Склад.НаправленияДеятельности.Количество() > 0;
	//НаправленияДеятельностиИспользуются = Ложь;
	//- ИнфоСофт Сумин Д.В. 10.04.2024 УА #74033
	Если ОбеспечиватьОбособленно И НаправленияДеятельностиИспользуются Тогда
		
		ЗаказНаСборку.НаправлениеДеятельности = ЗаказКлиента.Договор.НаправлениеДеятельности;
		
		ЗаказНаСборку.Назначение = Справочники.Назначения.НайтиПоРеквизиту("НаправлениеДеятельности", ЗаказКлиента.Договор.НаправлениеДеятельности);

	КонецЕсли;	
	
	Для Каждого Элемент Из ЗаказНаСборку.Товары Цикл
		
		Элемент.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
		
		Если ОбеспечиватьОбособленно И НаправленияДеятельностиИспользуются Тогда
			
			Элемент.Обособленно = Истина;		
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Если используется обособление, то сначала выполняется попытка проведения с обособлением товара. При неудаче выполняется поптыка проведения без обособления. 
	Попытка
		
		ЗаказНаСборку.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение 
		
		Если ОбеспечиватьОбособленно И НаправленияДеятельностиИспользуются Тогда	
			
			Попытка
				
				Для Каждого Элемент Из ЗаказНаСборку.Товары Цикл
					
					Элемент.Обособленно = Ложь;
					
				КонецЦикла;	
				
				ЗаказНаСборку.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
				
				ЗаказНаСборку.Статус = Перечисления.ВариантыОбеспечения.КОбеспечению;
				
				Для Каждого Элемент Из ЗаказНаСборку.Товары Цикл
					
					Элемент.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
					Элемент.Обособленно = Ложь;	
					
				КонецЦикла; 
				
				
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				
				ЗаказНаСборку.Записать();
				
			КонецПопытки;
			
		Иначе
			
			ЗаказНаСборку.Статус = Перечисления.ВариантыОбеспечения.КОбеспечению;
			
			Для Каждого Элемент Из ЗаказНаСборку.Товары Цикл
				
				Элемент.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
				Элемент.Обособленно = Ложь;	
				
			КонецЦикла;  
			
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			
			ЗаказНаСборку.Записать(); 
			
		КонецЕсли;
		
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.02.24 УА #67173

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 20.02.23 УА #53535
Функция ПолучитьПрименениеНДСОрганизации(Организация)
		
	ОрганизацияПименяетУСН = ОрганизацияПименяетУСН(Организация);
		
	Если ОрганизацияПименяетУСН <> Неопределено И ОрганизацияПименяетУСН Тогда
		Возврат Ложь;	
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиУчетаНДССрезПоследних.ПрименяетсяОсвобождениеОтУплатыНДС КАК ПрименяетсяОсвобождениеОтУплатыНДС
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(, Организация = &Организация) КАК НастройкиУчетаНДССрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Не Выборка.ПрименяетсяОсвобождениеОтУплатыНДС;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 20.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 21.02.23 УА #53535
Функция РассчитатьДолюСтоимости(ТоварыЗаказаТЗ, ВидЦены, Дата) Экспорт
	
	Доля = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Период,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура В(&Номенклатура)
	|				И Характеристика В(&Характеристика)) КАК ЦеныНоменклатурыСрезПоследних
	//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #72423
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";                          
	//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #72423
	
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Номенклатура", ТоварыЗаказаТЗ.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Характеристика", ТоварыЗаказаТЗ.ВыгрузитьКолонку("Характеристика"));
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Таблица = РезультатЗапроса.Выгрузить(); 
	
	ОбщаяЦена = 0;
	ЦенаЭлемента = 0;
	
	Для Каждого Элемент Из Таблица Цикл		
		Строка = ТоварыЗаказаТЗ.Найти(Элемент.Номенклатура, "Номенклатура"); 
		//+ ИнфоСофт Стояк Ю.К. 12.10.2023 УА #64691		
		Если ЗначениеЗаполнено(Строка) Тогда
			ОбщаяЦена = ОбщаяЦена + Элемент.Цена * Строка.Количество;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Проверьте наличие цены на комплектующую " + Элемент.Номенклатура + "по виду цен " + ВидЦены + " на дату " + Дата);
			Возврат Неопределено;
		КонецЕсли;                                  
		//- ИнфоСофт Стояк Ю.К. 12.10.2023 УА #64691	                               
	КонецЦикла; 
	
	МассивКоэффициентов = Новый Массив;
	
	Если ОбщаяЦена <> 0 Тогда
		Для Каждого Элемент Из Таблица Цикл
			Строка = ТоварыЗаказаТЗ.Найти(Элемент.Номенклатура, "Номенклатура"); 
			МассивКоэффициентов.Добавить((Элемент.Цена * Строка.Количество) / ОбщаяЦена);
		КонецЦикла;              
	Иначе
		//+ ИнфоСофт Стояк Ю.К. 14.11.2023 УА #65997		
		ОбщегоНазначения.СообщитьПользователю("Проверьте заполненность вида цен в профиле или наличие цены на набор / комплектующие набора " + ТоварыЗаказаТЗ[0].Набор + " по виду цен " + ВидЦены + " на дату " + Дата);
		//- ИнфоСофт Стояк Ю.К. 14.11.2023 УА #65997
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат МассивКоэффициентов;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 21.02.23 УА #53535
Функция ПолучитьТаблицуТоваровНабора(ТоварыЗаказа) Экспорт
	
	Запрос = Новый Запрос;		
	Запрос.Текст =
	
	//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
	"ВЫБРАТЬ
	|	ТоварыВзаказе.Количество КАК Количество,
	|	ТоварыВзаказе.Сумма КАК Сумма,
	|	ТоварыВзаказе.Номенклатура КАК Номенклатура,
	|	ТоварыВзаказе.Характеристика КАК Характеристика,
	|	ТоварыВзаказе.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_ТоварыВЗаказе
	|ИЗ
	|	&ТоварыВзаказе КАК ТоварыВзаказе
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости) КАК ОбщаяДоляСтоимости,
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК Количество,
	|	ВТ_ТоварыВЗаказе.Количество КАК КоличествоВЗаказе,
	|	ВТ_ТоварыВЗаказе.Сумма КАК Сумма,
	|	ВТ_ТоварыВЗаказе.Цена КАК Цена,
	|	ВТ_ТоварыВЗаказе.Номенклатура КАК Набор,
	|	ВТ_ТоварыВЗаказе.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Количество
	|ИЗ
	|	ВТ_ТоварыВЗаказе КАК ВТ_ТоварыВЗаказе
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО ВТ_ТоварыВЗаказе.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|			И ВТ_ТоварыВЗаказе.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыВЗаказе.Номенклатура,
	|	ВТ_ТоварыВЗаказе.Характеристика,
	|	ВТ_ТоварыВЗаказе.Сумма,
	|	ВТ_ТоварыВЗаказе.Цена,
	|	ВТ_ТоварыВЗаказе.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатуры.Владелец КАК Владелец,
	|	ВариантыКомплектацииНоменклатуры.Характеристика КАК ХарактеристикаВладельца,
	|	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Количество, 1) КАК Количество,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости,
	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка, ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения) КАК Упаковка
	|ПОМЕСТИТЬ ВТ_ВариантыКомплектации
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВариантыКомплектации.Номенклатура КАК Номенклатура,
	|	ВТ_ВариантыКомплектации.Характеристика КАК Характеристика,
	|	ВТ_ВариантыКомплектации.ДоляСтоимости КАК ДоляСтоимости,
	|	ВТ_ВариантыКомплектации.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
	|	ВТ_ВариантыКомплектации.Количество * ВТ_Количество.КоличествоВЗаказе КАК Количество,
	|	ВТ_ВариантыКомплектации.Упаковка КАК Упаковка,
	|	ВТ_Количество.Характеристика КАК ХарактеристикаНабора,
	|	ВТ_Количество.ОбщаяДоляСтоимости КАК ОбщаяДоляСтоимости,
	//+ ИнфоСофт Заварин К.В. 12.02.25 УА #93503
	|	Ложь КАК ОстатокНеСвободен,        
	//- ИнфоСофт Заварин К.В. 12.02.25 УА #93503
	|	ВТ_Количество.Количество КАК КоличествоОбщее,
	|	ВТ_Количество.Набор КАК Набор,
	|	ВТ_Количество.Сумма КАК Сумма,
	|	ВТ_Количество.Цена КАК Цена
	|ИЗ
	|	ВТ_Количество КАК ВТ_Количество
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВариантыКомплектации КАК ВТ_ВариантыКомплектации
	|		ПО ВТ_Количество.Набор = ВТ_ВариантыКомплектации.Владелец
	|			И ВТ_Количество.Характеристика = ВТ_ВариантыКомплектации.ХарактеристикаВладельца
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";                          
	//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			
	Запрос.УстановитьПараметр("ТоварыВзаказе", ТоварыЗаказа);
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.02.23 УА #53535 

//+ ИнфоСофт Ивонин К.А. 20.02.23 УА #53535
Функция РассчитатьСуммуНДС(Сумма, СтавкаНДС, СуммаВключаетНДС = Истина) Экспорт
	
	Если СуммаВключаетНДС Тогда
		СуммаНДС = Окр(Сумма - 100 * Сумма / (100 + СтавкаНДС), 2, РежимОкругления.Окр15как20);
	Иначе
		СуммаНДС = Окр(Сумма * СтавкаНДС / 100, 2, РежимОкругления.Окр15как20);
	КонецЕсли;
	
	Возврат СуммаНДС;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 20.02.23 УА #53535
Функция ПолучитьПроцентНДС(СтавкаНДС) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтавкиНДС.Ставка КАК Ставка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СтавкаНДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНДС = РезультатЗапроса.Выбрать();
	
	Если ВыборкаНДС.Следующий() Тогда
    	Возврат ВыборкаНДС.Ставка;
	КонецЕсли;

	Возврат Неопределено;	
		
КонецФункции //- ИнфоСофт Ивонин К.А. 20.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Функция ПолучитьИмяСобытия(Имя)
	Возврат СтрШаблон("ИС.МП.ИС_MP_РаботаСЗаказами.%1", Имя);
КонецФункции //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

//+ ИнфоСофт Стояк Ю.К. 20.03.2024 УА #64801
Функция ПроверитьСвободныеОстатки(ТаблицаТоваров, Склад, Назначения = Неопределено) Экспорт
	
	//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	Если Не ЗначениеЗаполнено(Назначения) Тогда
		Назначения = Новый Массив;
		Назначения.Добавить(Справочники.Назначения.ПустаяСсылка());
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	
	ЗапросОстатков = Новый Запрос;	
	ЗапросОстатков.Текст =	
	"ВЫБРАТЬ
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	ТЗ.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ТаблицаЗначений
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаЗначений.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаЗначений.Характеристика КАК Характеристика,
	|	РаспределениеЗапасов.Склад КАК Склад,
	//+ ИнфоСофт Заварин К.В. 11.02.25 УА #93503
	|	РаспределениеЗапасов.Свободно как Свободно,
	//- ИнфоСофт Заварин К.В. 11.02.25 УА #93503
	|	ВЫБОР
	|		КОГДА РаспределениеЗапасов.Свободно ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ РаспределениеЗапасов.Свободно > 0
	|	КОНЕЦ КАК ОстатокВНаличии
	|ИЗ
	|	ВТ_ТаблицаЗначений КАК ВТ_ТаблицаЗначений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО (ВТ_ТаблицаЗначений.Номенклатура = РаспределениеЗапасов.Номенклатура)
	|			И (ВТ_ТаблицаЗначений.Характеристика = РаспределениеЗапасов.Характеристика)
	|			И (РаспределениеЗапасов.Склад В ИЕРАРХИИ (&Склад))
	|			И (РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе))	
	//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	|			И (РаспределениеЗапасов.Назначение В (&Назначения))
	//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстатокВНаличии УБЫВ";	
	
	ЗапросОстатков.УстановитьПараметр("ТЗ", ТаблицаТоваров);
	ЗапросОстатков.УстановитьПараметр("Склад", Склад);
	//+ ИнфоСофт Стояк Ю.К. 19.11.2024 УА #74083
	ЗапросОстатков.УстановитьПараметр("Назначения", Назначения);
	//- ИнфоСофт Стояк Ю.К. 19.11.2024 УА #74083
	
	РезультатЗапросаОстатков = ЗапросОстатков.Выполнить();
	
	ВыгрузкаОстатков = РезультатЗапросаОстатков.Выгрузить();
	
	Возврат ВыгрузкаОстатков;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.03.2024 УА #64801 

//+ ИнфоСофт Мурсалимов Д.Р. 10.06.24 УА #77595
Процедура СоздатьРасходныйОрдер(Заказ, Знач Статус, Знач СтатусСтроки) Экспорт
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
	КонецЕсли;     
	
	Если Не ЗначениеЗаполнено(СтатусСтроки) Тогда
		СтатусСтроки = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
	КонецЕсли;
	
	Склад = Заказ.Склад; 
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("Получатель", Заказ.Партнер);
	СтруктураПараметров.Вставить("Склад", Склад);
	СтруктураПараметров.Вставить("РаспоряженияНаОтгрузку", Новый Массив);
	СтруктураПараметров.Вставить("Помещение", Справочники.СкладскиеПомещения.ПустаяСсылка());
	СтруктураПараметров.Вставить("ЗонаОтгрузки", Справочники.СкладскиеЯчейки.ПустаяСсылка());
	СтруктураПараметров.Вставить("ЗаданиеНаПеревозку", Документы.ЗаданиеНаПеревозку.ПустаяСсылка());
	СтруктураПараметров.Вставить("ФоновоеЗадание", Ложь);
	
	СтруктураПараметров.РаспоряженияНаОтгрузку.Добавить(Заказ);
	
	РасходныйОрдерСтруктура = СкладыСервер.ПереоформитьРасходныеОрдера(СтруктураПараметров);	
	
	Если РасходныйОрдерСтруктура.ЕстьОшибка Тогда
		ОбщегоНазначения.СообщитьПользователю("Автоматическое создание ордеров завершилось с ошибкой!");
		Возврат;	
	КонецЕсли;
	
	ВыполнитьИзменениеСтатусаРасходныхОрдеров(РасходныйОрдерСтруктура.ОформленныеОрдера, Статус, СтатусСтроки);
	
	// Получить значения функциональных опций.
	ИспользоватьАдресноеХранение = СкладыСервер.ИспользоватьАдресноеХранение(Склад);
	
	Если ИспользоватьАдресноеХранение Тогда
	
		Для Каждого Ордер Из РасходныйОрдерСтруктура.ОформленныеОрдера Цикл
			
			Если Ордер.РасходныйОрдер.Проведен Тогда
				
				ОтборРазмещениеТоваров = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
				ОтборРазмещениеТоваров.Заполнить(Ордер.РасходныйОрдер);
				
				Попытка
					ОтборРазмещениеТоваров.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ОтборРазмещениеТоваров.Записать();
				КонецПопытки;
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 10.06.24 УА #77595

//+ ИнфоСофт Мурсалимов Д.Р. 10.06.24 УА #77595
Процедура ВыполнитьИзменениеСтатусаРасходныхОрдеров(ОформленныеОрдеры, Статус, СтатусСтроки) Экспорт 
		
	Для Каждого Строка Из ОформленныеОрдеры Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("Документ.РасходныйОрдерНаТовары");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Строка.РасходныйОрдер);
			
			Блокировка.Заблокировать();
			
			РасходныйОрдерОбъект = Строка.РасходныйОрдер.ПолучитьОбъект(); // ДокументОбъект.РасходныйОрдерНаТовары
			РасходныйОрдерОбъект.ОтгрузкаПоЗаданиюНаПеревозку = Ложь;
			РасходныйОрдерОбъект.Статус = Статус;   
			
			Для Каждого Элемент Из РасходныйОрдерОбъект.ОтгружаемыеТовары Цикл
				Элемент.Действие = СтатусСтроки;		
			КонецЦикла;
			
			РасходныйОрдерОбъект.ДатаОтгрузки = НачалоДня(ТекущаяДатаСеанса());
			РасходныйОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать %Документ% фоновым заданием изменения статуса по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Строка.РасходныйОрдер);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Документы.РасходныйОрдерНаТовары,
				Строка.РасходныйОрдер,
				ТекстСообщения);
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 10.06.24 УА #77595

//+ ИнфоСофт Ивонин К.А. 21.02.23 УА #53535
Функция ОрганизацияПименяетУСН(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
	|ИЗ
	//+ ИнфоСофт Заварин К.В. 24.12.24 УА #90141
	//|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(, Организация = &Организация) КАК НастройкиСистемыНалогообложенияСрезПоследних";
	|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&Период, Организация = &Организация) КАК НастройкиСистемыНалогообложенияСрезПоследних";
	//- ИнфоСофт Заварин К.В. 24.12.24 УА #90141
	
	Запрос.УстановитьПараметр("Организация", Организация);
	//+ ИнфоСофт Заварин К.В. 24.12.24 УА #90141
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	//- ИнфоСофт Заварин К.В. 24.12.24 УА #90141
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Если Выборка.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.02.23 УА #53535 

//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
Процедура ЗаписатьЗаказОтчетаКомиссионера(Профиль, Маркетплейс, ИдентификаторМП, ЗаказМП, Заказ1С = Неопределено, ОтчетКомиссинера = Неопределено) Экспорт		
	
	МенеджерЗаписи = РегистрыСведений.ИС_MP_ЗаказыОтчетаКомиссионера.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Профиль 					= Профиль;
	МенеджерЗаписи.Маркетплейс 				= Маркетплейс;
	МенеджерЗаписи.ИдентификаторМП 			= ИдентификаторМП;
	МенеджерЗаписи.ЗаказМП 					= ЗаказМП;
	
	МенеджерЗаписи.Прочитать();
			
	МенеджерЗаписи.Профиль 					= Профиль;
	МенеджерЗаписи.Маркетплейс 				= Маркетплейс;
	МенеджерЗаписи.ИдентификаторМП 			= ИдентификаторМП;
	МенеджерЗаписи.ЗаказМП 					= ЗаказМП;
	МенеджерЗаписи.Заказ1С 					= Заказ1С;

	МенеджерЗаписи.Записать(Истина);		
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 01.11.24 УА #86746

//+ ИнфоСофт Заварин К.В. 13.11.24 УА #85881
Процедура ПометитьНаУдалениеПривязанныеДокументы(Заказ) Экспорт
	
	Событие = "ИС_MP_РаботаСЗаказами.ОтменитьОтборИРасходныйОрдер";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка КАК РасходныйОрдер,
	|	ОтборРазмещениеТоваров.Ссылка КАК Отбор,
	|	СвязанныеДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ОтборИРО
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Заказ) КАК СвязанныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|		ПО (СвязанныеДокументы.Ссылка = РасходныйОрдерНаТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтборРазмещениеТоваров КАК ОтборРазмещениеТоваров
	|		ПО (РасходныйОрдерНаТовары.Ссылка = ОтборРазмещениеТоваров.Распоряжение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.ЗаказКлиента.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Ссылка КАК реализация
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	Документ.ЗаказКлиента КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (РеализацияТоваровУслуг.ЗаказКлиента.Ссылка = РеализацияТоваровУслуг.ЗаказКлиента)
	|			И (НЕ РеализацияТоваровУслуг.ЗаказКлиента.Ссылка = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	РеализацияТоваровУслуг.ЗаказКлиента.Ссылка = &Заказ
	|	И НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.ЗаказКлиента.Ссылка,
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО (РеализацияТоваровУслугТовары.ЗаказКлиента.Ссылка = РеализацияТоваровУслугТовары.ЗаказКлиента)
	|			И (НЕ РеализацияТоваровУслугТовары.ЗаказКлиента.Ссылка = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	РеализацияТоваровУслугТовары.ЗаказКлиента.Ссылка = &Заказ
	|	И НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПередачаТоваровХранителю.ЗаказКлиента.Ссылка,
	|	ПередачаТоваровХранителю.Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО (ПередачаТоваровХранителю.ЗаказКлиента.Ссылка = ПередачаТоваровХранителю.ЗаказКлиента)
	|			И (НЕ ПередачаТоваровХранителю.ЗаказКлиента.Ссылка = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ПередачаТоваровХранителю.ЗаказКлиента.Ссылка = &Заказ
	|	И НЕ ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПередачаТоваровХранителюТовары.ЗаказКлиента.Ссылка,
	|	ПередачаТоваровХранителюТовары.Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО (ПередачаТоваровХранителюТовары.ЗаказКлиента.Ссылка = ПередачаТоваровХранителюТовары.ЗаказКлиента)
	|			И (НЕ ПередачаТоваровХранителюТовары.ЗаказКлиента.Ссылка = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ПередачаТоваровХранителюТовары.ЗаказКлиента.Ссылка = &Заказ
	|	И НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВТ_Реализации.реализация) КАК Реализация,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_КоличествоРеализаций
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_КоличествоРеализаций.Ссылка КАК Заказ,
	|	ВТ_КоличествоРеализаций.Реализация КАК Реализация,
	|	ВТ_ОтборИРО.РасходныйОрдер КАК РасходныйОрдер,
	|	ВТ_ОтборИРО.Отбор КАК Отбор
	|ИЗ
	|	ВТ_ОтборИРО КАК ВТ_ОтборИРО,
	|	ВТ_КоличествоРеализаций КАК ВТ_КоличествоРеализаций";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Отбор)  Тогда 
			
			Отбор = ВыборкаДетальныеЗаписи.Отбор.ПолучитьОбъект();	
			
			Попытка	
				Отбор.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение 
				
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				Возврат;
				
			КонецПопытки;
			
			Отбор.ПометкаУдаления = Истина; 			
			
			Попытка	
				Отбор.Записать();
			Исключение 
				
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				Возврат;
				
			КонецПопытки; 
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РасходныйОрдер)  Тогда 
			
			РасходныйОрдер = ВыборкаДетальныеЗаписи.РасходныйОрдер.ПолучитьОбъект();	
			
			Попытка	
				РасходныйОрдер.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение 
				
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				Возврат;
				
			КонецПопытки;
			
			РасходныйОрдер.ПометкаУдаления = Истина; 			
			
			Попытка	
				РасходныйОрдер.Записать();
			Исключение 
				
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				Возврат;
				
			КонецПопытки; 
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Реализация)  Тогда 
			
			Реализация = ВыборкаДетальныеЗаписи.Реализация.ПолучитьОбъект();	
			
			Попытка	
				Реализация.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение 
				
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				Возврат;
				
			КонецПопытки;
			
			Реализация.ПометкаУдаления = Истина; 			
			
			Попытка	
				Реализация.Записать();
			Исключение 
				
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				Возврат;
				
			КонецПопытки; 
			
		КонецЕсли;
		
	КонецЦикла;  
	
	Если ЗначениеЗаполнено(Заказ)  Тогда 
			
			ЗаказОсновной = Заказ.ПолучитьОбъект();	
			
			Попытка
				ЗаказОсновной.Заблокировать();    
			Исключение   
				
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", "Заказ " + ЗаказОсновной.Ссылка + " заблокирован для изменения данных");     
				
			КонецПопытки;
			
			Попытка	
				ЗаказОсновной.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение 
				
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				
			КонецПопытки;
			
			ЗаказОсновной.ПометкаУдаления = Истина; 			
			
			Попытка	
				ЗаказОсновной.Записать();
			Исключение 
				
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				
			КонецПопытки; 
			
		КонецЕсли;
	
	
	КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.11.24 УА #85881 

//+ ИнфоСофт Заварин К.В. 17.02.25 УА #83515
Функция ПолучитьРеализацииПоЗаказуМП(Профиль, Маркетплейс, ЗаказыМП = Неопределено) Экспорт
	
	МассивРеализаций = Новый Массив;
	
	Если ЗаказыМП = Неопределено Тогда
		Возврат	МассивРеализаций;		
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
		|	ПередачаТоваровХранителю.Ссылка КАК Реализация
		|ПОМЕСТИТЬ ВТ_Реализации
		|ИЗ
		|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
		|		ПО (ИС_WB_СборочноеЗадание.Заказ = ПередачаТоваровХранителю.ЗаказКлиента)
		|			И (НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
		|ГДЕ
		|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
		|	И ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
		|	И НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И НЕ ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ИС_WB_СборочноеЗадание.Ссылка,
		|	ПередачаТоваровХранителюТовары.Ссылка
		|ИЗ
		|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
		|		ПО ИС_WB_СборочноеЗадание.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента
		|			И (НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
		|ГДЕ
		|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
		|	И ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
		|	И НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ИС_WB_СборочноеЗадание.Ссылка,
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ИС_WB_СборочноеЗадание.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
		|			И (НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
		|ГДЕ
		|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
		|	И ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
		|	И НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ИС_WB_СборочноеЗадание.Ссылка,
		|	РеализацияТоваровУслугТовары.Ссылка
		|ИЗ
		|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ИС_WB_СборочноеЗадание.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
		|			И (НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
		|ГДЕ
		|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
		|	И ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
		|	И НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
		|	ДокументИС_WB_СборочноеЗадание.ПометкаУдаления КАК ПометкаУдаления,
		|	ДокументИС_WB_СборочноеЗадание.Заказ КАК Заказ1С,
		|	ВТ_Реализации.Реализация КАК РТУ,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
		|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
		|	ИС_WB_СоответствиеРазмеров.Упаковка КАК Упаковка
		|ИЗ
		|	Документ.ИС_WB_СборочноеЗадание КАК ДокументИС_WB_СборочноеЗадание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО (ИС_WB_СоответствиеРазмеров.РазмерWB = ДокументИС_WB_СборочноеЗадание.РазмерWB)
		|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
		|		ПО ДокументИС_WB_СборочноеЗадание.Ссылка = ВТ_Реализации.Ссылка
		|ГДЕ
		|	ДокументИС_WB_СборочноеЗадание.Профиль = &Профиль
		|	И ДокументИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
		|	И ВТ_Реализации.Реализация.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("МассивСсылок", ЗаказыМП);
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.РТУ) Тогда
				МассивРеализаций.Добавить(Выборка.РТУ);	
			КонецЕсли;		
			
		КонецЦикла;
		
		Возврат	МассивРеализаций;
		
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Заварин К.В. 17.02.25 УА #83515	
	
#КонецОбласти
