
#Область СлужебныйПрограммныйИнтерфейс

#Область Настройки

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ПолучитьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияСбер Тогда
		Возврат;
	КонецЕсли;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер; 
	
	//МассивНастроек = МассивНастроекПодключения();
	МассивНастроек = Новый Массив;
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	//МассивНастроек = МассивНастроекЦен(МассивНастроек);
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, МассивНастроек);

	СтруктураПараметров = Новый Структура;

	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить("Сбер" + Элемент.Ключ, Элемент.Значение);	
	КонецЦикла;
		
	ЗаполнитьЗначенияСвойств(Форма, СтруктураПараметров);
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ЗаписатьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияСбер Тогда
		Возврат;
	КонецЕсли;
	
	//МассивНастроек = МассивНастроекПодключения();
	МассивНастроек = Новый Массив;
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	//МассивНастроек = МассивНастроекЦен(МассивНастроек);
	
	СтруктураНастроек = Новый Структура;
	
	Для Каждого Элемент Из МассивНастроек Цикл
		СтруктураНастроек.Вставить("Сбер" + Элемент, Неопределено);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, Форма);
	
	СтруктураПараметров = Новый Структура;
	
	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить(СтрЗаменить(Элемент.Ключ, "Сбер", ""), Элемент.Значение);	
	КонецЦикла;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер;
	
	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, СтруктураПараметров);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция МассивНастроекОстатков(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("РассчитыватьНесобранныеКомплекты");
	МассивНастроек.Добавить("ВыгружатьОстаткиВРазрезеОрганизации");
	МассивНастроек.Добавить("ИспользоватьПоследниеОстатки");	
	МассивНастроек.Добавить("ИспользоватьФиксированныйОстаток");
	МассивНастроек.Добавить("ФиксированныйОстаток");
	МассивНастроек.Добавить("РежимСокрытияОстатков");
	МассивНастроек.Добавить("СкрываемыйОстаток");
	
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

#КонецОбласти

#Область РегламентныеЗадания

//+ ИнфоСофт Ивонин К.А. 11.11.23 УА #55166
Процедура ВыполнитьКомандуРеглЗадания(Профиль, ИдентификаторКомандыОбработки) Экспорт

	Событие = ИмяСобытия("ВыполнитьКомандуРеглЗадания");
	
	Если ИдентификаторКомандыОбработки = "ВыгрузкаЦенСбер" Тогда
		ВыгрузитьЦены(Профиль);
		Возврат;				
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ВыгрузкаОстатковСбер" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Сбер_Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_Сбер_Склады КАК ИС_Сбер_Склады
		|ГДЕ
		|	НЕ ИС_Сбер_Склады.ПометкаУдаления
		|	И ИС_Сбер_Склады.Профиль = &Профиль 
		//+ ИнфоСофт Заварин К.В. 13.08.24 УА #81097
		|	И НЕ(ИС_Сбер_Склады.ОбщаяГруппаСкладов = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|				И ИС_Сбер_Склады.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|				И ИС_Сбер_Склады.ВыгружатьОстаткиИзГруппыСкладов = ЛОЖЬ)";
		//- ИнфоСофт Заварин К.В. 13.08.24 УА #81097
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ВыгрузитьОстатки(Профиль, Выборка.Ссылка);
		КонецЦикла;
	
		Возврат;
						
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "СберЗагрузкаОтправлений" Тогда
		ПолучитьСписокОтправлений(Профиль, ПолучитьДатуПоследнегоЗаказа(Профиль));
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "СберОбновлениеСтатусов" Тогда
		ОбновитьСтатусы(Профиль);
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
	Если ИдентификаторКомандыОбработки = "СберЗакрыватьЗаказВТечениеДня" Тогда
		ВыполнитьЗакрытиеЗаказов(Профиль);
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 11.11.23 УА #55166

#КонецОбласти

#Область ТестПодключения

//+ ИнфоСофт Ивонин К.А. 13.08.23 УА #61542
Функция ТестПодключенияAPI(СтруктураПроверки) Экспорт
                 
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса(); 
	ПараметрыЗапроса.Сервер = СтруктураПроверки.АдресСервиса;
	ПараметрыЗапроса.Порт = СтруктураПроверки.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = СтруктураПроверки.ЗащищенноеСоединение;
	
	СтруктураПараметров = ИС_Сбер_API.ПолучитьСтруктуруЗапросаСпискаОтправлений();
	СтруктураПараметров.token = СтруктураПроверки.Токен;
		                                                       
	Результат = ИС_Сбер_API.ПолучитьСписокОтправлений(СтруктураПроверки.Профиль, ПараметрыЗапроса, СтруктураПараметров);

	Если Результат = Неопределено Тогда	
		Возврат Ложь;	
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции //- ИнфоСофт Ивонин К.А. 13.08.23 УА #61542

#КонецОбласти

#Область Товары

//+ ИнфоСофт Ивонин К.А. 03.03.25 УА #92887
Функция КоличествоТоваров(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество
	|ИЗ
	|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
	|ГДЕ
	|	ИС_Сбер_Номенклатура.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКоличества = РезультатЗапроса.Выбрать();
	
	Если ВыборкаКоличества.Следующий() Тогда
		Возврат ВыборкаКоличества.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 03.03.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 07.02.25 УА #92406
Функция ОбработатьДопПараметрыЗагрузкиТоваров(ДопПараметры) Экспорт
	
	ПараметрыТаблицы = Новый Структура;
	ПараметрыТаблицы.Вставить("СпособЧтенияЗначений", СпособЧтенияЗначенийТабличногоДокумента.Текст);
	ПараметрыТаблицы.Вставить("ПерваяСтрока", 1);
	ТаблицаТоваров = ИС_МП_Сервер.ТаблицаЗначенийИзExcel(ДопПараметры.Адрес, ПараметрыТаблицы);
	
	Если ТаблицаТоваров = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивУдаляемыхКолонок = Новый Массив;
	
	Для Каждого Колонка Из ТаблицаТоваров.Колонки Цикл
		
		Имя = Колонка.Имя;
		Если Имя = "КодТовараПродавца_offerId_" Или Имя = "НаименованиеМерчанта"
				Или Имя = "ШтрихкодМерчанта" Или Имя = "БрендМерчанта"
				Или Имя = "ВендорКод_артикулПроизводителя_" Тогда
				
			Продолжить;
			
		КонецЕсли;
		
		МассивУдаляемыхКолонок.Добавить(Колонка);
		
	КонецЦикла;

	Для Каждого Колонка Из МассивУдаляемыхКолонок Цикл
		ТаблицаТоваров.Колонки.Удалить(Колонка);
	КонецЦикла;
		
	ДопПараметры = Новый Структура("Таблица", ТаблицаТоваров);
	Возврат ДопПараметры;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 07.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 02.03.25 УА #92887
Функция ЗагрузитьТовары(Профиль, Перезаполнять = Ложь, ДопПараметры = Неопределено) Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("offerId", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	Для Каждого Строка Из ДопПараметры.Таблица Цикл
		
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.offerId = Строка.КодТовараПродавца_offerId_;	
		
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.offerId КАК offerId
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.offerId КАК offerId,
	|	ЕСТЬNULL(ИС_Сбер_Номенклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.ИС_Сбер_Номенклатура.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
	|		ПО ВТ_Товары.offerId = ИС_Сбер_Номенклатура.offer_id
	|			И (ИС_Сбер_Номенклатура.Профиль = &Профиль)";
	
	Если Не Перезаполнять Тогда
		
		Запрос.Текст = Запрос.Текст + 
		"
		|ГДЕ
		|	ИС_Сбер_Номенклатура.Ссылка ЕСТЬ NULL";
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Профиль", Профиль);
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ВсегоТоваров = Выборка.Количество();
	
	Счетчик = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = ДопПараметры.Таблица.НайтиСтроки(Новый Структура("КодТовараПродавца_offerId_", Выборка.offerId));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СоздатьИлиОбновитьТовар(Профиль, Выборка.Ссылка, НайденныеСтроки[0]);

		Если Счетчик % 50 = 0 Тогда
			ДлительныеОперации.СообщитьПрогресс( , "Уже обработано " + Счетчик + " из " + ВсегоТоваров + " товаров");
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
		
	Возврат "Загрузка завершена. Всего обработкано " + Счетчик + " элементов";
	
КонецФункции //- ИнфоСофт Ивонин К.А. 02.03.25 УА #92887

#КонецОбласти

#Область Отправления

//+ ИнфоСофт Ивонин К.А. 13.08.23 УА #61542
Процедура ПолучитьСписокОтправлений(Профиль, ДатаНачала, ДатаОкончания = Неопределено) Экспорт

	Событие = ИмяСобытия("ПолучитьСписокОтправлений");

	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);  
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	
	Если Не РезультатПроверки Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = ИС_Сбер_API.ПолучитьСтруктуруЗапросаСпискаОтправлений();
	СтруктураПараметров.token = НастройкиСоединения["СберТокен"];
	СтруктураПараметров.dateFrom = ДатаНачала;
	СтруктураПараметров.dateTo = ДатаОкончания;
	СтруктураПараметров.count = 1000;
	//СтруктураПараметров.statuses = Новый Массив;
	
	РезультатЗапроса = ИС_Сбер_API.ПолучитьСписокОтправлений(Профиль, ПараметрыЗапроса, СтруктураПараметров);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивОтправлений = Новый Массив;
	
	Для Каждого Отправление Из РезультатЗапроса.shipments Цикл
		МассивОтправлений.Добавить(Отправление);
	КонецЦикла;
	
	Если МассивОтправлений.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Нет новых заказов от " + ДатаНачала);
		Возврат;
	КонецЕсли;
	
	ПолучитьОтправления(Профиль, МассивОтправлений);	
				
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.08.23 УА #61542

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
Функция ПолучитьДатуПоследнегоЗаказа(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_Сбер_Отправление.Дата КАК Дата
	|ИЗ
	|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
	|ГДЕ
	|	ИС_Сбер_Отправление.Профиль = &Профиль
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Дата;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55156
Процедура ОбновитьСтатусы(Профиль) Экспорт
	
	Событие = ИмяСобытия("ОбновитьСтатусы");
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);  
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	
	//+ ИнфоСофт Заварин К.В. 30.09.24 УА #72472
	ФункциональныеОпции = ПолучитьИПроверитьФункциональныеОпции(Профиль);
	//- ИнфоСофт Заварин К.В. 30.09.24 УА #72472
	
	Если Не РезультатПроверки Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.CONFIRMED);
	МассивСтатусов.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.NEW);
	МассивСтатусов.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.PACKED);
	МассивСтатусов.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.PENDING);
	МассивСтатусов.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.PENDING_CONFIRMATION);
	МассивСтатусов.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.PENDING_PACKING);   
	// Почему-то имеются зависшие статусы более чем месяц назад
	//МассивСтатусов.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.PENDING_SHIPPING);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Сбер_Отправление.Ссылка КАК Ссылка,
	|	ИС_Сбер_Отправление.Номер КАК Номер,
	|	ИС_Сбер_Отправление.status КАК status
	|ИЗ
	|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
	|ГДЕ
	|	ИС_Сбер_Отправление.status В(&status)
	|	И ИС_Сбер_Отправление.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("status", МассивСтатусов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СписокОтправлений = РезультатЗапроса.Выгрузить();
	
	МассивОтправлений = Новый Массив;
	
	Для Каждого Строка Из СписокОтправлений Цикл
		МассивОтправлений.Добавить(Строка.Номер);
	КонецЦикла;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("token", НастройкиСоединения["СберТокен"]);
	СтруктураПараметров.Вставить("shipments", МассивОтправлений);
	
	РезультатЗапроса = ИС_Сбер_API.ПолучитьОтправления(Профиль, ПараметрыЗапроса, СтруктураПараметров);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Номер", "0");
	
	Для Каждого Отправление Из РезультатЗапроса.shipments Цикл
		
		СтруктураПоиска.Номер = Отправление.shipmentId;
		НайденныеСтроки = СписокОтправлений.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Статус = ИС_MP_Сервер.ПолучитьПеречислениеПоЗначению(Перечисления.ИС_Сбер_СтатусыОтправлений, Отправление.status);
		
		Если НайденныеСтроки[0].status = Статус Тогда
			Продолжить;
		КонецЕсли;
		
		ОтправлениеОбъект = НайденныеСтроки[0].Ссылка.ПолучитьОбъект();
		ОтправлениеОбъект.status = Статус; 
		//+ ИнфоСофт Стояк Ю.К. 12.04.2024 УА #73943
		ОтправлениеОбъект.orderCode = Отправление.orderCode;
		//- ИнфоСофт Стояк Ю.К. 12.04.2024 УА #73943
		
		//+ ИнфоСофт Заварин К.В. 26.09.24 УА #77549
		Если ОтправлениеОбъект.status = Перечисления.ИС_Сбер_СтатусыОтправлений.CUSTOMER_CANCELED 
			ИЛИ ОтправлениеОбъект.status = Перечисления.ИС_Сбер_СтатусыОтправлений.MERCHANT_CANCELED Тогда
			Заказ = НайденныеСтроки[0].Ссылка; 
			ОтменитьЗаказ(Заказ, Профиль);	
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 26.09.24 УА #77549
		
		Попытка
			ОтправлениеОбъект.Записать();
			СписокОтправлений.Удалить(НайденныеСтроки[0]);	
		Исключение
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
	//+ ИнфоСофт Заварин К.В. 30.09.24 УА #72472 
	Если ФункциональныеОпции.АвтоматическиПодтверждатьЗаказы Тогда
		
		МассивСтатусовПодтверждения = Новый Массив;
		МассивСтатусовПодтверждения.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.NEW); 
		
		Запрос = Новый Запрос;
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ИС_Сбер_Отправлениеitems.Ссылка.Номер КАК Номер,
		|	ИС_Сбер_Отправлениеitems.itemIndex КАК ПорядковыйНомер,
		|	ИС_Сбер_Отправлениеitems.offerId КАК Артикул,
		|	ЕСТЬNULL(ИС_Сбер_Отправлениеitems.Ссылка.Заказ.Номер, """") КАК НомерЗаказа
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправлениеitems
		|ГДЕ
		|	ИС_Сбер_Отправлениеitems.status В(&Статусы)
		|	И ИС_Сбер_Отправлениеitems.Ссылка.Заказ.Номер ЕСТЬ НЕ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заказы.Номер КАК Номер,
		|	ВТ_Заказы.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ВТ_Заказы.Артикул КАК Артикул,
		|	ВТ_Заказы.НомерЗаказа КАК НомерЗаказа
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы  
		|ИТОГИ ПО
		|	Номер,
		|	НомерЗаказа";
		
		Запрос.УстановитьПараметр("Статусы", МассивСтатусовПодтверждения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНомер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		МассивShipments = Новый Массив;
		
		Пока ВыборкаНомер.Следующий() Цикл
			
			СтруктураShipment = Новый Структура;
			СтруктураShipment.Вставить("shipmentId", ВыборкаНомер.Номер);
			
			ВыборкаНомерЗаказа = ВыборкаНомер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаНомерЗаказа.Следующий() Цикл
				
				Если Не ПустаяСтрока(ВыборкаНомерЗаказа.НомерЗаказа) Тогда
					
					МассивНомерЗаказа = СтрРазделить(ВыборкаНомерЗаказа.НомерЗаказа, "-");
					МассивНомерЗаказа = СтрШаблон("%1%2", 
					Формат(Год(ТекущаяДатаСеанса()), "ЧГ=0"), МассивНомерЗаказа[МассивНомерЗаказа.ВГраница()]); 
					
					СтруктураShipment.Вставить("orderCode", МассивНомерЗаказа);
				Иначе
					СтруктураShipment.Вставить("orderCode", ВыборкаНомерЗаказа.НомерЗаказа);	
				КонецЕсли;	
					
				МассивItems = Новый Массив;
				ВыборкаЛотов = ВыборкаНомерЗаказа.Выбрать();
				
				Пока ВыборкаЛотов.Следующий() Цикл
					
					СтруктураItem = Новый Структура;
					СтруктураItem.Вставить("itemIndex", ВыборкаЛотов.ПорядковыйНомер);
					СтруктураItem.Вставить("offerId", ВыборкаЛотов.Артикул);
					
					МассивItems.Добавить(СтруктураItem);
					
				КонецЦикла;
				
				СтруктураShipment.Вставить("items", МассивItems);
				
			КонецЦикла;
			
			МассивShipments.Добавить(СтруктураShipment);
			
		КонецЦикла;
		
		Если Не МассивShipments.Количество() = 0 Тогда
			ПодтвердитьЛоты(Профиль, МассивShipments);
		КонецЕсли;
		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 30.09.24 УА #72472
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55156

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
Функция ПолучитьЭтикетки(Профиль, МассивЗаказов) Экспорт
	
	Событие = ИмяСобытия("ПолучитьСписокОтправлений");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Значение КАК Значение
	|ИЗ
	|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.ЛичныйКабинет = &Профиль
	|	И ИС_MP_Настройки.Наименование = ""СберИдКабинета""";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Необходимо заполнить ""ID Личного кабинета"" МегаМаркета в настройках профиля");
		Возврат Неопределено;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Ид = Выборка.Значение;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Сбер_Отправление.Ссылка КАК Ссылка,
	|	ИС_Сбер_Отправление.Номер КАК Номер,
	|	ИС_Сбер_Отправление.orderCode КАК orderCode
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
	|ГДЕ
	|	ИС_Сбер_Отправление.Ссылка В(&Ссылка)
	|	И ИС_Сбер_Отправление.status В(&Статус)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Номер КАК Номер,
	|	ВТ_Заказы.orderCode КАК orderCode,
	|	ИС_Сбер_Отправлениеitems.boxIndex КАК boxIndex
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправлениеitems
	|		ПО ВТ_Заказы.Ссылка = ИС_Сбер_Отправлениеitems.Ссылка
	|ИТОГИ ПО
	|	Номер";
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.PACKED);
	МассивСтатусов.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.CONFIRMED);
	
	Запрос.УстановитьПараметр("Ссылка", МассивЗаказов);
	Запрос.УстановитьПараметр("Статус", МассивСтатусов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбрано ни одного заказа находящегося в статусе ""Подтверждено Мерчантом"" или ""Скомплектовано Мерчантом""");
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаЗаказов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);  
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	
	Если Не РезультатПроверки Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Data = Новый Структура;
	Data.Вставить("token", НастройкиСоединения["СберТокен"]);
	Data.Вставить("printAsPdf", Истина);
	
	Отправления = Новый Массив;
	
	Пока ВыборкаЗаказов.Следующий() Цикл
		
		Выборка = ВыборкаЗаказов.Выбрать();
		
		СтруктураОтправления = Новый Структура;
		СтруктураОтправления.Вставить("shipmentId", ВыборкаЗаказов.Номер);
		
		Пока Выборка.Следующий() Цикл
			
			МассивГрузовыхМест = Новый Массив;
			
			ГрузовоеМесто = СтрШаблон("%1*%2*%3", Ид, Выборка.orderCode, Выборка.boxIndex);
			
			МассивГрузовыхМест.Добавить(ГрузовоеМесто);
			
		КонецЦикла;
		
		СтруктураОтправления.Вставить("boxCodes", МассивГрузовыхМест);
		
		Отправления.Добавить(СтруктураОтправления);
		
	КонецЦикла;
	
	Data.Вставить("shipments", Отправления);
	
	РезультатЗапроса = ИС_Сбер_API.ПолучитьЭтикетки(Профиль, ПараметрыЗапроса, Data);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(РезультатЗапроса);
	
КонецФункции //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 20.11.23 УА #55166
Процедура СоздатьЗаказы(Профиль, МассивОтправлений) Экспорт
	
	Событие = ИмяСобытия("СоздатьЗаказы");
	
	ФукнциональныеОпции = ПолучитьИПроверитьФункциональныеОпции(Профиль);
	
	Если ФукнциональныеОпции = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 30.09.24 УА #75830
	МассивСтатусовОтмены = Новый Массив;
	МассивСтатусовОтмены.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.CUSTOMER_CANCELED);
	МассивСтатусовОтмены.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.MERCHANT_CANCELED);
	//- ИнфоСофт Заварин К.В. 30.09.24 УА #75830
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Сбер_Отправление.Ссылка КАК Ссылка,
	|	ИС_Сбер_Отправление.Номер КАК Номер,
	|	ИС_Сбер_Отправление.Дата КАК Дата,
	|	ИС_Сбер_Отправление.shippingTimeLimit КАК ДатаОтгрузки,
	|	ИС_Сбер_Склады.Ссылка КАК СкладМП,
	|	ИС_Сбер_Склады.Склад КАК Склад,
	|	ИС_Сбер_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_Сбер_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_Сбер_Склады.АдресДоставки КАК АдресДоставки,
	|	ИС_Сбер_Склады.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ИС_Сбер_Склады.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	ИС_Сбер_Склады.СпособДоставки КАК СпособДоставки,
	|	ИС_Сбер_Склады.ЗонаДоставки КАК ЗонаДоставки,
	|	ИС_Сбер_Склады.Грузополучатель КАК Грузополучатель,
	|	ИС_Сбер_Склады.Грузоотправитель КАК Грузоотправитель,
	|	ИС_Сбер_Склады.ПеревозчикПартнер КАК ПеревозчикПартнер
	|ИЗ
	|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Сбер_Склады КАК ИС_Сбер_Склады
	|		ПО (ИС_Сбер_Склады.Профиль = &Профиль)
	|ГДЕ
	|	ИС_Сбер_Отправление.Ссылка В(&МассивСсылок)
	|	И ИС_Сбер_Отправление.Заказ = &Заказ
	//+ ИнфоСофт Заварин К.В. 30.09.24 УА #75830
	|	И НЕ ИС_Сбер_Отправление.status В (&МассивСтатусовОтмены)";
    //- ИнфоСофт Заварин К.В. 30.09.24 УА #75830
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("МассивСсылок", МассивОтправлений); 
	Запрос.УстановитьПараметр("Заказ", ИС_MP_СерверЛокализация.ПустаяСсылкаЗаказа()); 
	
	//+ ИнфоСофт Заварин К.В. 30.09.24 УА #75830
	Запрос.УстановитьПараметр("МассивСтатусовОтмены", МассивСтатусовОтмены);
	//- ИнфоСофт Заварин К.В. 30.09.24 УА #75830
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаШапка = РезультатЗапроса.Выбрать();
	
	Если ФукнциональныеОпции.РежимСозданияЗаказов = 0 Тогда // Один к одному
		
		Пока ВыборкаШапка.Следующий() Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИС_Сбер_Товары.Номенклатура КАК Номенклатура,
			|	ИС_Сбер_Товары.Характеристика КАК Характеристика,
			|	ИС_Сбер_Отправлениеitems.quantity КАК Количество,
			|	ИС_Сбер_Отправлениеitems.finalPrice КАК Цена,
			//+ ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208			
			|	ИС_Сбер_Отправлениеitems.price КАК ЦенаДоСкидки,
			//- ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208
			|	ИС_Сбер_Товары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
			//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			|	ИС_Сбер_Товары.Упаковка КАК Упаковка,
			|	ВЫБОР
			|		КОГДА ИС_Сбер_Товары.Упаковка ЕСТЬ NULL ИЛИ ИС_Сбер_Товары.Упаковка.Числитель = 0
			|			ТОГДА 1
			|		ИНАЧЕ ИС_Сбер_Товары.Упаковка.Числитель
			|	КОНЕЦ / ВЫБОР
			|		КОГДА ИС_Сбер_Товары.Упаковка ЕСТЬ NULL ИЛИ ИС_Сбер_Товары.Упаковка.Знаменатель = 0
			|			ТОГДА 1
			|		ИНАЧЕ ИС_Сбер_Товары.Упаковка.Знаменатель
			|	КОНЕЦ КАК КоэффициентУпаковки
			//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			|ИЗ
			|	Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправлениеitems
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
			|		ПО (ИС_Сбер_Отправлениеitems.offerId = ИС_Сбер_Товары.offerID)
			|			И (ИС_Сбер_Товары.ЛичныйКабинет = &Профиль)
			|ГДЕ
			|	ИС_Сбер_Отправлениеitems.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Профиль", Профиль);
			Запрос.УстановитьПараметр("Ссылка", ВыборкаШапка.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаТовары = РезультатЗапроса.Выгрузить();
						
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #7408			
			Назначения = ПолучитьНазначения(ВыборкаШапка.Склад);
			
			Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Сбер, , Назначения);
			//Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Сбер);
			//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
			
			Если Не Заказ.Пустая() Тогда
				
				ДокОбъект = ВыборкаШапка.Ссылка.ПолучитьОбъект();
				ДокОбъект.Заказ = Заказ;
				
				Попытка
					ДокОбъект.Записать();
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;
				
			КонецЕсли; 	
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	Если ФукнциональныеОпции.РежимСозданияЗаказов = 1 Тогда // Пакетный режим
		
		Заказ = Неопределено;
		
		Пока ВыборкаШапка.Следующий() Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИС_Сбер_Товары.Номенклатура КАК Номенклатура,
			|	ИС_Сбер_Товары.Характеристика КАК Характеристика,
			|	ИС_Сбер_Отправлениеitems.quantity КАК Количество,
			|	ИС_Сбер_Отправлениеitems.finalPrice КАК Цена,
			//+ ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208			
			|	ИС_Сбер_Отправлениеitems.price КАК ЦенаДоСкидки,
			//- ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208
			|	ИС_Сбер_Товары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
			//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			|	ИС_Сбер_Товары.Упаковка КАК Упаковка,
			|	ВЫБОР
			|		КОГДА ИС_Сбер_Товары.Упаковка ЕСТЬ NULL ИЛИ ИС_Сбер_Товары.Упаковка.Числитель = 0
			|			ТОГДА 1
			|		ИНАЧЕ ИС_Сбер_Товары.Упаковка.Числитель
			|	КОНЕЦ / ВЫБОР
			|		КОГДА ИС_Сбер_Товары.Упаковка ЕСТЬ NULL ИЛИ ИС_Сбер_Товары.Упаковка.Знаменатель = 0
			|			ТОГДА 1
			|		ИНАЧЕ ИС_Сбер_Товары.Упаковка.Знаменатель
			|	КОНЕЦ КАК КоэффициентУпаковки
			//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			|ИЗ
			|	Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправлениеitems
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
			|		ПО (ИС_Сбер_Отправлениеitems.offerId = ИС_Сбер_Товары.offerID)
			|			И (ИС_Сбер_Товары.ЛичныйКабинет = &Профиль)
			|ГДЕ
			|	ИС_Сбер_Отправлениеitems.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Профиль", Профиль);
			Запрос.УстановитьПараметр("Ссылка", ВыборкаШапка.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаТовары = РезультатЗапроса.Выгрузить();
			
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #7408			
			Назначения = ПолучитьНазначения(ВыборкаШапка.Склад);
			
			Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Сбер, Заказ, Назначения);
			//Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Сбер, Заказ);
			//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
			
			Если Не Заказ.Пустая() И Заказ <> Неопределено Тогда
				
				ДокОбъект = ВыборкаШапка.Ссылка.ПолучитьОбъект();
				ДокОбъект.Заказ = Заказ;
				
				Попытка
					ДокОбъект.Записать();
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;
				
			КонецЕсли; 	
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	Если ФукнциональныеОпции.РежимСозданияЗаказов = 2 Тогда // Формирование в течение дня
		
		//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643		
		Если ФукнциональныеОпции.ФормироватьЕдиныйЗаказБезРазбиения Тогда
			//- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
			
			Если Не ФукнциональныеОпции.Свойство("АктивныйЗаказКлиента") Или 
				ФукнциональныеОпции.Свойство("АктивныйЗаказКлиента") И ФукнциональныеОпции.АктивныйЗаказКлиента.Пустая() Тогда
				
				ВыборкаШапка.Следующий();
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИС_Сбер_Товары.Номенклатура КАК Номенклатура,
				|	ИС_Сбер_Товары.Характеристика КАК Характеристика,
				|	ИС_Сбер_Отправлениеitems.quantity КАК Количество,
				|	ИС_Сбер_Отправлениеitems.finalPrice КАК Цена,
				//+ ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208			
				|	ИС_Сбер_Отправлениеitems.price КАК ЦенаДоСкидки,
				//- ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208
				|	ИС_Сбер_Товары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
				//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
				|	ИС_Сбер_Товары.Упаковка КАК Упаковка,
				|	ВЫБОР
				|		КОГДА ИС_Сбер_Товары.Упаковка ЕСТЬ NULL ИЛИ ИС_Сбер_Товары.Упаковка.Числитель = 0
				|			ТОГДА 1
				|		ИНАЧЕ ИС_Сбер_Товары.Упаковка.Числитель
				|	КОНЕЦ / ВЫБОР
				|		КОГДА ИС_Сбер_Товары.Упаковка ЕСТЬ NULL ИЛИ ИС_Сбер_Товары.Упаковка.Знаменатель = 0
				|			ТОГДА 1
				|		ИНАЧЕ ИС_Сбер_Товары.Упаковка.Знаменатель
				|	КОНЕЦ КАК КоэффициентУпаковки
				//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
				|ИЗ
				|	Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправлениеitems
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
				|		ПО (ИС_Сбер_Отправлениеitems.offerId = ИС_Сбер_Товары.offerID)
				|			И (ИС_Сбер_Товары.ЛичныйКабинет = &Профиль)
				|ГДЕ
				|	ИС_Сбер_Отправлениеitems.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Профиль", Профиль);
				Запрос.УстановитьПараметр("Ссылка", ВыборкаШапка.Ссылка);
				
				//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
				РезультатЗапроса = Запрос.Выполнить();
				//- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
				
				ВыборкаТовары = РезультатЗапроса.Выгрузить();
				
				//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #7408			
				Назначения = ПолучитьНазначения(ВыборкаШапка.Склад);
				
				Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Сбер, , Назначения);
				//Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Сбер);
				//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
				
				Если Не Заказ.Пустая() Тогда
					
					ДокОбъект = ВыборкаШапка.Ссылка.ПолучитьОбъект();
					ДокОбъект.Заказ = Заказ;
					
					Попытка
						ДокОбъект.Записать();
					Исключение
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
					КонецПопытки;
					
				КонецЕсли;
				
				СоответствиеПараметров = Новый Соответствие;
				СоответствиеПараметров.Вставить("СберАктивныйЗаказКлиента", Заказ);
				
				ИС_MP_Сервер.ЗаписатьНастройкиСправочника(Профиль, СоответствиеПараметров); 
				
			Иначе
				Заказ = ФукнциональныеОпции.АктивныйЗаказКлиента;
			КонецЕсли;
			
			Пока ВыборкаШапка.Следующий() Цикл
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИС_Сбер_Товары.Номенклатура КАК Номенклатура,
				|	ИС_Сбер_Товары.Характеристика КАК Характеристика,
				|	ИС_Сбер_Отправлениеitems.quantity КАК Количество,
				|	ИС_Сбер_Отправлениеitems.finalPrice КАК Цена,
				//+ ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208			
				|	ИС_Сбер_Отправлениеitems.price КАК ЦенаДоСкидки,
				//- ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208
				|	ИС_Сбер_Товары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
				//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
				|	ИС_Сбер_Товары.Упаковка КАК Упаковка,
				|	ВЫБОР
				|		КОГДА ИС_Сбер_Товары.Упаковка ЕСТЬ NULL ИЛИ ИС_Сбер_Товары.Упаковка.Числитель = 0
				|			ТОГДА 1
				|		ИНАЧЕ ИС_Сбер_Товары.Упаковка.Числитель
				|	КОНЕЦ / ВЫБОР
				|		КОГДА ИС_Сбер_Товары.Упаковка ЕСТЬ NULL ИЛИ ИС_Сбер_Товары.Упаковка.Знаменатель = 0
				|			ТОГДА 1
				|		ИНАЧЕ ИС_Сбер_Товары.Упаковка.Знаменатель
				|	КОНЕЦ КАК КоэффициентУпаковки
				//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
				|ИЗ
				|	Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправлениеitems
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
				|		ПО (ИС_Сбер_Отправлениеitems.offerId = ИС_Сбер_Товары.offerID)
				|			И (ИС_Сбер_Товары.ЛичныйКабинет = &Профиль)
				|ГДЕ
				|	ИС_Сбер_Отправлениеitems.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Профиль", Профиль);
				Запрос.УстановитьПараметр("Ссылка", ВыборкаШапка.Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаТовары = РезультатЗапроса.Выгрузить();
								
				//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #7408			
				Назначения = ПолучитьНазначения(ВыборкаШапка.Склад);
				
				Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Сбер, Заказ, Назначения);
				//Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Сбер, Заказ);
				//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
				
				ДокОбъект = ВыборкаШапка.Ссылка.ПолучитьОбъект();
				ДокОбъект.Заказ = Заказ;
				
				Попытка
					ДокОбъект.Записать();
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;
				
			КонецЦикла;
			
			//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
		КонецЕсли;
		
		Пока ВыборкаШапка.Следующий() Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИС_Сбер_Товары.Номенклатура КАК Номенклатура,
			|	ИС_Сбер_Товары.Характеристика КАК Характеристика,
			|	ИС_Сбер_Отправлениеitems.quantity КАК Количество,
			|	ИС_Сбер_Отправлениеitems.finalPrice КАК Цена,
			//+ ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208			
			|	ИС_Сбер_Отправлениеitems.price КАК ЦенаДоСкидки,
			//- ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208
			|	ИС_Сбер_Товары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
			//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			|	ИС_Сбер_Товары.Упаковка КАК Упаковка,
			|	ВЫБОР
			|		КОГДА ИС_Сбер_Товары.Упаковка ЕСТЬ NULL ИЛИ ИС_Сбер_Товары.Упаковка.Числитель = 0
			|			ТОГДА 1
			|		ИНАЧЕ ИС_Сбер_Товары.Упаковка.Числитель
			|	КОНЕЦ / ВЫБОР
			|		КОГДА ИС_Сбер_Товары.Упаковка ЕСТЬ NULL ИЛИ ИС_Сбер_Товары.Упаковка.Знаменатель = 0
			|			ТОГДА 1
			|		ИНАЧЕ ИС_Сбер_Товары.Упаковка.Знаменатель
			|	КОНЕЦ КАК КоэффициентУпаковки
			//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			|ИЗ
			|	Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправлениеitems
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
			|		ПО (ИС_Сбер_Отправлениеitems.offerId = ИС_Сбер_Товары.offerID)
			|			И (ИС_Сбер_Товары.ЛичныйКабинет = &Профиль)
			|ГДЕ
			|	ИС_Сбер_Отправлениеitems.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Профиль", Профиль);
			Запрос.УстановитьПараметр("Ссылка", ВыборкаШапка.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаТовары = РезультатЗапроса.Выгрузить(); 		
			
			ДобавитьЗапись = Ложь;
			
			АктивныйЗаказ = ПолучитьАктивныйЗаказКлиента(ВыборкаШапка.Ссылка, ВыборкаШапка.ДатаОтгрузки);
			
			Если АктивныйЗаказ = Неопределено Тогда
				ДобавитьЗапись = Истина;	
			КонецЕсли;
			
			Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Сбер, АктивныйЗаказ);
			
			Если ДобавитьЗапись Тогда
				ДобавитьЗаписьВРегистрЗаказов(Заказ, ВыборкаШапка.Ссылка, ВыборкаШапка.ДатаОтгрузки);	
			КонецЕсли;
			
			ДокОбъект = ВыборкаШапка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Заказ = Заказ;
			
			Попытка
				ДокОбъект.Записать();
			Исключение
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			КонецПопытки;
			
		КонецЦикла;
		//- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
		
		Возврат;
		
	КонецЕсли;
	
	ВызватьИсключение("Неизвестный режим формирования заказов");
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 28.11.23 УА #55166
Процедура СоздатьРеализации(Профиль, МассивОтправлений) Экспорт

	Событие = ИмяСобытия("СоздатьРеализации");
	
	ФукнциональныеОпции = ПолучитьИПроверитьФункциональныеОпции(Профиль);
	
	Если ФукнциональныеОпции = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Сбер_Отправление.Ссылка КАК Ссылка,
	|	ИС_Сбер_Отправление.Заказ КАК Заказ,
	|	ИС_Сбер_Отправление.shippingTimeLimit КАК ДатаОтгрузки
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
	|ГДЕ
	|	ИС_Сбер_Отправление.Профиль = &Профиль
	|	И НЕ ИС_Сбер_Отправление.Заказ = &Заказ
	|	И ИС_Сбер_Отправление.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка КАК Ссылка,
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	ВТ_Заказы.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВЫБОР КОГДА РеализацияТоваровУслуг.Ссылка IS NULL
	|		ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Реализация
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Заказы.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка,
	|	ВТ_Заказы.Заказ,
	|	ВТ_Заказы.ДатаОтгрузки,
	|	ВЫБОР КОГДА РеализацияТоваровУслугТовары.Ссылка IS NULL
	|		ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_Заказы.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка,
	|	ВТ_Заказы.Заказ,
	|	ВТ_Заказы.ДатаОтгрузки,
	|	ВЫБОР КОГДА ПередачаТоваровХранителю.Ссылка IS NULL
	|		ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителю
	|		ПО ВТ_Заказы.Заказ = ПередачаТоваровХранителю.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка,
	|	ВТ_Заказы.Заказ,
	|	ВТ_Заказы.ДатаОтгрузки,
	|	ВЫБОР КОГДА ПередачаТоваровХранителюТовары.Ссылка IS NULL
	|		ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО ВТ_Заказы.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПолучениеРеализаций.Заказ КАК Заказ,
	|	ВТ_ПолучениеРеализаций.ДатаОтгрузки КАК ДатаОтгрузки,
	|	СУММА(ВТ_ПолучениеРеализаций.Реализация) КАК КоличествоРеализаций
	|ПОМЕСТИТЬ ВТ_КоличествоРеализаций
	|ИЗ
	|	ВТ_Реализации КАК ВТ_ПолучениеРеализаций
	|ГДЕ
	|	НЕ ВТ_ПолучениеРеализаций.Реализация ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПолучениеРеализаций.Заказ,
	|	ВТ_ПолучениеРеализаций.ДатаОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КоличествоРеализаций.Заказ КАК Заказ,
	|	ВТ_КоличествоРеализаций.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВТ_КоличествоРеализаций.Заказ.Комментарий КАК Комментарий,
	|	ИС_Сбер_Склады.СтатусРасходногоОрдера КАК СтатусРасходногоОрдера,
	|	ИС_Сбер_Склады.СтатусСтрокиРасходногоОрдера КАК СтатусСтрокиРасходногоОрдера
	|ИЗ
	|	ВТ_КоличествоРеализаций КАК ВТ_КоличествоРеализаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Сбер_Склады КАК ИС_Сбер_Склады
	|		ПО (ИС_Сбер_Склады.Профиль = &Профиль)
	|ГДЕ
	|	ВТ_КоличествоРеализаций.КоличествоРеализаций = 0";

	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("МассивСсылок", МассивОтправлений);
	Запрос.УстановитьПараметр("Заказ", ИС_MP_СерверЛокализация.ПустаяСсылкаЗаказа());
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ФукнциональныеОпции = ПолучитьИПроверитьФункциональныеОпции(Профиль);
	
	Если ФукнциональныеОпции = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Комиссия25 = ФукнциональныеОпции.Договор.КомиссионныеПродажи25;
	
	Выборка = РезультатЗапроса.Выбрать();
    
    //+ ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
	ПорядокОформленияНакладныхРасходныхОрдеров = Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить();
	//- ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
	
    Пока Выборка.Следующий() Цикл

		//+ ИнфоСофт Мурсалимов Д.Р. 10.06.24 УА #77595
		Если ПорядокОформленияНакладныхРасходныхОрдеров 
			= Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные Тогда
			
			СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25);
			
			//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
			Если ФукнциональныеОпции.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.Заказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
				ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
															, Выборка.СтатусРасходногоОрдера
															, Выборка.СтатусСтрокиРасходногоОрдера);	
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
					
		Иначе
			
			//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
			Если ФукнциональныеОпции.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.Заказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
				ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
															, Выборка.СтатусРасходногоОрдера
															, Выборка.СтатусСтрокиРасходногоОрдера);	
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
			
			СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25);
			
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 10.06.24 УА #77595				
			
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
Процедура ПодтвердитьЛоты(Профиль, МассивShipments) Экспорт

	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);  
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	
	Если Не РезультатПроверки Тогда
		Возврат;
	КонецЕсли;
	
	Data = Новый Структура;
	Data.Вставить("token", НастройкиСоединения["СберТокен"]);
	Data.Вставить("shipments", МассивShipments);
	
	Результат = ИС_Сбер_API.ПодтвердитьЛотыВОтрпавлении(Профиль, ПараметрыЗапроса, Data);
	
	Если Результат <> Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Лоты подтверждены");
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
Процедура СкомплектоватьЛоты(Профиль, МассивShipments) Экспорт

	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);  
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	
	Если Не РезультатПроверки Тогда
		Возврат;
	КонецЕсли;
	
	Data = Новый Структура;
	Data.Вставить("token", НастройкиСоединения["СберТокен"]);
	Data.Вставить("shipments", МассивShipments);
	
	Результат = ИС_Сбер_API.ПодтвердитьКомплектацию(Профиль, ПараметрыЗапроса, Data);
	
	Если Результат <> Неопределено Тогда
		
		//+ ИнфоСофт Заварин К.В. 24.02.25 УА #73904
		Для Каждого Элемент Из МассивShipments Цикл 
			
			ЗаказМП = Документы.ИС_Сбер_Отправление.НайтиПоНомеру(Элемент.shipmentId);
			Запрос = Новый Запрос;
			Запрос.Текст =	
			"ВЫБРАТЬ
			|	ИС_Сбер_Отправление.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТ_СборочныеЗадания
			|ИЗ
			|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
			|ГДЕ
			|	ИС_Сбер_Отправление.Профиль = &Профиль
			|	И ИС_Сбер_Отправление.Ссылка В(&МассивЗаказов)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИС_Сбер_Отправление_items.Ссылка КАК Заказ,
			|	ИС_Сбер_Товары.Номенклатура КАК Номенклатура,
			|	ИС_Сбер_Товары.Характеристика КАК Характеристика,
			|	СУММА(ИС_Сбер_Отправление_items.quantity) КАК Количество
			|ИЗ
			|	Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправление_items
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
			|		ПО ИС_Сбер_Отправление_items.offerId = ИС_Сбер_Товары.offerID
			|			И (ИС_Сбер_Товары.ЛичныйКабинет = &Профиль)
			|ГДЕ
			|	ИС_Сбер_Отправление_items.Ссылка В
			|			(ВЫБРАТЬ
			|				ВТ_СборочныеЗадания.Ссылка КАК Ссылка
			|			ИЗ
			|				ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания)
			|
			|СГРУППИРОВАТЬ ПО
			|	ИС_Сбер_Отправление_items.Ссылка,
			|	ИС_Сбер_Товары.Номенклатура,
			|	ИС_Сбер_Товары.Характеристика";
			
			Запрос.УстановитьПараметр("МассивЗаказов", ЗаказМП);
			Запрос.УстановитьПараметр("Профиль", Профиль);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выгрузить();
			
			МассивКодов = Новый Массив;
			
			МассивКодов.Добавить(Выборка);
			
			ИС_MP_Сервер.ЗаписатьДанныеКИЗ(Профиль, Перечисления.ИС_МП_Маркетплейсы.Сбер, ЗаказМП, Выборка);
			
		КонецЦикла;                                    
		//- ИнфоСофт Заварин К.В. 24.02.25 УА #73904
		
		ОбщегоНазначения.СообщитьПользователю("Лоты подтверждены");
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
Процедура ОтгрузитьЛоты(Профиль, МассивShipments) Экспорт

	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);  
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	
	Если Не РезультатПроверки Тогда
		Возврат;
	КонецЕсли;
	
	Data = Новый Структура;
	Data.Вставить("token", НастройкиСоединения["СберТокен"]);
	Data.Вставить("shipments", МассивShipments);
	
	Результат = ИС_Сбер_API.ПодтвердитьОтгрузку(Профиль, ПараметрыЗапроса, Data);
	
	Если Результат <> Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Лоты подтверждены");
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
Процедура ОтменитьЛоты(Профиль, МассивShipments, СтруктурвReason) Экспорт

	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);  
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	
	Если Не РезультатПроверки Тогда
		Возврат;
	КонецЕсли;
	
	Data = Новый Структура;
	Data.Вставить("token", НастройкиСоединения["СберТокен"]);
	Data.Вставить("shipments", МассивShipments);
	Data.Вставить("reason", СтруктурвReason);
	
	Результат = ИС_Сбер_API.ОтменитьЛотыВОтрпавлении(Профиль, ПараметрыЗапроса, Data);
	
	Если Результат <> Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Лоты отменены");
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Стояк Ю.К. 07.06.2024 УА #76167
Функция ПолучитьДанныеОтправлений(Профиль, МассивОтправлений) Экспорт
	
	Событие = ИмяСобытия("ПолучитьОтправления");
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);  
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	
	Если Не РезультатПроверки Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("token", НастройкиСоединения["СберТокен"]);
	СтруктураПараметров.Вставить("shipments", МассивОтправлений);
	
	РезультатЗапроса = ИС_Сбер_API.ПолучитьОтправления(Профиль, ПараметрыЗапроса, СтруктураПараметров);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.shipments;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 07.06.2024 УА #76167

//+ ИнфоСофт Заварин К.В. 26.09.24 УА #77549
Процедура ОтменитьЗаказ(Заказ, Профиль) Экспорт 
	
	ФукнциональныеОпции = ПолучитьИПроверитьФункциональныеОпции(Профиль);
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ФукнциональныеОпции.УдалятьРТУ Тогда
		Возврат;
	КонецЕсли;
  
	Если ФукнциональныеОпции.ПроверятьДатуПередУдалением Тогда
				
		Если ЗначениеЗаполнено(Заказ.shippingTimeLimit) И ТекущаяДатаСеанса() >= Заказ.shippingTimeLimit Тогда
			Возврат;	
		КонецЕсли;
		
	КонецЕсли;
	
	ИспользоватьПричины = Ложь;
	
	Если Константы.ИспользоватьПричиныОтменыЗаказовКлиентов.Получить() Тогда
		ИспользоватьПричины = Истина;
		Если Не ЗначениеЗаполнено(ФукнциональныеОпции.ПричинаОтмены) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_Сбер_Отправлениеitems.Ссылка КАК Ссылка,
	|	ИС_Сбер_Отправлениеitems.Ссылка.Заказ КАК Заказ,
	|	ИС_Сбер_Товары.Номенклатура КАК Номенклатура,
	|	ИС_Сбер_Товары.Характеристика КАК Характеристика,
	|	ИС_Сбер_Товары.Упаковка КАК Упаковка,
	|	ИС_Сбер_Отправлениеitems.itemIndex КАК Count,
	|	ИС_Сбер_Отправлениеitems.price КАК price,
	|	ЕСТЬNULL(ИС_Сбер_Товары.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор
	|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	|ИЗ
	|	Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправлениеitems
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
	|		ПО ИС_Сбер_Отправлениеitems.НоменклатураМегаМаркета = ИС_Сбер_Товары.Номенклатура
	|ГДЕ
	|	ИС_Сбер_Отправлениеitems.Ссылка = &Ссылка
	|	И НЕ ИС_Сбер_Отправлениеitems.Ссылка.Заказ ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка КАК Заказ,
	|	МАКСИМУМ(РеализацияТоваровУслуг.Ссылка) КАК РТУ,
	|	СУММА(ВЫБОР
	|			КОГДА РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоРТУ
	|ПОМЕСТИТЬ ВТ_РТУ
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (ВТ_ОсновныеДанные.Ссылка.Заказ = (ВЫРАЗИТЬ(РеализацияТоваровУслуг.ЗаказКлиента КАК Документ.ЗаказКлиента)))
	|ГДЕ
	|	ВТ_ОсновныеДанные.Ссылка.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОсновныеДанные.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка,
	|	МАКСИМУМ(ПередачаТоваровХранителю.Ссылка),
	|	СУММА(ВЫБОР
	|			КОГДА ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО (ВТ_ОсновныеДанные.Ссылка.Заказ = (ВЫРАЗИТЬ(ПередачаТоваровХранителю.ЗаказКлиента КАК Документ.ЗаказКлиента)))
	|ГДЕ
	|	ВТ_ОсновныеДанные.Ссылка.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОсновныеДанные.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_РТУ.КоличествоРТУ) КАК КоличествоРТУ1,
	|	ВТ_РТУ.Заказ КАК Заказ,
	|	ВТ_РТУ.РТУ КАК РТУ
	|ПОМЕСТИТЬ ВТ_РТУ_Группировка
	|ИЗ
	|	ВТ_РТУ КАК ВТ_РТУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РТУ.Заказ,
	|	ВТ_РТУ.РТУ
	|;
	|
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК РасходныйОрдер
	|ПОМЕСТИТЬ ВТ_РасходныйОрдер1
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ПО ВТ_ОсновныеДанные.Заказ = (ВЫРАЗИТЬ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Документ.ЗаказКлиента))
	|ГДЕ
	|	НЕ ВТ_ОсновныеДанные.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасходныйОрдер1.Ссылка КАК Ссылка,
	|	ВТ_РасходныйОрдер1.РасходныйОрдер КАК РасходныйОрдер,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) КАК РазличныхРаспоряжений
	|ПОМЕСТИТЬ ВТ_РасходныйОрдер
	|ИЗ
	|	ВТ_РасходныйОрдер1 КАК ВТ_РасходныйОрдер1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ПО ВТ_РасходныйОрдер1.РасходныйОрдер = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
    |
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасходныйОрдер1.Ссылка,
	|	ВТ_РасходныйОрдер1.РасходныйОрдер
	|;
	|
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка КАК ЗаказЯМ,
	|	ВТ_ОсновныеДанные.Заказ КАК Заказ1С,
	|	ВТ_РТУ_Группировка.РТУ КАК РТУ,
	|	ВТ_ОсновныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ОсновныеДанные.Характеристика КАК Характеристика,
	|	ВТ_ОсновныеДанные.Count КАК count,
	|	ВТ_ОсновныеДанные.price КАК price,
	|	ВТ_ОсновныеДанные.ЭтоНабор КАК ЭтоНабор,
	|	NULL КАК НоменклатураВНаборе,
	|	NULL КАК ХарактеристикаНабора,
	|	NULL КАК Количество,
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|	ВТ_РасходныйОрдер.РасходныйОрдер КАК РасходныйОрдер,
	|   ВТ_РасходныйОрдер.РазличныхРаспоряжений КАК РазличныхРаспоряжений
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ_Группировка КАК ВТ_РТУ_Группировка
	|		ПО ВТ_ОсновныеДанные.Ссылка = ВТ_РТУ_Группировка.Заказ
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныйОрдер КАК ВТ_РасходныйОрдер		
	|       ПО ВТ_ОсновныеДанные.Ссылка = ВТ_РасходныйОрдер.Ссылка
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|ГДЕ
	|	НЕ ВТ_ОсновныеДанные.ЭтоНабор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка,
	|	ВТ_РТУ_Группировка.Заказ,
	|	ВТ_ОсновныеДанные.Заказ,
	|	ВТ_ОсновныеДанные.Номенклатура,
	|	ВТ_ОсновныеДанные.Характеристика,
	|	ВТ_ОсновныеДанные.Count,
	|	ВТ_ОсновныеДанные.price,
	|	ВТ_ОсновныеДанные.ЭтоНабор,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество,
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|	ВТ_РасходныйОрдер.РасходныйОрдер КАК РасходныйОрдер,
	|   ВТ_РасходныйОрдер.РазличныхРаспоряжений КАК РазличныхРаспоряжений
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ_Группировка КАК ВТ_РТУ_Группировка
	|		ПО ВТ_ОсновныеДанные.Ссылка = ВТ_РТУ_Группировка.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО ВТ_ОсновныеДанные.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|			И ВТ_ОсновныеДанные.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныйОрдер КАК ВТ_РасходныйОрдер		
	|       ПО ВТ_ОсновныеДанные.Ссылка = ВТ_РасходныйОрдер.Ссылка
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|ГДЕ
	|	ВТ_ОсновныеДанные.ЭтоНабор";
	
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//+ ИнфоСофт Стояк Ю.К. 11.10.2024 УА #84967
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РТУ) И ФукнциональныеОпции.РежимСозданияЗаказов = 0 Тогда 		
		//Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РТУ) Тогда 					
		//- ИнфоСофт Стояк Ю.К. 11.10.2024 УА #84967
			
			Если Не ВыборкаДетальныеЗаписи.РТУ.ПометкаУдаления Тогда
				РТУ = ВыборкаДетальныеЗаписи.РТУ.ПолучитьОбъект();	
				
				Попытка	
					РТУ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение 
					
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
					Возврат;
					
				КонецПопытки;
				
				РТУ.ПометкаУдаления = Истина; 			
				
				Попытка	
					РТУ.Записать();
				Исключение 
					
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
					Возврат;
					
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
		//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РасходныйОрдер)
			И ФукнциональныеОпции.РежимСозданияЗаказов = 0 Тогда 
			
			РО = ВыборкаДетальныеЗаписи.РасходныйОрдер.ПолучитьОбъект();
			
			Если ВыборкаДетальныеЗаписи.РазличныхРаспоряжений = 1 Тогда
				
				Попытка	
					РО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение 
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
					Возврат;	
				КонецПопытки;
				
				РО.ПометкаУдаления = Истина;
				
				Попытка	
					РО.Записать();
				Исключение	
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
					Возврат;	
				КонецПопытки; 	
				
			Иначе
				
				Отбор = Новый Структура(); 
				Отбор.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
				Отбор.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);
				
				НайденныеСтрокиОтгружаемые = РО.ОтгружаемыеТовары.НайтиСтроки(Отбор);
				
				Отбор.Вставить("Распоряжение", ВыборкаДетальныеЗаписи.Заказ1С);
				
				НайденныеСтрокиПоРаспоряжениям = РО.ТоварыПоРаспоряжениям.НайтиСтроки(Отбор);
				
				Если НайденныеСтрокиПоРаспоряжениям.Количество() > 0 Тогда
					
					РО.ТоварыПоРаспоряжениям.Удалить(НайденныеСтрокиПоРаспоряжениям[0]);
					
					НайденныеСтрокиОтгружаемые[0].Действие = 
					Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать;
					
					Попытка			
						РО.Записать(РежимЗаписиДокумента.Проведение);	
					Исключение 
						РО.Записать();			
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Заказ1С) Тогда
			
			Заказ1С = ВыборкаДетальныеЗаписи.Заказ1С.ПолучитьОбъект();
			
			Попытка
				Заказ1С.Заблокировать();    
			Исключение   
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", "Заказ " + Заказ1С.Ссылка + " заблокирован для изменения данных");     
				Продолжить;
			КонецПопытки;                               
			
			Если ФукнциональныеОпции.РежимСозданияЗаказов <> 0 Тогда
				
				Если ВыборкаДетальныеЗаписи.ЭтоНабор Тогда
					Отбор = Новый Структура();							
					Отбор.Вставить("НоменклатураНабора", ВыборкаДетальныеЗаписи.Номенклатура);
					Отбор.Вставить("ХарактеристикаНабора", ВыборкаДетальныеЗаписи.Характеристика); 
					Отбор.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.НоменклатураВНаборе);
					Отбор.Вставить("Характеристика", ВыборкаДетальныеЗаписи.ХарактеристикаНабора);					
					
					НайденныеСтроки = Заказ1С.Товары.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() > 0 Тогда	
											
						НайденныеСтроки[0].Отменено = Истина;
						Если ИспользоватьПричины Тогда		
							НайденныеСтроки[0].ПричинаОтмены = ФукнциональныеОпции.ПричинаОтмены;	
						КонецЕсли;  
						
					КонецЕсли; 
					
				Иначе
					Отбор = Новый Структура();							
					Отбор.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					Отбор.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);					
					
					НайденныеСтроки = Заказ1С.Товары.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() > 0 Тогда 
						
						НайденныеСтроки[0].Отменено = Истина;
						Если ИспользоватьПричины Тогда		
							НайденныеСтроки[0].ПричинаОтмены = ФукнциональныеОпции.ПричинаОтмены;	
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЕсли;                                                       
				
			Иначе 
				
				Для Каждого Товар Из Заказ1С.Товары Цикл
					Товар.Отменено = Истина;
					Если ИспользоватьПричины Тогда		
						Товар.ПричинаОтмены = ФукнциональныеОпции.ПричинаОтмены;	
					КонецЕсли;	
				КонецЦикла;
				
			КонецЕсли;                                  
			
			Попытка	
				Заказ1С.Записать(РежимЗаписиДокумента.Проведение);
			Исключение 
				
				Заказ1С.Записать();			
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
				
			КонецПопытки; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат;
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 26.09.24 УА #77549

#КонецОбласти

#Область ОстаткиИЦены

//+ ИнфоСофт Ивонин К.А. 04.03.24 УА #66733
Функция ПолучитьТекстЗапросаОстатков() Экспорт    
	
	Текст =
	"ВЫБРАТЬ
	|	ИС_Сбер_Номенклатура.Ссылка КАК ПолеСопоставления,
	|	ИС_Сбер_Номенклатура.offer_id КАК offerID,
	|	ИС_Сбер_Номенклатура.Штрихкод КАК Штрихкод,
	|	ИС_Сбер_Товары.Номенклатура КАК Номенклатура,
	|	ИС_Сбер_Товары.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_Сбер_Товары.Упаковка, &ПустаяУпаковка) КАК Упаковка,
	|	ИС_MP_ОграничениеОстатков.Остаток КАК СкрываемыйОстаток,
	|	НЕ ИС_MP_ОграничениеОстатков.Остаток ЕСТЬ NULL КАК ЕстьСкрываемыйОстаток,
	|	ИС_MP_РучныеОстатки.Остаток КАК РучнойОстаток,
	|	НЕ ИС_Сбер_Товары.Номенклатура ЕСТЬ NULL КАК ЕстьСопоставление,
	|	НЕ ИС_MP_РучныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьРучнойОстаток,
	|	ЕСТЬNULL(ИС_Сбер_Товары.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
	|	ВЫБОР
	|		КОГДА ИС_Сбер_Товары.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_Сбер_Товары.Упаковка.Числитель, 1)
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_Сбер_Товары.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_Сбер_Товары.Упаковка.Знаменатель, 1)
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	ЕСТЬNULL(ИС_MP_ПоследниеВыгруженныеОстатки.Остаток, 0) КАК ПоследнийВыгруженныйОстаток,
	|	НЕ ИС_MP_ПоследниеВыгруженныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьПоследнийВыгруженныйОстаток
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
	|		ПО (ИС_Сбер_Товары.ЛичныйКабинет = &Профиль)
	|			И ИС_Сбер_Номенклатура.offer_id = ИС_Сбер_Товары.offerID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ОграничениеОстатков КАК ИС_MP_ОграничениеОстатков
	|		ПО (ИС_MP_ОграничениеОстатков.Профиль = &Профиль)
	|			И (ИС_MP_ОграничениеОстатков.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ОграничениеОстатков.Склад КАК Справочник.ИС_Сбер_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ОграничениеОстатков.КарточкаМП КАК Справочник.ИС_Сбер_Номенклатура)) = ИС_Сбер_Номенклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_РучныеОстатки КАК ИС_MP_РучныеОстатки
	|		ПО (ИС_MP_РучныеОстатки.Профиль = &Профиль)
	|			И (ИС_MP_РучныеОстатки.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_РучныеОстатки.Склад КАК Справочник.ИС_Сбер_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_РучныеОстатки.КарточкаМП КАК Справочник.ИС_Сбер_Номенклатура)) = ИС_Сбер_Номенклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ПоследниеВыгруженныеОстатки КАК ИС_MP_ПоследниеВыгруженныеОстатки
	|		ПО (ИС_MP_ПоследниеВыгруженныеОстатки.Профиль = &Профиль)
	|			И (ИС_MP_ПоследниеВыгруженныеОстатки.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ПоследниеВыгруженныеОстатки.Склад КАК Справочник.ИС_Сбер_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ПоследниеВыгруженныеОстатки.КарточкаМП КАК Справочник.ИС_Сбер_Номенклатура)) = ИС_Сбер_Номенклатура.Ссылка)
	|ГДЕ
	|	ИС_Сбер_Номенклатура.Профиль = &Профиль
	|	И НЕ ИС_Сбер_Номенклатура.ПометкаУдаления";
	
	Текст = Текст + ";";
		
	Текст = Текст + ИС_МП_УправлениеОстатками.ТекстЗапросаОстатков();
	
	Текст = Текст +
	"ВЫБРАТЬ
	|	ВТ_Сопоставление.ПолеСопоставления КАК НоменклатураСбер,
	|	ВТ_Сопоставление.offerID КАК offerID,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка,
	|	ВТ_Остатки.Свободно КАК Свободно,
	|	ВТ_Остатки.Резерв КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВТ_Сопоставление.СкрываемыйОстаток ЕСТЬ NULL
	|			ТОГДА &КоличествоСкрываемогоОстатка
	|		ИНАЧЕ ВТ_Сопоставление.СкрываемыйОстаток
	|	КОНЕЦ КАК СкрываемыйОстаток,
	|	ВТ_Сопоставление.ЕстьСкрываемыйОстаток КАК ЕстьСкрываемыйОстаток,
	|	ВТ_Сопоставление.РучнойОстаток КАК РучнойОстаток,
	|	ВТ_Сопоставление.ЕстьСопоставление КАК ЕстьСопоставление,
	|	ВТ_Сопоставление.ЕстьРучнойОстаток КАК ЕстьРучнойОстаток,
	|	ВТ_Сопоставление.ПоследнийВыгруженныйОстаток КАК ПоследнийВыгруженныйОстаток,
	|	ВТ_Сопоставление.ЕстьПоследнийВыгруженныйОстаток КАК ЕстьПоследнийВыгруженныйОстаток,
	|	ВТ_Сопоставление.Штрихкод КАК Штрихкод
	|ИЗ
	|	ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_Остатки.ПолеСопоставления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Сопоставление.ЕстьСопоставление УБЫВ";
	
	Возврат Текст;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 04.03.24 УА #66733

//+ ИнфоСофт Ивонин К.А. 04.03.24 УА #66733
Процедура УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад) Экспорт
	
	Событие = ИмяСобытия("УстановитьПараметрыЗапросаОстатков");
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "Организация");
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Сбер; 
	
	МассивПараметров = ИС_МП_УправлениеОстатками.МассивНастроекОстатков(ПеречислениеМП);
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивПараметров); 
	
	РассчитыватьНесобранныеКомплекты = Ложь;
	ВыгружатьОстаткиВРазрезеОрганизации = Ложь;
	СкрываемыйОстаток = 0;
	
	Если Настройки.РассчитыватьНесобранныеКомплекты <> Неопределено Тогда
		РассчитыватьНесобранныеКомплекты = Настройки.РассчитыватьНесобранныеКомплекты;	
	КонецЕсли; 

	Если Настройки.ВыгружатьОстаткиВРазрезеОрганизации <> Неопределено Тогда
		ВыгружатьОстаткиВРазрезеОрганизации = Настройки.ВыгружатьОстаткиВРазрезеОрганизации;	
	КонецЕсли;

	Если Настройки.СкрываемыйОстаток <> Неопределено Тогда
		СкрываемыйОстаток = Настройки.СкрываемыйОстаток;	
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Маркетплейс", ПеречислениеМП);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("КоличествоСкрываемогоОстатка", СкрываемыйОстаток);
	Запрос.УстановитьПараметр("РассчитыватьНесобранныеКомплекты", РассчитыватьНесобранныеКомплекты);
	Запрос.УстановитьПараметр("ВыгружатьОстаткиВРазрезеОрганизации", ВыгружатьОстаткиВРазрезеОрганизации);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПустаяУпаковка", ИС_МП_СерверЛокализация.ПустаяСсылкаУпаковка());
	
	Заменитель = "ИЕРАРХИИ";
	ПараметрСклад = Неопределено;
	
	ЗапросНазначений = Новый Запрос;
	ЗапросНазначений.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
	|ИЗ
	|	Справочник.ИС_Сбер_Склады.НаправленияДеятельности КАК ИС_Сбер_СкладыНаправленияДеятельности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ИС_Сбер_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности
	|			И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|ГДЕ
	|	ИС_Сбер_СкладыНаправленияДеятельности.Ссылка = &Ссылка";
	
	ЗапросНазначений.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
	
	Назначения = Новый Массив;
	
	ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
	
	Пока ВыборкаНазначения.Следующий() Цикл	
		Назначения.Добавить(ВыборкаНазначения.Назначение);
	КонецЦикла;
	
	Если Назначения.Количество() = 0 Тогда		
		Назначения = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;

	Запрос.УстановитьПараметр("Назначение", Назначения);	
		
	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
	"ВЫБРАТЬ
	|	ИС_Сбер_Склады.Ссылка КАК Ссылка,
	|	ИС_Сбер_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_Сбер_Склады.Склад КАК Склад,
	|	ИС_Сбер_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_Сбер_СкладыГруппаСкладов.Склад КАК СкладГруппы
	|ИЗ
	|	Справочник.ИС_Сбер_Склады КАК ИС_Сбер_Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Сбер_Склады.ГруппаСкладов КАК ИС_Сбер_СкладыГруппаСкладов
	|		ПО ИС_Сбер_Склады.Ссылка = ИС_Сбер_СкладыГруппаСкладов.Ссылка
	|ГДЕ
	|	ИС_Сбер_Склады.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка";

	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСклад.Следующий() Цикл
			
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
		    
		    ПараметрСклад = Новый Массив;
		    
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
		
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
			
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда
			    	ПараметрСклад.Добавить(ВыборкаГруппаСкладов.СкладГруппы);
			    КонецЕсли;
			    
			КонецЦикла;				
		
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			Заменитель = "";
			ПараметрСклад = ВыборкаСклад.ОбщаяГруппаСкладов;
		Иначе
			ПараметрСклад = ВыборкаСклад.Склад;
		КонецЕсли;
	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Заменитель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, Заменитель, "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрСклад) Тогда
		Текст = СтрШаблон("Не заполнено сопоставление склада %1 (%2)", ПараметрСклад, Профиль);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст); 
	КонецЕсли;
	 
	Запрос.УстановитьПараметр("Склад1С", ПараметрСклад);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.03.24 УА #66733

//+ ИнфоСофт Ивонин К.А. 08.03.24 УА #66733
Процедура ВыгрузитьОстатки(Профиль, Склад, ТаблицаВыгрузки = Неопределено) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);  
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	
	Если Не РезультатПроверки Тогда
		Возврат;
	КонецЕсли;
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Сбер;
	
	МассивНастроек = ИС_МП_УправлениеОстатками.МассивПараметровВыгрузкиОстатков();	
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивНастроек);
		
	ИспользоватьПоследниеОстатки = Ложь;
	
	Если Настройки.ИспользоватьПоследниеОстатки <> Неопределено Тогда
		ИспользоватьПоследниеОстатки = Настройки.ИспользоватьПоследниеОстатки;
	КонецЕсли;
		
	Если ТаблицаВыгрузки = Неопределено Тогда		
		ТаблицаВыгрузки = ИС_МП_УправлениеОстатками.СформироватьТаблицуВыгрузки(Профиль, Склад, ПеречислениеМП, Настройки);		
	КонецЕсли;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивОстатки = Новый Массив;
		
	Для Каждого Элемент Из ТаблицаВыгрузки Цикл
		
		Остатки = Новый Структура;
		Остатки.Вставить("offerId", Элемент.offerID);
		Остатки.Вставить("quantity", Элемент.Остаток);
		МассивОстатки.Добавить(Остатки);
		
	КонецЦикла;
	
	//+ ИнфоСофт Стояк Ю.К. 08.11.2024 УА #87149	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивОстатки, 300);
	//- ИнфоСофт Стояк Ю.К. 08.11.2024 УА #87149
	
	Data = Новый Структура;
	Data.Вставить("token", НастройкиСоединения["СберТокен"]);
    Data.Вставить("stocks", Новый Массив);
	
	//+ ИнфоСофт Стояк Ю.К. 08.11.2024 УА #87149
	Для Каждого Элемент Из РазбитыйМассив Цикл						
		
		Data.stocks = Элемент;
		//- ИнфоСофт Стояк Ю.К. 08.11.2024 УА #87149
		Результат = ИС_Сбер_API.ВыгрузитьОстатки(Профиль, ПараметрыЗапроса, Data);
		
		БылиОшибкиВыгрузки = Ложь;
		
		Если Результат = Неопределено Тогда
			БылиОшибкиВыгрузки = Истина;            
		//+ ИнфоСофт Стояк Ю.К. 08.11.2024 УА #87149
		//Иначе
		//	ОбщегоНазначения.СообщитьПользователю("Остатки успешно выгружены");
		//- ИнфоСофт Стояк Ю.К. 08.11.2024 УА #87149
		КонецЕсли;
		
		Если Не ИспользоватьПоследниеОстатки Тогда      
			//+ ИнфоСофт Стояк Ю.К. 08.11.2024 УА #87149
			//Возврат;
			//- ИнфоСофт Стояк Ю.К. 08.11.2024 УА #87149
			Продолжить;
		КонецЕсли;
		
		Если Не БылиОшибкиВыгрузки Тогда
			
			//+ ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88148							
			//Для Каждого Строка Из ТаблицаВыгрузки Цикл				
			//	ИС_МП_УправлениеОстатками.ЗаписатьПоследнийВыгруженныйОстаток(Профиль, 
			//	Перечисления.ИС_МП_Маркетплейсы.Сбер, Склад, Строка.НоменклатураСбер, Строка.Остаток);
			//КонецЦикла;
			Для Каждого Строка Из Элемент Цикл	   
				
				Отбор = Новый Структура("offerID", Строка.offerId);
				НайденныеСтроки = ТаблицаВыгрузки.НайтиСтроки(Отбор);
				
				Если НайденныеСтроки.Количество() = 1 Тогда						
					ИС_МП_УправлениеОстатками.ЗаписатьПоследнийВыгруженныйОстаток(Профиль, 
					Перечисления.ИС_МП_Маркетплейсы.Сбер, Склад, НайденныеСтроки[0].НоменклатураСбер, НайденныеСтроки[0].Остаток);
				КонецЕсли;
			КонецЦикла;
			//- ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88148
			
		КонецЕсли;	
		
	//+ ИнфоСофт Стояк Ю.К. 08.11.2024 УА #87149	
	КонецЦикла; 
	
	ОбщегоНазначения.СообщитьПользователю("Выгрузка остатков завершена.");
	//- ИнфоСофт Стояк Ю.К. 08.11.2024 УА #87149	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.03.24 УА #66733

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
Функция ПолучитьСкладПоУмолчанию(Профиль) Экспорт

	Результат = Справочники.ИС_Сбер_Склады.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ИС_Сбер_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_Сбер_Склады КАК ИС_Сбер_Склады
	|ГДЕ
	|	ИС_Сбер_Склады.Профиль = &Профиль
	|	И НЕ ИС_Сбер_Склады.ПометкаУдаления";

	Запрос.УстановитьПараметр("Профиль", Профиль);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 01.04.24 УА #71892
Функция ПолучитьИнформациюОСкладе(Склад) Экспорт

	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
	"ВЫБРАТЬ
	|	ИС_Сбер_Склады.Ссылка КАК Ссылка,
	|	ИС_Сбер_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_Сбер_Склады.Склад КАК Склад,
	|	ИС_Сбер_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_Сбер_СкладыГруппаСкладов.Склад КАК СкладГруппы
	|ИЗ
	|	Справочник.ИС_Сбер_Склады КАК ИС_Сбер_Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Сбер_Склады.ГруппаСкладов КАК ИС_Сбер_СкладыГруппаСкладов
	|		ПО ИС_Сбер_Склады.Ссылка = ИС_Сбер_СкладыГруппаСкладов.Ссылка
	|ГДЕ
	|	ИС_Сбер_Склады.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Результат = "";
		
	Пока ВыборкаСклад.Следующий() Цикл				
				
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
		    
		    Результат = Результат + "Группа складов: " + Символы.ПС;
		    
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
		
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
			
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда
			    	Результат = Результат + Символы.Таб + " - " + ВыборкаГруппаСкладов.СкладГруппы + Символы.ПС;
			    КонецЕсли;
			    
			КонецЦикла;				
		
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			Результат = Результат + "Общая группа складов: " + ВыборкаСклад.ОбщаяГруппаСкладов + Символы.ПС;
		Иначе
			Результат = Результат + "Склад: " + ВыборкаСклад.Склад + Символы.ПС;		
		КонецЕсли;
	
	КонецЦикла;
    
    Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 01.04.24 УА #71892

//+ ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901
Процедура УстановитьПараметрыЗапросаЦен(Запрос, Профиль) Экспорт
	
	Событие = ИмяСобытия("УстановитьПараметрыЗапросаЦен");
		
	МассивПараметров = ПолучитьСписокПараметровЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.Сбер, МассивПараметров);
	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
		
	Запрос.УстановитьПараметр("Маркетплейс"			, Перечисления.ИС_МП_Маркетплейсы.Сбер);
	Запрос.УстановитьПараметр("ВидЦены"				, СтруктураЦен.ВидЦены); 
	Запрос.УстановитьПараметр("ВидЦеныСоСкидкой"	, Справочники.ВидыЦен.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидЦеныМинимальный"	, Справочники.ВидыЦен.ПустаяСсылка());
	//+ ИнфоСофт Заварин К.В. 03.09.24 УА #72696
	Запрос.УстановитьПараметр("ВидЦеныFBO"			, Справочники.ВидыЦен.ПустаяСсылка());
	//- ИнфоСофт Заварин К.В. 03.09.24 УА #72696
	Запрос.УстановитьПараметр("Профиль"				, Профиль); 
	Запрос.УстановитьПараметр("ПустаяУпаковка"		, ИС_MP_СерверЛокализация.ПустаяСсылкаУпаковка());
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьСписокПараметровЦен() Экспорт

	Результат = Новый Массив;
	
	Результат.Добавить("ВидЦены");
	Результат.Добавить("РежимОкругленияЦен");
	Результат.Добавить("ИспользоватьПоследниеЦены"); 

    Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьСтруктуруПараметровЦен() Экспорт

	Результат = Новый Структура;
	
	Результат.Вставить("ВидЦены"					, Справочники.ВидыЦен.ПустаяСсылка());
	Результат.Вставить("РежимОкругленияЦен"			, 0);
	Результат.Вставить("ИспользоватьПоследниеЦены"	, Ложь); 

    Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901
Функция ПолучитьТекстЗапросаЦен() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	ИС_Сбер_Номенклатура.Ссылка КАК ПолеСопоставления,
	|	ИС_МП_РучныеЦены.Цена КАК Цена,
	|	NULL КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_РучныеЦеныОбъединение
	|ИЗ
	|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_РучныеЦены КАК ИС_МП_РучныеЦены
	|		ПО (ИС_МП_РучныеЦены.Профиль = &Профиль)
	|			И (ИС_МП_РучныеЦены.Маркетплейс = &Маркетплейс)
	|			И (ИС_Сбер_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_РучныеЦены.КарточкаМП КАК Справочник.ИС_Сбер_Номенклатура)))
	|			И (ИС_МП_РучныеЦены.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦены))
	|ГДЕ
	|	ИС_МП_РучныеЦены.Профиль = &Профиль
	|	И ИС_МП_РучныеЦены.Маркетплейс = &Маркетплейс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_Сбер_Номенклатура.Ссылка,
	|	NULL,
	|	ИС_МП_РучныеЦеныСоСкидкой.Цена
	|ИЗ
	|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_РучныеЦены КАК ИС_МП_РучныеЦеныСоСкидкой
	|		ПО (ИС_МП_РучныеЦеныСоСкидкой.Профиль = &Профиль)
	|			И (ИС_МП_РучныеЦеныСоСкидкой.Маркетплейс = &Маркетплейс)
	|			И (ИС_Сбер_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_РучныеЦеныСоСкидкой.КарточкаМП КАК Справочник.ИС_Сбер_Номенклатура)))
	|			И (ИС_МП_РучныеЦеныСоСкидкой.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой))
	|ГДЕ
	|	ИС_МП_РучныеЦеныСоСкидкой.Профиль = &Профиль
	|	И ИС_МП_РучныеЦеныСоСкидкой.Маркетплейс = &Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Сбер_Номенклатура.Ссылка КАК ПолеСопоставления,
	|	ИС_МП_ПоследниеЦены.Цена КАК Цена,
	|	NULL КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_ПоследниеЦеныОбъединение
	|ИЗ
	|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_ПоследниеВыгруженныеЦены КАК ИС_МП_ПоследниеЦены
	|		ПО (ИС_МП_ПоследниеЦены.Профиль = &Профиль)
	|			И (ИС_МП_ПоследниеЦены.Маркетплейс = &Маркетплейс)
	|			И (ИС_Сбер_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_ПоследниеЦены.КарточкаМП КАК Справочник.ИС_Сбер_Номенклатура)))
	|			И (ИС_МП_ПоследниеЦены.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦены))
	|ГДЕ
	|	ИС_МП_ПоследниеЦены.Профиль = &Профиль
	|	И ИС_МП_ПоследниеЦены.Маркетплейс = &Маркетплейс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_Сбер_Номенклатура.Ссылка,
	|	NULL,
	|	ИС_МП_ПоследниеЦеныСоСкидкой.Цена
	|ИЗ
	|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_ПоследниеВыгруженныеЦены КАК ИС_МП_ПоследниеЦеныСоСкидкой
	|		ПО (ИС_МП_ПоследниеЦеныСоСкидкой.Профиль = &Профиль)
	|			И (ИС_МП_ПоследниеЦеныСоСкидкой.Маркетплейс = &Маркетплейс)
	|			И (ИС_Сбер_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_ПоследниеЦеныСоСкидкой.КарточкаМП КАК Справочник.ИС_Сбер_Номенклатура)))
	|			И (ИС_МП_ПоследниеЦеныСоСкидкой.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой))
	|ГДЕ
	|	ИС_МП_ПоследниеЦеныСоСкидкой.Профиль = &Профиль
	|	И ИС_МП_ПоследниеЦеныСоСкидкой.Маркетплейс = &Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РучныеЦеныОбъединение.ПолеСопоставления КАК ПолеСопоставления,
	|	СУММА(ВТ_РучныеЦеныОбъединение.Цена) КАК Цена,
	|	СУММА(ВТ_РучныеЦеныОбъединение.ЦенаСоСкидкой) КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_РучныеЦены
	|ИЗ
	|	ВТ_РучныеЦеныОбъединение КАК ВТ_РучныеЦеныОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РучныеЦеныОбъединение.ПолеСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеЦеныОбъединение.ПолеСопоставления КАК ПолеСопоставления,
	|	СУММА(ВТ_ПоследниеЦеныОбъединение.Цена) КАК Цена,
	|	СУММА(ВТ_ПоследниеЦеныОбъединение.ЦенаСоСкидкой) КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_ПоследниеЦены
	|ИЗ
	|	ВТ_ПоследниеЦеныОбъединение КАК ВТ_ПоследниеЦеныОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоследниеЦеныОбъединение.ПолеСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Сбер_Номенклатура.Ссылка КАК ПолеСопоставления,
	|	ИС_Сбер_Номенклатура.offer_id КАК offerID,
	|	ИС_Сбер_Номенклатура.Штрихкод КАК Штрихкод,
	|	ИС_Сбер_Товары.Номенклатура КАК Номенклатура,
	|	ИС_Сбер_Товары.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_Сбер_Товары.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)) КАК ХарактеристикаЦО,
	|	ЕСТЬNULL(ИС_Сбер_Товары.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
	|	ЕСТЬNULL(ИС_Сбер_Товары.Упаковка, &ПустаяУпаковка) КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ИС_Сбер_Товары.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_Сбер_Товары.Упаковка.Числитель, 1)
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_Сбер_Товары.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_Сбер_Товары.Упаковка.Знаменатель, 1)
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	НЕ ИС_Сбер_Товары.Номенклатура ЕСТЬ NULL КАК ЕстьСопоставление,
	|	ВТ_РучныеЦены.Цена КАК РучнаяЦена,
	|	НЕ ВТ_РучныеЦены.Цена ЕСТЬ NULL КАК ЕстьРучнаяЦена,
	|	ВТ_РучныеЦены.ЦенаСоСкидкой КАК РучнаяЦенаСоСкидкой,
	|	НЕ ВТ_РучныеЦены.ЦенаСоСкидкой ЕСТЬ NULL КАК ЕстьРучнаяЦенаСоСкидкой,
	|	ЕСТЬNULL(ВТ_ПоследниеЦены.Цена, 0) КАК ПоследняяВыгруженнаяЦена,
	|	НЕ ВТ_ПоследниеЦены.Цена ЕСТЬ NULL КАК ЕстьПоследняяВыгруженнаяЦена,
	|	ЕСТЬNULL(ВТ_ПоследниеЦены.ЦенаСоСкидкой, 0) КАК ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	НЕ ВТ_ПоследниеЦены.ЦенаСоСкидкой ЕСТЬ NULL КАК ЕстьПоследняяВыгруженнаяЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
	|		ПО (ИС_Сбер_Товары.ЛичныйКабинет = &Профиль)
	|			И ИС_Сбер_Номенклатура.offer_id = ИС_Сбер_Товары.offerID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РучныеЦены КАК ВТ_РучныеЦены
	|		ПО (ВТ_РучныеЦены.ПолеСопоставления = ИС_Сбер_Номенклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследниеЦены КАК ВТ_ПоследниеЦены
	|		ПО (ВТ_ПоследниеЦены.ПолеСопоставления = ИС_Сбер_Номенклатура.Ссылка)
	|ГДЕ
	|	ИС_Сбер_Номенклатура.Профиль = &Профиль
	|	И НЕ ИС_Сбер_Номенклатура.ПометкаУдаления";	
	
	Текст = Текст + ";";
	
	Текст = Текст + ИС_МП_УправлениеЦенами.ТекстЗапросаЦен();
	
	Текст = Текст +	
	
	"ВЫБРАТЬ
	|	ВТ_Сопоставление.ПолеСопоставления КАК НоменклатураСбер,
	|	ВТ_Сопоставление.offerID КАК offerID,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка,
	|	ВТ_Сопоставление.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Сопоставление.ЕстьСопоставление КАК ЕстьСопоставление,
	|	ВТ_Сопоставление.РучнаяЦена КАК РучнаяЦена,
	|	ВТ_Сопоставление.РучнаяЦенаСоСкидкой КАК РучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьРучнаяЦена КАК ЕстьРучнаяЦена,
	|	ВТ_Сопоставление.ЕстьРучнаяЦенаСоСкидкой КАК ЕстьРучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦена КАК ПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦенаСоСкидкой КАК ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦена КАК ЕстьПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой КАК ЕстьПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Цены.Цена КАК Цена,
	|	ВТ_Цены.ЦенаСоСкидкой КАК ЦенаСоСкидкой,
	|	ВТ_Сопоставление.Штрихкод КАК Штрихкод
	|ИЗ
	|	ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_Цены.ПолеСопоставления
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сопоставление.ПолеСопоставления,
	|	ВТ_Сопоставление.offerID,
	|	ВТ_Сопоставление.Номенклатура,
	|	ВТ_Сопоставление.Характеристика,
	|	ВТ_Сопоставление.Упаковка, 
	|	ВТ_Сопоставление.ЭтоНабор,
	|	ВТ_Сопоставление.ЕстьСопоставление,
	|	ВТ_Сопоставление.РучнаяЦена,
	|	ВТ_Сопоставление.ЕстьРучнаяЦена,
	|	ВТ_Сопоставление.РучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьРучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Цены.Цена,
	|	ВТ_Цены.ЦенаСоСкидкой,
	|	ВТ_Сопоставление.Штрихкод
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Сопоставление.ЕстьСопоставление УБЫВ,
	|	ВТ_Сопоставление.РучнаяЦена УБЫВ";
	
	Возврат Текст;
		
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 13.05.24 УА #66901
Процедура ВыгрузитьЦены(Профиль, ТаблицаВыгрузки = Неопределено) Экспорт

	Событие = ИмяСобытия("ВыгрузитьЦены");
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);  
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	
	Если Не РезультатПроверки Тогда
		Возврат;
	КонецЕсли;
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Сбер;
	
	МассивПараметров = ПолучитьСписокПараметровЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.Сбер, МассивПараметров);
	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен(); 
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
	
	РежимОкругленияЦен = СтруктураЦен.РежимОкругленияЦен;
	ИспользоватьПоследниеЦены = СтруктураЦен.ИспользоватьПоследниеЦены;
	
	Если ТаблицаВыгрузки = Неопределено Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = ПолучитьТекстЗапросаЦен(); 
		
		УстановитьПараметрыЗапросаЦен(Запрос, Профиль);                                                       
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		ТаблицаВыгрузки = Новый ТаблицаЗначений;	
		
		ИС_МП_УправлениеЦенами.ЗаполнитьКолонкиТаблицыВыгрузкиЦен(ПеречислениеМП, ТаблицаВыгрузки);
		
		МассивПолей = ИС_МП_УправлениеЦенами.ПолучитьПоляДляВыгрузки(ПеречислениеМП);
		
		Пока Выборка.Следующий() Цикл
		
			Если Не Выборка.ЕстьСопоставление И Не Выборка.ЕстьРучнаяЦена Тогда
				Продолжить;
			КонецЕсли; 
			
			Если Не ЗначениеЗаполнено(Выборка.offerID) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
		
			Для Каждого Элемент Из МассивПолей Цикл
				НоваяСтрока[Элемент] = Выборка[Элемент];
			КонецЦикла;
			
			ЭтоНабор = Выборка.ЭтоНабор;
			
			Если Выборка.ЕстьРучнаяЦена Тогда
				Цена = Выборка.РучнаяЦена;
			Иначе  
				Цена = Выборка.Цена;
			КонецЕсли;
			
			Цена = Окр(Цена, 0, РежимОкругленияЦен);
			
			НоваяСтрока.Цена = Цена;
				
			//Если Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
			//	ЦенаСоСкидкой = Выборка.РучнаяЦенаСоСкидкой;
			//Иначе
			//	ЦенаСоСкидкой = Выборка.ЦенаСоСкидкой;	
			//КонецЕсли;
			//
			//ЦенаСоСкидкой = Окр(ЦенаСоСкидкой, 0, РежимОкругленияЦен);
			//	
			//Если ЦенаСоСкидкой = 0 Тогда
			//	Скидка = 0;	
			//Иначе
			//	Скидка = ?(Цена = 0, 0, 100 - Окр(ЦенаСоСкидкой / Цена * 100, 0, РежимОкругленияЦен));
			//КонецЕсли;
			//
			//Если ЗначениеЗаполнено(Скидка) И Скидка > 0 Тогда 
			//	НоваяСтрока.Скидка = Скидка; 
			//КонецЕсли;
			
			Если НоваяСтрока.Цена = 0 Тогда 
				ТаблицаВыгрузки.Удалить(НоваяСтрока);
			КонецЕсли;
			
			Если Не ИспользоватьПоследниеЦены Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не Выборка.ЕстьРучнаяЦена Тогда
			
				Если Не ИС_МП_УправлениеЦенами.ПроверитьПоследниеЦены(ПеречислениеМП, Выборка, НоваяСтрока) Тогда		
					ТаблицаВыгрузки.Удалить(НоваяСтрока);			
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;  	
	
	МассивЦены = Новый Массив;
		
	Для Каждого Элемент Из ТаблицаВыгрузки Цикл
		
		Цены = Новый Структура;
		Цены.Вставить("offerId", 	Элемент.offerID);
		Цены.Вставить("price", 		Элемент.Цена);
		Цены.Вставить("isDeleted", 	Ложь);
		МассивЦены.Добавить(Цены);
		
	КонецЦикла;
	
	Data = Новый Структура;
	Data.Вставить("token", НастройкиСоединения["СберТокен"]);	
	
	//+ ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88226	         
	//Data.Вставить("prices", МассивЦены);
	Data.Вставить("prices", Новый Массив);
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивЦены, 300);
	//- ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88226
	
	//+ ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88226
	Для Каждого Элемент Из РазбитыйМассив Цикл						
		
		Data.prices = Элемент;
		//- ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88226
		
		Результат = ИС_Сбер_API.ВыгрузитьЦены(Профиль, ПараметрыЗапроса, Data);
		
		БылиОшибкиВыгрузки = Ложь;
		
		Если Результат = Неопределено Тогда
			БылиОшибкиВыгрузки = Истина;
			//+ ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88226		
			//Иначе	
			//	ОбщегоНазначения.СообщитьПользователю("Цены успешно выгружены");
			//- ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88226
		КонецЕсли;
		
		Если Не БылиОшибкиВыгрузки И ИспользоватьПоследниеЦены Тогда
			
			//+ ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88226			
			//Для Каждого Строка Из ТаблицаВыгрузки Цикл	
			//	
			//	ИС_МП_УправлениеЦенами.ЗаписатьПоследнююВыгруженнуюЦену(Профиль, 
			//	Перечисления.ИС_МП_Маркетплейсы.Сбер, Строка.НоменклатураСбер, Строка.Цена, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦены);
			//	
			//КонецЦикла;	
			
			Для Каждого Строка Из Элемент Цикл	   
				
				Отбор = Новый Структура("offerID", Строка.offerId);
				НайденныеСтроки = ТаблицаВыгрузки.НайтиСтроки(Отбор);
				
				Если НайденныеСтроки.Количество() = 1 Тогда	
					
					ИС_МП_УправлениеЦенами.ЗаписатьПоследнююВыгруженнуюЦену(Профиль, 
					Перечисления.ИС_МП_Маркетплейсы.Сбер, НайденныеСтроки[0].НоменклатураСбер, НайденныеСтроки[0].Цена, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦены);
					
				КонецЕсли;
				
			КонецЦикла;	
			//- ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88226
			
		КонецЕсли; 
		//+ ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88226	
	КонецЦикла; 
	
	ОбщегоНазначения.СообщитьПользователю("Выгрузка цен завершена.");
	//- ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88226
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 13.05.24 УА #66901

#КонецОбласти

#Область Отчеты

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
//+ ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
Функция СоздатьОтчетКомиссионера(Профиль, Период, ТаблицаТранзакций, Комментарий, СтруктураДопПараметров) Экспорт 
//Функция СоздатьОтчетКомиссионера(Профиль, Период, ТаблицаТранзакций, Комментарий) Экспорт 
//- ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
	ФукнциональныеОпции = ПолучитьИПроверитьФункциональныеОпции(Профиль); 
	//+ ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295	
    Возврат ИС_Сбер_СерверЛокализация.СоздатьДокументОтчетКомиссионера(Профиль, Период, ТаблицаТранзакций, Комментарий, ФукнциональныеОпции, СтруктураДопПараметров);
	//Возврат ИС_Сбер_СерверЛокализация.СоздатьДокументОтчетКомиссионера(Профиль, Период, ТаблицаТранзакций, Комментарий, ФукнциональныеОпции);
	//- ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
КонецФункции //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
Функция ПолучитьДокументКорректировкиЗадолженности(Отчет, СуммаКомпенсации) Экспорт 
    Возврат ИС_Сбер_СерверЛокализация.ПолучитьДокументКорректировкиЗадолженности(Отчет, СуммаКомпенсации);
КонецФункции //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

#КонецОбласти

//+ ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #62628
Процедура ДобавитьСоответствиеНоменклатуры(Профиль, OfferID, Номенклатура, 
		Характеристика, Упаковка, ТекНоменклатура = Неопределено, ТекХарактеристика = Неопределено) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_Сбер_Товары.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ЛичныйКабинет.Установить(Профиль);
	НаборЗаписей.Отбор.offerID.Установить(OfferID);
		
	НаборЗаписей.Прочитать(); 
	
	ТребуетсяНоваяЗапись = Истина;	
	Если НаборЗаписей.Количество() > 0 Тогда 
		
		Для Каждого Запись Из НаборЗаписей Цикл
		
			Если Запись.Номенклатура = ТекНоменклатура И Запись.Характеристика = ТекХарактеристика Тогда
			
				Запись.Номенклатура = Номенклатура;
				Запись.Характеристика = Характеристика;
				Запись.Упаковка = Упаковка;
        		ТребуетсяНоваяЗапись = Ложь;
        		Прервать;
			
			КонецЕсли;
		
		КонецЦикла; 	
	
	КонецЕсли;
   
    Если ТребуетсяНоваяЗапись Тогда
	
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.ЛичныйКабинет = Профиль;
		НоваяЗапись.OfferID = OfferID;
		НоваяЗапись.Номенклатура = Номенклатура; 
		НоваяЗапись.Характеристика = Характеристика;
		НоваяЗапись.Упаковка = Упаковка;
		
	КонецЕсли;
				
	НаборЗаписей.Записывать = Истина; 
	
	НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #62628

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Функция ИмяСобытия(Имя)
	Возврат СтрШаблон("ИС.МП.ИС_Сбер_Сервер.%1", Имя);
КонецФункции //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 13.08.23 УА #55166
Функция ПолучитьНастройкиСоединенияПрофиля(Профиль)
	
	МассивНастроек = Новый Массив;
	МассивНастроек.Добавить("СберАдресСервисаAPI");
	МассивНастроек.Добавить("СберТокен");
	
	Результат = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНастроек);
	
	Если Результат.Количество() = 0 Тогда
		ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.08.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 13.08.23 УА #55166
Функция ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения)
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения["СберАдресСервисаAPI"]) Тогда
		ОбщегоНазначения.СообщитьПользователю(
		"Для данного профиля не заполнен ""Адрес Сервиса API"" Мега Маркета, проверьте настройки авторизации");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения["СберТокен"]) Тогда
		ОбщегоНазначения.СообщитьПользователю(
		"Для данного профиля не заполнен ""Токен"" Мега Маркета, проверьте настройки авторизации");
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыЗапроса.Сервер = НастройкиСоединения["СберАдресСервисаAPI"];
	
	//ПараметрыЗапроса.Порт = НастройкиСоединения.Порт;
	//ПараметрыЗапроса.ЗащищенноеСоединение = НастройкиСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.Порт = 443;
	ПараметрыЗапроса.ЗащищенноеСоединение = Истина;
	
	Возврат Истина;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.08.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 28.08.23 УА #61542
Процедура ПолучитьОтправления(Профиль, МассивОтправлений)
	
	Событие = ИмяСобытия("ПолучитьОтправления");
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);  
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	
	Если Не РезультатПроверки Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("token", НастройкиСоединения["СберТокен"]);
	СтруктураПараметров.Вставить("shipments", МассивОтправлений);
	
	РезультатЗапроса = ИС_Сбер_API.ПолучитьОтправления(Профиль, ПараметрыЗапроса, СтруктураПараметров);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСозданныхОтправлений = Новый Массив;
	
	Для Каждого Отправление Из РезультатЗапроса.shipments Цикл
		
		Результат = НайтиИлиСоздатьОтправление(Профиль, Отправление);
		
		Если Не Результат.Пустая() Тогда
			МассивСозданныхОтправлений.Добавить(Результат);
		КонецЕсли;
		
	КонецЦикла; 
	
	ПроверитьФункциональныеОпцииОтправлений(Профиль, МассивСозданныхОтправлений);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.08.23 УА #61542

//+ ИнфоСофт Ивонин К.А. 29.08.23 УА #61542
Функция НайтиИлиСоздатьОтправление(Профиль, Данные) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Сбер_Отправление.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
	|ГДЕ
	|	ИС_Сбер_Отправление.Профиль = &Профиль
	|	И ИС_Сбер_Отправление.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", Данные.shipmentId);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Отправление = Документы.ИС_Сбер_Отправление.НайтиПоНомеру(Данные.shipmentId);
	
	Если РезультатЗапроса.Пустой() Тогда 
		ОтправлениеОбъект = Документы.ИС_Сбер_Отправление.СоздатьДокумент();
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОтправлениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
	КонецЕсли;
	
	ОтправлениеОбъект.Профиль = Профиль;
	ОтправлениеОбъект.Номер = Данные.shipmentId;
	ОтправлениеОбъект.Дата = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные.creationDate, ФорматДатыJSON.ISO); 
	
	ЗаполнитьЗначенияСвойств(ОтправлениеОбъект, Данные);
	
	ОтправлениеОбъект.status = ИС_MP_Сервер.ПолучитьПеречислениеПоЗначению(Перечисления.ИС_Сбер_СтатусыОтправлений, Данные.status);
	
	ОтправлениеОбъект.confirmedTimeLimit = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные.confirmedTimeLimit, ФорматДатыJSON.ISO);
	ОтправлениеОбъект.packingTimeLimit = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные.packingTimeLimit, ФорматДатыJSON.ISO);
	ОтправлениеОбъект.shippingTimeLimit = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные.shippingTimeLimit, ФорматДатыJSON.ISO);
	ОтправлениеОбъект.shipmentDateFrom = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные.shipmentDateFrom, ФорматДатыJSON.ISO);
	ОтправлениеОбъект.shipmentDateTo = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные.shipmentDateTo, ФорматДатыJSON.ISO);
	ОтправлениеОбъект.deliveryDate = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные.deliveryDate, ФорматДатыJSON.ISO);
	ОтправлениеОбъект.deliveryDateFrom = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные.deliveryDateFrom, ФорматДатыJSON.ISO);
	ОтправлениеОбъект.deliveryDateTo = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные.deliveryDateTo, ФорматДатыJSON.ISO);
	
	ОтправлениеОбъект.items.Очистить();
	
	Для Каждого Элемент Из Данные.items Цикл 
		
		//+ ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87738		
		Если Элемент.offerId = "delivery" Тогда
			Продолжить;
		КонецЕсли;                                  
		//- ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87738
		
		НоваяСтрока = ОтправлениеОбъект.items.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Сбер_Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
		|ГДЕ
		|	ИС_Сбер_Номенклатура.Профиль = &Профиль
		|	И ИС_Сбер_Номенклатура.offer_id = &offer_id";
		
		Запрос.УстановитьПараметр("offer_id", Элемент.offerId);
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			НоваяСтрока.НоменклатураМегаМаркета = Выборка.Ссылка;	
		КонецЕсли;
		
		НоваяСтрока.status = ИС_MP_Сервер.ПолучитьПеречислениеПоЗначению(Перечисления.ИС_Сбер_СтатусыОтправлений, Элемент.status); 
		НоваяСтрока.subStatus = ИС_MP_Сервер.ПолучитьПеречислениеПоЗначению(Перечисления.ИС_Сбер_ДетализацияСтатусовОтмены, Элемент.subStatus);
		
	КонецЦикла;      
	
	//  "items": [
	//    {
	//      "discounts": [
	//        {
	//          "discountType": "SPASIBO",
	//          "discountDescription": "Скидка от СберСпасибо для ЕПЛ (МРЦ-2023)",
	//          "discountAmount": 8225
	//        }
	//      ],
	//      "priceAdjustments": [
	//        {
	//          "priceAdjustmentType": "SuperPrice",
	//          "priceAdjustmentDescription": "SuperPrice",
	//          "priceAdjustmentAmount": 6400
	//        }
	//      ],
	//      "goodsData": {
	//        "name": "Вытяжка встраиваемая Schaub Lorenz SLD EY5004 1М Black",
	//        "isDelivery": false,
	//        "categoryName": "",
	//        "isDigitalMarkRequired": false
	//      },                      
	
	// Нет смысла добавлять, выглядит как бесполезная информация
	//      "events": [
	//        {
	//          "eventDate": "2023-08-28T19:10:40+03:00",
	//          "eventName": "СТАТУС_РЕЗУЛЬТАТ_ВЫПОЛНЕНИЯ",
	//          "eventValue": "Выполняется"
	//        },
	//		...
	//	    ]
	
	Попытка
		
		ОтправлениеОбъект.Записать();
		Возврат ОтправлениеОбъект.Ссылка;
		
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Документы.ИС_Сбер_Отправление.ПустаяСсылка();
	
КонецФункции //- ИнфоСофт Ивонин К.А. 29.08.23 УА #61542

//+ ИнфоСофт Ивонин К.А. 29.03.23 УА #55822
Функция ПолучитьИПроверитьФункциональныеОпции(Профиль)
	
	Событие = ИмяСобытия("ПолучитьИПроверитьФункциональныеОпции");
	
	ФункциональныеОпции = ИС_Сбер_СерверПовтИсп.ПолучитьНастройкиФункциональностиЗаказов(Профиль);
	
	Результат = Истина;
	
	Если ФункциональныеОпции.Количество() = 0 Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Сообщение = "Не заполнены параметры создания заказов МегаМаркета: ";
	
	Если Не ФункциональныеОпции.Свойство("Организация") И Не ЗначениеЗаполнено(ФункциональныеОпции.Организация) Тогда
		Сообщение = Сообщение + "Организация; ";
		Результат = Ложь;
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(ФункциональныеОпции.Контрагент) Тогда
	//	Сообщение = Сообщение + "Контрагент; ";
	//	Результат = Ложь;
	//КонецЕсли;
	
	Если Не ФункциональныеОпции.Свойство("Партнер") И Не ЗначениеЗаполнено(ФункциональныеОпции.Партнер) Тогда
		Сообщение = Сообщение + "Партнер; ";
		Результат = Ложь;
	КонецЕсли;
	
	Если Константы.ИспользоватьСоглашенияСКлиентами.Получить() Тогда	
		Если Не ФункциональныеОпции.Свойство("Соглашение") И Не ЗначениеЗаполнено(ФункциональныеОпции.Соглашение) Тогда
			Сообщение = Сообщение + "Соглашение; ";
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	Если Константы.ИспользоватьДоговорыСКлиентами.Получить() Тогда
		Если Не ФункциональныеОпции.Свойство("Договор") И Не ЗначениеЗаполнено(ФункциональныеОпции.Договор) Тогда
			Сообщение = Сообщение + "Договор; ";
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Константы.ИспользоватьРасширенныеВозможностиЗаказаКлиента.Получить() Тогда
		Если ФункциональныеОпции.Свойство("СтатусЗаказаКлиента") И Не ЗначениеЗаполнено(ФункциональныеОпции.СтатусЗаказаКлиента) Тогда
			Сообщение = Сообщение + "Статус Заказа Клиента; ";
			Результат = Ложь;
		КонецЕсли;  
	КонецЕсли;
	
	Если Константы.ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента.Получить() Тогда
		Если ФункциональныеОпции.Свойство("ВариантОбеспечения") И Не ЗначениеЗаполнено(ФункциональныеОпции.ВариантОбеспечения) Тогда
			Сообщение = Сообщение + "Вариант Обеспечения; ";
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208	
	Если Не ФункциональныеОпции.Свойство("ЦенаЛотаВЗаказ") И Не ЗначениеЗаполнено(ФункциональныеОпции.ЦенаЛотаВЗаказ) Тогда
		ФункциональныеОпции.Вставить("ЦенаЛотаВЗаказ", Ложь);
	КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208  
	
	//+ ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	Если Не ФункциональныеОпции.Свойство("ДатаОтгрузкиИлиТекущаяДатаВРеализацию") Тогда
		ФункциональныеОпции.Вставить("ДатаОтгрузкиИлиТекущаяДатаВРеализацию", Ложь);
	КонецЕсли; 
	//- ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	
	//+ ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	Если Не ФункциональныеОпции.Свойство("ВариантОбеспеченияПриНехватке") Тогда
		ФункциональныеОпции.Вставить("ВариантОбеспеченияПриНехватке", Неопределено);
	КонецЕсли; 
	//- ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	
	//+ ИнфоСофт Заварин К.В. 26.09.24 УА #77549
	//+ ИнфоСофт Мурсалимов Д.Р. 22.03.24 УА #71529
	//Если Не ФункциональныеОпции.Свойство("СберРассчитатьНесобранныеКомплекты") Тогда
	//	ФункциональныеОпции.Вставить("СберРассчитатьНесобранныеКомплекты", Ложь);
	//КонецЕсли;
	//
	//Если Не ФункциональныеОпции.Свойство("СберСоздатьЗаказНаСборку") Тогда
	//	ФункциональныеОпции.Вставить("СберСоздатьЗаказНаСборку", Ложь);
	//КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 22.03.24 УА #71529
	Если Не ФункциональныеОпции.Свойство("РассчитатьНесобранныеКомплекты") Тогда
		ФункциональныеОпции.Вставить("РассчитатьНесобранныеКомплекты", Ложь);
	КонецЕсли;
	
	Если Не ФункциональныеОпции.Свойство("СоздатьЗаказНаСборку") Тогда
		ФункциональныеОпции.Вставить("СоздатьЗаказНаСборку", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 26.09.24 УА #77549
	
	//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
		Если Не ФункциональныеОпции.Свойство("ФормироватьЕдиныйЗаказБезРазбиения") Тогда
		ФункциональныеОпции.Вставить("ФормироватьЕдиныйЗаказБезРазбиения", Ложь);
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
	
	//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	Если Не ФункциональныеОпции.Свойство("ЗакрытиеЗаказаПоДатеОтгрузки") Тогда
		ФункциональныеОпции.Вставить("ЗакрытиеЗаказаПоДатеОтгрузки", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175 
	
	//+ ИнфоСофт Заварин К.В. 26.09.24 УА #77549
	Если Не ФункциональныеОпции.Свойство("УдалятьРТУ") Тогда
		ФункциональныеОпции.Вставить("УдалятьРТУ", Ложь);
	КонецЕсли;
	
	Если Не ФункциональныеОпции.Свойство("ПроверятьДатуПередУдалением") Тогда
		ФункциональныеОпции.Вставить("ПроверятьДатуПередУдалением", Ложь);
	КонецЕсли; 
	
	Если Не ФункциональныеОпции.Свойство("ПричинаОтмены") Тогда
		ФункциональныеОпции.Вставить("ПричинаОтмены", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 26.09.24 УА #77549
	
	//+ ИнфоСофт Заварин К.В. 26.04.24 УА #72472
	Если Не ФункциональныеОпции.Свойство("АвтоматическиПодтверждатьЗаказы") Тогда
		ФункциональныеОпции.Вставить("АвтоматическиПодтверждатьЗаказы", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 26.04.24 УА #72472
	
	//+ ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	Если Не ФункциональныеОпции.Свойство("ОтделятьТоварыПриНехватке") Тогда
		ФункциональныеОпции.Вставить("ОтделятьТоварыПриНехватке", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	
	//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Сбер_Склады.АвтоматическиСоздаватьОрдерНаОтгрузку КАК АвтоматическиСоздаватьОрдерНаОтгрузку
	|ИЗ
	|	Справочник.ИС_Сбер_Склады КАК ИС_Сбер_Склады
	|ГДЕ
	|	ИС_Сбер_Склады.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ФункциональныеОпции.Вставить("АвтоматическиСоздаватьОрдерНаОтгрузку", ВыборкаДетальныеЗаписи.АвтоматическиСоздаватьОрдерНаОтгрузку);
	Иначе
		ФункциональныеОпции.Вставить("АвтоматическиСоздаватьОрдерНаОтгрузку", Ложь);
	КонецЕсли;;
	//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
	
	Если Не Результат Тогда
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Сообщение);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ФункциональныеОпции; 
	
КонецФункции //- ИнфоСофт Ивонин К.А. 29.03.23 УА #55822

//+ ИнфоСофт Ивонин К.А. 28.11.23 УА #55166
Процедура ПроверитьФункциональныеОпцииОтправлений(Профиль, МассивОтправлений)
	
	ФукнциональныеОпции = ПолучитьИПроверитьФункциональныеОпции(Профиль);
	
	Если ФукнциональныеОпции = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ФукнциональныеОпции.СоздаватьЗаказы Тогда	
		СоздатьЗаказы(Профиль, МассивОтправлений);		
	КонецЕсли;
	
	Если ФукнциональныеОпции.СоздаватьРеализации 
		И ФукнциональныеОпции.РежимСозданияЗаказов <> 2 Тогда	
		СоздатьРеализации(Профиль, МассивОтправлений);		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.11.23 УА #55166

//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
Функция ПолучитьАктивныйЗаказКлиента(СборочноеЗадание, ДатаОтгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Сбер_ЗаказыВТеченииДня.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	РегистрСведений.ИС_Сбер_ЗаказыВТеченииДня КАК ИС_Сбер_ЗаказыВТеченииДня
	|ГДЕ
	|	ИС_Сбер_ЗаказыВТеченииДня.ЗаказОткрыт
	|	И ИС_Сбер_ЗаказыВТеченииДня.ДатаОтгрузки = &ДатаОтгрузки
	|	И ИС_Сбер_ЗаказыВТеченииДня.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
	Запрос.УстановитьПараметр("Профиль", СборочноеЗадание.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	КонецЕсли; 	
	
	ВыборкаДетальныеЗаписи.Следующий();	
	
	Возврат ВыборкаДетальныеЗаписи.ЗаказКлиента;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643

//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
Процедура ДобавитьЗаписьВРегистрЗаказов(Заказ, СборочноеЗадание, ДатаОтгрузки)
	
	МенеджерЗаписи = РегистрыСведений.ИС_Сбер_ЗаказыВТеченииДня.СоздатьМенеджерЗаписи(); 
	
	МенеджерЗаписи.ДатаОтгрузки = ДатаОтгрузки;
	МенеджерЗаписи.ЗаказКлиента = Заказ; 
	МенеджерЗаписи.Профиль = СборочноеЗадание.Профиль;
	МенеджерЗаписи.ЗаказОткрыт = Истина;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643

//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
Процедура ВыполнитьЗакрытиеЗаказов(Профиль)
	
	Событие = ИмяСобытия("ВыполнитьЗакрытиеЗаказов");
		
	ФукнциональныеОпции = ПолучитьИПроверитьФункциональныеОпции(Профиль);
	
	Если ФукнциональныеОпции.ФормироватьЕдиныйЗаказБезРазбиения Тогда
		
		Если Не ЗначениеЗаполнено(ФукнциональныеОпции.АктивныйЗаказКлиента) Тогда
			Возврат;
		КонецЕсли;
		
		МассивЗаданий = Новый Массив;
		МассивЗаданий.Добавить(ФукнциональныеОпции.АктивныйЗаказКлиента);
		
		//+ ИнфоСофт Заварин К.В. 24.07.24 УА #80259
		//Если ФукнциональныеОпции.АвтоматическиСоздаватьРеализации Тогда 
		Если ФукнциональныеОпции.СоздаватьРеализации Тогда
		//- ИнфоСофт Заварин К.В. 24.07.24 УА #80259
			СоздатьРеализации(Профиль, МассивЗаданий);  
		КонецЕсли;
		
		СоответствиеПараметровЗаписи = Новый Соответствие;
		СоответствиеПараметровЗаписи.Вставить("СберАктивныйЗаказКлиента", Документы.ЗаказКлиента.ПустаяСсылка());
		ИС_MP_Сервер.ЗаписатьНастройкиСправочника(Профиль.Ссылка, СоответствиеПараметровЗаписи); 
		
		Возврат;  
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Сбер_ЗаказыВТеченииДня.Профиль КАК Профиль,
	|	ИС_Сбер_ЗаказыВТеченииДня.ЗаказКлиента КАК ЗаказКлиента,
	|	ИС_Сбер_ЗаказыВТеченииДня.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ИС_Сбер_ЗаказыВТеченииДня.ЗаказКлиента.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ИС_Сбер_ЗаказыВТеченииДня КАК ИС_Сбер_ЗаказыВТеченииДня
	|ГДЕ
	|	ИС_Сбер_ЗаказыВТеченииДня.Профиль = &Профиль
	|	И ИС_Сбер_ЗаказыВТеченииДня.ЗаказОткрыт";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Комиссия25 = ФукнциональныеОпции.Договор.КомиссионныеПродажи25;
	
	Пока Выборка.Следующий() Цикл
		
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Если ФукнциональныеОпции.ЗакрытиеЗаказаПоДатеОтгрузки и НачалоДня(Выборка.ДатаОтгрузки) <> НачалоДня(ТекущаяДатаСеанса()) Тогда
			Продолжить;	
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		
		МенеджерЗаписи = РегистрыСведений.ИС_Сбер_ЗаказыВТеченииДня.СоздатьМенеджерЗаписи(); 
		
		МенеджерЗаписи.Профиль = Выборка.Профиль;
		МенеджерЗаписи.ЗаказКлиента = Выборка.ЗаказКлиента;
		МенеджерЗаписи.ДатаОтгрузки = Выборка.ДатаОтгрузки;
		
		МенеджерЗаписи.ЗаказОткрыт = Ложь;
		
		МенеджерЗаписи.Записать();
		
		Если Комиссия25 Тогда
			ДокументРеализация = Документы.ПередачаТоваровХранителю.СоздатьДокумент();	
		Иначе
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		КонецЕсли;				
		
		Попытка
			ДокументРеализация.Заполнить(Выборка.Заказ); 
		Исключение
			Продолжить;
		КонецПопытки;
		
		ДокументРеализация.Дата = Выборка.ДатаОтгрузки;
		ДокументРеализация.Комментарий = Выборка.Комментарий;
		
		Если ЗначениеЗаполнено(ФукнциональныеОпции.Подразделение) Тогда  
			ДокументРеализация.Подразделение = ФукнциональныеОпции.Подразделение;
		КонецЕсли;     
		
		Если Не Комиссия25 Тогда
			ДокументРеализация.СкидкиРассчитаны = Истина;	
		КонецЕсли;
		
		ЗаписыватьДокумент = Ложь;
		Если ФукнциональныеОпции.ПроводитьРеализации Тогда
			
			Попытка
				ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ЗаписыватьДокумент = Истина;
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			КонецПопытки;
			
		Иначе
			ЗаписыватьДокумент = Истина;	
		КонецЕсли;
		
		Если ЗаписыватьДокумент Тогда	
			
			Попытка
				ДокументРеализация.Записать();			
			Исключение
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			КонецПопытки;
		
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643

//+ ИнфоСофт Сумин Д.В. 12.02.2023 УА #55175
Функция ПолучитьВидЦены(ЛичныйКабинет) Экспорт
	
	МассивНастроек = Новый Массив;
	МассивНастроек.Добавить("СберВидЦены");
	
	Результат = ИС_MP_Сервер.ПолучитьНастройки(ЛичныйКабинет, МассивНастроек);
	
	Возврат Результат["СберВидЦены"];
	
КонецФункции //- ИнфоСофт Сумин Д.В. 12.02.2023 УА #55175	

//+ ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
Процедура СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25)
	
	Событие = ИмяСобытия("СоздатьРеализации1С");
	
	Если Комиссия25 Тогда
		ДокументРеализация = Документы.ПередачаТоваровХранителю.СоздатьДокумент();	
	Иначе
		ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	КонецЕсли;
	
	Попытка
		ДокументРеализация.Заполнить(Выборка.Заказ); 
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	КонецПопытки;  
	
	//+ ИнфоСофт Мурсалимов Д.Р. 04.03.25 УА #95186
	Если ДокументРеализация.Товары.Количество() = 0 Тогда
		
		ДокументРеализация.ЗаказКлиента 	= Неопределено;
		ДокументРеализация.ПометкаУдаления 	= Истина;
		 
		Попытка
			ДокументРеализация.Записать(РежимЗаписиДокумента.Запись);			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
			
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 04.03.25 УА #95186
	
	Если Не ФукнциональныеОпции.ДатаОтгрузкиИлиТекущаяДатаВРеализацию Тогда
		Если ЗначениеЗаполнено(Выборка.ДатаОтгрузки) Тогда
			ДокументРеализация.Дата = Выборка.ДатаОтгрузки;		
		Иначе                                                 
			ДокументРеализация.Дата = ТекущаяДатаСеанса();
		КонецЕсли;	
	Иначе
		ДокументРеализация.Дата = ТекущаяДатаСеанса();	
	КонецЕсли;
	
	ДокументРеализация.Комментарий = Выборка.Комментарий;
	
	Если Не Комиссия25 Тогда
		ДокументРеализация.СкидкиРассчитаны = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФукнциональныеОпции.Подразделение) Тогда  
		ДокументРеализация.Подразделение = ФукнциональныеОпции.Подразделение;
	КонецЕсли;		
	
	ЗаписыватьДокумент = Ложь;
	
	Если ФукнциональныеОпции.ПроводитьРеализации Тогда
		
		Попытка
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписыватьДокумент = Истина;
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст); 
		КонецПопытки;
		
	Иначе
		ЗаписыватьДокумент = Истина;	
	КонецЕсли;
	
	Если ЗаписыватьДокумент Тогда	
		
		Попытка
			ДокументРеализация.Записать();			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595

//+ ИнфоСофт Ивонин К.А. 02.03.25 УА #92887
Процедура СоздатьИлиОбновитьТовар(Профиль, Ссылка, СтрокаТовара)
	
	Событие = ИмяСобытия("СоздатьИлиОбновитьТовар");
	
	Если Ссылка.Пустая() Тогда
		Товар = Справочники.ИС_Сбер_Номенклатура.СоздатьЭлемент();	
	Иначе
		Товар = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Товар.Профиль = Профиль;
	
	Товар.Наименование = СтрокаТовара.НаименованиеМерчанта;
	Товар.offer_id     = СтрокаТовара.КодТовараПродавца_offerId_;
	Товар.Штрихкод     = СтрокаТовара.ШтрихкодМерчанта;		
	Товар.Бренд        = СтрокаТовара.БрендМерчанта;
	Товар.vendorCode   = СтрокаТовара.ВендорКод_артикулПроизводителя_;
	
	Попытка
		Товар.Записать();
	Исключение
		ТестОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТестОшибки);
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 02.03.25 УА #92887

//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
Функция ПолучитьНазначения(Склад)
	
	Если Метаданные.Перечисления.Найти("ТипыОбъектовНазначений") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗапросНазначений = Новый Запрос;
	ЗапросНазначений.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
	|ИЗ
	|	Справочник.ИС_Сбер_Склады.НаправленияДеятельности КАК ИС_Сбер_СкладыНаправленияДеятельности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ИС_Сбер_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности
	|			И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|ГДЕ
	|	ИС_Сбер_СкладыНаправленияДеятельности.Ссылка = &Ссылка
	|	И Назначения.ТипОбъектаНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовНазначений.НаправлениеДеятельности)";		
	
	ЗапросНазначений.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
	
	Назначения = Новый Массив;
	
	ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
	
	Пока ВыборкаНазначения.Следующий() Цикл	
		Назначения.Добавить(ВыборкаНазначения.Назначение);
	КонецЦикла;
	
	Если Назначения.Количество() = 0 Тогда		
		Назначения.Добавить(Справочники.Назначения.ПустаяСсылка());
	КонецЕсли;
	
	Возврат Назначения;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083

#КонецОбласти
