
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 24.01.23 УА #53535
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТехническуюИнформацию();
	ПроверитьНаличиеОбновленийНаСервере();		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 01.08.24 УА #79145
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект);
	ДопПараметры = Новый Структура("Оповещение", ОповещениеОЗавершении);
	ИС_МП_Клиент.ПриОткрытии(ЭтотОбъект, Отказ, ДопПараметры);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.08.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 31.07.24 УА #79145
&НаКлиенте
Процедура ДекорацияЛогоНажатие(Элемент)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://marketplace.is1c.ru/");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.07.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 26.01.23 УА #53535
&НаКлиенте
Процедура ДекорацияСовместимоНажатие(Элемент)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://1c.ru/news/info.jsp?id=32047");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 24.01.23 УА #53535
&НаКлиенте
Процедура ИнструкцияПоРаботеСМодулемНажатие(Элемент)  
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://docs.google.com/document/d/11anaRyEBq1x_Q3e3W04CKyGhtZZDfacE/view");   
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 01.08.24 УА #79145
&НаКлиенте
Процедура СкачатьИнструкциюПоРаботеСМодулемНажатие(Элемент)
    
    ОчиститьСообщения();
    
	Результат = ПолучитьФайлИнструкцииНаСервере();
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось скачать файл инструкции...");
		Возврат;
	КонецЕсли;
			
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	
	ДиалогОткрытияФайла.ПолноеИмяФайла = "Руководство по работе с модулем «Управление Маркетплейсами на 1С».docx";
	Фильтр = "Документы Word (*.docx)|*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Заголовок = "Сохранить как";
	
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("СкачатьИнструкциюЗавершение", ЭтаФорма, Результат));

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.08.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 01.08.24 УА #79145
&НаКлиенте
Процедура ОбучающийКурсПоМодулюНажатие(Элемент)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://infosoftschool.getcourse.ru/my");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.08.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 01.08.24 УА #79145
&НаКлиенте
Процедура ТелеграмКаналНажатие(Элемент)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://t.me/+ZOPBtB85naczNzgy");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.08.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 24.01.23 УА #53535
&НаКлиенте
Процедура ЛичныйКабинетКлиентаНажатие(Элемент)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://my.is1c.ru/signin");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 31.07.24 УА #79145
&НаКлиенте
Процедура ДекорацияАвитоНажатие(Элемент)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://marketplace.is1c.ru/1c-avito");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.07.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 31.07.24 УА #79145
&НаКлиенте
Процедура ДекорацияТекстАвитоНажатие(Элемент)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://marketplace.is1c.ru/1c-avito");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.07.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 01.08.24 УА #79145
&НаКлиенте
Процедура ДекорацияРосреестрНажатие(Элемент)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://reestr.digital.gov.ru/reestr/1968567/?sphrase_id=3968422");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.08.24 УА #79145

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 08.08.24 УА #79145
&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("Обработка.ИС_МП_Поддержка.Форма.ФормаНастроек", , ЭтотОбъект);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.08.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 11.08.24 УА #79145
&НаКлиенте
Процедура ПроверитьНаличиеНовойВерсии(Команда)
	ОчиститьСообщения();
	ПроверитьНаличиеОбновленийНаСервере();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 11.08.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 31.01.23 УА #54554
&НаКлиенте
Процедура НоваяВерсияНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.ИС_МП_Поддержка.Форма.ФормаУстановкиОбновления", , ЭтотОбъект);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.01.23 УА #54554

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
&НаСервере   
Процедура ЗаполнитьТехническуюИнформацию()
	
	ТехИнфо = ИС_МП_ОбновлениеМодуля.ТехническаяИнформация();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТехИнфо);
	Элементы.ВерсияМодуля.Подсказка = ТехИнфо.Хеш;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 31.01.23 УА #54554
&НаСервере
Процедура ПроверитьНаличиеОбновленийНаСервере()
    
    Элементы.СообщениеОбОшибке.Видимость = Ложь; 
    Элементы.АктуальнаяВерсия.Видимость = Ложь;
	Элементы.НоваяВерсия.Видимость = Ложь;
    
	ИнформацияОВерсиях = ИС_МП_ОбновлениеМодуля.ИнформацияОбОбновлении();
		
	Если ИнформацияОВерсиях.ЕстьОшибки Тогда
		Элементы.СообщениеОбОшибке.Заголовок = ИнформацияОВерсиях.СообщениеОбОшибке;
		Элементы.СообщениеОбОшибке.Видимость = Истина;		
	Иначе
		
		Если ИнформацияОВерсиях.ЕстьНоваяВерсия Тогда
			НоваяВерсия = ИнформацияОВерсиях.НоваяВерсия;
			Элементы.НоваяВерсия.Видимость = Истина;
		Иначе
			Элементы.АктуальнаяВерсия.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ВремяПоследнейПроверки = ТекущаяДатаСеанса();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.01.23 УА #54554

//+ ИнфоСофт Ивонин К.А. 06.03.24 УА #65940
&НаСервере   
Функция ПолучитьФайлИнструкцииНаСервере()

	ПараметрыЗапроса = ИС_МП_РаботаСHTTPЗапросами.СтруктураHTTPЗапроса();
    
	РезультатРазбора = ИС_МП_РаботаСHTTPЗапросами.РазобратьURLНаПараметрыЗапроса(
		"https://drive.google.com/uc?export=download&id=11anaRyEBq1x_Q3e3W04CKyGhtZZDfacE");	

	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, РезультатРазбора);
	
	ПараметрыЗапроса.ФорматОтвета = "ДвоичныеДанные";
	ПараметрыЗапроса.ОбрабатыватьКоды3XX = Истина;
	
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьGETЗапрос(ПараметрыЗапроса);
	
	Если РезультатЗапроса.КодОтвета = 200 Тогда
		Возврат ПоместитьВоВременноеХранилище(РезультатЗапроса.Ответ);
	КонецЕсли;
	
	Возврат Неопределено; 

КонецФункции //- ИнфоСофт Ивонин К.А. 06.03.24 УА #65940

//+ ИнфоСофт Ивонин К.А. 06.03.24 УА #65940
&НаКлиенте
Процедура СкачатьИнструкциюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДополнительныеПараметры);
		ДвоичныеДанные.НачатьЗапись(Новый ОписаниеОповещения("СохранениеИнструкцииЗавершение", ЭтотОбъект), Результат[0]); 		
	КонецЕсли;
	
	УдалитьИзВременногоХранилища(ДополнительныеПараметры);	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.03.24 УА #65940

//+ ИнфоСофт Ивонин К.А. 06.03.24 УА #65940
&НаКлиенте
Процедура СохранениеИнструкцииЗавершение(Результат) Экспорт
	ОбщегоНазначенияКлиент.СообщитьПользователю("Файл успешно сохранен");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.03.24 УА #65940

//+ ИнфоСофт Ивонин К.А. 29.08.24 УА #81109
&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, ДопПараметры) Экспорт
	
	Элементы.СкачатьИнструкциюПоРаботеСМодулем.Доступность = Ложь;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = Истина Тогда
		Элементы.СкачатьИнструкциюПоРаботеСМодулем.Доступность = Истина;	
	КонецЕсли;
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.08.24 УА #81109

#КонецОбласти
