
#Область ПрограммныйИнтерфейс

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПредставлениеМаркетплейса() Экспорт	
	Возврат "Lamoda";	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолеСопоставленияОстатков() Экспорт	
	Возврат "РазмерЛамода";
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ИмяФункцииЗагрузкиТоваров() Экспорт
	
	Возврат "ИС_Ламода_Сервер.ПолучитьКарточкиТоваров";
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция НастройкиСоединенияПоУмолчанию() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЛамодаАдресСервисаB2B",    "api-b2b.lamoda.ru");
	Результат.Вставить("ЛамодаАдресСервисаSeller", "public-api-seller.lamoda.ru");
	Результат.Вставить("ЛамодаПортB2B",            443);
	Результат.Вставить("ЛамодаПортSeller",         443);
	Результат.Вставить("ЛамодаHTTPSB2B",           Истина);
	Результат.Вставить("ЛамодаHTTPSSeller",        Истина);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПараметрыТестаПодключения(Форма) Экспорт
	
	ТекстОшибки = "";
	
	Если Не ЗначениеЗаполнено(Форма.ЛамодаClientId) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен ""client_id""" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ЛамодаClientSecret) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен ""client_secret""" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ЛамодаАдресСервисаB2B) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен ""Адрес сервиса В2В""" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ЛамодаАдресСервисаSeller) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен ""Адрес сервиса Lamoda Seller""" + Символы.ПС;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("АдресСервисаB2B",    Форма.ЛамодаАдресСервисаB2B);
	Результат.Вставить("АдресСервисаSeller", Форма.ЛамодаАдресСервисаSeller);
	Результат.Вставить("ПортB2B",            Форма.ЛамодаПортB2B);
	Результат.Вставить("ПортSeller",         Форма.ЛамодаПортSeller);
	Результат.Вставить("HTTPSB2B", 			 Форма.ЛамодаHTTPSB2B);
	Результат.Вставить("HTTPSSeller", 		 Форма.ЛамодаHTTPSSeller);
	Результат.Вставить("ClientId",           Форма.ЛамодаClientId);
	Результат.Вставить("ClientSecret",       Форма.ЛамодаClientSecret);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ДопПараметрыЗагрузкиТоваров(Форма) Экспорт	
	
	Возврат Новый Структура;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

