#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Характеристика", Характеристика);
	Параметры.Свойство("Категория", Категория);

	ИнициализироватьФорму(Параметры.ВыбранныеЗначения);
	Элементы.СписокЗначенийЗначение.ОграничениеТипа	 = Новый ОписаниеТипов("Строка", ,
		Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная));

	Если ЗначениеЗаполнено(Характеристика) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Характеристика,
		"ИДСправочникаЗначенийХарактеристики") > 0 Тогда
		Элементы.СписокЗначенийЗначение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИС_Ozon_ЗначенияХарактеристик");

		МассивСвязей = Новый Массив;
		НоваяСвязь = Новый СвязьПараметраВыбора("Характеристика", "Характеристика");
		МассивСвязей.Добавить(НоваяСвязь);
		НоваяСвязь = Новый СвязьПараметраВыбора("Категория", "Категория");
		МассивСвязей.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(МассивСвязей);
		Элементы.СписокЗначенийЗначение.СвязиПараметровВыбора = НовыеСвязи;

	Иначе
		ЭтоСтроковыйТип = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ВладелецФормы.Имя = "Изображения" Тогда
		ОграничениеНаКоличествоЗаписей = 10;
	Иначе
		ОграничениеНаКоличествоЗаписей = 100;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗначений

&НаКлиенте
Процедура СписокЗначенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если СписокЗначений.Количество() >= ОграничениеНаКоличествоЗаписей Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Превышено максимальное количество записей. Установлено ограничение в 10 шт");
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если ЭтоСтроковыйТип Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Категория", Категория);
	СтруктураПараметров.Вставить("Характеристика", Характеристика);

	ОткрытьФорму("Справочник.ИС_Ozon_ЗначенияХарактеристик.ФормаВыбора", СтруктураПараметров, Элемент, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)

	Результат = ВыбратьНаСервере();
	ОповеститьОВыборе(Результат);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФорму(ВыбранныеЗначения)

	Для Каждого Значение Из ВыбранныеЗначения Цикл
		НоваяСтрока = СписокЗначений.Добавить();
		НоваяСтрока.Значение = Значение;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ВыбратьНаСервере()

	МассивЗначений = Новый Массив;

	Для Каждого стр Из СписокЗначений Цикл
		Если ЗначениеЗаполнено(стр.Значение) Тогда
			МассивЗначений.Добавить(стр.Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат МассивЗначений;

КонецФункции

#КонецОбласти