
#Область ОбработчикиСобытий

//+ ИнфоСофт Ивонин К.А. 14.04.22 УА #44857
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПолучитьОстаткиFBO И Не ПолучитьОстаткиFBS Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран ни один вид остатков для получения");
		Возврат;
	КонецЕсли;

	ОстаткиFBS = Новый ТаблицаЗначений;
	ОстаткиFBO = Новый ТаблицаЗначений;
		
	Если ПолучитьОстаткиFBS Тогда		
	
		ОстаткиFBS = ИС_WB_Сервер.ПолучитьИнфорамциюОбОстаткахFBS(Профиль);
		Если ОстаткиFBS = Неопределено Тогда
			ОстаткиFBS = Новый ТаблицаЗначений;
		КонецЕсли;	
	
	КонецЕсли;
	
	Если ПолучитьОстаткиFBO Тогда
		
		ОстаткиFBO = ИС_WB_Сервер.ПолучитьИнфорамциюОбОстаткахFBO(Профиль);
		Если ОстаткиFBO = Неопределено Тогда
			ОстаткиFBO = Новый ТаблицаЗначений;
		КонецЕсли;
		
	КонецЕсли;	
                                           
	ВнешниеНаборыДанных = Новый Структура;
	
	ВнешниеНаборыДанных.Вставить("ОстаткиFBS", ОстаткиFBS);
	ВнешниеНаборыДанных.Вставить("ОстаткиFBO", ОстаткиFBO);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    
		
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.04.22 УА #44857

#КонецОбласти
