
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстрановитьОтборПоПрофилю();
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	УстрановитьОтборПоПрофилю();
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаКлиенте
Процедура УстрановитьОтборПоПрофилю()	
	Отчет.Профиль = Профиль;  	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Отчет.ДатаНачала = ДатаНачала;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаКлиенте
Процедура ДатаоОкончанияПриИзменении(Элемент)
	Отчет.ДатаОкончания = ДатаОкончания;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

#КонецОбласти

