
#Область ОбработчикиСобытий

//+ ИнфоСофт Ивонин К.А. 22.03.24 УА #71892
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОбработатьЭлементыРекурсивно(ПараметрыВыполненияКоманды.Источник.ПодчиненныеЭлементы) 
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.03.24 УА #71892

#КонецОбласти
                               
#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 22.03.24 УА #71892
&НаКлиенте
Процедура ОбработатьЭлементыРекурсивно(Элементы)

	Для Каждого Элемент Из Элементы Цикл
	
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда   
			Элемент.Видимость = Истина;
			Элемент.ТолькоПросмотр = Ложь;
			Элемент.Вид = ВидПоляФормы.ПолеВвода;
			Продолжить;		
		КонецЕсли;
		
		Если ТипЗнч(Элемент) = Тип("ТаблицаФормы") Тогда   
			Элемент.Видимость = Истина;
			Элемент.ТолькоПросмотр = Ложь;
			Продолжить;		
		КонецЕсли;
		
		Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда   
			ОбработатьЭлементыРекурсивно(Элемент.ПодчиненныеЭлементы);	
		КонецЕсли;
			
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.03.24 УА #71892

#КонецОбласти 
