#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 03.05.2024 УА #62574
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Используется = Неопределено;
	Параметры.Отбор.Свойство("Используется", Используется);
	Если ЗначениеЗаполнено(Используется) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Дерево, "Используется", Используется,
			ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;

КонецПроцедуры
//- ИнфоСофт Стояк Ю.К. 03.05.2024 УА #62574

#КонецОбласти