
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ХарактеристикаЯМ = Неопределено;	
	Категория = Неопределено;
	Значения = Неопределено;
	Параметры.Свойство("ХарактеристикаЯМ", ХарактеристикаЯМ);
	Параметры.Свойство("Категория", Категория);	
	Параметры.Свойство("Значения", Значения);
	
	Если ЗначениеЗаполнено(ХарактеристикаЯМ) Тогда 
		
		НовЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец"); 
		НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;		
		НовЭлементОтбора.Использование = Истина;		
		НовЭлементОтбора.ПравоеЗначение = ХарактеристикаЯМ;  
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Категория) Тогда 
		
		НовЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Категории.Категория"); 
		НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;		
		НовЭлементОтбора.Использование = Истина;		
		НовЭлементОтбора.ПравоеЗначение = Категория;  
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Значения) Тогда 
		
		НовЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Код"); 
		НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;		
		НовЭлементОтбора.Использование = Истина;		
		НовЭлементОтбора.ПравоеЗначение = Значения;  
		
	КонецЕсли;


КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

#КонецОбласти