
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 06.10.21 УА #38646
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если Параметры.Свойство("Профиль") Тогда
		Профиль = Параметры.Профиль;
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 06.10.21 УА #38646
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для загрузки категорий необходимо выбрать Профиль!", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСписокРодительскихКатегорий();

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
&НаКлиенте
Процедура РодительскаяКатегорияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.РодительскаяКатегория.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСписокКатегорий(ТекДанные.id);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
&НаКлиенте
Процедура КатегорияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанныеКатегория = Элементы.Категория.ТекущиеДанные;
	Если ТекДанныеКатегория = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьКатегорию(ТекДанныеКатегория.Наименование);
	ОповеститьОбИзменении(Тип("СправочникСсылка.ИС_WB_Категории"));

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
&НаКлиенте
Процедура КомандаВыбрать(Команда)

	ТекДанные = Элементы.РодительскаяКатегория.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСписокКатегорий(ТекДанные.id);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
&НаКлиенте
Процедура КомандаЗагрузитьСписокРодительскихКатегорий(Команда)

	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для загрузки категорий необходимо выбрать Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСписокРодительскихКатегорий();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
&НаКлиенте
Процедура КомандаЗагрузить(Команда)

	ТекДанныеКатегория = Элементы.Категория.ТекущиеДанные;

	Если ТекДанныеКатегория = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьКатегорию(ТекДанныеКатегория.Наименование);
	ОповеститьОбИзменении(Тип("СправочникСсылка.ИС_WB_Категории"));
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 06.10.21 УА #38646
&НаСервере
Процедура ЗагрузитьСписокРодительскихКатегорий()

	СписокКатегорий = ИС_WB_Сервер.ПолучитьСписокРодительскихКатегорий(Профиль);
	
	Если СписокКатегорий = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	РодительскаяКатегория.Очистить();
	
	Для Каждого Элемент Из СписокКатегорий Цикл
		НоваяСтрока = РодительскаяКатегория.Добавить();
		НоваяСтрока.Наименование = Элемент.Ключ;  
		НоваяСтрока.id = Элемент.Значение;
	КонецЦикла; 
	
	РодительскаяКатегория.Сортировать("Наименование");
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
&НаСервере
Процедура ЗагрузитьСписокКатегорий(ИдРодительскойКатегории)

	СписокКатегорий = ИС_WB_Сервер.ПолучитьСписокКатегорий(Профиль, ИдРодительскойКатегории);
	
	Если СписокКатегорий <> Неопределено Тогда
			
		Категория.Очистить();
		
		Для Каждого Элемент Из СписокКатегорий Цикл
			НоваяСтрока = Категория.Добавить();
			НоваяСтрока.Наименование = Элемент.Ключ;  
			НоваяСтрока.id = Элемент.Значение;
		КонецЦикла;
		
	КонецЕсли;
	
	Категория.Сортировать("Наименование");
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
&НаСервере
Процедура ЗагрузитьКатегорию(Категория)

	ЗагруженнаяКатегория = ИС_WB_Сервер.ЗагрузитьКатегорию(Профиль, Категория, Истина);
	Если ЗагруженнаяКатегория <> Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Категория %1 успешно загружена!", ЗагруженнаяКатегория));
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

#КонецОбласти
