
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Категория = Неопределено;
	Характеристика = Неопределено;
	Параметры.Свойство("Категория", Категория);
	Параметры.Свойство("Характеристика", Характеристика);

	Если ЗначениеЗаполнено(Характеристика) И ЗначениеЗаполнено(Категория) Тогда

		МассивЗначений = РегистрыСведений.ИС_Ozon_ЗначенияХарактеристикПоКатегориям.ЗначенияХарактеристик(Категория,
			Характеристика);

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", МассивЗначений,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	КонецЕсли;

КонецПроцедуры 

//+ ИнфоСофт Заварин К.В. 02.11.24 УА #83978
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборХарактеристики" Тогда
				
		ДобавитьХарактеристикиВСписок(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 02.11.24 УА #83978

#КонецОбласти  

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Заварин К.В. 02.11.24 УА #83978
&НаКлиенте
Процедура ИзменитьХарактеристику(Команда) 
	
	ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаИзмененияХарактеристики", , , , , , ,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 02.11.24 УА #83978


#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Заварин К.В. 02.11.24 УА #83978
&НаСервере
Процедура ДобавитьХарактеристикиВСписок(Параметр)
	
	Характеристика  = Неопределено;
	Категория 		= Неопределено;
	
	Параметр.Свойство("Характеристика", Характеристика);
	Параметр.Свойство("Категория", 		Категория);
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		
		МассивЗначений = РегистрыСведений.ИС_Ozon_ЗначенияХарактеристикПоКатегориям.ЗначенияХарактеристик(Категория,
		Характеристика);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", МассивЗначений,
		ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
		
	КонецЕсли;	                
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 02.11.24 УА #83978

#КонецОбласти 