
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Профиль") Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не выбран профиль");
		Возврат;
	КонецЕсли; 
	
	Если Не Параметры.Свойство("МП") Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Ошибка открытия формы, обратитесь в техподдержку");
		Возврат;
	КонецЕсли;
	
	Профиль = Параметры.Профиль;
	МП = Параметры.МП;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621
&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажиете дату");	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаКонца) Тогда
		ДатаКонца = ТекущаяДата();	
	КонецЕсли;
 	
	ДлительнаяОперация = ЗагрузитьДанныеНаСервере(); 
		
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания()); 
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621
&НаСервере 
Функция ЗагрузитьДанныеНаСервере()  
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Если МП = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "ИС_WB_Сервер.ЗагрузитьДанныеОК", Профиль, НачалоНедели(Дата), КонецНедели(ДатаКонца));
	ИначеЕсли МП = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		ДатаТело = Новый Структура;
		ДатаТело.Вставить("from", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(Дата, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата));
		ДатаТело.Вставить("to", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ДатаКонца, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата));
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "ИС_Ozon_Сервер.ЗагрузитьДанныеУслуг", Профиль, ДатаТело);
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621 

//+ ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621
&НаКлиенте
Процедура ОбработатьРезультат(Результат, Параметры) Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Загрузка завершена");
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621  

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
&НаКлиенте
Функция ПараметрыОжидания()
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = "Идет процесс загрузки...";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Интервал = 5;
	ПараметрыОжидания.ПолучатьРезультат = Истина;     
	
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	
	Возврат ПараметрыОжидания;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

#КонецОбласти
