
#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Мурсалимов Д.Р. 05.03.24 УА #70747
Функция ОпределитьОбщийМодульРазбораКодаМаркировки() Экспорт	

	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль("РазборКодаМаркировкиИССлужебный");	
	Возврат ОбщийМодуль;	
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 05.03.24 УА #70747

//+ ИнфоСофт Мурсалимов Д.Р. 11.07.24 УА #79512
Функция ОпределитьОбщийМодульШтрихкодирования() Экспорт
    
	Версия = ИС_МП_Сервер.ВерсияБезРедакции();
	
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #93336
	////+ ИнфоСофт Власова И.С. 13.02.25 УА #93336
	////Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.17.90") >= 0 Тогда
	//Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.17.179") >= 0 Тогда
	////- ИнфоСофт Власова И.С. 13.02.25 УА #93336
	//	ИмяОбщегоМодуляШтрихкодирования = "ШтрихкодированиеОбщегоНазначенияИСКлиент";
	//Иначе
	//	ИмяОбщегоМодуляШтрихкодирования = "ШтрихкодированиеИСКлиент";
	//КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.20.91") >= 0 Тогда
		ИмяОбщегоМодуляШтрихкодирования = "ШтрихкодированиеОбщегоНазначенияИСКлиент";
	ИначеЕсли ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.17.179") < 0 Тогда
		ИмяОбщегоМодуляШтрихкодирования = "ШтрихкодированиеИСКлиент";		
	Иначе
		
		Если СтрНайти(Версия, "5.17.") = 0 Тогда
			ИмяОбщегоМодуляШтрихкодирования = "ШтрихкодированиеИСКлиент";
		Иначе
			ИмяОбщегоМодуляШтрихкодирования = "ШтрихкодированиеОбщегоНазначенияИСКлиент";
		КонецЕсли;
		
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 13.02.25 УА #93336
	
	Возврат ИмяОбщегоМодуляШтрихкодирования;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 11.07.24 УА #79512

//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686
Функция ОпределитьОбщийМодульШтрихкодированияВызовСервера() Экспорт   
	
	Версия = ИС_МП_Сервер.ВерсияБезРедакции();   
	
	//+ ИнфоСофт Власова И.С. 03.09.24 УА #81190
	//Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.17.113") >= 0 Тогда
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.17.90") >= 0 Тогда
	//- ИнфоСофт Власова И.С. 03.09.24 УА #81190
		ИмяОбщегоМодуляШтрихкодирования = "ШтрихкодированиеОбщегоНазначенияИСВызовСервера";
	Иначе
		ИмяОбщегоМодуляШтрихкодирования = "ШтрихкодированиеИСВызовСервера";
	КонецЕсли;
    
	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяОбщегоМодуляШтрихкодирования);
	Возврат ОбщийМодуль;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686

//+ ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842
Функция ОпределитьОбщийМодульШтрихкодированияКлиентСервер() Экспорт
	
	Версия = ИС_МП_Сервер.ВерсияБезРедакции();   
	
	//+ ИнфоСофт Власова И.С. 03.09.24 УА #81190
	//Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.17.113") >= 0 Тогда
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.17.90") >= 0 Тогда
	//- ИнфоСофт Власова И.С. 03.09.24 УА #81190
		ИмяОбщегоМодуляШтрихкодирования = "ШтрихкодированиеОбщегоНазначенияИСКлиентСервер";
	Иначе
		ИмяОбщегоМодуляШтрихкодирования = "ШтрихкодированиеИСКлиентСервер";
	КонецЕсли;
    	
	Возврат ИмяОбщегоМодуляШтрихкодирования;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842

//+ ИнфоСофт Власова И.С. 13.02.25 УА #93336
Функция ОпределитьОбщийМодульПараметровСканированияКлиент() Экспорт
	
	Версия = ИС_МП_Сервер.ВерсияБезРедакции();   
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.17.90") >= 0 Тогда
		ИмяОбщегоМодуляШтрихкодирования = "ШтрихкодированиеОбщегоНазначенияИСКлиент";
	Иначе
		ИмяОбщегоМодуляШтрихкодирования = "ШтрихкодированиеИСКлиент";
	КонецЕсли;
    	
	Возврат ИмяОбщегоМодуляШтрихкодирования;
	
КонецФункции //- ИнфоСофт Власова И.С. 13.02.25 УА #93336

#КонецОбласти
