
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 28.11.23 УА #55166
Функция ПустаяСсылкаЗаказа() Экспорт
	Возврат Документы.ЗаказКлиента.ПустаяСсылка();
КонецФункции //- ИнфоСофт Ивонин К.А. 28.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 27.03.24 УА #71892
Функция ПустаяСсылкаУпаковка() Экспорт
	Возврат Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
КонецФункции //- ИнфоСофт Ивонин К.А. 27.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 27.03.25 УА #63915
Функция ПризнакНабораВЗапросе() Экспорт
	Возврат ".ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)"; 
КонецФункции //- ИнфоСофт Ивонин К.А. 27.03.25 УА #63915

//+ ИнфоСофт Ивонин К.А. 31.03.25 УА #63915
Функция УпаковкаВЗапросе() Экспорт
	Возврат "Упаковка";
КонецФункции //- ИнфоСофт Ивонин К.А. 31.03.25 УА #63915

//+ ИнфоСофт Ивонин К.А. 31.03.25 УА #63915
Функция СтрокаТипУпаковка() Экспорт
	Возврат "СправочникСсылка.УпаковкиЕдиницыИзмерения";	
КонецФункции //- ИнфоСофт Ивонин К.А. 31.03.25 УА #63915

//+ ИнфоСофт Ивонин К.А. 14.04.25 УА #96894
Функция ВалютаУправленческогоУчета() Экспорт
	Возврат Константы.ВалютаУправленческогоУчета.Получить();	
КонецФункции //- ИнфоСофт Ивонин К.А. 14.04.25 УА #96894

//+ ИнфоСофт Власова И.С. 08.04.25 УА #78061
Функция ХозяйственнаяОперацияСписаниеДебиторскойЗадолженности() Экспорт
	Возврат Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности;	
КонецФункции //- ИнфоСофт Власова И.С. 08.04.25 УА #78061

//+ ИнфоСофт Власова И.С. 08.04.25 УА #78061
Функция ХозяйственнаяОперацияСписаниеКредиторскойЗадолженности() Экспорт
	Возврат Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности;	
КонецФункции //- ИнфоСофт Власова И.С. 08.04.25 УА #78061

//+ ИнфоСофт Власова И.С. 08.04.25 УА #78061
Функция СтрокаТипСписаниеЗадолженности() Экспорт
	Возврат "ДокументСсылка.СписаниеЗадолженности";	
КонецФункции //- ИнфоСофт Власова И.С. 08.04.25 УА #78061

#КонецОбласти
