
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330

//+ ИнфоСофт Стояк Ю.К. 16.12.2024 УА #89490
&НаКлиенте
Процедура ПолучатьОстаткиFBOПриИзменении(Элемент)
	Если ПолучатьОстаткиFBO Тогда
		Элементы.ПолучатьОстаткиВРамкахПрофиляFBYЯМ.Видимость = Истина;	
	Иначе
		Элементы.ПолучатьОстаткиВРамкахПрофиляFBYЯМ.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 16.12.2024 УА #89490

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330
&НаКлиенте
Процедура Сформировать(Команда) 
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль");
		Возврат;
	КонецЕсли;
	
	Если Не ПолучатьОстатки И Не ПолучатьЦены Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ни один тип данных для получения");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330
&НаСервере
Процедура СформироватьНаСервере()	
	
	РезультатЗапроса = СформироватьТаблицуНоменклатуры();
	
	ТаблицаНоменклатуры = РезультатЗапроса.Выгрузить();
	
	Если ПолучатьОстатки Тогда
		
		Остатки1С = Неопределено;
		
		Если ЗначениеЗаполнено(Склад) Тогда
			Остатки1С = ПолучитьОстатки1С(ТаблицаНоменклатуры);
		КонецЕсли;
		
		СтруктураМассивовНаименований = Новый Структура;
		
		Если WB Тогда 
			
			ОстаткиFBSWB = ИС_WB_Сервер.ПолучитьИнфорамциюОбОстаткахFBS(Профиль);
			Если ОстаткиFBSWB = Неопределено Тогда
				ОстаткиFBSWB = Новый ТаблицаЗначений;
			КонецЕсли; 
			
			Если ОстатокПоСкладам И ПолучатьОстаткиFBS Тогда
				ОстаткиПоСкладамFBSWB = ОстаткиFBSWB;
				НаименованияСкладовFBSWB = СвернутьМассив(ОстаткиFBSWB.ВыгрузитьКолонку("Склад"));
				СтруктураМассивовНаименований.Вставить("FBSWB", НаименованияСкладовFBSWB);
				//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #87814				
				//ОстаткиПоСкладамFBSWB = ДобавитьНоменклатуруКОстаткам(ОстаткиFBSWB, 11);
				ОстаткиПоСкладамFBSWB = ДобавитьНоменклатуруКОстаткам(ОстаткиFBSWB, 12);
				//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #87814
			КонецЕсли;
			
			ОстаткиFBSWB = СуммироватьОстаткиWBПоТипу(ОстаткиFBSWB);
			ОстаткиFBSWB = ДобавитьНоменклатуруКОстаткам(ОстаткиFBSWB, 1);
			//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #68577			
			ОстаткиFBSWB.Свернуть("Номенклатура, Характеристика, Артикул", "stock"); 
			//- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #68577
			
			ОстаткиFBOWB = ИС_WB_Сервер.ПолучитьИнфорамциюОбОстаткахFBO(Профиль);
			Если ОстаткиFBOWB = Неопределено Тогда
				ОстаткиFBOWB = Новый ТаблицаЗначений;
			КонецЕсли; 
			
			Если ОстатокПоСкладам И ПолучатьОстаткиFBO Тогда
				ОстаткиПоСкладамFBOWB = ОстаткиFBOWB;
				НаименованияСкладовFBOWB = СвернутьМассив(ОстаткиFBOWB.ВыгрузитьКолонку("Склад"));
				СтруктураМассивовНаименований.Вставить("FBOWB",НаименованияСкладовFBOWB);
				ОстаткиПоСкладамFBOWB = ДобавитьНоменклатуруКОстаткам(ОстаткиFBOWB, 11);
			КонецЕсли;
			
			ОстаткиFBOWB = СуммироватьОстаткиWBПоТипу(ОстаткиFBOWB);
			ОстаткиFBOWB = ДобавитьНоменклатуруКОстаткам(ОстаткиFBOWB, 1);
			//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #68577
			ОстаткиFBOWB.Свернуть("Номенклатура, Характеристика, Артикул", "stock");
			//- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #68577
			
		КонецЕсли;  
		
		Если Ozon Тогда
			
			ОстаткиOzon = ИС_Ozon_Сервер.ПолучитьИнформациюОбОстатках(Профиль);  
			
			Если ОстаткиOzon = Неопределено Тогда
				ОстаткиOzonFBO = Новый ТаблицаЗначений;
				ОстаткиOzonFBS = Новый ТаблицаЗначений; 
			Иначе                                                              
				
				Если ОстатокПоСкладам И ПолучатьОстаткиFBS Тогда  
					
					ОстаткиПоСкладамOzonFBS = ИС_Ozon_Сервер.ПолучитьОстаткиПоСкладам(Профиль);
					
					Если ЗначениеЗаполнено(ОстаткиПоСкладамOzonFBS) Тогда
												
						НаименованияСкладовFBSOzon = СвернутьМассив(ОстаткиПоСкладамOzonFBS.ВыгрузитьКолонку("Склад"));
						СтруктураМассивовНаименований.Вставить("FBSOzon",НаименованияСкладовFBSOzon);
						ОстаткиПоСкладамOzonFBS = ДобавитьНоменклатуруКОстаткам(ОстаткиПоСкладамOzonFBS, 21);
						
					КонецЕсли;
										
				КонецЕсли;
				
				ОстаткиOzonFBO = СуммироватьОстаткиOzonПоТипу(ОстаткиOzon.FBO); 
				ОстаткиOzonFBO = ДобавитьНоменклатуруКОстаткам(ОстаткиOzonFBO, 2);
				
				ОстаткиOzonFBS = СуммироватьОстаткиOzonПоТипу(ОстаткиOzon.FBS);
				ОстаткиOzonFBS = ДобавитьНоменклатуруКОстаткам(ОстаткиOzonFBS, 2);
				
				//+ ИнфоСофт Стояк Ю.К. 07.11.2024 УА #72455				
				Если ОстатокПоСкладам И ПолучатьОстаткиFBO Тогда  
					
					ОстаткиПоСкладамOzonFBO = ИС_Ozon_Сервер.ПолучитьОстаткиПоСкладамFBO(Профиль);
					
					Если ЗначениеЗаполнено(ОстаткиПоСкладамOzonFBO) Тогда
												
						НаименованияСкладовFBOOzon = СвернутьМассив(ОстаткиПоСкладамOzonFBO.ВыгрузитьКолонку("warehouse_name"));
						СтруктураМассивовНаименований.Вставить("FBOOzon",НаименованияСкладовFBOOzon);
						ОстаткиПоСкладамOzonFBO = ДобавитьНоменклатуруКОстаткам(ОстаткиПоСкладамOzonFBO, 22);
						
					КонецЕсли;  
					
				КонецЕсли;
				//- ИнфоСофт Стояк Ю.К. 07.11.2024 УА #72455
				
			КонецЕсли;					
			
		КонецЕсли; 
		
		Если ЯМ Тогда  
			
			//+ ИнфоСофт Стояк Ю.К. 23.11.2024 УА #87127
			МассивНаименованийПараметров = Новый Массив;  
			МассивНаименованийПараметров.Добавить("ЯМКампанияID");
		
			Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);
			
			IDКампанииТекущегоПрофиля = Настройки["ЯМКампанияID"];
			
			СписокМагазинов = ИС_ЯМ_Сервер.ПолучитьСписокМагазинов(Профиль); 		 
			
			Если СписокМагазинов = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			КампанияID = Неопределено;
			МассивID = Новый Массив; 
			ПрофильFBY = Ложь;
						
			Для Каждого Магазин Из СписокМагазинов Цикл
				Если Магазин.placementType = "FBY" Тогда
					
					КампанияID = Формат(Магазин.id, "ЧГ=0");	
					
					Если Число(КампанияID) = IDКампанииТекущегоПрофиля Тогда 
						ПрофильFBY = Истина;
					КонецЕсли;
					
					//+ ИнфоСофт Стояк Ю.К. 16.12.2024 УА #89490			
					Если ПрофильFBY И ПолучатьОстаткиВРамкахПрофиляFBYЯМ Тогда
						МассивID.Добавить(КампанияID);
						Прервать;
					ИначеЕсли Не ПолучатьОстаткиВРамкахПрофиляFBYЯМ Тогда
						МассивID.Добавить(КампанияID);
					КонецЕсли;
					//МассивID.Добавить(КампанияID);
					//- ИнфоСофт Стояк Ю.К. 16.12.2024 УА #89490
					
				КонецЕсли;			
			КонецЦикла;			
			
			Если ПрофильFBY Тогда
				ОстаткиЯМ = Неопределено;
			Иначе
				ОстаткиЯМ = ИС_ЯМ_Сервер.ПолучитьОстатки(Профиль);
			КонецЕсли;
			//ОстаткиЯМ = ИС_ЯМ_Сервер.ПолучитьОстатки(Профиль);
			//- ИнфоСофт Стояк Ю.К. 23.11.2024 УА #87127
			
			Если ОстаткиЯМ = Неопределено Тогда
				ОстаткиЯМ = Новый ТаблицаЗначений; 
			Иначе
				
				Если ОстатокПоСкладам И ПолучатьОстаткиFBS Тогда  															
					
					НаименованияСкладовFBSЯМ = СвернутьМассив(ОстаткиЯМ.ВыгрузитьКолонку("Склад"));
					СтруктураМассивовНаименований.Вставить("FBSЯМ", НаименованияСкладовFBSЯМ);
					ОстаткиПоСкладамFBSЯМ = ДобавитьНоменклатуруКОстаткам(ОстаткиЯМ, 31);
					
				КонецЕсли;
				
				ОстаткиЯМ = СуммироватьОстаткиЯМ(ОстаткиЯМ);
				ОстаткиЯМ = ДобавитьНоменклатуруКОстаткам(ОстаткиЯМ, 3);  	
				
			КонецЕсли;
			
			//+ ИнфоСофт Стояк Ю.К. 23.11.2024 УА #87127			
			//СписокМагазинов = ИС_ЯМ_Сервер.ПолучитьСписокМагазинов(Профиль); 		 
			//
			//Если СписокМагазинов = Неопределено Тогда
			//	Возврат;
			//КонецЕсли;
			//
			//КампанияID = Неопределено;
			//
			//Для Каждого Магазин Из СписокМагазинов Цикл
			//	Если Магазин.placementType = "FBY" Тогда
			//		КампанияID = Формат(Магазин.id, "ЧГ=0");	
			//		Прервать;
			//	КонецЕсли;			
			//КонецЦикла;
			
			ОстаткиЯМFBO = Неопределено;
			
			Для Каждого КампанияID Из МассивID Цикл
				
				ОстаткиЯМFBOБфуер = ИС_ЯМ_Сервер.ПолучитьОстатки(Профиль, КампанияID);		
				
				Если ОстаткиЯМFBO = Неопределено Тогда					
					ОстаткиЯМFBO = ОстаткиЯМFBOБфуер;
				Иначе
					Для каждого СтрокаИсточник Из ОстаткиЯМFBOБфуер Цикл
						НоваяСтрока = ОстаткиЯМFBO.Добавить();						
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);						
						НоваяСтрока.НомерСтроки = ОстаткиЯМFBO.Количество();
					КонецЦикла;					
				КонецЕсли;
				
			КонецЦикла; 
			
			Если ОстаткиЯМFBO = Неопределено Тогда
				ОстаткиЯМFBO = Новый ТаблицаЗначений;				
			Иначе
				
				Если ОстатокПоСкладам И ПолучатьОстаткиFBO Тогда  															
					
					НаименованияСкладовFBOЯМ = СвернутьМассив(ОстаткиЯМFBO.ВыгрузитьКолонку("Склад"));
					СтруктураМассивовНаименований.Вставить("FBOЯМ", НаименованияСкладовFBOЯМ);
					ОстаткиПоСкладамFBOЯМ = ДобавитьНоменклатуруКОстаткам(ОстаткиЯМFBO, 31);
					
				КонецЕсли;
				
				ОстаткиЯМFBO = СуммироватьОстаткиЯМ(ОстаткиЯМFBO);
				ОстаткиЯМFBO = ДобавитьНоменклатуруКОстаткам(ОстаткиЯМFBO, 3);
				
			КонецЕсли;									
			
			//Если ЗначениеЗаполнено(КампанияID) Тогда

			//	СкладыFBY = ИС_ЯМ_Сервер.ПолучитьСкладыFBY(Профиль); 
			//	
			//	ОстаткиЯМFBO = ИС_ЯМ_Сервер.ПолучитьОстатки(Профиль, КампанияID);		
			//	
			//	Если ОстаткиЯМFBO = Неопределено Тогда
			//		ОстаткиЯМFBO = Новый ТаблицаЗначений;				
			//	Иначе
			//		
			//		Если ОстатокПоСкладам И ПолучатьОстаткиFBO Тогда  															
			//			
			//			НаименованияСкладовFBOЯМ = СвернутьМассив(ОстаткиЯМFBO.ВыгрузитьКолонку("Склад"));
			//			СтруктураМассивовНаименований.Вставить("FBOЯМ", НаименованияСкладовFBOЯМ);
			//			ОстаткиПоСкладамFBOЯМ = ДобавитьНоменклатуруКОстаткам(ОстаткиЯМFBO, 31);
			//			
			//		КонецЕсли;
			//		
			//		ОстаткиЯМFBO = СуммироватьОстаткиЯМ(ОстаткиЯМFBO);
			//		ОстаткиЯМFBO = ДобавитьНоменклатуруКОстаткам(ОстаткиЯМFBO, 3);
			//		
			//	КонецЕсли;
			//	
			//Иначе				
			//	ОстаткиЯМFBO = Новый ТаблицаЗначений;				
			//КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 23.11.2024 УА #87127
							
		КонецЕсли;
		
		Если Aliexpress Тогда
			
			ОстаткиАли = ИС_АЛИ_Сервер.ПолучитьОстаткиТовара(Профиль);
			
			Если ОстаткиАли = Неопределено Тогда
				ОстаткиАли = Новый ТаблицаЗначений;
			Иначе
				ОстаткиАли = ДобавитьНоменклатуруКОстаткам(ОстаткиАли, 4);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если ПолучатьЦены Тогда
		
		Если WB Тогда 
			
			ЦеныWB = ИС_WB_Сервер.ПолучитьИнформациюОСкидках(Профиль, 0);
			Если ЦеныWB = Неопределено Тогда
				ЦеныWB = Новый ТаблицаЗначений;
			Иначе      
				ЦеныWB = ДобавитьНоменклатуруКЦенам(ЦеныWB, 1);		
			КонецЕсли; 						
			
		КонецЕсли;  
		
		Если Ozon Тогда
			
			ЦеныOzon = ИС_Ozon_Сервер.ПолучитьИнформациюОЦенах(Профиль);  
			
			Если ЦеныOzon = Неопределено Тогда
				ЦеныOzon = Новый ТаблицаЗначений;				
			Иначе                                                              						
				ЦеныOzon = ДобавитьНоменклатуруКЦенам(ЦеныOzon, 2);
			КонецЕсли;					
			
		КонецЕсли; 
		
		Если ЯМ Тогда
			
			ЦеныЯМ = ИС_ЯМ_Сервер.ПолучитьСписокЦен(Профиль);
			
			Если ЦеныЯМ = Неопределено Тогда
				ЦеныЯМ = Новый ТаблицаЗначений; 
			Иначе
				ЦеныЯМ = ДобавитьНоменклатуруКЦенам(ЦеныЯМ, 3);	
			КонецЕсли;
			
		КонецЕсли;
		
		Если Aliexpress Тогда 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если Не Aliexpress И Не ЯМ И Не WB И Не Ozon Тогда
		ОбщегоНазначения.СообщитьПользователю("Ни один маркетплейс не выбран!");
		Возврат;
	КонецЕсли;
	
	ИспХарактеристики = Константы.ИспользоватьХарактеристикиНоменклатуры.Получить();
	
	ТабДок = Новый ТабличныйДокумент;
	
	МакетТД = ПолучитьОбщийМакет("ОтчетПоМП");
	
	ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|Номенклатура"); 
			
	ТабДок.Вывести(ОбластьШапка);
	//+ ИнфоСофт Стояк Ю.К. 25.09.2023 УА #62245
	Если ИспХарактеристики Тогда 
		ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|Характеристика");
		ТабДок.Присоединить(ОбластьШапка);
	КонецЕсли;
	
	ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|Артикул"); 
	ОбластьШапка.Параметры.АртикулИмя = "Артикул 1C"; 						
	ТабДок.Присоединить(ОбластьШапка);  
	//- ИнфоСофт Стояк Ю.К. 25.09.2023 УА #62245
	
	Если ВыводитьАртикулыМП Тогда
		
		Если WB Тогда
			ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|Артикул");       
			ОбластьШапка.Параметры.АртикулИмя = "Артикул WB"; 						
			ТабДок.Присоединить(ОбластьШапка);	
		КонецЕсли;
		
		Если Ozon Тогда
			ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|Артикул"); 
			ОбластьШапка.Параметры.АртикулИмя = "Артикул Ozon"; 						
			ТабДок.Присоединить(ОбластьШапка);	
		КонецЕсли;
		
		Если ЯМ Тогда
			ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|Артикул"); 
			ОбластьШапка.Параметры.АртикулИмя = "Артикул Яндекс.Маркет"; 						
			ТабДок.Присоединить(ОбластьШапка);	
		КонецЕсли;
		
		Если Aliexpress Тогда
			ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|Артикул");  
			ОбластьШапка.Параметры.АртикулИмя = "Артикул Aliexpress"; 						
			ТабДок.Присоединить(ОбластьШапка);	
		КонецЕсли;
		
	КонецЕсли;
	
	ОбработатьШапку(ТабДок, МакетТД, СтруктураМассивовНаименований); 
	//+ ИнфоСофт Стояк Ю.К. 25.09.2023 УА #62245
	ВыборкаГруппы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  

	Итератор = 0;
	
	Пока ВыборкаГруппы.Следующий() Цикл 
				
		Если ЗначениеЗаполнено(ВыборкаГруппы.Родитель) Тогда
			ОбластьДанные = МакетТД.ПолучитьОбласть("ГруппаНоменклатуры|Номенклатура"); 
			ОбластьДанные.Параметры.Группа = ВыборкаГруппы.Родитель; 						
			
			ТабДок.Вывести(ОбластьДанные);                      
		КонецЕсли;
		
		ВыборкаНоменклатуры = ВыборкаГруппы.Выбрать();
		
		Пока ВыборкаНоменклатуры.Следующий() Цикл 
			
			Если Итератор % 2 = 0 Тогда
				Цвет = Новый Цвет(244, 236, 197);          
			Иначе
				Цвет = Новый Цвет(255,255,255);
			КонецЕсли; 
			
			Итератор = Итератор + 1;

			
			ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|Номенклатура");  
			ОбластьДанные.Параметры.Номенклатура = ВыборкаНоменклатуры.Номенклатура;  
			ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
			
			ТабДок.Вывести(ОбластьДанные); 
			
			Если ИспХарактеристики Тогда
				
				ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|Характеристика");
				ОбластьДанные.Параметры.Характеристика = ВыборкаНоменклатуры.Характеристика;
				ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
				
				ТабДок.Присоединить(ОбластьДанные);
				
			КонецЕсли;                    
			
			ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|Артикул");  
			ОбластьДанные.Параметры.Артикул = ВыборкаНоменклатуры.Артикул; 
			ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
			
			ТабДок.Присоединить(ОбластьДанные);             
			
			Если ВыводитьАртикулыМП Тогда
				
				Если WB Тогда	
					
					ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|Артикул"); 
					
					Если ОстаткиFBSWB.Количество() > 0 Тогда 
						
						//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						//НайденныеСтроки = ОстаткиFBSWB.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика));
						НайденныеСтроки = ОстаткиFBSWB.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, ВыборкаНоменклатуры.АртикулМП));
						//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.Артикул = НайденныеСтроки[0].Артикул;							
						КонецЕсли; 
					КонецЕсли;
					
					ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
					
					ТабДок.Присоединить(ОбластьДанные);	
				КонецЕсли;
				
				Если Ozon Тогда  
					
					ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|Артикул");
					
					Если ОстаткиOzonFBS.Количество() > 0 Тогда
						
						//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						//НайденныеСтроки = ОстаткиOzonFBS.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика));
						НайденныеСтроки = ОстаткиOzonFBS.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, ВыборкаНоменклатуры.АртикулМП));
						//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.Артикул = НайденныеСтроки[0].Артикул;							
						КонецЕсли;  
						
					КонецЕсли;
										
					ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
					
					ТабДок.Присоединить(ОбластьДанные);	
				КонецЕсли;
				
				Если ЯМ Тогда
					ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|Артикул");
					
					Если ОстаткиЯМ.Количество() > 0 Тогда    
						
						//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						//НайденныеСтроки = ОстаткиЯМ.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика));
						НайденныеСтроки = ОстаткиЯМ.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, ВыборкаНоменклатуры.АртикулМП));
						//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.Артикул = НайденныеСтроки[0].Артикул;							
						КонецЕсли;
						
					КонецЕсли;
										
					ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
					
					ТабДок.Присоединить(ОбластьДанные);	
				КонецЕсли;
				
				Если Aliexpress Тогда
					ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|Артикул");
					
					Если ОстаткиАли.Количество() > 0 Тогда
						
						//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						//НайденныеСтроки = ОстаткиАли.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика));
						НайденныеСтроки = ОстаткиАли.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, ВыборкаНоменклатуры.АртикулМП));
						//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.Артикул = НайденныеСтроки[0].Артикул;							
						КонецЕсли;
						
						ТабДок.Присоединить(ОбластьДанные); 
						
					КонецЕсли;
									
					ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
					
					ТабДок.Присоединить(ОбластьДанные);	
				КонецЕсли;
				
			КонецЕсли;           
			
	
			//- ИнфоСофт Стояк Ю.К. 25.09.2023 УА #62245
			Если ПолучатьОстатки Тогда
				
				СуммаFBO = 0;
				
				//+ ИнфоСофт Стояк Ю.К. 25.09.2023 УА #62245			
				Если ЗначениеЗаполнено(Остатки1С) Тогда 
					
					ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|Остаток1С");
					ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
					
					Если Остатки1С.Количество() > 0 Тогда
						
						НайденныеСтроки = Остатки1С.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика));
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.Остаток1С = НайденныеСтроки[0].ОстатокУТ;
						КонецЕсли; 
					КонецЕсли;
					
					Если Остатки1С.Количество() > 0 Тогда 
						ТабДок.Присоединить(ОбластьДанные); 
					КонецЕсли;	
					
				КонецЕсли;
				//- ИнфоСофт Стояк Ю.К. 25.09.2023 УА #62245
				
				Если WB Тогда   
					
					Если ЗначениеЗаполнено(НаименованияСкладовFBSWB) И ПолучатьОстаткиFBS Тогда
						
						Для Каждого Наименование Из НаименованияСкладовFBSWB Цикл          
							
							ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ОстатокСклад");
							ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
							
							//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
							//НайденныеСтроки = ОстаткиПоСкладамFBSWB.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, Наименование));
							НайденныеСтроки = ОстаткиПоСкладамFBSWB.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, Наименование, ВыборкаНоменклатуры.АртикулМП));
							//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
							
							Если НайденныеСтроки.Количество() > 0 Тогда
								ОбластьДанные.Параметры.Остаток = НайденныеСтроки[0].stock;
								ТабДок.Присоединить(ОбластьДанные);
							Иначе
								ОбластьДанные.Параметры.Остаток = 0;
								ТабДок.Присоединить(ОбластьДанные);
							КонецЕсли;
							
						КонецЦикла; 
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(НаименованияСкладовFBOWB) И ПолучатьОстаткиFBO Тогда 
						
						Для Каждого Наименование Из НаименованияСкладовFBOWB Цикл          
							
							ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ОстатокСкладДетальный");
							//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177							
							//ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
							ОбластьДанные.Область(1,1,1,3).ЦветФона = Цвет;
							//- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177
							
							//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
							//НайденныеСтроки = ОстаткиПоСкладамFBOWB.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, Наименование));
							НайденныеСтроки = ОстаткиПоСкладамFBOWB.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, Наименование, ВыборкаНоменклатуры.АртикулМП));
							//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
							
							Если НайденныеСтроки.Количество() > 0 Тогда
								ОбластьДанные.Параметры.Остаток = НайденныеСтроки[0].stock;
								//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177								
								ОбластьДанные.Параметры.ОстатокВПутиДо = НайденныеСтроки[0].ВПутиДо;
								ОбластьДанные.Параметры.ОстатокВПутиОт = НайденныеСтроки[0].ВПутиОт;
								//- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177
								ТабДок.Присоединить(ОбластьДанные);
							Иначе
								ОбластьДанные.Параметры.Остаток = 0;        
								//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177
								ОбластьДанные.Параметры.ОстатокВПутиДо = 0;
								ОбластьДанные.Параметры.ОстатокВПутиОт = 0; 
								//- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177
								ТабДок.Присоединить(ОбластьДанные);
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли;
					
					ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ОстатокВБ"); 
					ОбластьДанные.Область(1,1,1,2).ЦветФона = Цвет;
					
					Если ОстаткиFBSWB.Количество() > 0 Тогда
						
						//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						//НайденныеСтроки = ОстаткиFBSWB.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика));
						НайденныеСтроки = ОстаткиFBSWB.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, ВыборкаНоменклатуры.АртикулМП));
						//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.FBSWB = НайденныеСтроки[0].stock;
						Иначе
							ОбластьДанные.Параметры.FBSWB = 0;
						КонецЕсли; 
					КонецЕсли;   
					
					
					Если ОстаткиFBOWB.Количество() > 0 Тогда
						
						//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						//НайденныеСтроки = ОстаткиFBOWB.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика));
						НайденныеСтроки = ОстаткиFBOWB.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, ВыборкаНоменклатуры.АртикулМП));
						//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.FBOWB = НайденныеСтроки[0].stock;
							СуммаFBO = СуммаFBO + НайденныеСтроки[0].stock;
						Иначе
							ОбластьДанные.Параметры.FBOWB = 0;
						КонецЕсли;
						
					КонецЕсли;
					
					Если ОстаткиFBSWB.Количество() > 0 Или ОстаткиFBOWB.Количество() > 0 Тогда 
						ТабДок.Присоединить(ОбластьДанные); 
					КонецЕсли;
					
				КонецЕсли;  
				
				Если Ozon Тогда 
					
					Если ЗначениеЗаполнено(НаименованияСкладовFBSOzon) И ПолучатьОстаткиFBS Тогда
						
						Для Каждого Наименование Из НаименованияСкладовFBSOzon Цикл          
							
							ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ОстатокСклад");
							ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
														
							//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
							//НайденныеСтроки = ОстаткиПоСкладамOzonFBS.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, Наименование));
							НайденныеСтроки = ОстаткиПоСкладамOzonFBS.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, Наименование, ВыборкаНоменклатуры.АртикулМП));
							//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
							
							Если НайденныеСтроки.Количество() > 0 Тогда
								ОбластьДанные.Параметры.Остаток = НайденныеСтроки[0].stock;
								ТабДок.Присоединить(ОбластьДанные);
							Иначе
								ОбластьДанные.Параметры.Остаток = 0;
								ТабДок.Присоединить(ОбластьДанные);
							КонецЕсли;
							
						КонецЦикла; 
						
					КонецЕсли;
					//+ ИнфоСофт Стояк Ю.К. 07.11.2024 УА #72455					
					Если ЗначениеЗаполнено(НаименованияСкладовFBOOzon) И ПолучатьОстаткиFBO Тогда 
						
						Для Каждого Наименование Из НаименованияСкладовFBOOzon Цикл          
							
							ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ОстатокСкладДетальный");
							ОбластьДанные.Область(1,1,1,3).ЦветФона = Цвет;
							
							//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
							//НайденныеСтроки = ОстаткиПоСкладамOzonFBO.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, Наименование));
							НайденныеСтроки = ОстаткиПоСкладамOzonFBO.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, Наименование, ВыборкаНоменклатуры.АртикулМП));
							//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
							
							Если НайденныеСтроки.Количество() > 0 Тогда
								ОбластьДанные.Параметры.Остаток = НайденныеСтроки[0].free_to_sell_amount;								
								ОбластьДанные.Параметры.ОстатокВПутиДо = НайденныеСтроки[0].promised_amount;
								ОбластьДанные.Параметры.ОстатокВПутиОт = НайденныеСтроки[0].reserved_amount;								
								ТабДок.Присоединить(ОбластьДанные);
							Иначе
								ОбластьДанные.Параметры.Остаток = 0;        								
								ОбластьДанные.Параметры.ОстатокВПутиДо = 0;
								ОбластьДанные.Параметры.ОстатокВПутиОт = 0; 								
								ТабДок.Присоединить(ОбластьДанные);
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли;
					//- ИнфоСофт Стояк Ю.К. 07.11.2024 УА #72455
					
					ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ОстатокOzon");
					ОбластьДанные.Область(1,1,1,2).ЦветФона = Цвет;
					
					Если ОстаткиOzonFBS.Количество() > 0 Тогда
						
						//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						//НайденныеСтроки = ОстаткиOzonFBS.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика));
						НайденныеСтроки = ОстаткиOzonFBS.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, ВыборкаНоменклатуры.АртикулМП));
						//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222

						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.FBSOzon = НайденныеСтроки[0].stock;
						Иначе
							ОбластьДанные.Параметры.FBSOzon = 0;
						КонецЕсли;  
						
					КонецЕсли;
					
					Если ОстаткиOzonFBO.Количество() > 0 Тогда  
						
						
						//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						//НайденныеСтроки = ОстаткиOzonFBO.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика));
						НайденныеСтроки = ОстаткиOzonFBO.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, ВыборкаНоменклатуры.АртикулМП));
						//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.FBOOzon = НайденныеСтроки[0].stock;
							СуммаFBO = СуммаFBO + НайденныеСтроки[0].stock;
						Иначе
							ОбластьДанные.Параметры.FBOOzon = 0;
						КонецЕсли; 
						
					КонецЕсли;    
					
					Если ОстаткиOzonFBS.Количество() > 0 Или ОстаткиOzonFBO.Количество() > 0 Тогда
						ТабДок.Присоединить(ОбластьДанные);
					КонецЕсли;
					
				КонецЕсли; 
				
				Если ЯМ Тогда 
					
					Если ЗначениеЗаполнено(НаименованияСкладовFBSЯМ) И ПолучатьОстаткиFBS Тогда
						
						Для Каждого Наименование Из НаименованияСкладовFBSЯМ Цикл          
							
							ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ОстатокСклад");
							ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
							
							//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
							//НайденныеСтроки = ОстаткиПоСкладамFBSЯМ.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, Наименование));
							НайденныеСтроки = ОстаткиПоСкладамFBSЯМ.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, Наименование, ВыборкаНоменклатуры.АртикулМП));
							//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
							
							Если НайденныеСтроки.Количество() > 0 Тогда
								ОбластьДанные.Параметры.Остаток = НайденныеСтроки[0].stock;
								ТабДок.Присоединить(ОбластьДанные);
							Иначе
								ОбластьДанные.Параметры.Остаток = 0;
								ТабДок.Присоединить(ОбластьДанные);
							КонецЕсли;
							
						КонецЦикла; 
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(НаименованияСкладовFBOЯМ) И ПолучатьОстаткиFBO Тогда
						
						Для Каждого Наименование Из НаименованияСкладовFBOЯМ Цикл          
							
							ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ОстатокСклад");
							ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
							
							//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
							//НайденныеСтроки = ОстаткиПоСкладамFBOЯМ.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, Наименование));
							НайденныеСтроки = ОстаткиПоСкладамFBOЯМ.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, Наименование, ВыборкаНоменклатуры.АртикулМП));
							//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
							
							Если НайденныеСтроки.Количество() > 0 Тогда
								ОбластьДанные.Параметры.Остаток = НайденныеСтроки[0].stock;
								ТабДок.Присоединить(ОбластьДанные);
							Иначе
								ОбластьДанные.Параметры.Остаток = 0;
								ТабДок.Присоединить(ОбластьДанные);
							КонецЕсли;
							
						КонецЦикла; 
						
					КонецЕсли;
					
					Если ОстаткиЯМ.Количество() > 0 Тогда    
						
						ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ОстатокЯМ");
						ОбластьДанные.Область(1,1,1,2).ЦветФона = Цвет;
						
						//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						//НайденныеСтроки = ОстаткиЯМ.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика));
						НайденныеСтроки = ОстаткиЯМ.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, ВыборкаНоменклатуры.АртикулМП));
						//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.FBSЯМ = НайденныеСтроки[0].stock;
						Иначе
							ОбластьДанные.Параметры.FBSЯМ = 0;
						КонецЕсли;
					//+ ИнфоСофт Стояк Ю.К. 23.11.2024 УА #87127
					Иначе
						ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ОстатокЯМ");
						ОбластьДанные.Область(1,1,1,2).ЦветФона = Цвет;
						ОбластьДанные.Параметры.FBSЯМ = 0;
						//- ИнфоСофт Стояк Ю.К. 23.11.2024 УА #87127						
					КонецЕсли;
					
					Если ОстаткиЯМFBO.Количество() > 0 Тогда    
						
						//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						//НайденныеСтроки = ОстаткиЯМFBO.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика));
						НайденныеСтроки = ОстаткиЯМFBO.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, ВыборкаНоменклатуры.АртикулМП));
						//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.FBOЯМ = НайденныеСтроки[0].stock;
							СуммаFBO = СуммаFBO + НайденныеСтроки[0].stock;
						Иначе
							ОбластьДанные.Параметры.FBOЯМ = 0;
						КонецЕсли;
						
						//ТабДок.Присоединить(ОбластьДанные); 
					Иначе 
						ОбластьДанные.Параметры.FBOЯМ = 0;
					КонецЕсли;
					
					Если ОстаткиЯМ.Количество() Или ОстаткиЯМFBO.Количество() Тогда
						ТабДок.Присоединить(ОбластьДанные);
					КонецЕсли;
					
				КонецЕсли;
				
				Если Aliexpress Тогда 
					
					Если ОстаткиАли.Количество() > 0 Тогда
						
						ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ОстатокАли"); 
						ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
						
						//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						//НайденныеСтроки = ОстаткиАли.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика));
						НайденныеСтроки = ОстаткиАли.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Артикул", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Характеристика, ВыборкаНоменклатуры.АртикулМП));
						//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.FBSAli = НайденныеСтроки[0].stock;
						Иначе                                                         
							ОбластьДанные.Параметры.FBSAli = 0;
						КонецЕсли;
						
						ТабДок.Присоединить(ОбластьДанные); 
						
					КонецЕсли;
					
				КонецЕсли;
				
				ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|СуммаFBO"); 
				ОбластьДанные.Область(1,1,1,1).ЦветФона = Цвет;
				ОбластьДанные.Параметры.СуммаFBO = СуммаFBO;
				ТабДок.Присоединить(ОбластьДанные);
				
			КонецЕсли;	
			
			Если ПолучатьЦены Тогда
				
				Если WB Тогда 
					
					Если ЦеныWB.Количество() > 0 Тогда
						
						ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ЦеныВБ");
						ОбластьДанные.Область(1,1,1,2).ЦветФона = Цвет;
						
						НайденныеСтроки = ЦеныWB.НайтиСтроки(Новый Структура("Номенклатура", ВыборкаНоменклатуры.Номенклатура));
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.ЦенаВБ = НайденныеСтроки[0].Цена;  
							ОбластьДанные.Параметры.ЦенаВБДо = НайденныеСтроки[0].ЦенаДоСкидок;					
						КонецЕсли;
						
						ТабДок.Присоединить(ОбластьДанные);	 
						
					КонецЕсли;
					
				КонецЕсли;  
				
				Если Ozon Тогда
					
					Если ЦеныOzon.Количество() > 0 Тогда
						
						ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ЦеныOzon");
						ОбластьДанные.Область(1,1,1,3).ЦветФона = Цвет;
						
						НайденныеСтроки = ЦеныOzon.НайтиСтроки(Новый Структура("Номенклатура", ВыборкаНоменклатуры.Номенклатура));
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.ЦенаМинOzon = НайденныеСтроки[0].МинимальнаяЦена;
							ОбластьДанные.Параметры.ЦенаOzon = НайденныеСтроки[0].Цена;
							ОбластьДанные.Параметры.ЦенаOzonДо = НайденныеСтроки[0].ЦенаДоСкидок;
						КонецЕсли;
						
						ТабДок.Присоединить(ОбластьДанные);
						
					КонецЕсли;
					
				КонецЕсли; 
				
				Если ЯМ Тогда
					
					Если ЦеныЯМ.Количество() > 0 Тогда
						
						ОбластьДанные = МакетТД.ПолучитьОбласть("СтрокаТЧ|ЦеныЯМ");
						ОбластьДанные.Область(1,1,1,2).ЦветФона = Цвет;
						
						НайденныеСтроки = ЦеныЯМ.НайтиСтроки(Новый Структура("Номенклатура", ВыборкаНоменклатуры.Номенклатура));
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							ОбластьДанные.Параметры.ЦенаЯМ = НайденныеСтроки[0].Цена;
							ОбластьДанные.Параметры.ЦенаЯМДо = НайденныеСтроки[0].ЦенаДоСкидок;
						КонецЕсли;
						
						ТабДок.Присоединить(ОбластьДанные);	 
						
					КонецЕсли;
					
				КонецЕсли;			
				
			КонецЕсли;
			
		КонецЦикла;  
		
	КонецЦикла;
	
	Результат = ТабДок;
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330

//+ ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330
Функция СуммироватьОстаткиWBПоТипу(ТаблицаЗначений)
	
	ФБС = ?(ТаблицаЗначений.Колонки.Найти("ФБС") <> Неопределено, Истина, Ложь);
	
	ТаблицаОстатков = Новый ТаблицаЗначений;  
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(20, 2, ДопустимыйЗнак.Неотрицательный);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(20);
		
	ТаблицаОстатков.Колонки.Добавить("id", Новый ОписаниеТипов("Число",КвалификаторыЧисла));
	ТаблицаОстатков.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка",КвалификаторыСтроки));
	ТаблицаОстатков.Колонки.Добавить("stock", Новый ОписаниеТипов("Число", КвалификаторыЧисла)); 
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		
		НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(Новый Структура("id, Штрихкод", Строка.ИД, Строка.Штрихкод));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если НайденныеСтроки[0].stock <> Строка.НаСкладе И ФБС Тогда
				НайденныеСтроки[0].stock = НайденныеСтроки[0].stock + Строка.НаСкладе;
			ИначеЕсли Не ФБС Тогда
				НайденныеСтроки[0].stock = НайденныеСтроки[0].stock + Строка.НаСкладе;         
			КонецЕсли;
		Иначе
			НоваяСтрока = ТаблицаОстатков.Добавить();
			НоваяСтрока.id = Строка.ИД;
			НоваяСтрока.Штрихкод = Строка.Штрихкод;
			НоваяСтрока.stock = Строка.НаСкладе;                                 
		КонецЕсли;  
		
	КонецЦикла;
	
	Возврат ТаблицаОстатков;
			
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330

//+ ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330
Функция СуммироватьОстаткиOzonПоТипу(ТаблицаЗначений)
	
	ТаблицаОстатков = Новый ТаблицаЗначений;  
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(50, 2, ДопустимыйЗнак.Неотрицательный);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(50);
	
	ТаблицаОстатков.Колонки.Добавить("OfferId", Новый ОписаниеТипов("Строка",КвалификаторыСтроки));	
	ТаблицаОстатков.Колонки.Добавить("stock", Новый ОписаниеТипов("Число", КвалификаторыЧисла)); 
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		
		НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(Новый Структура("OfferId", Строка.nmId));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].stock = НайденныеСтроки[0].stock + Строка.НаСкладе;
		Иначе
			НоваяСтрока = ТаблицаОстатков.Добавить();
			НоваяСтрока.OfferId = Строка.nmId;			
			НоваяСтрока.stock = Строка.НаСкладе;                                 
		КонецЕсли;  
		
	КонецЦикла;
	
	Возврат ТаблицаОстатков;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330  

//+ ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330
Функция СуммироватьОстаткиЯМ(ТаблицаЗначений)
	
	ТаблицаОстатков = Новый ТаблицаЗначений;  
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(50, 2, ДопустимыйЗнак.Неотрицательный);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(80);
	
	ТаблицаОстатков.Колонки.Добавить("shopSku", Новый ОписаниеТипов("Строка",КвалификаторыСтроки));	
	ТаблицаОстатков.Колонки.Добавить("stock", Новый ОписаниеТипов("Число", КвалификаторыЧисла)); 
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		
		НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(Новый Структура("shopSku", Строка.shopSku));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].stock = НайденныеСтроки[0].stock + Строка.stock;
		Иначе
			НоваяСтрока = ТаблицаОстатков.Добавить();
			НоваяСтрока.shopSku = Строка.shopSku;			
			НоваяСтрока.stock = Строка.stock;                                 
		КонецЕсли;  
		
	КонецЦикла;
	
	Возврат ТаблицаОстатков;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330

//+ ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330
Функция ДобавитьНоменклатуруКОстаткам(ТаблицаЗначений, МП = 0) 
	
	Запрос = Новый Запрос;
	
	Если МП = 1 Тогда 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.Штрихкод КАК Barcode,
		|	Данные.id КАК id,
		|	Данные.stock КАК stock
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Данные.stock, 0) КАК stock,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
		|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
		|	ИС_WB_СоответствиеРазмеров.РазмерWB.Владелец.vendorCode КАК Артикул
		|ИЗ
		|	РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО ИС_WB_ШтрихкодыРазмеров.Штрихкод = Данные.Barcode
		|			И (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
		|			И ИС_WB_ШтрихкодыРазмеров.Размер.Владелец.Код = Данные.id
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО ИС_WB_ШтрихкодыРазмеров.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
		|ГДЕ
		|	ИС_WB_СоответствиеРазмеров.Профиль = &Профиль
		|	И НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
		
	ИначеЕсли МП = 2 Тогда	
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.OfferId КАК OfferId,
		|	Данные.stock КАК stock
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Данные.stock, 0) КАК stock,
		|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		|	ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id КАК Артикул
		|ИЗ
		|	РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id = Данные.OfferId
		|ГДЕ
		|	НЕ ИС_Ozon_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL
		|	И ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура"; 
		
	ИначеЕсли МП = 3 Тогда  
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.shopSku КАК shopSku,
		|	Данные.stock КАК stock
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Данные.stock, 0) КАК stock,
		|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		|	ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku КАК Артикул
		|ИЗ
		|	РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku = Данные.shopSku
		|ГДЕ
		|	НЕ ИС_ЯМ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL
		|	И ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
		
	ИначеЕсли МП = 4 Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Данные.id КАК id,
		|	Данные.stock КАК stock
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Данные.stock, 0) КАК stock,
		|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_АЛИ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73943
		//|	ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ.Владелец.id КАК Артикул		
		|	ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ.Владелец.Код КАК Артикул
		//- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73943
		|ИЗ
		|	РегистрСведений.ИС_АЛИ_СоответствиеХарактеристик КАК ИС_АЛИ_СоответствиеХарактеристик
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ.sku_id = Данные.id
		|ГДЕ
		|	НЕ ИС_АЛИ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL
		|	И ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура"; 
		
	ИначеЕсли МП = 11 Тогда 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.Штрихкод КАК Barcode,
		|	Данные.ИД КАК id,
		|	Данные.НаСкладе КАК stock,
		|	Данные.Склад КАК Склад,
		//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177		
		|	Данные.ВПутиДо КАК ВПутиДо,
		|	Данные.ВПутиОт КАК ВПутиОт              
		//- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Данные.stock, 0) КАК stock,
		|	Данные.Склад КАК Склад,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
		|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
		|	ИС_WB_СоответствиеРазмеров.РазмерWB.Владелец.vendorCode КАК Артикул,
		//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177
		|	ЕСТЬNULL(Данные.ВПутиДо, 0) КАК ВПутиДо,
		|	ЕСТЬNULL(Данные.ВПутиОт, 0) КАК ВПутиОт
		//- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177
		|ИЗ
		|	РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО ИС_WB_ШтрихкодыРазмеров.Штрихкод = Данные.Barcode
		|			И (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
		|			И ИС_WB_ШтрихкодыРазмеров.Размер.Владелец.Код = Данные.id
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО ИС_WB_ШтрихкодыРазмеров.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
		|ГДЕ
		|	ИС_WB_СоответствиеРазмеров.Профиль = &Профиль
		|	И НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура"; 
		
	ИначеЕсли МП = 12 Тогда 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.Штрихкод КАК Barcode,
		|	Данные.ИД КАК id,
		|	Данные.НаСкладе КАК stock,
		|	Данные.Склад КАК Склад
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Данные.stock, 0) КАК stock,
		|	Данные.Склад КАК Склад,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
		|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
		|	ИС_WB_СоответствиеРазмеров.РазмерWB.Владелец.vendorCode КАК Артикул
		|ИЗ
		|	РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО ИС_WB_ШтрихкодыРазмеров.Штрихкод = Данные.Barcode
		|			И (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
		|			И ИС_WB_ШтрихкодыРазмеров.Размер.Владелец.Код = Данные.id
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО ИС_WB_ШтрихкодыРазмеров.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
		|ГДЕ
		|	ИС_WB_СоответствиеРазмеров.Профиль = &Профиль
		|	И НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
		
	ИначеЕсли МП = 21 Тогда 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.product_id КАК product_id,
		|	Данные.Склад КАК Склад,
		|	Данные.stock КАК stock
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Данные.stock, 0) КАК stock,
		|	Данные.Склад КАК Склад,
		|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		|	ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id КАК Артикул
		|ИЗ
		|	РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Код = Данные.product_id
		|ГДЕ
		|	НЕ ИС_Ozon_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL
		|	И ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура"; 
		
	//+ ИнфоСофт Стояк Ю.К. 07.11.2024 УА #72455	
	ИначеЕсли МП = 22 Тогда 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.sku КАК sku,
		|	Данные.warehouse_name КАК warehouse_name,
		|	Данные.free_to_sell_amount КАК free_to_sell_amount,
		|	Данные.promised_amount КАК promised_amount,
		|	Данные.reserved_amount КАК reserved_amount
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Данные.free_to_sell_amount, 0) КАК free_to_sell_amount,
		|	ЕСТЬNULL(Данные.promised_amount, 0) КАК promised_amount,
		|	ЕСТЬNULL(Данные.reserved_amount, 0) КАК reserved_amount,
		|	Данные.warehouse_name КАК Склад,
		|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		|	ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id КАК Артикул
		|ИЗ
		|	РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku = Данные.sku
		|ГДЕ
		|	НЕ ИС_Ozon_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL
		|	И ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
	//- ИнфоСофт Стояк Ю.К. 07.11.2024 УА #72455
		
	ИначеЕсли МП = 31 Тогда  
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.shopSku КАК shopSku,
		|	Данные.stock КАК stock,
		|	Данные.Склад КАК Склад
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Данные.stock, 0) КАК stock,
		|	Данные.Склад КАК Склад,
		|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		|	ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku КАК Артикул
		|ИЗ
		|	РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku = Данные.shopSku
		|ГДЕ
		|	НЕ ИС_ЯМ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL
		|	И ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Данные", ТаблицаЗначений);
	Запрос.УстановитьПараметр("Профиль", Профиль);

	Результатзапроса = Запрос.Выполнить();
	
	Возврат Результатзапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330

//+ ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330
Функция ДобавитьНоменклатуруКЦенам(ТаблицаЗначений, МП = 0)
	
	Запрос = Новый Запрос;
	
	Если МП = 1 Тогда 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.nmId КАК nmId,
		//+ ИнфоСофт Мурсалимов Д.Р. 16.05.24 УА #66901 
		//|	Данные.ТекущаяЦена КАК Цена,
		|	Данные.Цена КАК Цена,                      
		//- ИнфоСофт Мурсалимов Д.Р. 16.05.24 УА #66901
		|	Данные.Скидка КАК Скидка
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИС_WB_Номенклатура.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Данные КАК Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_Номенклатура КАК ИС_WB_Номенклатура
		|		ПО Данные.nmId = ИС_WB_Номенклатура.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Ссылка КАК Ссылка,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_Сопоставление
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО ВТ_Номенклатура.Ссылка = ИС_WB_СоответствиеРазмеров.РазмерWB.Владелец
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Номенклатура.Ссылка,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Данные.Цена, 0) КАК ЦенаДоСкидок,
		|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА НЕ Данные.Цена ЕСТЬ NULL
		|			ТОГДА Данные.Цена * ((100 - ЕСТЬNULL(Данные.Скидка, 0)) / 100)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Цена
		|ИЗ
		|	ВТ_Сопоставление КАК ВТ_Сопоставление
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО ВТ_Сопоставление.Ссылка.Код = Данные.nmId
		|ГДЕ
		|	НЕ ВТ_Сопоставление.Номенклатура ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
		
	ИначеЕсли МП = 2 Тогда		

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.nmId КАК OfferId,
		|	Данные.product_id КАК product_id,
		|	Данные.old_price КАК old_price,
		|	Данные.min_price КАК min_price,
		|	Данные.Цена КАК Цена
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.old_price КАК ЦенаДоСкидок,
		|	Данные.min_price КАК МинимальнаяЦена,
		|	Данные.Цена КАК Цена,
		|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура		
		|ИЗ
		|	РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО (Данные.OfferId = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id)
		|			И (Данные.product_id = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Код)
		|ГДЕ
		|	ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль = &Профиль
		|	И НЕ ИС_Ozon_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура"; 
		
	ИначеЕсли МП = 3 Тогда 
				
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.shopSku КАК shopSku,
		|	Данные.discountBase КАК ЦенаДоСкидок,
		|	Данные.value КАК Цена
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,		
		|	Данные.Цена КАК Цена,
		|	Данные.ЦенаДоСкидок КАК ЦенаДоСкидок
		|ИЗ
		|	РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku = Данные.shopSku
		|ГДЕ
		|	ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль = &Профиль
		|	И НЕ ИС_ЯМ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
		
	ИначеЕсли МП = 4 Тогда
		
		//Тут может быть ваш код 
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Данные", ТаблицаЗначений);
	Запрос.УстановитьПараметр("Профиль", Профиль);

	Результатзапроса = Запрос.Выполнить();
	
	Возврат Результатзапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330

//+ ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330
Функция СформироватьТаблицуНоменклатуры()
	
	Номенклатура = Новый ТаблицаЗначений;
	Номенклатура.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Номенклатура.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	Номенклатура.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
	Номенклатура.Колонки.Добавить("АртикулМП", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150))); 
	//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
	
	НоменклатураВБ = Новый ТаблицаЗначений;
	НоменклатураОзон = Новый ТаблицаЗначений;
	НоменклатураЯМ = Новый ТаблицаЗначений;
    НоменклатураАли = Новый ТаблицаЗначений;
	
	Если WB Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
		|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
		//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
		|	ИС_WB_СоответствиеРазмеров.РазмерWB.Владелец.vendorCode КАК АртикулМП
		//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
		|ИЗ
		|	РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|ГДЕ
		|	ИС_WB_СоответствиеРазмеров.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИС_WB_СоответствиеРазмеров.Номенклатура.Наименование";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		НоменклатураВБ = Результатзапроса.Выгрузить(); 
		
		ОбъединитьТаблицыЗначений(Номенклатура, НоменклатураВБ); 
		
	КонецЕсли;
	
	Если Ozon Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
		|	ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id КАК АртикулМП 
		//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
		|ИЗ
		|	РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
		|ГДЕ
		|	ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура.Наименование";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		НоменклатураОзон = Результатзапроса.Выгрузить();
		
		ОбъединитьТаблицыЗначений(Номенклатура, НоменклатураОзон);
		
	КонецЕсли; 
	
	Если ЯМ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
		|	ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku КАК АртикулМП
		//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
		|ИЗ
		|	РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
		|ГДЕ
		|	ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.Наименование";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		НоменклатураЯМ = Результатзапроса.Выгрузить(); 
		
		ОбъединитьТаблицыЗначений(Номенклатура, НоменклатураЯМ);
		
	КонецЕсли;
	
	Если Aliexpress Тогда 
		
		Запрос = Новый Запрос;  
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_АЛИ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		//+ ИнфоСофт Заварин К.В. 27.03.25 УА #97250
		//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
		//|	ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ.sku_id КАК АртикулМП 
		|	ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ.Владелец.Код КАК АртикулМП
		//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
		//- ИнфоСофт Заварин К.В. 27.03.25 УА #97250
		|ИЗ
		|	РегистрСведений.ИС_АЛИ_СоответствиеХарактеристик КАК ИС_АЛИ_СоответствиеХарактеристик
		|ГДЕ
		|	ИС_АЛИ_СоответствиеХарактеристик.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура.Наименование";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		НоменклатураАли = Результатзапроса.Выгрузить();
		
		ОбъединитьТаблицыЗначений(Номенклатура, НоменклатураАли);
		
	КонецЕсли; 
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеНоменклатуры.Номенклатура КАК Номенклатура,
	|	ДанныеНоменклатуры.Характеристика КАК Характеристика, 
	//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
	|	ДанныеНоменклатуры.АртикулМП КАК АртикулМП
	//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	&ДанныеНоменклатуры КАК ДанныеНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	СпрНоменклатура.Наименование КАК Наименование,
	|	СпрНоменклатура.Артикул КАК Артикул,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	//+ ИнфоСофт Заварин К.В. 24.03.25 УА #90222
	|	ВТ_Номенклатура.АртикулМП КАК АртикулМП,
	//- ИнфоСофт Заварин К.В. 24.03.25 УА #90222
	|	СпрНоменклатура.Родитель КАК Родитель
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВТ_Номенклатура.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	НЕ СпрНоменклатура.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	%1
	|ИТОГИ ПО
	|	Родитель"; 
	
	Если Сортировать Тогда
		Запрос.Текст = СтрШаблон(Запрос.Текст, "Артикул");
	Иначе
		Запрос.Текст = СтрШаблон(Запрос.Текст, "Наименование");
	КонецЕсли;
	Запрос.УстановитьПараметр("ДанныеНоменклатуры", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Возврат РезультатЗапроса;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330

//+ ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330
Процедура ОбъединитьТаблицыЗначений(тзОсновная, тзПрисоединяемая)    
	
	//+ ИнфоСофт Заварин К.В. 25.03.25 УА #90222
	//Отборы = Новый Структура("Номенклатура, Характеристика",);
	Отборы = Новый Структура("Номенклатура, Характеристика, АртикулМП",);
	//- ИнфоСофт Заварин К.В. 25.03.25 УА #90222
	
	Для каждого текПрисоединяемаяЗапись из тзПрисоединяемая цикл  
		
		ЗаполнитьЗначенияСвойств(Отборы, текПрисоединяемаяЗапись);
		НайденыеСтроки = тзОсновная.НайтиСтроки(Отборы);  
		
		Если Не НайденыеСтроки.Количество() > 0 тогда
			
			НовСтрока = тзОсновная.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, текПрисоединяемаяЗапись);	
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330

//+ ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330
Процедура ОбработатьШапку(ТабДок, МакетТД, Структура)    
	
	Если ПолучатьОстатки Тогда		
		
		Если ЗначениеЗаполнено(Склад) Тогда 		
			ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|Остаток1С");
			ТабДок.Присоединить(ОбластьШапка);
		КонецЕсли;
		
		Если WB Тогда
			
			Если ОстатокПоСкладам Тогда
				
				Если ПолучатьОстаткиFBS И Структура.Свойство("FBSWB") Тогда
					Для Каждого Строка Из Структура.FBSWB Цикл
						ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ОстатокСклад"); 
						ОбластьШапка.Параметры.Склад = Строка;
						ТабДок.Присоединить(ОбластьШапка);	
					КонецЦикла;
				КонецЕсли;
				
				Если ПолучатьОстаткиFBO И Структура.Свойство("FBOWB") Тогда
					Для Каждого Строка Из Структура.FBOWB Цикл
						//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177
						//ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ОстатокСклад"); 
						ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ОстатокСкладДетальный"); 
						//- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177						
						ОбластьШапка.Параметры.Склад = Строка;
						ТабДок.Присоединить(ОбластьШапка);	
					КонецЦикла;               
				КонецЕсли;

			КонецЕсли; 
			
			
			ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ОстатокВБ");
			ТабДок.Присоединить(ОбластьШапка); 
			
		КонецЕсли;  
		
		Если Ozon Тогда
			
			Если ОстатокПоСкладам И ПолучатьОстаткиFBS И Структура.Свойство("FBSOzon") Тогда 
				
				Для Каждого Строка Из Структура.FBSOzon Цикл
					ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ОстатокСклад"); 
					ОбластьШапка.Параметры.Склад = Строка;
					ТабДок.Присоединить(ОбластьШапка);	
				КонецЦикла; 
				
			КонецЕсли;
			
			//+ ИнфоСофт Стояк Ю.К. 07.11.2024 УА #72455			
			Если ОстатокПоСкладам И ПолучатьОстаткиFBO И Структура.Свойство("FBOOzon") Тогда
				Для Каждого Строка Из Структура.FBOOzon Цикл					
					ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ОстатокСкладДетальный"); 					
					ОбластьШапка.Параметры.Склад = Строка;
					ТабДок.Присоединить(ОбластьШапка);	
				КонецЦикла;               
			КонецЕсли;                                  
			//- ИнфоСофт Стояк Ю.К. 07.11.2024 УА #72455
			
			ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ОстатокOzon");
			ТабДок.Присоединить(ОбластьШапка);
		КонецЕсли; 
		
		Если ЯМ Тогда
			
			Если ОстатокПоСкладам И ПолучатьОстаткиFBS И Структура.Свойство("FBSЯМ") Тогда 
				
				Для Каждого Строка Из Структура.FBSЯМ Цикл
					ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ОстатокСклад"); 
					ОбластьШапка.Параметры.Склад = Строка;
					ТабДок.Присоединить(ОбластьШапка);	
				КонецЦикла; 
				
			КонецЕсли;  
			
			Если ОстатокПоСкладам И ПолучатьОстаткиFBO И Структура.Свойство("FBOЯМ") Тогда 
				
				Для Каждого Строка Из Структура.FBOЯМ Цикл
					ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ОстатокСклад"); 
					ОбластьШапка.Параметры.Склад = Строка;
					ТабДок.Присоединить(ОбластьШапка);	
				КонецЦикла; 
				
			КонецЕсли;
			
			ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ОстатокЯМ");
			ТабДок.Присоединить(ОбластьШапка);	
		КонецЕсли;
		
		Если Aliexpress Тогда
			ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ОстатокАли");
			ТабДок.Присоединить(ОбластьШапка);			
		КонецЕсли;
		
		ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|СуммаFBO");
		ТабДок.Присоединить(ОбластьШапка);
		
	КонецЕсли;
	
	Если ПолучатьЦены Тогда
		
		Если WB Тогда  						
			ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ЦеныВБ");
			ТабДок.Присоединить(ОбластьШапка);
		КонецЕсли;  
		
		Если Ozon Тогда				
			ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ЦеныOzon");
			ТабДок.Присоединить(ОбластьШапка);
		КонецЕсли; 
		
		Если ЯМ Тогда	
			ОбластьШапка = МакетТД.ПолучитьОбласть("ШапкаТаблицы|ЦеныЯМ");
			ТабДок.Присоединить(ОбластьШапка);
		КонецЕсли;
		
		Если Aliexpress Тогда 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.07.2023 УА #59330  

//+ ИнфоСофт Стояк Ю.К. 24.09.2023 УА #00000
Функция ПолучитьОстатки1С(ТаблицаНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|		ВТ_Товары.Номенклатура КАК Номенклатура,
	|		ВТ_Товары.Характеристика КАК Характеристика
	|	ПОМЕСТИТЬ ВТ_Размеры
	|	ИЗ
	|		&ВТ_Товары КАК ВТ_Товары
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	|		РаспределениеЗапасов.Характеристика КАК Характеристика,
	|		СУММА(РаспределениеЗапасов.Свободно) КАК Свободно,
	|		СУММА(РаспределениеЗапасов.Резерв) КАК Резерв,
	|		РаспределениеЗапасов.ЗаказНаПоступление КАК ЗаказНаПоступление,
	|		РаспределениеЗапасов.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку
	|	ПОМЕСТИТЬ ВТ_Запасы
	|	ИЗ
	|		РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|	ГДЕ
	|		РаспределениеЗапасов.Склад В(&Склад)
	|		И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|		И РаспределениеЗапасов.Назначение В(&Назначение)
	|		И (РаспределениеЗапасов.Номенклатура, РаспределениеЗапасов.Характеристика) В
	|				(ВЫБРАТЬ
	|					ВТ.Номенклатура КАК Номенклатура,
	|					ВТ.Характеристика КАК Характеристика
	|				ИЗ
	|					ВТ_Размеры КАК ВТ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РаспределениеЗапасов.Номенклатура,
	|		РаспределениеЗапасов.Характеристика,
	|		РаспределениеЗапасов.ЗаказНаПоступление,
	|		РаспределениеЗапасов.ЗаказНаОтгрузку
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|
	|		ВТ_Размеры.Номенклатура КАК Номенклатура,
	|		ВТ_Размеры.Характеристика КАК Характеристика,
	|		ЕСТЬNULL(ВТ_Запасы.Свободно, 0) КАК ВНаличииСоСклада,
	|		ЕСТЬNULL(ВТ_Запасы.Резерв, 0) КАК ВРезервеСоСклада
	|	ПОМЕСТИТЬ ВТ_ФиналДоГруппировки
	|	ИЗ
	|		ВТ_Размеры КАК ВТ_Размеры
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Запасы КАК ВТ_Запасы
	|			ПО ВТ_Размеры.Характеристика = ВТ_Запасы.Характеристика
	|				И ВТ_Размеры.Номенклатура = ВТ_Запасы.Номенклатура
	|
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_Размеры.Номенклатура,
	|		ВТ_Размеры.Характеристика,
	|		ЕСТЬNULL(ВТ_Запасы.Свободно, 0),
	|		ЕСТЬNULL(ВТ_Запасы.Резерв, 0)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Размеры.Номенклатура,
	|		ВТ_Размеры.Характеристика,
	|		ВЫБОР
	|			КОГДА МИНИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) / ВариантыКомплектацииНоменклатурыТовары.Количество - 0.5 КАК ЧИСЛО(10, 0))) < 0
	|				ТОГДА 0
	|			ИНАЧЕ МИНИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) / ВариантыКомплектацииНоменклатурыТовары.Количество - 0.5 КАК ЧИСЛО(10, 0)))
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА МИНИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(РаспределениеЗапасов.Резерв, 0) / ВариантыКомплектацииНоменклатурыТовары.Количество - 0.5 КАК ЧИСЛО(10, 0))) < 0
	|				ТОГДА 0
	|			ИНАЧЕ МИНИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(РаспределениеЗапасов.Резерв, 0) / ВариантыКомплектацииНоменклатурыТовары.Количество - 0.5 КАК ЧИСЛО(10, 0)))
	|		КОНЕЦ
	|	ИЗ
	|		ВТ_Размеры КАК ВТ_Размеры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|				ПО ВариантыКомплектацииНоменклатурыТовары.Номенклатура = РаспределениеЗапасов.Номенклатура
	|					И (РаспределениеЗапасов.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика)
	|					И (РаспределениеЗапасов.Склад В (&Склад))
	|					И (РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе))
	|			ПО ВТ_Размеры.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|	ГДЕ
	|		ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_Размеры.Номенклатура,
	|		ВТ_Размеры.Характеристика
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ВТ_ФиналДоГруппировки.Номенклатура КАК НоменклатураКомплект,
	|		ВТ_ФиналДоГруппировки.Характеристика КАК ХарактеристикаКомплект,
	|		ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК НоменклатураКомплектация,
	|		ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК ХарактеристикаКомплектация,
	|		ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоКомплектация
	|
	|	ПОМЕСТИТЬ ВТ_Комплект
	|	ИЗ
	|		ВТ_ФиналДоГруппировки КАК ВТ_ФиналДоГруппировки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|			ПО ВТ_ФиналДоГруппировки.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|				И ВТ_ФиналДоГруппировки.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика
	|	ГДЕ
	|		ВариантыКомплектацииНоменклатурыТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ВТ_Комплект.НоменклатураКомплект КАК НоменклатураКомплект,
	|		ВТ_Комплект.ХарактеристикаКомплект КАК ХарактеристикаКомплект,
	|		ВТ_Комплект.КоличествоКомплектация КАК КоличествоКомплектация,
	|		ВЫБОР
	|			КОГДА РаспределениеЗапасов.Свободно ЕСТЬ NULL
	|				ТОГДА 0
	|			КОГДА РаспределениеЗапасов.Свободно = 0
	|				ТОГДА 0
	|			ИНАЧЕ РаспределениеЗапасов.Свободно / ВТ_Комплект.КоличествоКомплектация
	|		КОНЕЦ КАК СвободноКомплектация,
	|		ВТ_Комплект.НоменклатураКомплектация КАК НоменклатураКомплектация,
	|		ВТ_Комплект.ХарактеристикаКомплектация КАК ХарактеристикаКомплектация
	|	ПОМЕСТИТЬ ВТ_КомплектацияОстаток
	|	ИЗ
	|		ВТ_Комплект КАК ВТ_Комплект
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|			ПО ВТ_Комплект.НоменклатураКомплектация = РаспределениеЗапасов.Номенклатура
	|				И ВТ_Комплект.ХарактеристикаКомплектация = РаспределениеЗапасов.Характеристика
	|	ГДЕ
	|		РаспределениеЗапасов.Склад В(&Склад)
	|		И РаспределениеЗапасов.Назначение В(&Назначение)
	|		И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ВТ_Комплект.НоменклатураКомплект КАК НоменклатураКомплект,
	|		ВТ_Комплект.ХарактеристикаКомплект КАК ХарактеристикаКомплект,
	|		МИНИМУМ(ЕСТЬNULL(ВТ_КомплектацияОстаток.СвободноКомплектация, 0)) КАК СвободноКомплектация
	|	ПОМЕСТИТЬ ВТ_ФиналКомплект
	|	ИЗ
	|		ВТ_Комплект КАК ВТ_Комплект
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомплектацияОстаток КАК ВТ_КомплектацияОстаток
	|			ПО (ВТ_Комплект.НоменклатураКомплектация = ВТ_КомплектацияОстаток.НоменклатураКомплектация
	|					И ВТ_Комплект.ХарактеристикаКомплектация = ВТ_КомплектацияОстаток.ХарактеристикаКомплектация	
	|					И ВТ_Комплект.НоменклатураКомплект = ВТ_КомплектацияОстаток.НоменклатураКомплект
	|					И ВТ_Комплект.ХарактеристикаКомплект = ВТ_КомплектацияОстаток.ХарактеристикаКомплект)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_Комплект.НоменклатураКомплект,
	|		ВТ_Комплект.ХарактеристикаКомплект
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ВТ_ФиналДоГруппировки.Номенклатура КАК Номенклатура,
	|		ВТ_ФиналДоГруппировки.Характеристика КАК Характеристика,
	|		МИНИМУМ(ВЫБОР
	|				КОГДА СпрНоменклатура.Ссылка.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)							
	|					ТОГДА ЕСТЬNULL(ВТ_ФиналКомплект.СвободноКомплектация, 0)
	|				ИНАЧЕ ЕСТЬNULL(ВТ_ФиналДоГруппировки.ВНаличииСоСклада, 0)
	|			КОНЕЦ) КАК ОстатокУТ,
	|		СУММА(ВТ_ФиналДоГруппировки.ВРезервеСоСклада) КАК РезервУТ
	|	ИЗ
	|		ВТ_ФиналДоГруппировки КАК ВТ_ФиналДоГруппировки
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФиналКомплект КАК ВТ_ФиналКомплект
	|			ПО ВТ_ФиналДоГруппировки.Номенклатура = ВТ_ФиналКомплект.НоменклатураКомплект
	|				И ВТ_ФиналДоГруппировки.Характеристика = ВТ_ФиналКомплект.ХарактеристикаКомплект
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО ВТ_ФиналДоГруппировки.Номенклатура = СпрНоменклатура.Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ФиналДоГруппировки.Номенклатура,
	|		ВТ_ФиналДоГруппировки.Характеристика";

	Запрос.УстановитьПараметр("ВТ_Товары", ТаблицаНоменклатуры); 
	Запрос.УстановитьПараметр("Назначение", Справочники.Назначения.ПустаяСсылка());
	Запрос.УстановитьПараметр("Склад", Склад);


	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 24.09.2023 УА #00000

//+ ИнфоСофт Стояк Ю.К. 25.09.2023 УА #62245
&НаКлиенте
Процедура ПолучатьОстаткиПриИзменении(Элемент)
	
	Если ПолучатьОстатки Тогда
		Элементы.Склад.Видимость = Истина;
		Элементы.ОстатокПоСкладам.Видимость = Истина;
	Иначе
		Элементы.Склад.Видимость = Ложь;
		Элементы.ОстатокПоСкладам.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.09.2023 УА #62245

//+ ИнфоСофт Стояк Ю.К. 13.10.2023 УА #62194
Функция СвернутьМассив(Массив) 
	
	СвернутыйМассив = Новый Массив;
	
	Для каждого Элемент Из Массив Цикл
		Если СвернутыйМассив.Найти(Элемент) = Неопределено Тогда			
			СвернутыйМассив.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СвернутыйМассив;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 13.10.2023 УА #62194

//+ ИнфоСофт Стояк Ю.К. 25.09.2023 УА #62245
&НаКлиенте
Процедура ОстатокПоСкладамПриИзменении(Элемент)
	Если ОстатокПоСкладам Тогда
		Элементы.ГруппаТипыОстатков.Видимость = Истина;	
	Иначе
		Элементы.ГруппаТипыОстатков.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.09.2023 УА #62245

#КонецОбласти
