
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 23.01.23 УА #53535
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	Список.ТекстЗапроса = ИС_WB_Сервер.ПолучитьТекстЗапросаСборочныхЗаданий();
	Список.ОсновнаяТаблица = "Документ.ИС_WB_СборочноеЗадание"; 
	СортировкаПечати = "Код";
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//+ ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныеСклады") Тогда	
		Элементы.РасходныйОрдер.Видимость = Ложь;	
	КонецЕсли;                               
	//- ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 23.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 08.04.25 УА #96894
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ОпределитьСписокДоступныхДействий();	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПрименитьНастройкиПрофиля();
	//+ ИнфоСофт Заварин К.В. 05.09.24 УА #79742
	УстановитьОтборыОтправлений();
	//- ИнфоСофт Заварин К.В. 05.09.24 УА #79742
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Профиль) Тогда		
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469		
		//ПолучитьДатуПоследнегоСборочногоЗадания(Профиль, ДатаПоследнегоСборочногоЗадания);
		ПолучитьДатуПоследнегоСборочногоЗадания(Профиль, ДатаПоследнегоСборочногоЗадания, ДатаПоследнегоОтправленияФБО);
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	КонецЕсли;
	
	ПрименитьНастройкиПрофиля();
	
	//+ ИнфоСофт Заварин К.В. 09.09.24 УА #79742
	УстановитьОтборыОтправлений();				
	//- ИнфоСофт Заварин К.В. 09.09.24 УА #79742
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаКлиенте
Процедура СписокПоставокПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.СписокПоставок.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
	КонецЕсли;
	
	ПолучитьСписокСборочныхЗаданийВПоставке(ТекДанные.Код);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

	//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные; 
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.Заказ Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Элемент.ТекущиеДанные.Заказ.Пустая() Тогда
			Возврат;
		КонецЕсли;
		
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Заказ);
	
	ИначеЕсли Поле = Элементы.Реализация Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Реализация) Тогда
			Возврат;
		ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ПоказатьЗначение(, Элемент.ТекущиеДанные.Реализация);
		Иначе
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заказ", Элемент.ТекущиеДанные.Заказ);
			//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
			ПараметрыФормы.Вставить("ДокументыРеализации", Истина);
			//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
			ОткрытьФорму("ОбщаяФорма.ИС_WB_ФормаРТУ", ПараметрыФормы);
		КонецЕсли 
		
	//+ ИнфоСофт Конышев А.Е. 10.12.24 УА #77940
	ИначеЕсли Поле = Элементы.РасходныйОрдер Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.РасходныйОрдер) Тогда
			Возврат;
		//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201			
		//ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.РасходныйОрдер) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.РасходныйОрдер) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
		//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
			ПоказатьЗначение(, Элемент.ТекущиеДанные.РасходныйОрдер);
		//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
		Иначе
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заказ", Элемент.ТекущиеДанные.Заказ);
			ПараметрыФормы.Вставить("ДокументыРеализации", Ложь);
			ОткрытьФорму("ОбщаяФорма.ИС_WB_ФормаРТУ", ПараметрыФормы);
		//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
		КонецЕсли
		
	//- ИнфоСофт Конышев А.Е. 10.12.24 УА #77940	
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 14.02.23 УА #53535
&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Если ТекущаяСтраница = Элементы.ГруппаУправлениеСборочнымиЗаданиями Тогда
		Элементы.ПечатьQRПоставки.Видимость = Ложь;
		//+ ИнфоСофт Заварин К.В. 27.06.24 УА #69703
		Элементы.ПечатьQRКороба.Видимость = Ложь;	
		//- ИнфоСофт Заварин К.В. 27.06.24 УА #69703
		//+ ИнфоСофт Заварин К.В. 05.09.24 УА #79742
		Элементы.КоличествоСборочныхЗаданий.Видимость = Истина;
		Элементы.ОтборОтправлений.Видимость = Истина;
		//- ИнфоСофт Заварин К.В. 05.09.24 УА #79742
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаУправлениеПоставками Тогда 
		Элементы.ПечатьQRПоставки.Видимость = Истина;
		//+ ИнфоСофт Заварин К.В. 27.06.24 УА #69703
		Элементы.ПечатьQRКороба.Видимость = Истина;	
		//- ИнфоСофт Заварин К.В. 27.06.24 УА #69703
		//+ ИнфоСофт Заварин К.В. 05.09.24 УА #79742
		Элементы.КоличествоСборочныхЗаданий.Видимость = Ложь;
		Элементы.ОтборОтправлений.Видимость = Ложь;
		//- ИнфоСофт Заварин К.В. 05.09.24 УА #79742
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	Режим = РежимДиалогаВопрос.ДаНет;
	
	ДопПараметры = Новый Структура("Поставка", ВыбранноеЗначение);
	Оповещение = Новый ОписаниеОповещения("ПрикреплениеКПоставкеЗавершение", ЭтотОбъект, ДопПараметры);
	Текст = СтрШаблон("Прикрепить выделенные задания к поставке: %1?", ВыбранноеЗначение); 
	ПоказатьВопрос(Оповещение, Текст, Режим, 0);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 21.03.23 УА #55822
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ТекДанные = Элементы.Список.ВыделенныеСтроки;
	
	Если ТекДанные = Неопределено Тогда
		ВыделенноСтрок = 0;
	Иначе
		ВыделенноСтрок = ТекДанные.Количество();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.03.23 УА #55822

//+ ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893
&НаКлиенте
Процедура ОткрытьФормуСборкиЗаказов(Команда)
	
	//+ ИнфоСофт Стояк Ю.К. 01.08.2024 УА #76396	
	Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершениеИзмененияПоставки", ЭтотОбъект);
	ТекстВопроса = "Открыть новую форму упаковки товаров? При нажатии 'Нет' будет открыта старая форма";
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	//ПараметрыОткрытия = Новый Структура("Профиль", Профиль);
	//ОткрытьФорму("Документ.ИС_WB_СборочноеЗадание.Форма.ФормаУпаковкиТоваров", ПараметрыОткрытия, ЭтотОбъект);
	//- ИнфоСофт Стояк Ю.К. 01.08.2024 УА #76396
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893

//+ ИнфоСофт Заварин К.В. 03.06.24 УА #70731
&НаКлиенте
Процедура ОткрытьФормуНастройки(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Профиль", Профиль);
	ОткрытьФорму("Документ.ИС_WB_СборочноеЗадание.Форма.ФормаНастройкиЭтикетокСРазбиением",ПараметрыФормы , , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры //- ИнфоСофт Заварин К.В. 03.06.24 УА #70731

//+ ИнфоСофт Ивонин К.А. 28.08.24 УА #79743
&НаКлиенте
Процедура СписокСборочныхЗаданийВПоставкеПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.СписокСборочныхЗаданийВПоставке.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		КоличествоСборочныхЗаданийВПоставке = 0;
	Иначе
		КоличествоСборочныхЗаданийВПоставке = СписокСборочныхЗаданийВПоставке.Количество();
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.08.24 УА #79743

//+ ИнфоСофт Заварин К.В. 05.09.24 УА #79742
&НаКлиенте
Процедура ОтборОтправленийПриИзменении(Элемент)
	УстановитьОтборыОтправлений();
КонецПроцедуры //- ИнфоСофт Заварин К.В. 05.09.24 УА #79742

//+ ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
&НаКлиенте
Процедура ДатаПоследнегоСборочногоЗаданияПриИзменении(Элемент)
	ДатаПоследнегоОтправленияФБО = ДатаПоследнегоСборочногоЗадания;
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//+ ИнфоСофт Ивонин К.А. 13.07.22 УА #46999
&НаКлиенте
Процедура ЗагрузитьСборочныеЗадания(Команда)

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли; 
	
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	РеглРаботает = ПроверитьРегламетноеЗаданиеНаСервере(Профиль, "ПолучениеСборочныхЗаданий");
	
	Если Не РеглРаботает Тогда    
		
		ДлительнаяОперация = ЗагрузитьСборочныеЗаданияНаСервере(Профиль, ДатаПоследнегоСборочногоЗадания, УникальныйИдентификатор);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучениеЗаказовЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
		
		Элементы["КартинкаОжидание"].Видимость = Истина;		
		
		//ЗагрузитьСборочныеЗаданияНаСервере(Профиль, ДатаПоследнегоСборочногоЗадания);		
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Уже выполняется регламентное задание по загрузке заказов, обновите форму чуть позже");
	КонецЕсли;                                      
	//Элементы.Список.Обновить();
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.07.22 УА #46999 

//+ ИнфоСофт Ивонин К.А. 12.02.23 УА #53535
&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
		
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;   
	
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	РеглРаботает = ПроверитьРегламетноеЗаданиеНаСервере(Профиль, "ОбновлениеСтатусовСборочныхЗаданий");
	
	Если Не РеглРаботает Тогда    
		
		ДлительнаяОперация = ОбновитьСтатусыНаСервере(Профиль, УникальныйИдентификатор);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьСтатусыЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
		
		Элементы["КартинкаОжиданиеСтатусы"].Видимость = Истина;		
				
		//ОбновитьСтатусыНаСервере(Профиль);
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Уже выполняется регламентное задание по обновлению статусов, обновите форму чуть позже");
	КонецЕсли;                                      
	//Элементы.Список.Обновить();
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.02.23 УА #53535

//+ ИнфоСофт Заварин К.В. 06.05.24 УА #68658
&НаКлиенте
Процедура ОбновитьВыделенныеСтатусы(Команда)

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;

	РеглРаботает = ПроверитьРегламетноеЗаданиеНаСервере(Профиль, "ОбновлениеСтатусовСборочныхЗаданий");
	
	Если Не РеглРаботает Тогда  
		
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеСборочнымиЗаданиями Тогда
			
			ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
			Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
		Иначе
			Возврат;			
		КонецЕсли;
				
		ДлительнаяОперация = ОбновитьСтатусыНаСервере(Профиль, УникальныйИдентификатор, ВыделенныеСтроки);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьСтатусыЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
		
		Элементы["КартинкаОжиданиеВыделенныеСтатусы"].Видимость = Истина;		
						
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Уже выполняется регламентное задание по обновлению статусов, обновите форму чуть позже");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 06.05.24 УА #68658

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаКлиенте
Процедура ПечатьЛистаПодбора(Команда)
    
    Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеСборочнымиЗаданиями Тогда
    
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
		Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеПоставками Тогда
		
		ВыделенныеСтроки = Элементы.СписокПоставок.ВыделенныеСтроки;
			
		Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ВыделенныеСтроки = Новый Массив;
		
		Для Каждого Строка Из СписокСборочныхЗаданийВПоставке Цикл
			ВыделенныеСтроки.Добавить(Строка.СборочноеЗадание);	
		КонецЦикла;
						
		Если ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		Возврат;			
	КонецЕсли; 
		
	ПолучитьЭтикеткиСборочныхЗаданийНаСервере(Профиль);
		
	ТабДок = ПолучитьЛистПодбораНаСервере(ВыделенныеСтроки);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Лист Подбора WildBerries");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Лист Подбора WildBerries";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 20.03.23 УА #55822
&НаКлиенте
Процедура ПечатьЛистПодбораКомпактный(Команда)
   
    Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеСборочнымиЗаданиями Тогда
    
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
		Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеПоставками Тогда
		
		ВыделенныеСтроки = Элементы.СписокПоставок.ВыделенныеСтроки;
			
		Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ВыделенныеСтроки = Новый Массив;
		
		Для Каждого Строка Из СписокСборочныхЗаданийВПоставке Цикл
			ВыделенныеСтроки.Добавить(Строка.СборочноеЗадание);	
		КонецЦикла;
						
		Если ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		Возврат;			
	КонецЕсли; 
		
	ПолучитьЭтикеткиСборочныхЗаданийНаСервере(Профиль);
		
	ТабДок = ПолучитьЛистПодбораКомпактныйНаСервере(ВыделенныеСтроки);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Лист Подбора WildBerries");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Лист Подбора WildBerries";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.03.23 УА #55822

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаКлиенте
Процедура ПечатьЭтикеток(Команда)

	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеСборочнымиЗаданиями Тогда
    
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
		Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеПоставками Тогда
		
		ВыделенныеСтроки = Элементы.СписокПоставок.ВыделенныеСтроки;
			
		Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ВыделенныеСтроки = Новый Массив;
		
		Для Каждого Строка Из СписокСборочныхЗаданийВПоставке Цикл
			ВыделенныеСтроки.Добавить(Строка.СборочноеЗадание);	
		КонецЦикла;
						
		Если ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		Возврат;			
	КонецЕсли;
	
	ВыделенныеСтроки = УдалитьНедопустимыеТипыЭтикеток(ВыделенныеСтроки);
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет доступных заказов для печати этикеток");
		Возврат;
	КонецЕсли;
			
	ПолучитьЭтикеткиСборочныхЗаданийНаСервере(Профиль);
		
	ТабДок = ПолучитьЭтикеткиНаСервере(ВыделенныеСтроки);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Этикетки WildBerries");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Этикетки WildBerries";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаКлиенте
Процедура ПечатьШтрихкодов(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеСборочнымиЗаданиями Тогда
    
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
		Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеПоставками Тогда
		
		ВыделенныеСтроки = Элементы.СписокПоставок.ВыделенныеСтроки;
			
		Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ВыделенныеСтроки = Новый Массив;
		
		Для Каждого Строка Из СписокСборочныхЗаданийВПоставке Цикл
			ВыделенныеСтроки.Добавить(Строка.СборочноеЗадание);	
		КонецЦикла;
						
		Если ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		Возврат;			
	КонецЕсли;
 
		
	ПолучитьЭтикеткиСборочныхЗаданийНаСервере(Профиль);
		
	ТабДок = ПолучитьШтрихкодовНаСервере(ВыделенныеСтроки);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Штрихкоды WildBerries");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Штрихкоды WildBerries";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 14.02.23 УА #53535
&НаКлиенте
Процедура ПечатьQRПоставки(Команда)
	
	ВыделенныеСтроки = Элементы.СписокПоставок.ВыделенныеСтроки;
			
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Новый Массив;
	
	ТабДок = ПолучитьQRПоставкиНаСервере();
	
	Если ТабДок = Неопределено Тогда 
		Возврат;
	КонецЕсли;		

	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("QR поставки WildBerries");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "QR поставки WildBerries";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.02.23 УА #53535

//+ ИнфоСофт Заварин К.В. 27.06.24 УА #69703
&НаКлиенте
Процедура ПечатьQRКороба(Команда)
	ВыделенныеСтроки = Элементы.СписокПоставок.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Новый Массив;
	
	ТабДок = ПолучитьQRКоробаНаСервере();
	
	Если ТабДок = Неопределено Тогда 
		Возврат;
	КонецЕсли;		
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("QR Короба WildBerries");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "QR Короба WildBerries";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 27.06.24 УА #69703

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаКлиенте
Процедура СоздатьЗаказы(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
	 	ОбщегоНазначенияКлиент.СообщитьПользователю(
	 		"Для созданием заказа нужно выделить необходимые сборочные задания");
		Возврат;
	КонецЕсли;
	
	СоздатьЗаказыНаСервере(); 
	Элементы.Список.Обновить();

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 21.02.23 УА #53535
&НаКлиенте
Процедура СоздатьРеализации(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
	 	ОбщегоНазначенияКлиент.СообщитьПользователю(
	 		//+ ИнфоСофт Власова И.С. 07.02.25 УА #92584
	 		//"Для созданием реализаций нужно выделить необходимые сборочные задания");
			"Для создания реализаций нужно выделить необходимые сборочные задания");
			//- ИнфоСофт Власова И.С. 07.02.25 УА #92584
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 07.02.25 УА #92584
	//СоздатьРеализацииНаСервере(); 
	//Элементы.Список.Обновить();
	
	РеглРаботает = Ложь;
	
	ФункциональныеОпции = ПолучитьФункциональныеОпции(Профиль);
	
	Если ФункциональныеОпции.АвтоматическиСоздаватьРеализации И ФункциональныеОпции.РежимСозданияЗаказов <> 2 Тогда
		РеглРаботает = ПроверитьРегламетноеЗаданиеНаСервере(Профиль, "ПолучитьСписокСборочныхЗаданий");
	КонецЕсли;
	
	Если Не РеглРаботает Тогда
			
		ДлительнаяОперация = СоздатьРеализацииНаСервере(Профиль, УникальныйИдентификатор, ВыделенныеСтроки);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("СоздатьРеализацииЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
		
		Элементы["КартинкаОжиданиеРеализации"].Видимость = Истина;
	
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Уже выполняется регламентное задание по загрузке заказов и созданию реализаций, обновите форму чуть позже");
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 07.02.25 УА #92584
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 15.02.23 УА #53535
&НаКлиенте
Процедура ПрикрепитьКПоставке(Команда)

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
	 	ОбщегоНазначенияКлиент.СообщитьПользователю(
	 		"Перед прикреплением к поставке нужно выделить необходимые сборочные задания");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = УдалитьНедопустимыеТипыДоставки(ВыделенныеСтроки);
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("В выделенном списке нет заказов схемы FBS");
		Возврат;	
	КонецЕсли;
	
	ТипТовара = ПроверитьВозможностьПрикрепления(ВыделенныеСтроки);
	
	Если ТипТовара = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивТиповТовара = Новый Массив;
	МассивТиповТовара.Добавить(ТипТовара);
	МассивТиповТовара.Добавить(ПредопределенноеЗначение("Перечисление.ИС_ВБ_ТипыТоваров.ПустаяСсылка"));
	
	ПараметрыОтбора = Новый Структура("Профиль", Профиль);
	ПараметрыОтбора.Вставить("ТипТовара", МассивТиповТовара);
	ПараметрыОтбора.Вставить("done", Ложь);
	ПараметрыОтбора.Вставить("ПометкаУдаления", Ложь);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.ИС_ВБ_ПоставкиFBS.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 15.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 22.03.23 УА #55822
&НаКлиенте
Процедура ПрикрепитьКиЗы(Команда)
    
    ОчиститьСообщения();
    
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
	 	ОбщегоНазначенияКлиент.СообщитьПользователю(
	 		"Для прикрепления КиЗов нужно выделить необходимые сборочные задания");
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Сумин Д.В. 07.09.2023 УА #61972
    ВыделенныеСтроки = ПолучитьЗаказыМаркированногоТовара(ВыделенныеСтроки);
	
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
	 	ОбщегоНазначенияКлиент.СообщитьПользователю(
	 		"В выделенных строках не найден маркированный товар.");
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Сумин Д.В. 07.09.2023 УА #61972
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Профиль", Профиль);
	ПараметрыФормы.Вставить("СборочныеЗадания", ВыделенныеСтроки);
	
	ОткрытьФорму("Документ.ИС_WB_СборочноеЗадание.Форма.ФормаКиЗов", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.03.23 УА #55822

//+ ИнфоСофт Ивонин К.А. 07.05.23 УА #58360
&НаКлиенте
Процедура ДействияНадСборочнымиЗаданиями(Команда)

	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ОткрытьФорму("Документ.ИС_WB_СборочноеЗадание.Форма.ФормаНастроекОчистки", , ЭтотОбъект, , , , 
		Новый ОписаниеОповещения("ДействияНадСборочнымиЗаданиямиЗавершение", ЭтотОбъект));

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.05.23 УА #58360

//+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
&НаКлиенте
Процедура ВыводПамяткиПоРедактированиюМакета(Команда)
	ТабДок = ВыводПамяткиПоРедактированиюМакетаНаСервере(); 
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Памятка редактирования макета");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Памятка редактирования макета";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816

//+ ИнфоСофт Заварин К.В. 13.11.24 УА #85881
&НаКлиенте
Процедура ПометитьНаУдалениеПривязанныеДокументы(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
	 	ОбщегоНазначенияКлиент.СообщитьПользователю(
	 		"Для пометки на удаление нужно выделить необходимые сборочные задания");
		Возврат;
	КонецЕсли;
	
	ПометитьНаУдалениеПривязанныеДокументыНаСервере();
	Элементы.Список.Обновить();	
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Документы успешно помечены на удаление");
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.11.24 УА #85881

//+ ИнфоСофт Конышев А.Е. 28.11.24 УА #72929
&НаКлиенте
Процедура ОткрытьФормуУдалениеСборочныхЗаданий(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Профиль", Профиль);
	
	ОткрытьФорму("Документ.ИС_WB_СборочноеЗадание.Форма.ФормаУдалениеСборочныхЗаданий", ПараметрыФормы, ЭтотОбъект, , , , 
		Новый ОписаниеОповещения("ОткрытьФормуУдалениеСборочныхЗаданийЗавершение", ЭтотОбъект));	
		
КонецПроцедуры //- ИнфоСофт Конышев А.Е. 28.11.24 УА #72929

//+ ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168
&НаКлиенте
Процедура ОткрытьФормуНастройкиЛистаПодбора(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Профиль", Профиль);
	ОткрытьФорму("Документ.ИС_WB_СборочноеЗадание.Форма.ФормаНастройкиЛистаПодбора",ПараметрыФормы , , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
&НаКлиенте
Асинх Процедура ПеревестиНаСборку(Команда)
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх(НСтр("ru = 'Уверены что хотите перевести на сборку выбранные заказы?'"), Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
    	Возврат;
	КонецЕсли;
	
	ПеревестиЗаказыНаСборку(Профиль, ВыделенныеСтроки);
	ОбщегоНазначенияКлиент.СообщитьПользователю("Операция завершена");
	Элементы.Список.Обновить();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 10.04.25 УА #96894
&НаКлиенте
Асинх Процедура ПеревестиВДоставку(Команда)
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх(НСтр("ru = 'Уверены что хотите перевести в доставку выбранные заказы?'"), Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
    	Возврат;
	КонецЕсли;
	
	ПеревестиЗаказыВДоставку(Профиль, ВыделенныеСтроки);
	ОбщегоНазначенияКлиент.СообщитьПользователю("Операция завершена");
	Элементы.Список.Обновить();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 10.04.25 УА #96894
&НаКлиенте
Асинх Процедура ГотовКВыдаче(Команда)
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх(НСтр("ru = 'Уверены что хотите подтвердить готовность к выдаче выбранных заказов?'"), Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
    	Возврат;
	КонецЕсли;
	
	ПодтвердитьГотовностьКВыдачеЗаказов(Профиль, ВыделенныеСтроки);
	ОбщегоНазначенияКлиент.СообщитьПользователю("Операция завершена");
	Элементы.Список.Обновить();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 10.04.25 УА #96894
&НаКлиенте
Процедура ПокупательПринял(Команда)
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыделенныеСтроки.Количество() > 1 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для данного действия необходимо выбрать один заказ");
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные.ТипДоставки = ПредопределенноеЗначение("Перечисление.ИС_ВБ_ТипыДоставки.CnC") Тогда
		ПодтвердитьВыдачуЗаказаCnC(Профиль, ТекДанные.Номер);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Операция завершена");
		Элементы.Список.Обновить();
	КонецЕсли;
	
	Если ТекДанные.ТипДоставки = ПредопределенноеЗначение("Перечисление.ИС_ВБ_ТипыДоставки.DBS")
			Или ТекДанные.ТипДоставки = ПредопределенноеЗначение("Перечисление.ИС_ВБ_ТипыДоставки.EDBS") Тогда
			
		ДопПараметры = Новый Структура("Номер", ТекДанные.Номер);
		Оповещение = Новый ОписаниеОповещения("ПокупательПринялЗавершение", ЭтотОбъект, ДопПараметры);
		ПоказатьВводСтроки(Оповещение, "", "Введите код подтверждения");
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 10.04.25 УА #96894
&НаКлиенте
Процедура ПокупательОтказался(Команда)
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыделенныеСтроки.Количество() > 1 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для данного действия необходимо выбрать один заказ");
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные.ТипДоставки = ПредопределенноеЗначение("Перечисление.ИС_ВБ_ТипыДоставки.CnC") Тогда
		ПодтвердитьОтказОтЗаказаCnC(Профиль, ТекДанные.Номер);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Операция завершена");
		Элементы.Список.Обновить();
	КонецЕсли;
	
	Если ТекДанные.ТипДоставки = ПредопределенноеЗначение("Перечисление.ИС_ВБ_ТипыДоставки.DBS")
			Или ТекДанные.ТипДоставки = ПредопределенноеЗначение("Перечисление.ИС_ВБ_ТипыДоставки.EDBS") Тогда
			
		ДопПараметры = Новый Структура("Номер", ТекДанные.Номер);
		Оповещение = Новый ОписаниеОповещения("ПокупательОтказалсяЗавершение", ЭтотОбъект, ДопПараметры);
		ПоказатьВводСтроки(Оповещение, "", "Введите код подтверждения");
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
&НаКлиенте
Асинх Процедура ОтменитьЗаказ(Команда)
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх(НСтр("ru = 'Уверены что хотите отменить выбранные заказы?'"), Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
    	Возврат;	
	КонецЕсли;
	
	ОтменитьЗаказы(Профиль, ВыделенныеСтроки);
	ОбщегоНазначенияКлиент.СообщитьПользователю("Операция завершена");
	Элементы.Список.Обновить();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Стояк Ю.К. 23.11.2024 УА #86844
&НаКлиенте
Процедура ПечатьЛистПодбораКомпактныйАльтернативный(Команда)
   
    Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеСборочнымиЗаданиями Тогда
    
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
		Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеПоставками Тогда
		
		ВыделенныеСтроки = Элементы.СписокПоставок.ВыделенныеСтроки;
			
		Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ВыделенныеСтроки = Новый Массив;
		
		Для Каждого Строка Из СписокСборочныхЗаданийВПоставке Цикл
			ВыделенныеСтроки.Добавить(Строка.СборочноеЗадание);	
		КонецЦикла;
						
		Если ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		Возврат;			
	КонецЕсли; 
		
	ПолучитьЭтикеткиСборочныхЗаданийНаСервере(Профиль);
		
	ТабДок = ПолучитьЛистПодбораКомпактныйАльтертативныйНаСервере(ВыделенныеСтроки);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Лист Подбора WildBerries");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Лист Подбора WildBerries";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 23.11.2024 УА #86844

//+ ИнфоСофт Стояк Ю.К. 21.11.2024 УА #87826
&НаКлиенте
Процедура ПечатьЭтикеткиЗоныСборки(Команда) 
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеСборочнымиЗаданиями Тогда
    
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
		Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
				
	Иначе
		Возврат;			
	КонецЕсли;
	
	ТабДок = ПечатьЭтикеткиЗоныСборкиНаСервере(ВыделенныеСтроки);    
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Этикетки зоны сборки");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Этикетки зоны сборки";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.11.2024 УА #87826

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 01.08.2024 УА #76396
&НаКлиенте
Процедура ПоказатьВопросЗавершениеИзмененияПоставки(Результат, Объект) Экспорт
	ПараметрыОткрытия = Новый Структура("Профиль", Профиль);
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("Документ.ИС_WB_УпаковкаТоваров.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтотОбъект);	
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда		
		ОткрытьФорму("Документ.ИС_WB_СборочноеЗадание.Форма.ФормаУпаковкиТоваров", ПараметрыОткрытия, ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.08.2024 УА #76396

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаКлиенте
Процедура ПрименитьНастройкиПрофиля()
	
	Если ЗначениеЗаполнено(Профиль) Тогда		
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469		
		//ПолучитьДатуПоследнегоСборочногоЗадания(Профиль, ДатаПоследнегоОтправления);
		ПолучитьДатуПоследнегоСборочногоЗадания(Профиль, ДатаПоследнегоСборочногоЗадания, ДатаПоследнегоОтправленияФБО);
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	КонецЕсли; 
		
	Список.Параметры.УстановитьЗначениеПараметра("Профиль", Профиль);
	СписокПоставок.Параметры.УстановитьЗначениеПараметра("Профиль", Профиль);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 13.07.22 УА #46999
&НаСервереБезКонтекста                      
Функция ЗагрузитьСборочныеЗаданияНаСервере(Профиль, ДатаПоследнегоСборочногоЗадания, УникальныйИдентификатор)
	
	Если ДатаПоследнегоСборочногоЗадания = Дата(1, 1, 1) Тогда
		ДатаПоследнегоСборочногоЗадания = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
		"ИС_ВБ_Сервер.ВыполнитьЗагрузкуЗаказов", Профиль, ДатаПоследнегоСборочногоЗадания + 1);
		
	//ИС_WB_Сервер.ПолучитьСписокСборочныхЗаданий(Профиль, ДатаПоследнегоСборочногоЗадания + 1);
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
&НаСервереБезКонтекста
//+ ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
//Процедура ПолучитьДатуПоследнегоСборочногоЗадания(Профиль, Дата)
Процедура ПолучитьДатуПоследнегоСборочногоЗадания(Профиль, Дата, ДатаФБО)
//- ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_WB_СборочноеЗадание.Дата КАК Дата
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Дата = Выборка.Дата;
	Иначе
		Дата = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;  
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

//+ ИнфоСофт Заварин К.В. 06.05.24 УА #68658
&НаСервереБезКонтекста
//+ ИнфоСофт Ивонин К.А. 12.02.23 УА #53535
//Функция ОбновитьСтатусыНаСервере(Профиль, УникальныйИдентификатор)   
Функция ОбновитьСтатусыНаСервере(Профиль, УникальныйИдентификатор, ВыделенныеСтроки = Неопределено)  
//- ИнфоСофт Заварин К.В. 06.05.24 УА #68658
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800         
	ФукнциональныеОпции = ИС_WB_СерверПовтИсп.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	АктивныйЗаказКлиента = ИС_WB_Сервер.ПолучитьАктивныйЗаказКлиента(Профиль);
	
	Если АктивныйЗаказКлиента <> Неопределено Тогда	
		ФукнциональныеОпции.Вставить("АктивныйЗаказКлиента", АктивныйЗаказКлиента);	
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	
	Если ФукнциональныеОпции.КоличествоДнейОбновлениеСтатусов = 0 Тогда
		Период = 30 * 86400;
	Иначе
		Период = ФукнциональныеОпции.КоличествоДнейОбновлениеСтатусов * 86400;
	КонецЕсли;  
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	//+ ИнфоСофт Заварин К.В. 06.05.24 УА #68658
	//Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
	//"ИС_WB_Сервер.ОбновитьСтатусыСборочныхЗаданий", Профиль, , Период);
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
		"ИС_ВБ_Сервер.ОбновитьСтатусыЗаказов", Профиль, ВыделенныеСтроки, Период);
	//- ИнфоСофт Заварин К.В. 06.05.24 УА #68658
		
	//ИС_WB_Сервер.ОбновитьСтатусыСборочныхЗаданий(Профиль);
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	
КонецФункции //- ИнфоСофт Ивонин К.А. 12.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаСервереБезКонтекста   
Процедура ПолучитьЭтикеткиСборочныхЗаданийНаСервере(Профиль)
	ИС_WB_Сервер.ПолучитьЭтикеткиСборочныхЗаданий(Профиль);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

//+ ИнфоСофт Стояк Ю.К. 09.02.2025 УА #77168
//Тело функции пркатически полностью заменено переносом доработок из УНФ3, старые комментарии удалены 
//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаСервере
Функция ПолучитьЛистПодбораНаСервере(ВыделенныеСтроки)

	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_WB_ПечатьЛистаПодбора";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина; 
		
	ТабДок.ПолеСправа = 7;	
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_ЛистПодбора");
		
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить("ПечататьНомерСтроки");       
	МассивЗначений.Добавить("ПечататьНомерСборочного"); 
	МассивЗначений.Добавить("ПечататьНомерЗаказа"); 	
	МассивЗначений.Добавить("ПечататьНомерРеализации");   	
	МассивЗначений.Добавить("ПечататьБренд");               
	МассивЗначений.Добавить("ПечататьНазвание");	    
	МассивЗначений.Добавить("ПечататьРазмер");
	МассивЗначений.Добавить("ПечататьЦвет");
	МассивЗначений.Добавить("ПечататьАртикулВБ");
	МассивЗначений.Добавить("ПечататьАртикулПоставщика");
	МассивЗначений.Добавить("ПечататьАртикул1С");
	МассивЗначений.Добавить("ПечататьQR");	  		
	МассивЗначений.Добавить("ПечататьШтрихкод");
	МассивЗначений.Добавить("ПечататьКоличество");   	
	МассивЗначений.Добавить("ПечататьФото");
	
	НастройкиПечати = ИС_МП_Печать.ПолучитьНастройкиПечатиЛистаПодбора(Профиль, МассивЗначений, Перечисления.ИС_МП_Маркетплейсы.ВБ);	
	
	ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка|ОсновнойЛист");

	
	ОбластьШапка.Параметры.Дата = ТекущаяДатаСеанса();
	ОбластьШапка.Параметры.Профиль = Профиль;   
		
	Если ЗначениеЗаполнено(СортировкаПечати) Тогда	
		ОбластьШапка.Параметры.Сорт = Элементы.СортировкаПечати.СписокВыбора.НайтиПоЗначению(СортировкаПечати).Представление;
	Иначе
		СортировкаПечати = "Код";
		ОбластьШапка.Параметры.Сорт = Элементы.СортировкаПечати.СписокВыбора.НайтиПоЗначению(СортировкаПечати).Представление;
	КонецЕсли;                                  		
	
	Табдок.Вывести(ОбластьШапка);
		
	ИС_МП_Печать.ЗаполнитьШапкуТаблицыЛистаПодбора(Табдок, МакетОбработки, НастройкиПечати, МассивЗначений);  
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.waiting);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sorted);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sold);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ready_for_pickup);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.postponed_delivery);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_WB_ХарактеристикиКатегорий.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Бренд
	|ИЗ
	|	Справочник.ИС_WB_ХарактеристикиКатегорий КАК ИС_WB_ХарактеристикиКатегорий
	|ГДЕ
	|	ИС_WB_ХарактеристикиКатегорий.Наименование = ""Бренд""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_WB_ХарактеристикиКатегорий.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Цвет
	|ИЗ
	|	Справочник.ИС_WB_ХарактеристикиКатегорий КАК ИС_WB_ХарактеристикиКатегорий
	|ГДЕ
	|	ИС_WB_ХарактеристикиКатегорий.Наименование = ""Цвет""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ПередачаТоваровХранителюТовары.Ссылка.Номер КАК НомерРеализации
	|ПОМЕСТИТЬ ВТ_РТУ
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО (ИС_WB_СборочноеЗадание.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента)
	|			И (НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|	И ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка,
	|	РеализацияТоваровУслугТовары.Ссылка.Номер
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ИС_WB_СборочноеЗадание.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
	|			И (НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|	И ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
	|;
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер,
	|	ИС_WB_СборочноеЗадание.Дата КАК Дата,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_НоменклатураХарактеристикиБренд.Значение, """")) КАК Бренд,
	|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Характеристика) КАК Характеристика,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код КАК Код,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode КАК vendorCode,
	|	ЕСТЬNULL(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partA, """") КАК partA,
	|	ЕСТЬNULL(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partB, """") КАК partB,
	|	ЕСТЬNULL(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.barcode, """") КАК barcode,
	|	ИС_WB_СборочноеЗадание.РазмерWB.techSize КАК techSize,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_НоменклатураХарактеристикиЦвет.Значение, """")) КАК Цвет,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_ШтрихкодыРазмеров.Штрихкод, """")) КАК Штрихкод,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ИС_WB_СборочноеЗадание.Заказ.Номер КАК НомерЗаказа,
	|	ВЫБОР
	|		КОГДА ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ МИНИМУМ(ВТ_РТУ.НомерРеализации)
	|	КОНЕЦ КАК НомерРеализации
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_Номенклатура.Характеристики КАК ИС_WB_НоменклатураХарактеристикиБренд
	|		ПО ИС_WB_СборочноеЗадание.НоменклатураWB = ИС_WB_НоменклатураХарактеристикиБренд.Ссылка
	|			И (ИС_WB_НоменклатураХарактеристикиБренд.Поле В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Бренд КАК ВТ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_Номенклатура.Характеристики КАК ИС_WB_НоменклатураХарактеристикиЦвет
	|		ПО ИС_WB_СборочноеЗадание.НоменклатураWB = ИС_WB_НоменклатураХарактеристикиЦвет.Ссылка
	|			И (ИС_WB_НоменклатураХарактеристикиЦвет.Поле В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Цвет КАК ВТ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_WB_СборочноеЗадание.skus КАК ИС_WB_СборочноеЗаданиеskus
	|		ПО ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СборочноеЗаданиеskus.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ КАК ВТ_РТУ
	|		ПО ИС_WB_СборочноеЗадание.Ссылка = ВТ_РТУ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО (ИС_WB_ШтрихкодыРазмеров.Размер = ИС_WB_СборочноеЗадание.РазмерWB)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
	|	И ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB В(&Статусы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_СборочноеЗадание.Номер,
	|	ИС_WB_СборочноеЗадание.Дата,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode,
	|	ЕСТЬNULL(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partA, """"),
	|	ЕСТЬNULL(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partB, """"),
	|	ЕСТЬNULL(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.barcode, """"),
	|	ИС_WB_СборочноеЗадание.РазмерWB.techSize,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Артикул,
	|	ИС_WB_СборочноеЗадание.Заказ.Номер,
	|	ИС_WB_СборочноеЗадание.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номер КАК НомерЗадания,
	|	ВТ.Дата КАК Дата,
	|	ВТ.Бренд КАК Бренд,
	|	ЕСТЬNULL(ВТ.Номенклатура, ""Отсутствует"") КАК Номенклатура,
	|	ЕСТЬNULL(ВТ.Характеристика, ""Сопоставление"") КАК Характеристика,
	|	ВТ.Код КАК Код,
	|	ВТ.vendorCode КАК Артикул,
	|	ВТ.partA КАК partA,
	|	ВТ.partB КАК partB,
	|	ВТ.barcode КАК barcode,
	|	ВТ.techSize КАК Размер,
	|	ВТ.Цвет КАК Цвет,
	|	ВТ.Штрихкод КАК Штрихкод,
	|	ЕСТЬNULL(ВТ.Номенклатура.Наименование, """") КАК Наименование,
	|	ВТ.Номенклатура.ФайлКартинки КАК ФайлКартинки,
	|	ВТ.НоменклатураАртикул КАК Артикул1С,
	|	ВТ.НомерЗаказа КАК НомерЗаказа,
	|	ВТ.НомерРеализации КАК НомерРеализации
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	%1";
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, ?(СортировкаПечати = "Наименование", "Наименование, Характеристика, Номер, Цвет, Код", СортировкаПечати));
	
	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки); 
		
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать лист подбора");
		Возврат Табдок;	
	КонецЕсли;
		
	ОбластьСтроки = МакетОбработки.ПолучитьОбласть("ДанныеСтроки");
	
	Эталон = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.Эталон"); 
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
					
	Выборка = РезультатЗапроса.Выбрать();
	
	ВысотаОбластей = Табдок.ВысотаТаблицы;
		
	Если ВыводитьКомплектующие Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ВТ.НомерЗадания КАК НомерЗадания,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.Характеристика КАК Характеристика,
		|	ВТ.partA КАК partA,
		|	ВТ.partB КАК partB,
		|	ВТ.barcode КАК barcode
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.НомерЗадания КАК НомерЗадания,
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.Характеристика КАК Характеристика,
		|	ВТ_Номенклатура.partA КАК partA,
		|	ВТ_Номенклатура.partB КАК partB,
		|	ВТ_Номенклатура.barcode КАК barcode,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК НоменклатураНабора,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК ХарактеристикаНабора,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_СоставНаборов
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ПО ВТ_Номенклатура.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
		|			И ВТ_Номенклатура.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СоставНаборов.НомерЗадания КАК НомерЗадания,
		|	ВТ_СоставНаборов.Номенклатура КАК Номенклатура,
		|	ВТ_СоставНаборов.Характеристика КАК Характеристика,
		|	ВТ_СоставНаборов.partA КАК partA,
		|	ВТ_СоставНаборов.partB КАК partB,
		|	ВТ_СоставНаборов.barcode КАК barcode,
		|	ВТ_СоставНаборов.НоменклатураНабора КАК НоменклатураНабора,
		|	ВТ_СоставНаборов.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ВТ_СоставНаборов.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТ_СоставНаборов.НоменклатураНабора.ФайлКартинки КАК ФайлКартинки,
		|	ВТ_СоставНаборов.НоменклатураНабора.Марка КАК Бренд,
		|	ВТ_СоставНаборов.НоменклатураНабора.Артикул КАК Артикул
		|ИЗ
		|	ВТ_СоставНаборов КАК ВТ_СоставНаборов
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_СоставНаборов.НоменклатураНабора.Наименование";		  
		
		Запрос.УстановитьПараметр("ВТ", РезультатЗапроса.Выгрузить());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыгрузкаНаборы = РезультатЗапроса.Выгрузить(); 
		
	КонецЕсли;
	
	НомерСтроки = 0;
	
	Пока Выборка.Следующий() Цикл  
		
		ОбластьВыведена = Ложь; 
		
		Для Каждого Параметр Из МассивЗначений Цикл
			
			Если НастройкиПечати[Параметр] Тогда
				
				ОбластьСтроки = МакетОбработки.ПолучитьОбласть("ДанныеСтроки|" + Сред(Параметр, 9));
				
				ЗаполнитьЗначенияСвойств(ОбластьСтроки.Параметры, Выборка);
				
				Если Параметр = "ПечататьНомерСтроки" Тогда             
					НомерСтроки = НомерСтроки + 1;
					ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;						
				КонецЕсли;
				
				Если Параметр = "ПечататьНазвание" Тогда
					ОбластьСтроки.Параметры.Название = СтрШаблон("%1 %2", Выборка.Номенклатура, Выборка.Характеристика);	
				КонецЕсли; 
				
				Если Параметр = "ПечататьАртикулВБ" Тогда
					ОбластьСтроки.Параметры.АртикулWB = Формат(Выборка.Код, "ЧГ=");	
				КонецЕсли; 
				
				Если Параметр = "ПечататьQR" Тогда
					
					Размер = Окр(ОбластьСтроки.Рисунки.КартинкаQR.Ширина / КоличествоМиллиметровВПикселе);					
					ДвоичныеДанныеКартинки = ИС_MP_ГенерацияШтрихкода.ДанныеQRКода(Выборка.barcode, 0, Размер);					
					ОбластьСтроки.Рисунки.КартинкаQR.Картинка = Новый Картинка(ДвоичныеДанныеКартинки); 
					
				КонецЕсли;
				
				Если Параметр = "ПечататьШтрихкод" Тогда
					
					ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
					
					ПараметрыШК.Ширина = Окр(ОбластьСтроки.Рисунки.КартинкаШК.Ширина / КоличествоМиллиметровВПикселе);
					ПараметрыШК.Высота = Окр(ОбластьСтроки.Рисунки.КартинкаШК.Высота / КоличествоМиллиметровВПикселе);
					ПараметрыШК.РазмерШрифта = 10;
					ПараметрыШК.Штрихкод = Выборка.Штрихкод;
					ПараметрыШК.Масштабировать = Истина;
					ПараметрыШК.СохранятьПропорции = Истина;
					ПараметрыШК.ВертикальноеВыравнивание = 2; 
					
					СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
					
					Если СтруктураКартинки.Результат Тогда	
						ОбластьСтроки.Рисунки.КартинкаШК.Картинка = СтруктураКартинки.Картинка;
					КонецЕсли; 
					
				КонецЕсли;
				
				Если Параметр = "ПечататьФото" И ЗначениеЗаполнено(Выборка.ФайлКартинки) Тогда
					ОбластьСтроки.Рисунки.КартинкаТовара.Картинка = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.ФайлКартинки));
				КонецЕсли;
				
				//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
				Если Не ТабДок.ПроверитьВывод(ОбластьСтроки) Тогда 					
					Табдок.ВывестиГоризонтальныйРазделительСтраниц();					
				КонецЕсли;
				//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
				
				Если ОбластьВыведена Тогда
					ТабДок.Присоединить(ОбластьСтроки);	
				Иначе  
					ТабДок.Вывести(ОбластьСтроки);
					ВысотаОбластей = ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы;
					ОбластьВыведена = Истина;
				КонецЕсли; 
				
				//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648				
				//Если ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы >= 102 Тогда 					
				//	Табдок.ВывестиГоризонтальныйРазделительСтраниц();
				//	ВысотаОбластей = 0;
				//КонецЕсли;                                  
				//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВыводитьКомплектующие И ВыгрузкаНаборы.Количество() > 0 Тогда                    
			
			ОбластьСтроки = МакетОбработки.ПолучитьОбласть("ДанныеСтрокиНабора|ОсновнойЛист");
			
			НайденныеСтроки = ВыгрузкаНаборы.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Выборка.Номенклатура, Выборка.Характеристика));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Для Каждого Строка Из НайденныеСтроки Цикл
					
					ОбластьВыведена = Ложь; 
					
					Для Каждого Параметр Из МассивЗначений Цикл
						
						Если НастройкиПечати[Параметр] Тогда
							
							ОбластьСтроки = МакетОбработки.ПолучитьОбласть("ДанныеСтроки|" + Сред(Параметр, 9));
							
							ЗаполнитьЗначенияСвойств(ОбластьСтроки.Параметры, Строка);  
							
							Если Параметр = "ПечататьНазвание" Тогда
								ОбластьСтроки.Параметры.Название     = СтрШаблон("Комплектующая набора: %1 %2 в количестве %3", Строка.НоменклатураНабора, Строка.ХарактеристикаНабора, Строка.КоличествоУпаковок);
							КонецЕсли; 
							
							Если Параметр = "ПечататьQR" Тогда								
								ОбластьСтроки.Рисунки.КартинкаQRНабор.Картинка = Новый Картинка(ДвоичныеДанныеКартинки); 								
							КонецЕсли;
														
							Если Параметр = "ПечататьФото" И ЗначениеЗаполнено(Строка.ФайлКартинки) Тогда								
								ОбластьСтроки.Рисунки.КартинкаТовараНабор.Картинка = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(Строка.ФайлКартинки));								
							КонецЕсли;
							
							//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
							Если Не ТабДок.ПроверитьВывод(ОбластьСтроки) Тогда 					
								Табдок.ВывестиГоризонтальныйРазделительСтраниц();								
							КонецЕсли;
							//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
							
							Если ОбластьВыведена Тогда
								ТабДок.Присоединить(ОбластьСтроки);	
							Иначе  
								ТабДок.Вывести(ОбластьСтроки);
								ВысотаОбластей = ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы;
								ОбластьВыведена = Истина;
							КонецЕсли; 
							
							//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648							
							//Если ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы >= 104 Тогда 					
							//	Табдок.ВывестиГоризонтальныйРазделительСтраниц();
							//	ВысотаОбластей = 0;
							//КонецЕсли;                                  
							//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
							
						КонецЕсли;
						
					КонецЦикла;
																							 					
					ВыгрузкаНаборы.Удалить(Строка);
					
				КонецЦикла;
				
			КонецЕсли; 
						
		КонецЕсли;				
			
	КонецЦикла;    
	
	Возврат Табдок;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 09.02.2025 УА #77168

//+ ИнфоСофт Стояк Ю.К. 09.02.2025 УА #77168
//Тело функции пркатически полностью заменено переносом доработок из УНФ3, старые комментарии удалены 
//+ ИнфоСофт Ивонин К.А. 20.03.23 УА #55822
&НаСервере
Функция ПолучитьЛистПодбораКомпактныйНаСервере(ВыделенныеСтроки)
	
	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_WB_ПечатьЛистаПодбораКомпактный";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	Табдок.ОтображатьСетку = Истина;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_ЛистПодбораКомпактный");
	
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить("ПечататьНомерРеализации");   	              
	МассивЗначений.Добавить("ПечататьНазвание");	    
	МассивЗначений.Добавить("ПечататьРазмер");
	МассивЗначений.Добавить("ПечататьАртикулВБ");
	МассивЗначений.Добавить("ПечататьАртикул1С");
	МассивЗначений.Добавить("ПечататьQR");	  		
	МассивЗначений.Добавить("ПечататьШтрихкод");
	МассивЗначений.Добавить("ПечататьКоличество");   	
	
	НастройкиПечати = ИС_МП_Печать.ПолучитьНастройкиПечатиЛистаПодбора(Профиль, МассивЗначений, Перечисления.ИС_МП_Маркетплейсы.ВБ);	
	ОбластьРазделитель = МакетОбработки.ПолучитьОбласть("Разделитель|ОсновныеДанные");
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.waiting);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sorted);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sold);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ready_for_pickup);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.postponed_delivery);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ПередачаТоваровХранителюТовары.Ссылка.Номер КАК НомерРеализации
	|ПОМЕСТИТЬ ВТ_РТУ
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО (ИС_WB_СборочноеЗадание.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента)
	|			И (НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|	И ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка,
	|	РеализацияТоваровУслугТовары.Ссылка.Номер
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ИС_WB_СборочноеЗадание.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
	|			И (НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|	И ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер,
	|	ИС_WB_СборочноеЗадание.Дата КАК Дата,
	|	ИС_WB_СборочноеЗадание.Ссылка КАК ЗаказКлиента,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код КАК Код,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode КАК vendorCode,
	|	ИС_WB_СоответствиеРазмеров.РазмерWB.Владелец.Наименование КАК Наименование,
	|	ЕСТЬNULL(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partA, """") КАК partA,
	|	ЕСТЬNULL(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partB, """") КАК partB,
	|	ИС_WB_СборочноеЗадание.РазмерWB.techSize КАК techSize,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_ШтрихкодыРазмеров.Штрихкод, """")) КАК Штрихкод,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ВЫБОР
	|		КОГДА ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ МИНИМУМ(ВТ_РТУ.НомерРеализации)
	|	КОНЕЦ КАК НомерРеализации,
	|	ИС_WB_СборочноеЗадание.Склад.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB)	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_WB_СборочноеЗадание.skus КАК ИС_WB_СборочноеЗаданиеskus
	|		ПО (ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СборочноеЗаданиеskus.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ КАК ВТ_РТУ
	|		ПО ИС_WB_СборочноеЗадание.Ссылка = ВТ_РТУ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО (ИС_WB_ШтрихкодыРазмеров.Размер = ИС_WB_СборочноеЗадание.РазмерWB)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В (&МассивСсылок)
	|	И ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB В (&Статусы)  	
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_СборочноеЗадание.Номер,
	|	ИС_WB_СборочноеЗадание.Дата,
	|	ИС_WB_СборочноеЗадание.Ссылка,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode,
	|	ЕСТЬNULL(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partA, """"),
	|	ЕСТЬNULL(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partB, """"),
	|	ЕСТЬNULL(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.barcode, """"),
	|	ИС_WB_СборочноеЗадание.РазмерWB.techSize,
	|	ИС_WB_СоответствиеРазмеров.РазмерWB.Владелец.Наименование,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Артикул,
	|	ИС_WB_СборочноеЗадание.Заказ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Ячейка) КАК Ячейка
	|ПОМЕСТИТЬ ВТ_Ячейка
	|ИЗ	
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура В (ВЫБРАТЬ ВТ_ОсновныеДанные.Номенклатура	
	|								ИЗ
	|							ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные)
	|			И Характеристика  В (ВЫБРАТЬ
	|								ВТ_ОсновныеДанные.Характеристика
	|									ИЗ
	|								ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные) 
	|			И Ячейка.Владелец  В (ВЫБРАТЬ 	ВТ_ОсновныеДанные.Склад
	|									ИЗ
	|								ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные)
	|													) КАК ТоварыВЯчейкахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Номер КАК Номер,
	|	ВТ_ОсновныеДанные.Дата КАК Дата,
	|	ВТ_ОсновныеДанные.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_ОсновныеДанные.Код КАК Код,
	|	ВТ_ОсновныеДанные.vendorCode КАК АртикулВБ,
	|	ВТ_ОсновныеДанные.Наименование КАК Наименование,
	|	ВТ_ОсновныеДанные.partA КАК partA,
	|	ВТ_ОсновныеДанные.partB КАК partB,
	|	ВТ_ОсновныеДанные.partA + ВТ_ОсновныеДанные.partB КАК QR,
	|	ВТ_ОсновныеДанные.techSize КАК Размер,
	|	ВТ_ОсновныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ОсновныеДанные.Характеристика КАК Характеристика,
	|	ВТ_ОсновныеДанные.Штрихкод КАК Штрихкод,       	
	|	ВТ_ОсновныеДанные.Склад КАК Склад,	
	|	ВТ_ОсновныеДанные.НомерРеализации КАК НомерРеализации,
	|	ВТ_ОсновныеДанные.НоменклатураАртикул КАК Артикул1С,	
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК ЯчейкаСправочно,
	|	ВТ_Ячейка.Ячейка КАК Ячейка
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ячейка КАК ВТ_Ячейка
	|		ПО (ВТ_ОсновныеДанные.Номенклатура = ВТ_Ячейка.Номенклатура
	|				И ВТ_ОсновныеДанные.Характеристика = ВТ_Ячейка.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|			ПО ВТ_ОсновныеДанные.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|				И ВТ_ОсновныеДанные.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|УПОРЯДОЧИТЬ ПО
	|	%1
	|ИТОГИ ПО
	|	vendorCode";   
			
	Запрос.Текст = СтрШаблон(Запрос.Текст, СортировкаПечати);
	
	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки);
	
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать лист подбора");
		Возврат Табдок;	
	КонецЕсли;
							
	ВыборкаАртикулов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Если ВыводитьКомплектующие Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ВТ.Номер КАК Номер,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.Характеристика КАК Характеристика,   		
		|	ВТ.Склад КАК Склад,		
		|	ВТ.partA КАК partA,
		|	ВТ.partB КАК partB		
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Номер КАК Номер,
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.Характеристика КАК Характеристика,		
		|	ВТ_Номенклатура.Склад КАК Склад, 
		|	ВТ_Номенклатура.partA КАК partA,
		|	ВТ_Номенклатура.partB КАК partB,		
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК НоменклатураНабора,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК ХарактеристикаНабора,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_СоставНаборов
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ПО ВТ_Номенклатура.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
		|			И ВТ_Номенклатура.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|;
		|		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ  
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,  
		|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Ячейка) КАК Ячейка
		|ПОМЕСТИТЬ ВТ_Ячейка  
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(  
		|   ,
		|   Номенклатура В (ВЫБРАТЬ ВТ_СоставНаборов.НоменклатураНабора  
		|        	ИЗ
		|       ВТ_СоставНаборов КАК ВТ_СоставНаборов)  
		|   И Характеристика  В (ВЫБРАТЬ
		|        ВТ_СоставНаборов.ХарактеристикаНабора  
		|         	ИЗ
		|        ВТ_СоставНаборов КАК ВТ_СоставНаборов)   
		|   И Ячейка.Владелец  В (ВЫБРАТЬ  ВТ_СоставНаборов.Склад
		|        	ИЗ  
		|        ВТ_СоставНаборов КАК ВТ_СоставНаборов)
		|             ) КАК ТоварыВЯчейкахОстатки  
		|
		|СГРУППИРОВАТЬ ПО  
		|	ТоварыВЯчейкахОстатки.Номенклатура,
		|	ТоварыВЯчейкахОстатки.Характеристика  
		|
		|ИНДЕКСИРОВАТЬ ПО  
		| 	Номенклатура,
		| 	Характеристика  
		|;
		| 		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ  
		| ВТ_СоставНаборов.Номер КАК Номер,
		| ВТ_СоставНаборов.Номенклатура КАК Номенклатура,
		| ВТ_СоставНаборов.Характеристика КАК Характеристика,  
		| ВТ_СоставНаборов.partA КАК partA,
		| ВТ_СоставНаборов.partB КАК partB,    
		| ВТ_СоставНаборов.НоменклатураНабора КАК НоменклатураНабора,
		| ВТ_СоставНаборов.ХарактеристикаНабора КАК ХарактеристикаНабора,  
		| ВТ_СоставНаборов.КоличествоУпаковок КАК КоличествоУпаковок,
		| ВТ_СоставНаборов.НоменклатураНабора.ФайлКартинки КАК ФайлКартинки,  
		| ВТ_СоставНаборов.НоменклатураНабора.Марка КАК Бренд,
		| ВТ_СоставНаборов.НоменклатураНабора.Артикул КАК Артикул,  		
		| ВТ_Ячейка.Ячейка КАК Ячейка               		
		|ИЗ  
		| ВТ_СоставНаборов КАК ВТ_СоставНаборов     		
		|  ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ячейка КАК ВТ_Ячейка  
		|  ПО (ВТ_СоставНаборов.НоменклатураНабора = ВТ_Ячейка.Номенклатура
		|    И ВТ_СоставНаборов.ХарактеристикаНабора = ВТ_Ячейка.Характеристика)  		
		|
		|УПОРЯДОЧИТЬ ПО  
		| ВТ_СоставНаборов.НоменклатураНабора.Наименование";
		
		Запрос = Новый Запрос;
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ВТ.Номер КАК Номер,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.Характеристика КАК Характеристика,
		|	ВТ.partA КАК partA,
		|	ВТ.partB КАК partB		
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Номер КАК Номер,
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.Характеристика КАК Характеристика,
		|	ВТ_Номенклатура.partA КАК partA,
		|	ВТ_Номенклатура.partB КАК partB,		
		|	ВТ_Номенклатура.partA + ВТ_Номенклатура.partB КАК QR,
		|	СоставНаборов.Номенклатура КАК НоменклатураНабора,
		|	СоставНаборов.Характеристика КАК ХарактеристикаНабора,
		|	СоставНаборов.Количество КАК КоличествоУпаковок,
		|	СоставНаборов.Номенклатура.ФайлКартинки КАК ФайлКартинки,
		|	СоставНаборов.Номенклатура.Артикул КАК Артикул1С,
		|	СоставНаборов.Номенклатура.Изготовитель КАК Бренд
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставНаборов КАК СоставНаборов
		|		ПО (ВТ_Номенклатура.Номенклатура = СоставНаборов.НоменклатураНабора)
		|			И (ВТ_Номенклатура.Характеристика = СоставНаборов.ХарактеристикаНабора)
		|ГДЕ
		|	СоставНаборов.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СоставНаборов.Номенклатура.Наименование";     
		
		Запрос.УстановитьПараметр("ВТ", РезультатЗапроса.Выгрузить());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыгрузкаНаборы = РезультатЗапроса.Выгрузить(); 
		
	КонецЕсли;  
	
	Пока ВыборкаАртикулов.Следующий() Цикл  
		
		Выборка = ВыборкаАртикулов.Выбрать();   
		
		Пока Выборка.Следующий() Цикл    
						
			ОбластьВыведена = Ложь; 
			
			Для Каждого Параметр Из МассивЗначений Цикл
				
				Если НастройкиПечати[Параметр] Тогда
					
					ОбластьСтроки = МакетОбработки.ПолучитьОбласть("СтрокаТаблицы|" + Сред(Параметр, 9));
					
					ЗаполнитьЗначенияСвойств(ОбластьСтроки.Параметры, Выборка);  
					
					Если Выборка.PartA + Выборка.PartB = "" Тогда
						Сообщить("Внимание! Не определен QR-код для товара " + Выборка.Наименование + ", артикул " + Выборка.Размер + 
						", проверьте заказ " + Строка(Выборка.ЗаказКлиента) + ", id " + Выборка.ЗаказКлиента.rid);
					КонецЕсли;  
					
					Если ОбластьВыведена Тогда
						ТабДок.Присоединить(ОбластьСтроки);	
					Иначе  
						ТабДок.Вывести(ОбластьСтроки);						
						ОбластьВыведена = Истина;
					КонецЕсли;										
					
				КонецЕсли;
				
			КонецЦикла; 

			Если ЗначениеЗаполнено(Выборка.Ячейка) Тогда
				ОбластьДанные = МакетОбработки.ПолучитьОбласть("СтрокаТаблицы|Ячейка");
				ОбластьДанные.Параметры.Ячейка = Выборка.Ячейка;
				ТабДок.Присоединить(ОбластьДанные);	
			КонецЕсли;			
			
			Если ВыводитьКомплектующие Тогда                    
				
				Если ВыгрузкаНаборы.Количество() > 0 Тогда							
					
					НайденныеСтроки = ВыгрузкаНаборы.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Выборка.Номенклатура, Выборка.Характеристика));
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						
						Для Каждого Строка Из НайденныеСтроки Цикл 
							
							ОбластьВыведена = Ложь; 
							
							Для Каждого Параметр Из МассивЗначений Цикл
								
								Если НастройкиПечати[Параметр] Тогда
									
									ОбластьСтроки = МакетОбработки.ПолучитьОбласть("СтрокаТаблицы|" + Сред(Параметр, 9));
									
									ЗаполнитьЗначенияСвойств(ОбластьСтроки.Параметры, Выборка);
									
									Если ОбластьВыведена Тогда
										ТабДок.Присоединить(ОбластьСтроки);	
									Иначе  
										ТабДок.Вывести(ОбластьСтроки);										
										ОбластьВыведена = Истина;
									КонецЕсли;									
									
									ВыгрузкаНаборы.Удалить(Строка);								
								КонецЕсли;  
								
							КонецЦикла; 							
							
							Если ЗначениеЗаполнено(Выборка.Ячейка) Тогда
								ОбластьДанные = МакетОбработки.ПолучитьОбласть("СтрокаТаблицы|Ячейка");
								ОбластьДанные.Параметры.Ячейка = Выборка.Ячейка;
								ТабДок.Присоединить(ОбластьДанные);	
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли; 
					
				КонецЕсли;	    
				
			КонецЕсли;			
			
		КонецЦикла;
		
		Табдок.Вывести(ОбластьРазделитель);
	
	КонецЦикла;    
			
	Возврат Табдок;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 09.02.2025 УА #77168

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаСервере
Функция ПолучитьЭтикеткиНаСервере(ВыделенныеСтроки)

	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_WB_ПечатьЭтикеток";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_QR58х40");
	
	//+ ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.waiting);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sorted);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sold);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ready_for_pickup);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.postponed_delivery);
	//- ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	
	Запрос = Новый Запрос;
	//+ ИнфоСофт Заварин К.В. 11.03.24 УА #69556
	//Запрос.Текст =     
	//	"ВЫБРАТЬ
	//|	ИС_WB_СборочноеЗадание.Номер КАК Номер,
	//|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код КАК Код,
	//|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode КАК vendorCode,
	//|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Этикетка КАК Этикетка,
	//|	ИС_WB_СоответствиеРазмеров.Номенклатура.Наименование КАК Наименование
	//|ИЗ
	//|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	//|		ПО (ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	//|		ПО (ИС_WB_СоответствиеРазмеров.РазмерWB = ИС_WB_СборочноеЗадание.РазмерWB)
	//|ГДЕ
	//|	ИС_WB_СборочноеЗадание.Ссылка В (&МассивСсылок)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	%1";
	Запрос.Текст =	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_WB_ХарактеристикиКатегорий.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Цвет
	|ИЗ
	|	Справочник.ИС_WB_ХарактеристикиКатегорий КАК ИС_WB_ХарактеристикиКатегорий
	|ГДЕ
	|	ИС_WB_ХарактеристикиКатегорий.Наименование = ""Цвет""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер,
	|	ИС_WB_СборочноеЗадание.Дата КАК Дата,
	|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Характеристика) КАК Характеристика,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код КАК Код,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode КАК vendorCode,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_НоменклатураХарактеристикиЦвет.Значение, """")) КАК Цвет,
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	//+ ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	//- ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_Номенклатура.Характеристики КАК ИС_WB_НоменклатураХарактеристикиЦвет
	|		ПО ИС_WB_СборочноеЗадание.НоменклатураWB = ИС_WB_НоменклатураХарактеристикиЦвет.Ссылка
	|			И (ИС_WB_НоменклатураХарактеристикиЦвет.Поле В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Цвет КАК ВТ))
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок) 
	//+ ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	|	И ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB В (&Статусы)  
	//- ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_СборочноеЗадание.Номер,
	|	ИС_WB_СборочноеЗадание.Дата,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode,
	|	ИС_WB_СборочноеЗадание.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номер КАК Номер,
	|	ВТ.Дата КАК Дата,
	|	ВТ.Код КАК Код,
	|	ВТ.vendorCode КАК vendorCode,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Этикетка КАК Этикетка,
	|	ЕСТЬNULL(ВТ.Номенклатура.Наименование, """") КАК Наименование,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Цвет КАК Цвет,
	|	ВТ.Характеристика КАК Характеристика
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ВТ.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание)
	|
	|УПОРЯДОЧИТЬ ПО
	|	%1";
	//+ ИнфоСофт Сумин Д.В. 28.11.2023 УА #66723
	//Запрос.Текст = СтрШаблон(Запрос.Текст, СортировкаПечати);
	//Запрос.Текст = СтрШаблон(Запрос.Текст, ?(СортировкаПечати = "Наименование", "Наименование, Код", СортировкаПечати));
	Запрос.Текст = СтрШаблон(Запрос.Текст, ?(СортировкаПечати = "Наименование", "Наименование, Характеристика, Номер, Цвет, Код", СортировкаПечати));
	//- ИнфоСофт Сумин Д.В. 28.11.2023 УА #66723
	//- ИнфоСофт Заварин К.В. 11.03.24 УА #69556
		
	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки); 
	
	//+ ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	//- ИнфоСофт Заварин К.В. 30.03.24 УА #67778

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать этикетки WildBerries");
		Возврат Табдок;	
	КонецЕсли;
		
	ОбластьЭтикетка = МакетОбработки.ПолучитьОбласть("Этикетка");
						
	Выборка = РезультатЗапроса.Выбрать();
	
	Первый = Истина;	
	Пока Выборка.Следующий() Цикл  
				
		ОбластьЭтикетка.Рисунки.КартинкаQR.Картинка = Новый Картинка(Выборка.Этикетка.Получить()); 
		
		Если Не Первый Тогда
			Табдок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Первый = Ложь;
			
		Табдок.Вывести(ОбластьЭтикетка);
			
	КонецЦикла;    
			
	Возврат Табдок;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаСервере
Функция ПолучитьШтрихкодовНаСервере(ВыделенныеСтроки)
	
	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_WB_ПечатьШтрихкодов";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_Штрихкод58х40");
		
	//+ ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.waiting);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sorted);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sold);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ready_for_pickup);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.postponed_delivery);
	//- ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	
	Запрос = Новый Запрос;
	//+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ИС_WB_ХарактеристикиКатегорий.Ссылка КАК Ссылка
	//|ПОМЕСТИТЬ ВТ_Цвет
	//|ИЗ
	//|	Справочник.ИС_WB_ХарактеристикиКатегорий КАК ИС_WB_ХарактеристикиКатегорий
	//|ГДЕ
	//|	ИС_WB_ХарактеристикиКатегорий.Наименование = ""Цвет""
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ИС_WB_СборочноеЗадание.Номер КАК Номер,
	//|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код КАК Код,
	//|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode КАК vendorCode,
	//|	ИС_WB_СборочноеЗадание.РазмерWB.techSize КАК techSize,
	//|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_НоменклатураХарактеристикиЦвет.Значение, """")) КАК Цвет,
	//|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СборочноеЗаданиеskus.Штрихкод, """")) КАК Штрихкод,
	//|	ИС_WB_СборочноеЗадание.НоменклатураWB.Наименование КАК Наименование
	//|ИЗ
	//|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	////+ ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	//|		ПО ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	////- ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_Номенклатура.Характеристики КАК ИС_WB_НоменклатураХарактеристикиЦвет
	//|		ПО ИС_WB_СборочноеЗадание.НоменклатураWB = ИС_WB_НоменклатураХарактеристикиЦвет.Ссылка
	//|			И (ИС_WB_НоменклатураХарактеристикиЦвет.Поле В
	//|				(ВЫБРАТЬ
	//|					ВТ.Ссылка
	//|				ИЗ
	//|					ВТ_Цвет КАК ВТ))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_WB_СборочноеЗадание.skus КАК ИС_WB_СборочноеЗаданиеskus
	//|		ПО ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СборочноеЗаданиеskus.Ссылка
	//|ГДЕ
	//|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
	////+ ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	//|	И ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB В (&Статусы)  
	////- ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ИС_WB_СборочноеЗадание.Номер,
	//|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код,
	//|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode,
	//|	ИС_WB_СборочноеЗадание.РазмерWB.techSize,
	//|	ИС_WB_СборочноеЗадание.НоменклатураWB.Наименование
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	%1";
	Запрос.Текст =	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_WB_ХарактеристикиКатегорий.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Цвет
	|ИЗ
	|	Справочник.ИС_WB_ХарактеристикиКатегорий КАК ИС_WB_ХарактеристикиКатегорий
	|ГДЕ
	|	ИС_WB_ХарактеристикиКатегорий.Наименование = ""Цвет""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Номер КАК НомерЗаказаСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.Дата КАК Дата,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код КАК КодНоменклатурыСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode КАК АртикулПоставщикаНоменклатурыСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.РазмерWB.techSize КАК РазмерСВБ,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_НоменклатураХарактеристикиЦвет.Значение, """")) КАК ЦветСВБ,
	//+ ИнфоСофт Заварин К.В. 26.12.24 УА #89436
	//|	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СборочноеЗаданиеskus.Штрихкод, """")) КАК ШтрихкодСМаркетплейса,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_ШтрихкодыРазмеров.Штрихкод, """")) КАК ШтрихкодСМаркетплейса,
	//- ИнфоСофт Заварин К.В. 26.12.24 УА #89436
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Наименование КАК НаименованиеНоменклатурыСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.Заказ КАК Заказ,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура1С,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика1С
	|ПОМЕСТИТЬ ВТ_ДанныеМаркетплейса
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_Номенклатура.Характеристики КАК ИС_WB_НоменклатураХарактеристикиЦвет
	|		ПО (ИС_WB_СборочноеЗадание.НоменклатураWB = ИС_WB_НоменклатураХарактеристикиЦвет.Ссылка)
	|			И (ИС_WB_НоменклатураХарактеристикиЦвет.Поле В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Цвет КАК ВТ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_WB_СборочноеЗадание.skus КАК ИС_WB_СборочноеЗаданиеskus
	|		ПО (ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СборочноеЗаданиеskus.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB)
	//+ ИнфоСофт Заварин К.В. 26.12.24 УА #89436
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО (ИС_WB_ШтрихкодыРазмеров.Размер = ИС_WB_СборочноеЗадание.РазмерWB)
	//- ИнфоСофт Заварин К.В. 26.12.24 УА #89436	
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
	|	И ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB В (&Статусы)  
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_СборочноеЗадание.Номер,
	|	ИС_WB_СборочноеЗадание.Дата,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode,
	|	ИС_WB_СборочноеЗадание.РазмерWB.techSize,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Наименование,
	|	ИС_WB_СборочноеЗадание.Заказ,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика
	|;
	|" + ИС_МП_Печать.ТекстЗапросаПараметровПечатиШтрихкодов() + "
	|УПОРЯДОЧИТЬ ПО
	|	%1";
	
	//Метод деревянный. Используется пока что для быстрой обратной совместимости, чтобы в случае изменения/отката не переделывать вызовы печати
	//с сортировкой везде
	//+ ИнфоСофт Стояк Ю.К. 23.12.2024 УА #89956	
	КопияСортировкаПечати = СортировкаПечати;
	
	Если КопияСортировкаПечати = "vendorCode" Тогда
		КопияСортировкаПечати = "АртикулПоставщикаНоменклатурыСМаркетплейса"; 
	ИначеЕсли КопияСортировкаПечати = "Код" Тогда
		КопияСортировкаПечати = "КодНоменклатурыСМаркетплейса"; 
	ИначеЕсли КопияСортировкаПечати = "Наименование" Тогда                      
		КопияСортировкаПечати = "НаименованиеНоменклатурыСМаркетплейса"; 
	ИначеЕсли КопияСортировкаПечати = "Номер" Тогда                      
		КопияСортировкаПечати = "НомерЗаказаСМаркетплейса"; 
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, КопияСортировкаПечати);
	//- ИнфоСофт Стояк Ю.К. 23.12.2024 УА #89956
	
	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки); 
	
	//+ ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	//- ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать штрихкоды WildBerries");
		Возврат Табдок;	
	КонецЕсли;
		
	ОбластьЭтикетка = МакетОбработки.ПолучитьОбласть("Этикетка");
	
	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
					
	Выборка = РезультатЗапроса.Выбрать();
	
	Первый = Истина;	
	Пока Выборка.Следующий() Цикл
	    
	    //+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816		
		//ОбластьЭтикетка.Параметры.Наименование  = Выборка.Наименование;
		//ОбластьЭтикетка.Параметры.Артикул = Выборка.vendorCode;
		//ОбластьЭтикетка.Параметры.Цвет	  = Выборка.Цвет;
		//ОбластьЭтикетка.Параметры.Размер  = Выборка.techSize;
		ЗаполнитьЗначенияСвойств(ОбластьЭтикетка.Параметры, Выборка);
		//- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
		    
		ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
				
		ПараметрыШК.Ширина = Окр(ОбластьЭтикетка.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе);
		ПараметрыШК.Высота = Окр(ОбластьЭтикетка.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе);
		//+ ИнфоСофт Мурсалимов Д.Р. 05.10.23 УА #62139
		//ПараметрыШК.ТипКода = 1;
		//- ИнфоСофт Мурсалимов Д.Р. 05.10.23 УА #62139
		ПараметрыШК.РазмерШрифта = 10;
		//+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816		
		//ПараметрыШК.Штрихкод = Выборка.Штрихкод;
		ПараметрыШК.Штрихкод = Выборка.ШтрихкодСМаркетплейса;
		//- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
		ПараметрыШК.Масштабировать = Истина;
		ПараметрыШК.СохранятьПропорции = Истина;
		ПараметрыШК.ВертикальноеВыравнивание = 2; 
		
		СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
		
		Если СтруктураКартинки.Результат Тогда	
			ОбластьЭтикетка.Рисунки.Штрихкод.Картинка = СтруктураКартинки.Картинка;
		КонецЕсли;  
		
		Если Не Первый Тогда
			Табдок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Первый = Ложь;
			
		Табдок.Вывести(ОбластьЭтикетка);
			
	КонецЦикла;    
			
	Возврат Табдок;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 14.02.23 УА #53535
&НаСервере 
Функция ПолучитьQRПоставкиНаСервере()
    
    ИС_ВБ_Сервер.ОбновитьИнформациюОПоставках(Профиль);
    
	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_WB_ПечатьQRПоставки";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_QR58х40");
	
	ВыделенныеСтроки = Элементы.СписокПоставок.ВыделенныеСтроки;
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ВБ_ПоставкиFBS.QR КАК QR
	|ИЗ
	|	Справочник.ИС_ВБ_ПоставкиFBS КАК ИС_ВБ_ПоставкиFBS
	|ГДЕ
	|	ИС_ВБ_ПоставкиFBS.Ссылка В(&МассивСсылок)
	|	И ИС_ВБ_ПоставкиFBS.done";
	
	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать QR поставки WildBerries.
											  |Поставка должна быть закрыта перед получением QR кода.");
		Возврат Неопределено;	
	КонецЕсли;
		
	ОбластьЭтикетка = МакетОбработки.ПолучитьОбласть("Этикетка");
						
	Выборка = РезультатЗапроса.Выбрать();
	
	Первый = Истина;	
	Пока Выборка.Следующий() Цикл  
				
		ОбластьЭтикетка.Рисунки.КартинкаQR.Картинка = Новый Картинка(Выборка.QR.Получить()); 
		
		Если Не Первый Тогда
			Табдок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Первый = Ложь;
			
		Табдок.Вывести(ОбластьЭтикетка);
			
	КонецЦикла;    
			
	Возврат Табдок;

КонецФункции //- ИнфоСофт Ивонин К.А. 14.02.23 УА #53535

//+ ИнфоСофт Заварин К.В. 28.06.24 УА #69703
&НаСервере 
Функция ПолучитьQRКоробаНаСервере()
    
    ИС_ВБ_Сервер.ОбновитьИнформациюОПоставках(Профиль);
	
	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_WB_ПечатьQRКороба";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_QR58х40");
	
	ВыделенныеСтроки = Элементы.СписокПоставок.ВыделенныеСтроки;
	
	МассивQRКоробов = Новый Массив;
	
	Для Каждого	ВыделеннаяСтрока из ВыделенныеСтроки  Цикл
		
		МассивКоробов = ИС_ВБ_Сервер.СписокКоробовПоставки(Профиль, ВыделеннаяСтрока.Код);
		
		Если МассивКоробов = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		Если МассивКоробов.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Не найдены короба по поставке: " + ВыделеннаяСтрока.Код);
			Продолжить;	
		КонецЕсли;
				
		КартинкиQRКороба = ИС_ВБ_Сервер.ПолучитьСтикерыКоробов(Профиль, ВыделеннаяСтрока.Код, МассивКоробов);
		
		Если КартинкиQRКороба = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		Если КартинкиQRКороба.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Не найдены QR коробов по поставке: " + ВыделеннаяСтрока.Код);
			Продолжить;	
		КонецЕсли; 
		
		Для каждого КартинкаQRКороба из КартинкиQRКороба  Цикл
			МассивQRКоробов.Добавить(КартинкаQRКороба);  		
		КонецЦикла;	
	КонецЦикла;
	
	ОбластьЭтикетка = МакетОбработки.ПолучитьОбласть("Этикетка");
	
	Для каждого КартинкаQRКороба из МассивQRКоробов  Цикл
		ОбластьЭтикетка.Рисунки.КартинкаQR.Картинка = Новый Картинка(КартинкаQRКороба);
		Табдок.ВывестиГоризонтальныйРазделительСтраниц();
		Табдок.Вывести(ОбластьЭтикетка); 		
	КонецЦикла;			
	
	Если Табдок.ВысотаТаблицы = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Табдок;

КонецФункции //- ИнфоСофт Заварин К.В. 28.06.24 УА #69703

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаСервере
Процедура ПолучитьСписокСборочныхЗаданийВПоставке(КодПоставки)
    
    СписокСборочныхЗаданийВПоставке.Очистить();
        
	МассивНомеровСборочныхЗаданий = ИС_ВБ_Сервер.СписокСборочныхЗаданийВПоставке(Профиль, КодПоставки);
	
	Если МассивНомеровСборочныхЗаданий = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Номер В(&СписокНомеров)";
	
	Запрос.УстановитьПараметр("СписокНомеров", МассивНомеровСборочныхЗаданий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Элемент = МассивНомеровСборочныхЗаданий.Найти(Выборка.Номер);
		Если Элемент <> Неопределено Тогда
			МассивНомеровСборочныхЗаданий.Удалить(Элемент);
		КонецЕсли;
		
		НоваяСтрока = СписокСборочныхЗаданийВПоставке.Добавить();
		НоваяСтрока.Номер = Выборка.Номер;
		НоваяСтрока.СборочноеЗадание = Выборка.Ссылка;
		
	КонецЦикла;
	
	Для Каждого Элемент Из МассивНомеровСборочныхЗаданий Цикл
	
		НоваяСтрока = СписокСборочныхЗаданийВПоставке.Добавить();
		НоваяСтрока.Номер = Элемент;
		 
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 15.02.23 УА #53535
&НаСервереБезКонтекста
Функция ПроверитьВозможностьПрикрепления(ВыделенныеСтроки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИС_WB_СборочноеЗадание.ТипТовара) КАК ТипТовара,              
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Поставка) КАК Поставка
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание = ИС_WB_СборочноеЗадание.Ссылка)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)";
	
	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда   
		
		Если Выборка.ТипТовара > 1 Тогда
			ОбщегоНазначения.СообщитьПользователю(
	 		"Нельзя прикрепить к одной поставке сборочные задания с разными типами товаров.
	 		|Пожалуйста, проверьте чтобы все выделенные сборочные задания имели одинаковые типы товаров.
	 		|При необходимости повторите прикрепление сборочных заданий с другими типами товаров в другую поставку.");
			Возврат Неопределено;
		КонецЕсли;
		
		ТипТовара = ВыделенныеСтроки[0].ТипТовара;
		
		Если Выборка.Поставка > 1 Тогда
			ОбщегоНазначения.СообщитьПользователю(
	 		"В выделенном списке найдены заданий закрепленные за поставкой, они будут переприкреплены к далее выбранной");
		КонецЕсли;
		
		Возврат ТипТовара;
	
	КонецЕсли;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 15.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаКлиенте
Процедура ПрикреплениеКПоставкеЗавершение(Результат, Параметры) Экспорт
    
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ПрикрепитьЗаказыКПоставкеНаСервере(Параметры.Поставка);
	//+ ИнфоСофт Конышев А.Е. 27.11.24 УА #73042
	ОбновитьВыделенныеСтатусы(Неопределено);
	//- ИнфоСофт Конышев А.Е. 27.11.24 УА #73042
    Элементы.Список.Обновить();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Прикрепление завершено");

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаСервере
Процедура ПрикрепитьЗаказыКПоставкеНаСервере(Поставка)	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	ИС_ВБ_Сервер.ДобавитьСборочныеЗаданияВПоставку(Профиль, Поставка, ВыделенныеСтроки);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаСервере
Процедура СоздатьЗаказыНаСервере()

	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	ИС_WB_Сервер.СоздатьЗаказы(Профиль, ВыделенныеСтроки);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535  

//+ ИнфоСофт Власова И.С. 07.02.25 УА #92584
&НаСервереБезКонтекста
Функция СоздатьРеализацииНаСервере(Профиль, УникальныйИдентификатор, ВыделенныеСтроки = Неопределено)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
		"ИС_WB_Сервер.СоздатьРеализации", Профиль, ВыделенныеСтроки);
	
КонецФункции //- ИнфоСофт Власова И.С. 07.02.25 УА #92584

//+ ИнфоСофт Власова И.С. 07.02.25 УА #92584
&НаКлиенте
Процедура СоздатьРеализацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы["КартинкаОжиданиеРеализации"].Видимость = Ложь;	
	
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);				
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 07.02.25 УА #92584

//+ ИнфоСофт Власова И.С. 07.02.25 УА #92584
&НаСервере
Функция ПолучитьФункциональныеОпции(Профиль)
	
	ФукнциональныеОпции = ИС_WB_СерверПовтИсп.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	АктивныйЗаказКлиента = ИС_WB_Сервер.ПолучитьАктивныйЗаказКлиента(Профиль);
	
	Если АктивныйЗаказКлиента <> Неопределено Тогда	
		ФукнциональныеОпции.Вставить("АктивныйЗаказКлиента", АктивныйЗаказКлиента);	
	КонецЕсли;
	
	Возврат ФукнциональныеОпции;
	//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	
КонецФункции //- ИнфоСофт Власова И.С. 07.02.25 УА #92584

//+ ИнфоСофт Ивонин К.А. 07.05.23 УА #58360
&НаКлиенте
Процедура ДействияНадСборочнымиЗаданиямиЗавершение(Результат, Параметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДействияНадСборочнымиЗаданиямиНаСервере(Результат);
	Элементы.Список.Обновить();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.05.23 УА #58360

//+ ИнфоСофт Ивонин К.А. 07.05.23 УА #58360
&НаСервере
Процедура ДействияНадСборочнымиЗаданиямиНаСервере(СтруктураДействий)

	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ИС_WB_СборочноеЗадание.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
	|	И НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка КАК Ссылка,
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	РеализацияТоваровУслуг.Ссылка КАК РТУ
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Заказы.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказы.Заказ,
	|	РеализацияТоваровУслуг.Ссылка,
	|	ВТ_Заказы.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка,
	|	ВТ_Заказы.Заказ,
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_Заказы.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
	|		
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка,
	|	ВТ_Заказы.Заказ,
	|	ПередачаТоваровХранителю.Ссылка
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ВТ_Заказы.Заказ = ПередачаТоваровХранителю.ЗаказКлиента
	|		
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка,
	|	ВТ_Заказы.Заказ,
	|	ПередачаТоваровХранителюТовары.Ссылка
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО ВТ_Заказы.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента";
	
	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСборочных = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаСборочных.Следующий() Цикл
    
    	Если СтруктураДействий.ПометитьСвязанныеОбъектыНаУдаление Тогда
    			
			ЗапросСвязанных = Новый Запрос;
			ЗапросСвязанных.Текст = 
			"ВЫБРАТЬ
			|	СвязанныеДокументы.Ссылка КАК Ссылка
			|ИЗ
			|	КритерийОтбора.СвязанныеДокументы(&Заказ) КАК СвязанныеДокументы";			
			
			ЗапросСвязанных.УстановитьПараметр("Заказ", ВыборкаСборочных.Заказ);
			РезультатЗапросаСвязанных = ЗапросСвязанных.Выполнить();
			
			ВыборкаСвязанных = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаСвязанных.Следующий() Цикл
			
				Попытка
				
					ДокОбъект = ВыборкаСвязанных.Ссылка.ПолучитьОбъект();	
					ДокОбъект.УстановитьПометкуУдаления(Истина);				
					
				Исключение
					ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецПопытки;
			
			КонецЦикла;
		
    	ИначеЕсли СтруктураДействий.ПометитьРеализацииНаУдаление И ВыборкаСборочных.РТУ <> NULL Тогда
    	    
    		Попытка
			
				ДокОбъект = ВыборкаСборочных.РТУ.ПолучитьОбъект();	
				ДокОбъект.УстановитьПометкуУдаления(Истина);				
				
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
    	
    	КонецЕсли;

    	Если СтруктураДействий.ПометитьЗаказыНаУдаление Тогда
    		   
    		Попытка
			
				ДокОбъект = ВыборкаСборочных.Заказ.ПолучитьОбъект();	
				ДокОбъект.УстановитьПометкуУдаления(Истина);				
				
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
    	КонецЕсли;

    	Если СтруктураДействий.ОтвязатьЗаказы Тогда
    		
    		Попытка
			
				ДокОбъект = ВыборкаСборочных.Ссылка.ПолучитьОбъект();	
				ДокОбъект.Заказ = Документы.ЗаказКлиента.ПустаяСсылка();
				ДокОбъект.Записать();				
				
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
    	КонецЕсли;
   
	КонецЦикла;	 
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.05.23 УА #58360

//+ ИнфоСофт Сумин Д.В. 07.09.2023 УА #61972 
&НаСервере
Функция ПолучитьЗаказыМаркированногоТовара(ВыделенныеСтроки)
	
	Запрос = Новый Запрос(
	//+ ИнфоСофт Сумин Д.В. 31.01.2024 УА #69810
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ИС_WB_СборочноеЗадание.РазмерWB КАК РазмерWB,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.ВидНоменклатуры.ТипНоменклатуры КАК НоменклатураВидНоменклатурыТипНоменклатуры,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.ВидНоменклатуры.ОсобенностьУчета КАК НоменклатураВидНоменклатурыОсобенностьУчета
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСборочныхЗаданий)
	|	И ИС_WB_СоответствиеРазмеров.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезособенностейУчета)
	|	И ИС_WB_СоответствиеРазмеров.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка)");
	//"ВЫБРАТЬ
	//|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	//|	ИС_WB_СборочноеЗадание.РазмерWB КАК РазмерWB,
	//|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура
	//|ИЗ
	//|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	//|		ПО (ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB)
	//|ГДЕ
	//|	ИС_WB_СборочноеЗадание.Ссылка В (&МассивСборочныхЗаданий)
	//|	И (ИС_WB_СоответствиеРазмеров.Номенклатура.ВидНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность)
	//|			ИЛИ ИС_WB_СоответствиеРазмеров.Номенклатура.ВидНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция)
	//|			ИЛИ ИС_WB_СоответствиеРазмеров.Номенклатура.ВидНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Шины)
	//|			ИЛИ ИС_WB_СоответствиеРазмеров.Номенклатура.ВидНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Фотоаппараты))");
    //- ИнфоСофт Сумин Д.В. 31.01.2024 УА #69810
	Запрос.УстановитьПараметр("МассивСборочныхЗаданий", ВыделенныеСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	РезультатМассив = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		РезультатМассив.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат РезультатМассив;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 07.09.2023 УА #61972

//+ ИнфоСофт Мурсалимов Д.Р. 03.10.23 УА #59537
&НаКлиенте
Процедура ПечатьШтрихкодов1С(Команда)
	
	МассивТовары = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		//+ ИнфоСофт Мурсалимов Д.Р. 01.07.24 УА #78714
		СтрокаДС = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если Не ЗначениеЗаполнено(СтрокаДС.Номенклатура) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("В сборочном задании с номером " + СтрокаДС.Номер + " отсутствует номенклатура из 1С. Сопоставьте товары!");
			Возврат;
		КонецЕсли;
		
		СтруктураТовары = Новый Структура;
		
		СтруктураТовары.Вставить("Номенклатура", 		СтрокаДС.Номенклатура);
		
		Если СтрокаДС.Свойство("Характеристика") Тогда
			СтруктураТовары.Вставить("Характеристика", 	СтрокаДС.Характеристика);
		КонецЕсли;
		
		Если СтрокаДС.Свойство("Упаковка") Тогда
			СтруктураТовары.Вставить("Упаковка", 		СтрокаДС.Упаковка);
		КонецЕсли;
	
		МассивТовары.Добавить(СтруктураТовары);
		//- ИнфоСофт Мурсалимов Д.Р. 01.07.24 УА #78714
		
	КонецЦикла;
	
	Товары = ЗаполнитьТоварыПодготовитьПараметрыЗаполнения(МассивТовары);
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Товары", Товары);  
	
	СтруктураДействий = Новый Структура; 
	СтруктураДействий.Вставить("ЗаполнитьТаблицуТоваров", Истина);
	СтруктураДействий.Вставить("ЗаполнитьКоличествоЭтикетокПоДокументу", Истина);
	СтруктураДействий.Вставить("УстановитьРежим", "ПечатьЭтикеток");	
	
	ПараметрыЗаполнения.Вставить("СтруктураДействий", СтруктураДействий);
	
	ПараметрыФормы.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);

	ОткрытьФорму("Обработка.ПечатьЭтикетокИЦенников.Форма", ПараметрыФормы);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 03.10.23 УА #59537

//+ ИнфоСофт Мурсалимов Д.Р. 01.07.24 УА #78714   
&НаСервере
Функция ЗаполнитьТоварыПодготовитьПараметрыЗаполнения(Данные)	

	Порядок = 1;	
	Товары 	= Новый Массив;
	     	
	Для Каждого Элемент Из Данные Цикл	
		
		ТекТовар = Новый Структура;
		
		ТекТовар.Вставить("Номенклатура", 		Элемент.Номенклатура); 
		
		Если Элемент.Свойство("Характеристика") Тогда
			ТекТовар.Вставить("Характеристика", Элемент.Характеристика);
		КонецЕсли;
		
		Если Элемент.Свойство("Упаковка") Тогда
			ТекТовар.Вставить("Упаковка", 		Элемент.Упаковка);
		КонецЕсли;
		
		ТекТовар.Вставить("Порядок", 			Порядок);
		ТекТовар.Вставить("Количество", 		1.000);
		
		Товары.Добавить(ТекТовар);

		Порядок = Порядок + 1;
		
	КонецЦикла;
	
	Возврат Товары;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 01.07.24 УА #78714

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Функция ПараметрыОжидания()

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);	
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	Возврат ПараметрыОжидания;

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Процедура ПолучениеЗаказовЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы["КартинкаОжидание"].Видимость = Ложь;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	//+ ИнфоСофт Заварин К.В. 09.09.24 УА #79742
	УстановитьОтборыОтправлений();				
	//- ИнфоСофт Заварин К.В. 09.09.24 УА #79742
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207 

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Процедура ОбновитьСтатусыЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы["КартинкаОжиданиеСтатусы"].Видимость = Ложь;
    //+ ИнфоСофт Заварин К.В. 06.05.24 УА #68658
	Элементы["КартинкаОжиданиеВыделенныеСтатусы"].Видимость = Ложь;
	//- ИнфоСофт Заварин К.В. 06.05.24 УА #68658
	
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	//+ ИнфоСофт Заварин К.В. 09.09.24 УА #79742
	УстановитьОтборыОтправлений();				
	//- ИнфоСофт Заварин К.В. 09.09.24 УА #79742 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаСервереБезКонтекста
Функция ПроверитьРегламетноеЗаданиеНаСервере(Профиль, ИмяКоманды)
	
	РеглАктивен = Ложь;
	
	Если Не РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		
		УникальныйИдентификатор = ИС_MP_РаботаСРегламентнымиЗаданиями.ПолучитьУникальныйИдентификаторРегламентогоЗадания(Профиль, ИмяКоманды);
		
		Если ЗначениеЗаполнено(УникальныйИдентификатор) Тогда
			
			Попытка
				УстановитьПривилегированныйРежим(Истина);
				РегламентноеЗадание = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(УникальныйИдентификатор);
				
				РеглАктивен = ИС_MP_РаботаСРегламентнымиЗаданиями.ФоновоеЗаданиеАктивно(РегламентноеЗадание);
				УстановитьПривилегированныйРежим(Ложь);	 
			Исключение
				РеглАктивен = Ложь;
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РеглАктивен;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Заварин К.В. 05.09.24 УА #79742
&НаКлиенте
Процедура УстановитьОтборыОтправлений()
	
	ВсеОтправления = Ложь;
	ВидимостьФормаПрикрепитьКПоставке = Ложь;	
	
	Статусы = Новый Массив;
	//+ ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461
	СтатусыВБ = Новый Массив;
	ИсключающиесяСтатусыВБ = Новый Массив;
	//- ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461
	
	Если ОтборОтправлений = "Новые" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданий.new"));
		
		//+ ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461
		ИсключающиесяСтатусыВБ.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.declined_by_client"));
		ИсключающиесяСтатусыВБ.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.canceled_by_client"));
		//- ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461
		
		ВидимостьФормаПрикрепитьКПоставке = Истина;
		
	ИначеЕсли ОтборОтправлений = "Сборка" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданий.confirm"));
		
		ВидимостьФормаПрикрепитьКПоставке = Ложь;
		
	ИначеЕсли ОтборОтправлений = "Доставка" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданий.complete"));
		//+ ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461
		ИсключающиесяСтатусыВБ.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sold"));
		ИсключающиесяСтатусыВБ.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.canceled_by_client"));
		ИсключающиесяСтатусыВБ.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.defect"));
		//- ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461
		
		ВидимостьФормаПрикрепитьКПоставке = Ложь;
		
	ИначеЕсли ОтборОтправлений = "Доставлены" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданий.receive"));
		//+ ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461
		СтатусыВБ.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sold"));
		
		ИсключающиесяСтатусыВБ.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.canceled_by_client"));
		ИсключающиесяСтатусыВБ.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.defect"));
		//- ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461
		
		ВидимостьФормаПрикрепитьКПоставке = Ложь;
		
	ИначеЕсли ОтборОтправлений = "Отменены" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданий.cancel"));
		//+ ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461
		СтатусыВБ.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.canceled_by_client"));
		СтатусыВБ.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.defect"));
		СтатусыВБ.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.declined_by_client"));
		//- ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461
		
		ВидимостьФормаПрикрепитьКПоставке = Ложь;
		
	Иначе // Все 
		
		ВсеОтправления = Истина;
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданий.ПустаяСсылка")); 
		
		ВидимостьФормаПрикрепитьКПоставке = Истина;
		
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ВсеОтправления", ВсеОтправления); 
	Список.Параметры.УстановитьЗначениеПараметра("Статусы", Статусы);
	//+ ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461
	Список.Параметры.УстановитьЗначениеПараметра("СтатусыВБ", СтатусыВБ);
	Список.Параметры.УстановитьЗначениеПараметра("ИсключающиесяСтатусыВБ", ИсключающиесяСтатусыВБ);
	//- ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461
	Элементы.ФормаПрикрепитьКПоставке.Видимость = ВидимостьФормаПрикрепитьКПоставке;
	
	КоличествоЭлементовСписка = КоличествоДинамическогоСписка();
	
	КоличествоСборочныхЗаданий = СтрШаблон("%1", КоличествоЭлементовСписка);
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 05.09.24 УА #79742

//+ ИнфоСофт Заварин К.В. 05.09.24 УА #79742
&НаСервере
Функция КоличествоДинамическогоСписка()

    Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    
    МояТаблицаЗначений = Новый ТаблицаЗначений;
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВывода.УстановитьОбъект(МояТаблицаЗначений);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);

    Возврат МояТаблицаЗначений.Количество();

КонецФункции //- ИнфоСофт Заварин К.В. 05.09.24 УА #79742

//+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
&НаСервере
Функция ВыводПамяткиПоРедактированиюМакетаНаСервере()
	
	Табдок = Новый ТабличныйДокумент;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_ПамяткаПоРедактированиюМакета");
	ОбластьПамятка = МакетОбработки.ПолучитьОбласть("Памятка");
	
	Табдок.Вывести(ОбластьПамятка);   
	
	Возврат Табдок;   
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816

//+ ИнфоСофт Заварин К.В. 13.11.24 УА #85881
&НаСервере
Процедура ПометитьНаУдалениеПривязанныеДокументыНаСервере()
	
	Событие = "ИС_WB_СборочноеЗадание.ПометитьНаУдалениеПривязанныеДокументыНаСервере";
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		
		ИС_MP_РаботаСЗаказами.ПометитьНаУдалениеПривязанныеДокументы(Строка.Заказ);	
		
		СтрокаСборочноеЗадание = Строка.ПолучитьОбъект();
		
		СтрокаСборочноеЗадание.ПометкаУдаления = Истина; 			
		
		Попытка	
			СтрокаСборочноеЗадание.Записать();
		Исключение 
			
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			
		КонецПопытки;
		
	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.11.24 УА #85881

//+ ИнфоСофт Конышев А.Е. 28.11.24 УА #72929
&НаКлиенте
Процедура ОткрытьФормуУдалениеСборочныхЗаданийЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = УдалениеСборочныхЗаданийНаСервере(Результат, Профиль, УникальныйИдентификатор);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("УдалениеСборочныхЗаданийЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
	
КонецПроцедуры //- ИнфоСофт Конышев А.Е. 28.11.24 УА #72929

//+ ИнфоСофт Конышев А.Е. 28.11.24 УА #72929
&НаСервереБезКонтекста
Функция УдалениеСборочныхЗаданийНаСервере(Результат, Профиль, УникальныйИдентификатор)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
		"ИС_WB_Сервер.УдалитьСборочныеЗадания", Профиль, Результат.НачалоПериода, Результат.КонецПериода);

КонецФункции //- ИнфоСофт Конышев А.Е. 28.11.24 УА #72929

//+ ИнфоСофт Конышев А.Е. 28.11.24 УА #72929
&НаКлиенте
Процедура УдалениеСборочныхЗаданийЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Элементы.Список.Обновить();	
	КоличествоЭлементовСписка = КоличествоДинамическогоСписка();	
	КоличествоСборочныхЗаданий = СтрШаблон("%1", КоличествоЭлементовСписка);
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры //- ИнфоСофт Конышев А.Е. 28.11.24 УА #72929

//+ ИнфоСофт Ивонин К.А. 07.04.25 УА #96894
&НаСервереБезКонтекста
Функция УдалитьНедопустимыеТипыДоставки(МассивЗаказов)
	
	ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.FBS;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&Ссылка)
	|	И ИС_WB_СборочноеЗадание.ТипДоставки = &ТипДоставки";
	
	Запрос.УстановитьПараметр("Ссылка", МассивЗаказов);
	Запрос.УстановитьПараметр("ТипДоставки", ТипДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Массив;
	
	ВыборкаЗаказов = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗаказов.Следующий() Цикл
		Результат.Добавить(ВыборкаЗаказов.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 07.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 07.04.25 УА #96894
&НаСервереБезКонтекста
Функция УдалитьНедопустимыеТипыЭтикеток(МассивЗаказов)
	
	ТипыДоставки = Новый Массив;
	ТипыДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.FBS);
	ТипыДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.DBW);
	ТипыДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.DBS);
	ТипыДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.EDBS);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&Ссылка)
	|	И ИС_WB_СборочноеЗадание.ТипДоставки В(&ТипДоставки)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивЗаказов);
	Запрос.УстановитьПараметр("ТипДоставки", ТипыДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Массив;
	
	ВыборкаЗаказов = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗаказов.Следующий() Цикл
		Результат.Добавить(ВыборкаЗаказов.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 07.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 08.04.25 УА #96894
&НаСервере   
Процедура ОпределитьСписокДоступныхДействий()
	
	Элементы.ПеревестиНаСборку.Видимость = Ложь;
	Элементы.ПеревестиВДоставку.Видимость = Ложь;
	Элементы.ГотовКВыдаче.Видимость = Ложь;
	Элементы.ПокупательПринял.Видимость = Ложь;
	Элементы.ПокупательОтказался.Видимость = Ложь;
	Элементы.ОтменитьЗаказ.Видимость = Ложь;
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		Возврат;
	КонецЕсли;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ;
	
	МассивНастроек = ИС_ВБ_Сервер.МассивНастроекСхемРаботы();
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивНастроек); 
		
	ЗаголовокПеревестиНаСборку = "Перевести на сборку (";
	ЗаголовокПеревестиВДоставку = "Перевести в доставку (";
	ЗаголовокПокупательПринял = "Покупатель принял (";
	ЗаголовокПокупательОтказался = "Покупатель отказался (";
	
	Если СтруктураНастроек.ЗаказыFBS <> Неопределено И СтруктураНастроек.ЗаказыFBS Тогда
		Элементы.ПеревестиНаСборку.Видимость = Истина;
		Элементы.ПеревестиВДоставку.Видимость = Истина;
		Элементы.ОтменитьЗаказ.Видимость = Истина;
		ЗаголовокПеревестиНаСборку = ЗаголовокПеревестиНаСборку + "DBW / ";
		ЗаголовокПеревестиВДоставку = ЗаголовокПеревестиВДоставку + "DBW / ";
	КонецЕсли;
	
	Если СтруктураНастроек.ЗаказыDBS <> Неопределено И СтруктураНастроек.ЗаказыDBS Тогда
		Элементы.ПеревестиНаСборку.Видимость = Истина;
		Элементы.ПеревестиВДоставку.Видимость = Истина;
		Элементы.ПокупательПринял.Видимость = Истина;
		Элементы.ПокупательОтказался.Видимость = Истина;
		Элементы.ОтменитьЗаказ.Видимость = Истина;
		ЗаголовокПеревестиНаСборку = ЗаголовокПеревестиНаСборку + "DBS / ";
		ЗаголовокПеревестиВДоставку = ЗаголовокПеревестиВДоставку + "DBS";
		ЗаголовокПокупательПринял = ЗаголовокПокупательПринял + "DBS / ";
		ЗаголовокПокупательОтказался = ЗаголовокПокупательОтказался + "DBS / ";
	КонецЕсли;
		
	Если СтруктураНастроек.ЗаказыCnC <> Неопределено И СтруктураНастроек.ЗаказыCnC Тогда
		Элементы.ПеревестиНаСборку.Видимость = Истина;
		Элементы.ГотовКВыдаче.Видимость = Истина;
		Элементы.ПокупательПринял.Видимость = Истина;
		Элементы.ПокупательОтказался.Видимость = Истина;
		Элементы.ОтменитьЗаказ.Видимость = Истина;
		ЗаголовокПеревестиНаСборку = ЗаголовокПеревестиНаСборку + "C&&C";
		ЗаголовокПокупательПринял = ЗаголовокПокупательПринял + "C&&C";
		ЗаголовокПокупательОтказался = ЗаголовокПокупательОтказался + "C&&C";
	КонецЕсли;
	
	Если Прав(ЗаголовокПеревестиНаСборку, 1) = " " Тогда
		ЗаголовокПеревестиНаСборку = Лев(ЗаголовокПеревестиНаСборку, СтрДлина(ЗаголовокПеревестиНаСборку) - 3);	
	КонецЕсли;
	
	Если Прав(ЗаголовокПеревестиВДоставку, 1) = " " Тогда
		ЗаголовокПеревестиВДоставку = Лев(ЗаголовокПеревестиВДоставку, СтрДлина(ЗаголовокПеревестиВДоставку) - 3);	
	КонецЕсли;
	
	Если Прав(ЗаголовокПокупательПринял, 1) = " " Тогда
		ЗаголовокПокупательПринял = Лев(ЗаголовокПокупательПринял, СтрДлина(ЗаголовокПокупательПринял) - 3);	
	КонецЕсли;
	
	Если Прав(ЗаголовокПокупательОтказался, 1) = " " Тогда
		ЗаголовокПокупательОтказался = Лев(ЗаголовокПокупательОтказался, СтрДлина(ЗаголовокПокупательОтказался) - 3);	
	КонецЕсли;
	
	ЗаголовокПеревестиНаСборку = ЗаголовокПеревестиНаСборку + ")";
	ЗаголовокПеревестиВДоставку = ЗаголовокПеревестиВДоставку + ")";
	ЗаголовокПокупательПринял = ЗаголовокПокупательПринял + ")";
	ЗаголовокПокупательОтказался = ЗаголовокПокупательОтказался + ")";
	
	Элементы.ПеревестиНаСборку.Заголовок = ЗаголовокПеревестиНаСборку;
	Элементы.ПеревестиВДоставку.Заголовок = ЗаголовокПеревестиВДоставку;
	Элементы.ПокупательПринял.Заголовок = ЗаголовокПокупательПринял;
	Элементы.ПокупательОтказался.Заголовок = ЗаголовокПокупательОтказался;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
&НаСервереБезКонтекста   
Процедура ПеревестиЗаказыНаСборку(Профиль, ВыделенныеСтроки)	
	ИС_ВБ_Сервер.ПеревестиЗаказыНаСборку(Профиль, ВыделенныеСтроки);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
&НаСервереБезКонтекста   
Процедура ПеревестиЗаказыВДоставку(Профиль, ВыделенныеСтроки)	
	ИС_ВБ_Сервер.ПеревестиЗаказыВДоставку(Профиль, ВыделенныеСтроки);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
&НаСервереБезКонтекста   
Процедура ПодтвердитьГотовностьКВыдачеЗаказов(Профиль, ВыделенныеСтроки)	
	ИС_ВБ_Сервер.ПодтвердитьГотовностьКВыдачеЗаказов(Профиль, ВыделенныеСтроки);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 10.04.25 УА #96894
&НаКлиенте
Процедура ПокупательПринялЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ПодтвердитьВыдачуЗаказаDBS(Профиль, ДопПараметры.Номер, Результат);
	
	Если Результат Тогда
		ОбновитьВыделенныеСтатусы(Неопределено);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Подтверждение выполнено");
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
&НаСервереБезКонтекста   
Функция ПодтвердитьВыдачуЗаказаDBS(Профиль, Номер, Код)	
	Возврат ИС_ВБ_Сервер.ПодтвердитьВыдачуЗаказаDBS(Профиль, Номер, Код);	
КонецФункции //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 10.04.25 УА #96894
&НаКлиенте
Процедура ПокупательОтказалсяЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ПодтвердитьОтказОтЗаказаDBS(Профиль, ДопПараметры.Номер, Результат);
	
	Если Результат Тогда
		ОбновитьВыделенныеСтатусы(Неопределено);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Отказ выполнен");
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
&НаСервереБезКонтекста   
Функция ПодтвердитьОтказОтЗаказаDBS(Профиль, Номер, Код)	
	Возврат ИС_ВБ_Сервер.ПодтвердитьОтказОтЗаказаDBS(Профиль, Номер, Код);	
КонецФункции //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
&НаСервереБезКонтекста   
Процедура ПодтвердитьВыдачуЗаказаCnC(Профиль, Номер)	
	ИС_ВБ_Сервер.ПодтвердитьВыдачуЗаказаCnC(Профиль, Номер);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
&НаСервереБезКонтекста   
Процедура ПодтвердитьОтказОтЗаказаCnC(Профиль, Номер)	
	ИС_ВБ_Сервер.ПодтвердитьОтказОтЗаказаCnC(Профиль, Номер);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
&НаСервереБезКонтекста   
Процедура ОтменитьЗаказы(Профиль, ВыделенныеСтроки)	
	ИС_ВБ_Сервер.ОтменитьЗаказы(Профиль, ВыделенныеСтроки);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Стояк Ю.К. 23.11.2024 УА #86844
&НаСервере
Функция ПолучитьЛистПодбораКомпактныйАльтертативныйНаСервере(ВыделенныеСтроки)
	
	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_WB_ПечатьЛистаПодбораКомпактныйАльтернативный";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	Табдок.ОтображатьСетку = Истина;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_ЛистПодбораКомпактныйАльтернативный");

	ОбластьСтрока = МакетОбработки.ПолучитьОбласть("СтрокаQR");
	ОбластьРазделитель = МакетОбработки.ПолучитьОбласть("Разделитель");
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ИС_WB_СборочноеЗадание.Заказ.Склад КАК Склад,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Код КАК КодНоменклатуры,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Артикул КАК АртикулНоменклатуры,
	|	ЕСТЬNULL(РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование + ЕСТЬNULL(""/"" + РазмещениеНоменклатурыПоСкладскимЯчейкамДополнительная.Ячейка.Наименование, """"), """") КАК Ячейка,
	|	ИС_WB_СборочноеЗадание.Заказ КАК Ссылка,
	|	ИС_WB_СборочноеЗадание.Номер КАК НомерСборочного,
	|	ИС_WB_СборочноеЗадание.Дата КАК Дата,
	|	ИС_WB_СборочноеЗадание.Ссылка КАК ЗаказКлиента,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код КАК Код,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode КАК vendorCode,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Наименование КАК Наименование,
	|	ЕСТЬNULL(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partA, """") КАК partA,
	|	ЕСТЬNULL(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partB, """") КАК partB,
	|	ИС_WB_СборочноеЗадание.РазмерWB.techSize КАК techSize
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB)		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО (РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = ИС_WB_СоответствиеРазмеров.Номенклатура)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ИС_WB_СборочноеЗадание.Заказ.Склад)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкамДополнительная
	|		ПО (РазмещениеНоменклатурыПоСкладскимЯчейкамДополнительная.Номенклатура = ИС_WB_СоответствиеРазмеров.Номенклатура)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкамДополнительная.Склад = ИС_WB_СборочноеЗадание.Заказ.Склад)
	|			И (НЕ РазмещениеНоменклатурыПоСкладскимЯчейкамДополнительная.ОсновнаяЯчейка)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В (&МассивСсылок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование,
	|	%1,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partA,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partB
	|ИТОГИ
	|	МАКСИМУМ(Номенклатура),
	|	МАКСИМУМ(Склад),
	|	МАКСИМУМ(КодНоменклатуры),
	|	МАКСИМУМ(АртикулНоменклатуры),
	|	МАКСИМУМ(Ячейка),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номер),
	|	МАКСИМУМ(ЗаказКлиента),
	|	МАКСИМУМ(Код)
	|ПО
	|	vendorCode";
	
	//+ ИнфоСофт Стояк Ю.К. 23.12.2024 УА #89956	
	КопияСортировкаПечати = СортировкаПечати;
	
	Если КопияСортировкаПечати = "Номер" Тогда                      
		КопияСортировкаПечати = "НомерСборочного"; 
	КонецЕсли;	
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, КопияСортировкаПечати);
	//- ИнфоСофт Стояк Ю.К. 23.12.2024 УА #89956
	
	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать лист подбора");
		Возврат Табдок;	
	КонецЕсли;  
	
	Область = МакетОбработки.ПолучитьОбласть("Шапка");						
	Табдок.Вывести(Область);
	
	ВыборкаАртикулов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НомерСтроки = 1;
	
	Пока ВыборкаАртикулов.Следующий() Цикл  
		
		Выборка = ВыборкаАртикулов.Выбрать(); 
		
		Область = МакетОбработки.ПолучитьОбласть("СтрокаДанные"); 
		
		ЗаполнитьЗначенияСвойств(Область.Параметры,ВыборкаАртикулов);
		
		Область.Параметры.Количество = ВыборкаАртикулов.НомерСборочного;
		Область.Параметры.Штрихкоды = ПолучитьВсеШтрихкоды(ВыборкаАртикулов.Номенклатура);
		Область.Параметры.Ячейка = ПолучитьВсеЯчейки(ВыборкаАртикулов.Номенклатура, ВыборкаАртикулов.Склад);  
		
		Табдок.Вывести(Область);        
		
		Пока Выборка.Следующий() Цикл
		
			ОбластьСтрока.Параметры.Номер = НомерСтроки;
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);			
			
			Если Выборка.PartA + Выборка.PartB = "" Тогда
				Сообщить("Внимание! Не определен QR-код для товара " + Выборка.Наименование + ", артикул " + Выборка.techSize + 
				", проверьте заказ " + Строка(Выборка.ЗаказКлиента) + ", id " + Выборка.ЗаказКлиента.rid);
			КонецЕсли; 
			
			Табдок.Вывести(ОбластьСтрока);
			НомерСтроки = НомерСтроки +1; 
			
		КонецЦикла;

		Табдок.Вывести(ОбластьРазделитель);
	
	КонецЦикла;    
			
	Возврат Табдок;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 23.11.2024 УА #86844

//+ ИнфоСофт Стояк Ю.К. 21.11.2024 УА #87826
&НаСервере
Функция ПечатьЭтикеткиЗоныСборкиНаСервере(ВыделенныеСтроки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&Ссылка)
	|	И ИС_WB_СборочноеЗадание.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_РасходныеНакладные
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ПО ВТ_Заказы.Заказ = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение
	|ГДЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка <> ЗНАЧЕНИЕ(Документ.РасходныйОрдерНаТовары.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтборРазмещениеТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_РасходныеНакладные КАК ВТ_РасходныеНакладные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтборРазмещениеТоваров КАК ОтборРазмещениеТоваров
	|		ПО (ВТ_РасходныеНакладные.Ссылка = ОтборРазмещениеТоваров.Распоряжение)
	|ГДЕ
	|	ОтборРазмещениеТоваров.Ссылка <> ЗНАЧЕНИЕ(Документ.ОтборРазмещениеТоваров.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтборРазмещениеТоваров.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";     
	
	Запрос.УстановитьПараметр("Ссылка", ВыделенныеСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивОбъектов = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
			
			НайденныйЭлемент = МассивОбъектов.Найти(ВыборкаДетальныеЗаписи.Ссылка);  
			
			Если НайденныйЭлемент = Неопределено Тогда
				МассивОбъектов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			КонецЕсли;
			
		КонецЕсли;     
		
	КонецЦикла;  
	
	Если МассивОбъектов.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не найдено документов на отбор товаров для печати этикетки зоны размещения");	
	КонецЕсли;

	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ВыводитьГоризонтальныйРазделитель", ВыводитьГоризонтальныйРазделитель);
	ПараметрыПечати.Вставить("СортироватьЯчейкиПо", СортироватьЯчейкиПо); 
		
	ТабДок = ИС_МП_Печать.ПечатьЭтикеткиЗоныСборки(МассивОбъектов, ПараметрыПечати);
	
	Возврат ТабДок;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 21.11.2024 УА #87826

//+ ИнфоСофт Стояк Ю.К. 23.11.2024 УА #86844
&НаСервере
Функция ПолучитьВсеШтрихкоды(Номенклатура)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	                      |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура"); 
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Штрихкод = ""; 
	
	Пока Выборка.Следующий() цикл
		Штрихкод = Штрихкод + Выборка.Штрихкод + Символы.ПС;		
	КонецЦикла;
	
	Возврат СокрЛП(Штрихкод);
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 23.11.2024 УА #86844

//+ ИнфоСофт Стояк Ю.К. 23.11.2024 УА #86844
&НаСервере
Функция ПолучитьВсеЯчейки(Номенклатура, Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура КАК Номенклатура,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад КАК Склад,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Помещение КАК Помещение,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка КАК ОсновнаяЯчейка
	|ИЗ
	|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|ГДЕ
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = &Номенклатура
	|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка УБЫВ";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад); 
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ячейка");
	
	Возврат СтрСоединить(ТаблицаЗначений, "/" + Символы.ПС);
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 23.11.2024 УА #86844

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469 
&НаСервере
Процедура ПолучитьОпциюРаботыСФБО(ВключенаРаботаСоСхемойФБО) 
	
	МассивНаименованийПараметров = Новый Массив;  		
	МассивНаименованийПараметров.Добавить("ЗагружатьЗаказыПоСхемеФБО");
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, МассивНаименованийПараметров);
	
	Если Настройки.ЗагружатьЗаказыПоСхемеФБО <> Неопределено Тогда
		ВключенаРаботаСоСхемойФБО = Настройки.ЗагружатьЗаказыПоСхемеФБО;
	Иначе
		ВключенаРаботаСоСхемойФБО = Ложь;
	КонецЕсли;          
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

//+ ИнфоСофт Сумин Д.В. 14.12.2023 УА #63115 
&НаСервере
Функция ВыполнитьПроверкуСкладаНаИспользованияЯчеек(ВыделенныеСтроки)
	
	Для Каждого Элемент Из ВыделенныеСтроки Цикл
		//+ ИнфоСофт Стояк Ю.К. 14.01.2025 УА #90791		
		Если Элемент.Склад.Склад.ИспользоватьСкладскиеПомещения Или Элемент.Склад.Склад.ИспользоватьАдресноеХранение Тогда
		//Если Элемент.Склад.Склад.ИспользоватьСкладскиеПомещения Тогда
		//- ИнфоСофт Стояк Ю.К. 14.01.2025 УА #90791
			Возврат Истина;	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 14.12.2023 УА #63115

#КонецОбласти     
