#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗначенияХарактеристик(Категория, Характеристика, СтрокаПоиска = Неопределено) Экспорт
	МассивКатегорий = Новый Массив;
	МассивКатегорий.Добавить(Категория);
	МассивКатегорий.Добавить(ПредопределенноеЗначение("Справочник.ИС_Ozon_КатегорииТоваров.ПустаяСсылка"));

	Если ТипЗнч(Характеристика) = Тип("Строка") Тогда
		Характеристика = Справочники.ИС_Ozon_Характеристики.НайтиПоКоду(Число(Характеристика), Истина);
	КонецЕсли;

	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Отбор = " И Ozon_ЗначенияХарактеристик.Наименование Подобно ""%" + СтрокаПоиска + "%""";
	Иначе
		Отбор = "";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	Ozon_ЗначенияХарактеристик.Ссылка КАК ЗначениеХарактеристики
				   |ИЗ
				   |	РегистрСведений.ИС_Ozon_ЗначенияХарактеристикПоКатегориям КАК Ozon_ЗначенияХарактеристикПоКатегориям
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_ЗначенияХарактеристик КАК Ozon_ЗначенияХарактеристик
				   |		ПО Ozon_ЗначенияХарактеристикПоКатегориям.ЗначениеХарактеристики = Ozon_ЗначенияХарактеристик.Ссылка
				   |ГДЕ
				   |	Ozon_ЗначенияХарактеристикПоКатегориям.Категория В (&МассивКатегорий)
				   |	И Ozon_ЗначенияХарактеристикПоКатегориям.Характеристика = &Характеристика" + Отбор;

	Запрос.УстановитьПараметр("МассивКатегорий", МассивКатегорий);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса.ВыгрузитьКолонку("ЗначениеХарактеристики");

КонецФункции

#КонецОбласти

#КонецЕсли