#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Значения = Неопределено;
	Параметры.Свойство("ХарактеристикаЯМ", Характеристика);
	Параметры.Свойство("Категория", Категория);	
	Параметры.Свойство("Значения", Значения); 
	
	Если ЗначениеЗаполнено(Значения) Тогда
		
		Для Каждого Значение Из Значения Цикл
			НСтр = СсылкиЗначений.Добавить();
			НСтр.Значение = Значение;
		КонецЦикла; 
		
	КонецЕсли;

	ИнициализироватьФорму(Параметры.ВыбранныеЗначения);
	Элементы.СписокЗначенийЗначение.ОграничениеТипа	 = Новый ОписаниеТипов("Строка", ,
		Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная));

	Если ЗначениеЗаполнено(Характеристика) Тогда
		Элементы.СписокЗначенийЗначение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИС_ЯМ_ЗначенияХарактеристик");

		МассивСвязей = Новый Массив;
		НоваяСвязь = Новый СвязьПараметраВыбора("Владелец", "Характеристика");
		МассивСвязей.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(МассивСвязей);
		Элементы.СписокЗначенийЗначение.СвязиПараметровВыбора = НовыеСвязи;

	Иначе
		ЭтоСтроковыйТип = Истина;
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ВладелецФормы.Имя = "Изображения" Тогда
		ОграничениеНаКоличествоЗаписей = 10;
	Иначе
		ОграничениеНаКоличествоЗаписей = 100;
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗначений

//+ ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724
&НаКлиенте
Процедура СписокЗначенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если СписокЗначений.Количество() >= ОграничениеНаКоличествоЗаписей Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Превышено максимальное количество записей. Установлено ограничение в 10 шт");
		Возврат;
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724
&НаКлиенте
Процедура СписокЗначенийЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если ЭтоСтроковыйТип Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	СтруктураПараметров = Новый Структура;	
	СтруктураПараметров.Вставить("ХарактеристикаЯМ", Характеристика);
	СтруктураПараметров.Вставить("Категория", Категория); 
	МассивЗначений = ПолучитьЗначения();
	СтруктураПараметров.Вставить("Значения", МассивЗначений);

	ОткрытьФорму("Справочник.ИС_ЯМ_ЗначенияХарактеристик.ФормаВыбора", СтруктураПараметров, Элемент, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724
&НаКлиенте
Процедура Выбрать(Команда)

	Результат = ВыбратьНаСервере();
	ОповеститьОВыборе(Результат);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФорму(ВыбранныеЗначения)

	Для Каждого Значение Из ВыбранныеЗначения Цикл
		НоваяСтрока = СписокЗначений.Добавить();
		НоваяСтрока.Значение = Значение;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ВыбратьНаСервере()

	МассивЗначений = Новый Массив;

	Для Каждого стр Из СписокЗначений Цикл
		Если ЗначениеЗаполнено(стр.Значение) Тогда
			МассивЗначений.Добавить(стр.Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат МассивЗначений;

КонецФункции

//+ ИнфоСофт Стояк Ю.К. 29.05.2024 УА #65724
&НаСервере
Функция ПолучитьЗначения()
	Возврат СсылкиЗначений.Выгрузить(,"Значение").ВыгрузитьКолонку("Значение");	
КонецФункции //- ИнфоСофт Стояк Ю.К. 29.05.2024 УА #65724

#КонецОбласти