
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Веселова А.С. 18.12.2020 УА #29084
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	РеквизитыOzonСкрыты = Истина;		
КонецПроцедуры //- ИнфоСофт Веселова А.С. 18.12.2020 УА #29084

//+ ИнфоСофт Ивонин К.А. 26.01.24 УА #63724	
&НаКлиенте
Процедура ОткрытьНаOzonНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке(" https://ozon.ru/product/" + Формат(Объект.sku, "ЧГ=0") + "/");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.01.24 УА #63724

#КонецОбласти
