
#Область ПрограммныйИнтерфейс
//+ ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842
&НаКлиенте
Процедура ЗакодироватьШтрихкодДанныхBase64(ДанныеШтрихкода) Экспорт
	
	ИмяОбщегоМодуляШтрихкодирования = ОпределитьОбщийМодульШтрихкодированияКлиентСервер(); 
	ОбщийМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль(ИмяОбщегоМодуляШтрихкодирования);	
 	ОбщийМодуль.ЗакодироватьШтрихкодДанныхBase64(ДанныеШтрихкода);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842
Функция ОпределитьОбщийМодульШтрихкодированияКлиентСервер()
		    
	Возврат ИС_МП_ВызовСервера.ОпределитьОбщийМодульШтрихкодированияКлиентСервер();
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842

#КонецОбласти
