
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстрановитьОтборПоПрофилю();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	УстрановитьОтборПоПрофилю();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаКлиенте
Процедура УстрановитьОтборПоПрофилю()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Профиль", Профиль);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

#КонецОбласти
