	
#Область ОбработчикиСобытийФормы 

//+ ИнфоСофт Ивонин К.А. 04.10.22 УА #50199
&НаКлиенте
Процедура ПутьКФайлуПриИзменении(Элемент)
	
	Если ПутьКФайлуОтчета = "" Тогда
		АдресОтчетаВоВременномХранилище = "";
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.10.22 УА #50199 

//+ ИнфоСофт Ивонин К.А. 04.10.22 УА #50199
&НаКлиенте
Процедура ПутьКФайлуДетализацииПриИзменении(Элемент)

	Если ПутьКФайлуДетализации = "" Тогда
		АдресДетализацииВоВременномХранилище = "";
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.10.22 УА #50199

//+ ИнфоСофт Ивонин К.А. 30.11.21 УА #38643
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОчиститьСообщения(); 
	  
	РасширениеФайлаОтчетаZip = Ложь;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл отчета комиссионера";
	ДиалогВыбораФайла.МножественныйВыбор =  Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.Фильтр = "Архив ZIP (*.zip)|*.zip|Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Реквизит", "ПутьКФайлуОтчета");
	ДополнительныеПараметры.Вставить("Адрес", "АдресОтчетаВоВременномХранилище");  
	ДополнительныеПараметры.Вставить("ЭтоZip", "РасширениеФайлаОтчетаZip");
	ДополнительныеПараметры.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры));
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.11.21 УА #38643

 //+ ИнфоСофт Ивонин К.А. 12.01.22 УА #38643
&НаКлиенте
Процедура ПутьКФайлуДетализацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	//+ ИнфоСофт Стояк Ю.К. 07.09.2023 УА #62429
	СписокТранзакцийExcelWB.Очистить();
	Элементы.СписокТранзакцийExcelWB.Видимость = Ложь;
	СписокТранзакцийExcelWBИн.Очистить();
	Элементы.СписокТранзакцийExcelWBИн.Видимость = Ложь;
	//- ИнфоСофт Стояк Ю.К. 07.09.2023 УА #62429
	//+ ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
	Элементы.ПодобратьПоАртикулу.Видимость = Ложь;
	Элементы.ПодобратьПоАртикулуИн.Видимость = Ложь;
	//- ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
	                     
	РасширениеФайлаДетализацииZip = Ложь;	                     
	                     
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл детализации отчета комиссионера";
	ДиалогВыбораФайла.МножественныйВыбор =  Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.Фильтр = "Архив ZIP (*.zip)|*.zip|Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Реквизит", "ПутьКФайлуДетализации");
	ДополнительныеПараметры.Вставить("Адрес", "АдресДетализацииВоВременномХранилище");
	ДополнительныеПараметры.Вставить("ЭтоZip", "РасширениеФайлаДетализацииZip");
	ДополнительныеПараметры.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры));
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.01.22 УА #38643

//+ ИнфоСофт Ивонин К.А. 30.07.21 УА #36051
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеФайлы = ДиалогВыбораФайла.ВыбранныеФайлы;
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЭтотОбъект[ДополнительныеПараметры.Реквизит] = ВыбранныеФайлы[0];
		
		ВыбранныйФайл = Новый Файл(ВыбранныеФайлы[0]);
		Расширение = ВыбранныйФайл.Расширение;
		
		Если Расширение = ".zip" Тогда
			ЭтотОбъект[ДополнительныеПараметры.ЭтоZip] = Истина;			
		КонецЕсли;
		ПутьКФайлуВоВременномКаталоге = ВыбранныеФайлы[0];
		ПоместитьФайлНаСервер(ДополнительныеПараметры.Адрес);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.07.21 УА #36051 

//+ ИнфоСофт Ивонин К.А. 30.07.21 УА #36051
&НаКлиенте
Процедура ПоместитьФайлНаСервер(Адрес)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоместитьФайлНаСерверЗавершение", ЭтотОбъект, Новый Структура("Адрес", Адрес));
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , , , ПутьКФайлуВоВременномКаталоге, УникальныйИдентификатор);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.07.21 УА #36051 

//+ ИнфоСофт Ивонин К.А. 30.07.21 УА #36051
&НаКлиенте
Процедура ПоместитьФайлНаСерверЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.ПомещениеФайлаОтменено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось поместить файл на сервер, попробуйте ещё раз...", , , "ПутьКФайлу");
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[Параметры.Адрес] = Результат.Адрес;          
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.07.21 УА #36051

//+ ИнфоСофт Сумин Д.В. 01.03.23 УА #55086
&НаКлиенте
Процедура ОтчетыПриСменеСтраницы(Элемент, ТекущаяСтраница)  
	
	АдресДетализацииВоВременномХранилище = "";
	АдресОтчетаВоВременномХранилище = "";
	ПутьКФайлуВоВременномКаталоге = "";
	ПутьКФайлуДетализации = "";
	ПутьКФайлуОтчета = ""; 
	ПутьКФайлуДетализацииУведомления = "";
	ПутьКФайлуУведомления = ""; 
	
	Если ТекущаяСтраница.Имя = "РоссийскиеПродажи" Тогда
		РоссийскиеПродажи = Истина;
		ИностранныеПродажи = Ложь;
		Api = Ложь;
	ИначеЕсли ТекущаяСтраница.Имя = "ИностранныеПродажи" Тогда
		РоссийскиеПродажи = Ложь;
		ИностранныеПродажи = Истина;
		Api = Ложь; 
	ИначеЕсли ТекущаяСтраница.Имя = "Api" Тогда
		РоссийскиеПродажи = Ложь;
		ИностранныеПродажи = Ложь;
		Api = Истина;	
	КонецЕсли;	
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 01.03.23 УА #55086

//+ ИнфоСофт Сумин Д.В. 02.03.23 УА #55086
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	РоссийскиеПродажи = Истина; 
	ИностранныеПродажи = Ложь;
	Api = Ложь;
	//+ ИнфоСофт Стояк Ю.К. 11.09.2023 УА #62429
	ВариантФормированияСебестоимости = 1;
	//- ИнфоСофт Стояк Ю.К. 11.09.2023 УА #62429 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 09.02.24 УА #69965
	ВариантФормированияЦеныВозврата = 0;
	//- ИнфоСофт Мурсалимов Д.Р. 09.02.24 УА #69965
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 02.03.23 УА #55086

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если ВебКлиент Тогда                         
		ПодключитьРасширениеДляРаботыСФайлами(Истина);
	#КонецЕсли
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127

//+ ИнфоСофт Мурсалимов Д.Р. 09.02.24 УА #69965
&НаКлиенте
Процедура ВариантФормированияЦеныВозвратаПриИзменении(Элемент)
	
	Если ВариантФормированияЦеныВозврата = 1 Тогда
		Элементы.ВидЦеныВозврата.Видимость = Истина;
	Иначе                                                
		Элементы.ВидЦеныВозврата.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 09.02.24 УА #69965

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
&НаКлиенте 
Процедура ПодключитьРасширениеДляРаботыСФайлами(УстановитьЕслиНеПодключено) Экспорт  
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьРасширениеДляРаботыСФайламиЗавершение", ЭтотОбъект, УстановитьЕслиНеПодключено); 
	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127 

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
&НаКлиенте
Процедура ПодключитьРасширениеДляРаботыСФайламиЗавершение(Подключено, УстановитьЕслиНеПодключено) Экспорт
	
	Если Подключено Тогда
		Возврат;
	ИначеЕсли УстановитьЕслиНеПодключено Тогда  	
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьРасширениеДляРаботыСФайлами", ЭтотОбъект, Ложь);     
		НачатьУстановкуРасширенияРаботыСФайлами(ОписаниеОповещения);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось подключить расширение для работы с файлами!");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127

#КонецОбласти

//+ ИнфоСофт Сумин Д.В. 02.03.23 УА #55086
&НаКлиенте
Процедура Загрузить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли;  
	
	Если РоссийскиеПродажи Тогда
		
		Если НЕ ЗначениеЗаполнено(ПутьКФайлуОтчета) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл отчета.", , , "ПутьКФайлуОтчета");
			Возврат;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ПутьКФайлуДетализации) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл детализации.", , , "ПутьКФайлуДетализации");
			Возврат;
		КонецЕсли;
		
		ЗагрузитьОтчетКомисисонераИзФайлаНаСервере();	
		
	ИначеЕсли Api Тогда 
		Если НЕ ЗначениеЗаполнено(ПериодДляЗагрузки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран период загрузки.", , , "ПериодДляЗагрузки");
			Возврат;
		КонецЕсли; 
		ЗагрузитьОтчетКомисисонераПоApiНаСервере(); 
		
	ИначеЕсли ИностранныеПродажи Тогда 
		ЗагрузитьИностранныеПродажиНаСервере();	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 02.03.23 УА #55086  

//+ ИнфоСофт Стояк Ю.К. 01.09.2023 УА #61246
&НаКлиенте
Процедура ВариантФормированияСебестоимостиПриИзменении(Элемент)
	
	Если ВариантФормированияСебестоимости = 2 Тогда
		Элементы.ВидЦеныСебестоимость.Видимость = Истина;
	Иначе                                                
		Элементы.ВидЦеныСебестоимость.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.09.2023 УА #61246

//+ ИнфоСофт Мурсалимов Д.Р. 12.12.24 УА #67818
&НаСервере
Процедура ЗагрузитьОтчетКомисисонераПоApiНаСервере() 
	
	Попытка
		
		ДатаНачала 	= НачалоДня(ПериодДляЗагрузки.ДатаНачала);
		ДатаКонца 	= КонецДня(ПериодДляЗагрузки.ДатаОкончания);
		
		ДанныеОК 	= ИС_WB_Сервер.ПолучитьДанныеОК(Профиль, ДатаНачала, ДатаКонца);
		
		НомерДокументаРФ = 0;
		НомерДокументаИн = 0;
		
		Для Каждого Элемент Из ДанныеОК.Тип Цикл
			
			Если Элемент.Российский Тогда
				НомерДокументаРФ = Элемент.Номер;
			Иначе
				НомерДокументаИн = Элемент.номер;	
			КонецЕсли;
			
		КонецЦикла;
		
		ДанныеОкРФ = ПолучитьТаблицуЗначенийДанныхПродаж(НомерДокументаРФ, ДанныеОК.Таблица);
		
		ДанныеОкИн = ПолучитьТаблицуЗначенийДанныхПродаж(НомерДокументаИн, ДанныеОК.Таблица); 
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = ИС_WB_Сервер.ПолучитьТекстЗапросаОК();
		
		Запрос.УстановитьПараметр("ДанныеТЗ", 	ДанныеОкРФ);
		Запрос.УстановитьПараметр("Профиль", 	Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ДанныеДляДокумента = РезультатЗапроса.Выгрузить(); 
		
		ДанныеДляДокумента = ПодобратьПоАртикулуApiНаСервере(ДанныеДляДокумента);
		
		ЗаголовокСтруктура = Новый Структура;
		
		Комментарий = "Отчет  Вайлдберриз №" + Строка(НомерДокументаРФ) + " от " + Формат(ДатаКонца, "ДФ=dd.MM.yyyy"); 
		
		ЗаголовокСтруктура.Вставить("ДатаДокумента", 		ПериодДляЗагрузки.ДатаНачала);
		ЗаголовокСтруктура.Вставить("Комментарий", 			Комментарий);
		ЗаголовокСтруктура.Вставить("НачалоПериода", 		ПериодДляЗагрузки.ДатаНачала);
		ЗаголовокСтруктура.Вставить("КонецПериода", 		ПериодДляЗагрузки.ДатаОкончания);  
		
		ДанныеВВ = Новый Структура;  
		ДанныеВВ.Вставить("РассчитыватьВВ", Ложь);
		
		ЗаголовокСтруктура.Вставить("ДанныеВВ", 			ДанныеВВ);
		
		МассивПараметров = Новый Массив;
		
		МассивПараметров.Добавить("WildBerriesСтатьяЗадолженности");
		
		Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивПараметров);
		
		СтатьяЗадолженности = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
		
		Если Настройки <> Неопределено Тогда
			
			Если Настройки["WildBerriesСтатьяЗадолженности"] <> Неопределено Тогда
				СтатьяЗадолженности = Настройки["WildBerriesСтатьяЗадолженности"];       
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаголовокСтруктура.Вставить("СтатьяЗадолженности",	СтатьяЗадолженности);
		
		//+ ИнфоСофт Заварин К.В. 21.02.25 УА #94295
 		Если ДанныеДляДокумента = Неопределено Тогда
			Возврат;
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 21.02.25 УА #94295
		
		ДокОтчет = ИС_WB_Сервер.СоздатьОтчетКомиссионера(ДанныеДляДокумента, Профиль, ЗаголовокСтруктура);
		ДобавитьДокументВРезультирующуюТЧ(ДокОтчет.Ссылка);
		
		//Создание документа корреткировки задолженности по браку
		Взаимозачет = Неопределено;
		
		Если ДанныеОК.Брак > 0 Тогда
			Взаимозачет = ИС_WB_СерверУТ11_5.ПолучитьДокументКорректировкиЗадолженности(ЗаголовокСтруктура, ДокОтчет.Ссылка, ДанныеОК.Брак);
			ДобавитьДокументВРезультирующуюТЧ(Взаимозачет.Ссылка);
		КонецЕсли;
		
	Исключение 
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));		
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.12.24 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 12.12.24 УА #67818
&НаСервере
Функция ПодобратьПоАртикулуApiНаСервере(СписокТранзакций)
	
	ТЗРезультирующая = Новый ТаблицаЗначений;
	
	ТЗРезультирующая.Колонки.Добавить("Артикул", 	Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ТЗРезультирующая.Колонки.Добавить("Размер", 	Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
		
	ТаблицаСопоставления = СписокТранзакций;  
		
	Для Каждого Строка Из ТаблицаСопоставления Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			НоваяСтрока = ТЗРезультирующая.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ТЗРезультирующая.Свернуть("Артикул, Размер");
	
	Если ТЗРезультирующая.Количество() = 0 Тогда		
		ОбщегоНазначения.СообщитьПользователю("Нет данных для обработки!"); 
		Возврат Неопределено;		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ДанныеТЗ.Артикул КАК Артикул,
	|	ДанныеТЗ.Размер КАК Размер
	|ПОМЕСТИТЬ ВТ_ДанныеТЗ
	|ИЗ
	|	&ТЗРезультирующая КАК ДанныеТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_Номенклатура.Ссылка КАК Ссылка,
	|	ВТ_ДанныеТЗ.Артикул КАК Артикул,
	|	ВТ_ДанныеТЗ.Размер КАК Размер
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.ИС_WB_Номенклатура КАК ИС_WB_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеТЗ КАК ВТ_ДанныеТЗ
	|		ПО ИС_WB_Номенклатура.vendorCode = ВТ_ДанныеТЗ.Артикул
	|ГДЕ
	|	ИС_WB_Номенклатура.Профиль = &Профиль
	|	И НЕ ВТ_ДанныеТЗ.Размер ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Ссылка КАК НоменклатураWB,
	|	ВТ_Номенклатура.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(ИС_WB_РазмерыНоменклатур.techSize) > 1
	|			ТОГДА ВТ_Номенклатура.Размер
	|		ИНАЧЕ ИС_WB_РазмерыНоменклатур.techSize
	|	КОНЕЦ КАК Размер
	|ПОМЕСТИТЬ ВТ_РазмерНоменклатуры
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|		ПО (ИС_WB_РазмерыНоменклатур.Владелец = ВТ_Номенклатура.Ссылка)
	|			И (ИС_WB_РазмерыНоменклатур.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Номенклатура.Ссылка,
	|	ИС_WB_РазмерыНоменклатур.techSize,
	|	ВТ_Номенклатура.Размер,
	|	ВТ_Номенклатура.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ВТ_РазмерНоменклатуры.Артикул КАК Артикул, 
	|	ВТ_РазмерНоменклатуры.Размер КАК Размер,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоНабор,
	|	ИС_WB_СоответствиеРазмеров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель
	|	КОНЕЦ КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВТ_Результирующая
	|ИЗ
	|	ВТ_РазмерНоменклатуры КАК ВТ_РазмерНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|		ПО ВТ_РазмерНоменклатуры.НоменклатураWB = ИС_WB_РазмерыНоменклатур.Владелец
	|			И ВТ_РазмерНоменклатуры.Размер = ИС_WB_РазмерыНоменклатур.techSize
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_РазмерыНоменклатур.Ссылка = ИС_WB_СоответствиеРазмеров.РазмерWB)
	|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
	|ГДЕ
	|	ИС_WB_РазмерыНоменклатур.Профиль = &Профиль
	|	И НЕ ИС_WB_РазмерыНоменклатур.ПометкаУдаления
	|	И НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результирующая.Номенклатура КАК Номенклатура,
	|	ВТ_Результирующая.Характеристика КАК Характеристика, 
	|	ВТ_Результирующая.Артикул КАК АртикулПоставщика,   
	|	ВТ_Результирующая.Размер КАК Размер,
	|	ВТ_Результирующая.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Результирующая.Упаковка КАК Упаковка,
	|	ВТ_Результирующая.КоэффициентУпаковки КАК КоэффициентУпаковки
	|ИЗ
	|	ВТ_Результирующая КАК ВТ_Результирующая";
	
	Запрос.УстановитьПараметр("Профиль", 			Профиль);
	Запрос.УстановитьПараметр("ТЗРезультирующая", 	ТЗРезультирующая);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = ТаблицаСопоставления.НайтиСтроки(Новый Структура("Артикул", Выборка.АртикулПоставщика));
		
		Для Каждого Элемент Из НайденныеСтроки Цикл
			
			Если Не ЗначениеЗаполнено(Элемент.Номенклатура) Тогда
				
				ЗаполнитьЗначенияСвойств(Элемент, Выборка, "Номенклатура,Характеристика,Упаковка,КоэффициентУпаковки,ЭтоНабор,Размер");   
					
				Элемент.КоэффициентУпаковки = Выборка.КоэффициентУпаковки; 
					
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	СписокТранзакций.Сортировать("Номенклатура");
	
	Возврат СписокТранзакций;
		
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 12.12.24 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 14.12.24 УА #67818
&НаСерверебезКонтекста
Функция ПолучитьТаблицуЗначенийДанныхПродаж(Номер, Таблица)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Номер", Номер);
	
	ДанныеТЗ = Таблица.Скопировать(Отбор);
	
	Возврат ДанныеТЗ;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 14.12.24 УА #67818 

//+ ИнфоСофт Сумин Д.В. 06.07.2023 УА #60267
&НаСервере
Процедура ЗагрузитьОтчетКомисисонераИзФайлаНаСервере()  
	
	//+ ИнфоСофт Сумин Д.В. 01.08.2023 УА #61489
	УстановитьПривилегированныйРежим(Истина);
	//- ИнфоСофт Сумин Д.В. 01.08.2023 УА #61489
	
	СтруктураНастроек = ПолучитьДанныеЗаголовкаИзФайла();
	//+ ИнфоСофт Стояк Ю.К. 06.09.2023 УА #62429
	Если Не Элементы.СписокТранзакцийExcelWB.Видимость Тогда
		
		ДанныеОк = ПолучитьТаблицуЗначенийПродажИзФайла(); 
		
		МассивУдаляемыхСтрок = Новый Массив;
		//+ ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730 
		
		Брак.Очистить();
		Потери.Очистить();
		
		АвансоваяСумма = 0;
		Если УчитыватьБракСписаниеОтдельно Тогда
			БракМассив = Новый Массив;
			ПотериМассив = Новый Массив;
			Для Каждого Строка Из ДанныеОк Цикл
				Если Строка.Кол_во = "0" Тогда			
					МассивУдаляемыхСтрок.Добавить(Строка);
				ИначеЕсли Строка.ОбоснованиеДляОплаты = "Частичная компенсация брака" Или Строка.ОбоснованиеДляОплаты = "Оплата брака" Тогда
					БракМассив.Добавить(Строка);
					МассивУдаляемыхСтрок.Добавить(Строка);
				ИначеЕсли Строка.ОбоснованиеДляОплаты = "Авансовая оплата за товар без движения" Тогда
					ПотериМассив.Добавить(Строка);
					МассивУдаляемыхСтрок.Добавить(Строка);
				ИначеЕсли Строка.ОбоснованиеДляОплаты = "Возмещение издержек по перевозке" Тогда 
					МассивУдаляемыхСтрок.Добавить(Строка);
				Иначе
					Продолжить;
				КонецЕсли;
				
			КонецЦикла;
			
			Если БракМассив.Количество() > 0 Тогда	
				БракТЗ = ПолучитьТзИзМассива(БракМассив); 
			КонецЕсли;  
			
			Если ПотериМассив.Количество() > 0 Тогда	
				ПотериТЗ = ПолучитьТзИзМассива(ПотериМассив); 
			КонецЕсли;  
			
		Иначе	
			Для Каждого Строка Из ДанныеОк Цикл	
				Если Строка.Кол_во = "0" Тогда			
					МассивУдаляемыхСтрок.Добавить(Строка);
				ИначеЕсли Строка.ОбоснованиеДляОплаты = "Частичная компенсация брака" Или Строка.ОбоснованиеДляОплаты = "Авансовая оплата за товар без движения" Или Строка.ОбоснованиеДляОплаты = "Оплата брака" Тогда 	
					Коэффициент = -1;
					Если Строка.ТипДокумента = "Продажа" Тогда
						Коэффициент = 1;
					КонецЕсли;
					МассивУдаляемыхСтрок.Добавить(Строка);
					АвансоваяСумма = АвансоваяСумма + Число(Строка.ВайлдберризРеализовалТовар_Пр_) * Коэффициент;
				ИначеЕсли Строка.ОбоснованиеДляОплаты = "Возмещение издержек по перевозке" Тогда 
					МассивУдаляемыхСтрок.Добавить(Строка);
				Иначе
					Продолжить;
				КонецЕсли;		
			КонецЦикла;
		КонецЕсли;
		//АвансоваяСумма = 0;
		//
		//Для Каждого Строка Из ДанныеОк Цикл	
		//	Если Строка.Кол_во = "0" Тогда			
		//		МассивУдаляемыхСтрок.Добавить(Строка);
		//	ИначеЕсли Строка.ОбоснованиеДляОплаты = "Частичная компенсация брака" Или Строка.ОбоснованиеДляОплаты = "Авансовая оплата за товар без движения" Или Строка.ОбоснованиеДляОплаты = "Оплата брака" Тогда 	
		//		Коэффициент = -1;
		//		Если Строка.ТипДокумента = "Продажа" Тогда
		//			Коэффициент = 1;
		//		КонецЕсли;
		//		МассивУдаляемыхСтрок.Добавить(Строка);
		//		АвансоваяСумма = АвансоваяСумма + Число(Строка.ВайлдберризРеализовалТовар_Пр_) * Коэффициент;
		//	ИначеЕсли Строка.ОбоснованиеДляОплаты = "Возмещение издержек по перевозке" Тогда 
		//		МассивУдаляемыхСтрок.Добавить(Строка);
		//	Иначе
		//		Продолжить;
		//	КонецЕсли;	
		//	
		//КонецЦикла;
		//- ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730
		
		Для Каждого Строка Из МассивУдаляемыхСтрок Цикл
			ДанныеОк.Удалить(Строка);
		КонецЦикла;
		
		ТаблицаЗначенийРезультирующая = Новый ТаблицаЗначений;
		
		ТаблицаЗначенийРезультирующая.Колонки.Добавить("НоменклатураWB", Новый ОписаниеТипов("СправочникСсылка.ИС_WB_Номенклатура"));			
		ТаблицаЗначенийРезультирующая.Колонки.Добавить("Баркод", Новый ОписаниеТипов("Строка"));
		//+ ИнфоСофт Стояк Ю.К. 06.09.2023 УА #62429		
		ТаблицаЗначенийРезультирующая.Колонки.Добавить("Название", Новый ОписаниеТипов("Строка")); 
		ТаблицаЗначенийРезультирующая.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
		//- ИнфоСофт Стояк Ю.К. 06.09.2023 УА #62429
		ТаблицаЗначенийРезультирующая.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));		
		ТаблицаЗначенийРезультирующая.Колонки.Добавить("ЦенаРозничная", Новый ОписаниеТипов("Число"));
		ТаблицаЗначенийРезультирующая.Колонки.Добавить("СуммаПродажи", Новый ОписаниеТипов("Число"));
		ТаблицаЗначенийРезультирующая.Колонки.Добавить("ЦенаПродажи", Новый ОписаниеТипов("Число"));
		ТаблицаЗначенийРезультирующая.Колонки.Добавить("Код", Новый ОписаниеТипов("Число"));
		ТаблицаЗначенийРезультирующая.Колонки.Добавить("РазмерыНоменклатурWB", Новый ОписаниеТипов("СправочникСсылка.ИС_WB_РазмерыНоменклатур"));
		//+ ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
		ТаблицаЗначенийРезультирующая.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка"));
		ТаблицаЗначенийРезультирующая.Колонки.Добавить("РазмерПоставщика", Новый ОписаниеТипов("Строка"));
		//- ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
		
		МассивНастроек = Новый Массив;
		
		Для Каждого Строка Из ДанныеОк Цикл	
			Коэффициент = -1;
			Если Строка.ТипДокумента = "Продажа" Тогда
				Коэффициент = 1;
			КонецЕсли;	
			
			НоваяСтрока = ТаблицаЗначенийРезультирующая.Добавить();
			НоваяСтрока.Баркод = Строка.Баркод;
			НоваяСтрока.Количество = Коэффициент * Число(Строка.Кол_во);
			НоваяСтрока.ЦенаРозничная = Число(Строка.ЦенаРозничная); 
			НоваяСтрока.СуммаПродажи = Коэффициент * Число(Строка.ВайлдберризРеализовалТовар_Пр_);	   	
			НоваяСтрока.ЦенаПродажи = ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.СуммаПродажи / НоваяСтрока.Количество); 	
			НоваяСтрока.Код = Строка.КодНоменклатуры;
			//+ ИнфоСофт Стояк Ю.К. 06.09.2023 УА #62429
			НоваяСтрока.Название = Строка.Название; 
			НоваяСтрока.Номер = Строка._;
			//- ИнфоСофт Стояк Ю.К. 06.09.2023 УА #62429
			//+ ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
			НоваяСтрока.Артикул = Строка.АртикулПоставщика;
			НоваяСтрока.РазмерПоставщика = Строка.Размер;
			//- ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
			
			Если Коэффициент > 0 Тогда
				МассивНастроек.Добавить(НоваяСтрока.ЦенаПродажи);	
			КонецЕсли;
			
		КонецЦикла;
		
		Если АвансоваяСумма <> 0 Тогда
			Итератор = 0;
			МассивСуммАванс = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(АвансоваяСумма, МассивНастроек);
			Для Каждого Строка Из ТаблицаЗначенийРезультирующая Цикл	
				Если Строка.Количество > 0 Тогда
					Строка.ЦенаПродажи = Строка.ЦенаПродажи + МассивСуммАванс[Итератор];
					Строка.СуммаПродажи = Строка.СуммаПродажи + МассивСуммАванс[Итератор];	
					Итератор = Итератор + 1;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = ИС_WB_Сервер.ПолучитьТекстЗапросаОК();
		Запрос.УстановитьПараметр("ДанныеТЗ", ТаблицаЗначенийРезультирующая);
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ДанныеДляДокумента = РезультатЗапроса.Выгрузить();
		
		//+ ИнфоСофт Стояк Ю.К. 06.09.2023 УА #62429	
		СписокТранзакцийExcelWB.Загрузить(ДанныеДляДокумента);  
		СписокТранзакцийExcelWB.Сортировать("Номенклатура Возр");
		
		ОшибкаСопоставления = Ложь;
		
		Для Каждого Строка Из СписокТранзакцийExcelWB Цикл
			Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				ОшибкаСопоставления = Истина;			
			КонецЕсли;
		КонецЦикла;
		
		Если Не ОшибкаСопоставления Тогда
			
			МассивДокументов = Новый Массив;
			ДанныеВВ = Новый Структура;  
			ДанныеВВ.Вставить("РассчитыватьВВ", РассчитатьКомиссионноеВознаграждение);
			
			Если РассчитатьКомиссионноеВознаграждение Тогда
				ТабличныйДокумент = ПрочитатьExcelФайлВТабличныйДокумент(); 
				СуммаУслугВБ = ПолучитьСуммуУслугВБ(ТабличныйДокумент); 
				НастройкиЗаполненияВВ = ПолучитьНастройкиЗаполненияВВ();
				ДанныеВВ.Вставить("НастройкиЗаполненияВВ", НастройкиЗаполненияВВ);
				ДанныеВВ.Вставить("СуммаУслугВБ", СуммаУслугВБ); 
				
			КонецЕсли; 
			
			СтруктураНастроек.Вставить("ДанныеВВ", ДанныеВВ);
			
			//+ ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
			Если СгруппироватьПоНоменклатуре Тогда
				ДанныеДляДокумента = ВыполнитьГруппировкуПоНоменклатуре(ДанныеДляДокумента);	
			КонецЕсли;	
			//- ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
			
			//+ ИнфоСофт Мурсалимов Д.Р. 09.02.24 УА #69965
			ДанныеВВ.Вставить("СпособРасчетаЦеныВозврата", Новый Структура("СпособРасчета, ВидЦены", ВариантФормированияЦеныВозврата, ВидЦеныВозврата));
			
			Если ВариантФормированияЦеныВозврата = 1 И Не ЗначениеЗаполнено(ВидЦеныВозврата) Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Не выбран вид цены");
				Возврат;
				
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 09.02.24 УА #69965
			
			ДокОтчет = ИС_WB_Сервер.СоздатьОтчетКомиссионера(ДанныеДляДокумента, Профиль, СтруктураНастроек);
			МассивДокументов.Добавить(ДокОтчет.Ссылка);
			ОтчетКомиссионера = ДокОтчет.Ссылка;
			Для Каждого Элемент Из МассивДокументов Цикл
				ДобавитьДокументВРезультирующуюТЧ(Элемент);	
			КонецЦикла; 
			
			//+ ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730
			Если УчитыватьБракСписаниеОтдельно Тогда
				Если БракМассив.Количество() > 0 Тогда	
					ОбработатьБрак(ДокОтчет, БракТЗ); 
				КонецЕсли;  
				
				Если ПотериМассив.Количество() > 0 Тогда	
					ОбработатьПотери(ДокОтчет, ПотериТЗ); 
				КонецЕсли;
			КонецЕсли;		
			//- ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730
			
		Иначе  
			Элементы.СписокТранзакцийExcelWB.Видимость = Истина;
			ОбщегоНазначения.СообщитьПользователю("Проверьте сопоставление для создания документов!");
			//+ ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
			Элементы.ПодобратьПоАртикулу.Видимость = Истина;
			//- ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
		КонецЕсли;
		//- ИнфоСофт Стояк Ю.К. 06.09.2023 УА #62429 
		
	Иначе
		
		Для Каждого Строка Из СписокТранзакцийExcelWB Цикл
			Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьПользователю("Проверьте сопоставление для создания документов!");
				Возврат;
			КонецЕсли;
		КонецЦикла;
				
		ДанныеДляДокумента = СписокТранзакцийExcelWB.Выгрузить();
		
		//+ ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
		Если СгруппироватьПоНоменклатуре Тогда
			ДанныеДляДокумента = ВыполнитьГруппировкуПоНоменклатуре(ДанныеДляДокумента);	
		КонецЕсли;	
		//- ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
		
		МассивДокументов = Новый Массив;
		ДанныеВВ = Новый Структура;  
		ДанныеВВ.Вставить("РассчитыватьВВ", РассчитатьКомиссионноеВознаграждение);
		
		Если РассчитатьКомиссионноеВознаграждение Тогда
			ТабличныйДокумент = ПрочитатьExcelФайлВТабличныйДокумент(); 
			СуммаУслугВБ = ПолучитьСуммуУслугВБ(ТабличныйДокумент); 
			НастройкиЗаполненияВВ = ПолучитьНастройкиЗаполненияВВ();
			ДанныеВВ.Вставить("НастройкиЗаполненияВВ", НастройкиЗаполненияВВ);
			ДанныеВВ.Вставить("СуммаУслугВБ", СуммаУслугВБ); 
			
		КонецЕсли; 
		
		//+ ИнфоСофт Мурсалимов Д.Р. 09.02.24 УА #69965
		ДанныеВВ.Вставить("СпособРасчетаЦеныВозврата", Новый Структура("СпособРасчета, ВидЦены", ВариантФормированияЦеныВозврата, ВидЦеныВозврата));
		
		Если ВариантФормированияЦеныВозврата = "СуммаПоВидуЦен" И Не ЗначениеЗаполнено(ВидЦеныВозврата) Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Не выбран вид цены");
			Возврат;
			
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 09.02.24 УА #69965
		
		СтруктураНастроек.Вставить("ДанныеВВ", ДанныеВВ); 
		
		ДокОтчет = ИС_WB_Сервер.СоздатьОтчетКомиссионера(ДанныеДляДокумента, Профиль, СтруктураНастроек);
		МассивДокументов.Добавить(ДокОтчет.Ссылка);
		ОтчетКомиссионера = ДокОтчет.Ссылка;
		Для Каждого Элемент Из МассивДокументов Цикл
			ДобавитьДокументВРезультирующуюТЧ(Элемент);	
		КонецЦикла;
		
		//+ ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730
		Если УчитыватьБракСписаниеОтдельно Тогда
			Если Брак.Количество() > 0 Тогда	
				ОбработатьБрак(ДокОтчет, Брак); 
			КонецЕсли;  
			
			Если Потери.Количество() > 0 Тогда	
				ОбработатьПотери(ДокОтчет, Потери); 
			КонецЕсли;
		КонецЕсли;		
		//- ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730
		
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 06.09.2023 УА #62429
	
	//+ ИнфоСофт Сумин Д.В. 01.08.2023 УА #61489
    УстановитьПривилегированныйРежим(Ложь);
	//- ИнфоСофт Сумин Д.В. 01.08.2023 УА #61489
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 06.07.2023 УА #60267

//+ ИнфоСофт Сумин Д.В. 03.03.23 УА #55086
&НаСервере
Функция ПолучитьДанныеЗаголовкаИзФайла() 
	
	Если ЗначениеЗаполнено(АдресОтчетаВоВременномХранилище) Тогда
		
		Если РасширениеФайлаОтчетаZip Тогда  
			
			ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище); 
			Имя = ПолучитьИмяВременногоФайла("zip");
			ФайлВременногоХранилища.Записать(Имя);
			
			ВызватьОшибку = Истина;
			ТабличныйДокумент = ПрочитатьТабДокИзZIP(Имя, ВызватьОшибку);
			
			Если ВызватьОшибку Тогда
				ОбщегоНазначения.СообщитьПользователю("Был выбран некорректный файл для загрузки отчета комиссионера WildBerries, проверьте выбранный файл",,, "ПутьКФайлу");
				ОтменитьТранзакцию();
			КонецЕсли;
			
		Иначе
			
			ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
			Имя = ПолучитьИмяВременногоФайла("xlsx");
			ФайлВременногоХранилища.Записать(Имя);
			ТабличныйДокумент = Новый ТабличныйДокумент;
			ТабличныйДокумент.Прочитать(Имя);		
			
		КонецЕсли;
		
		ТабличныйДокумент.Область().Разъединить();
		
		Если РоссийскиеПродажи Тогда		
			Комментарий = ТабличныйДокумент.Область("R5C6").Текст;
			НомерДата = ТабличныйДокумент.Область("R5C7").Текст;
			НачалоПериода = ТабличныйДокумент.Область("R7C12").Текст;
			КонецПериода = ТабличныйДокумент.Область("R7C14").Текст;  
			
			ДатаДокумента = Дата(СтрЗаменить(СтрРазделить(НомерДата, " ")[2], "-", "") + "000000");
			Комментарий = Комментарий + НомерДата;      
			НачалоПериода = Дата(СтрЗаменить(НачалоПериода, "-", "") + "000000");
			КонецПериода = Дата(СтрЗаменить(КонецПериода, "-", "") + "000000");			
		Иначе
			Комментарий = ТабличныйДокумент.Область("R3C1").Текст;
			ВремДата = СтрЗаменить(СтрРазделить(Комментарий, " ")[5], ".", "");
			КаноническаяФорма = Сред(ВремДата, 5, 4) + Сред(ВремДата, 3, 2) + Сред(ВремДата, 1, 2) + "000000" ;  
			ДатаДокумента = Дата(КаноническаяФорма);
		КонецЕсли;
		
		Попытка
			УдалитьФайлы(Имя);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'ИС.WB.ЗагрузитьОтчетКомиссионераНаСервере'"), УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОтменитьТранзакцию();
		КонецПопытки;   
		
	Иначе
		ДатаДокумента = ТекущаяДатаСеанса(); 
		Комментарий = Неопределено;
		НачалоПериода = Неопределено;
		КонецПериода = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДатаДокумента", ДатаДокумента);
	Результат.Вставить("Комментарий", Комментарий);
	Результат.Вставить("НачалоПериода", НачалоПериода);
	Результат.Вставить("КонецПериода", КонецПериода);
	Результат.Вставить("ЗагрузитьКодыМаркировкиВДокументРеализации", Ложь); 
	
	Возврат Результат;
		
КонецФункции //- ИнфоСофт Сумин Д.В. 03.03.23 УА #55086	

//+ ИнфоСофт Сумин Д.В. 03.03.23 УА #55086
&НаСервере
Функция ПолучитьТаблицуЗначенийПродажИзФайла()
	Если РасширениеФайлаДетализацииZip Тогда  
			
			ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресДетализацииВоВременномХранилище);
			Имя = ПолучитьИмяВременногоФайла("zip");
			ФайлВременногоХранилища.Записать(Имя);
			
			ВызватьОшибку = Истина;
			ТабличныйДокумент = ПрочитатьТабДокИзZIP(Имя, ВызватьОшибку);
							
			Если ВызватьОшибку Тогда
				ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
				ОтменитьТранзакцию();
			КонецЕсли;
			
		Иначе     
			
			ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресДетализацииВоВременномХранилище);
			Имя = ПолучитьИмяВременногоФайла("xlsx");
			ФайлВременногоХранилища.Записать(Имя);
			ТабличныйДокумент = Новый ТабличныйДокумент;
			ТабличныйДокумент.Прочитать(Имя);
			
		КонецЕсли;
		
		ТабличныйДокумент.Область().Разъединить();
			
		ПоследняяСтрока = ТабличныйДокумент.ВысотаТаблицы;
		ПоследняяКолонка = ТабличныйДокумент.ШиринаТаблицы;
		
		ОбластьЯчеек = ТабличныйДокумент.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка);
		ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
		
		ПостроительОтчета = Новый ПостроительОтчета;
		ПостроительОтчета.ИсточникДанных = ИсточникДанных;
		ПостроительОтчета.Выполнить();
		
		ТаблицаЗначений = ПостроительОтчета.Результат.Выгрузить();
		
		//+ ИнфоСофт Сумин Д.В. 07.11.2023 УА #65868
		МассивУдаляемыхСтрок = Новый Массив;
		Для Каждого Строка Из ТаблицаЗначений Цикл
			Если Строка.Баркод = "" Тогда
				МассивУдаляемыхСтрок.Добавить(Строка);	
			КонецЕсли;	
		КонецЦикла;
		
		Для Каждого Элемент Из МассивУдаляемыхСтрок Цикл
			ТаблицаЗначений.Удалить(Элемент);		
		КонецЦикла;	
		//- ИнфоСофт Сумин Д.В. 07.11.2023 УА #65868 
		
		Попытка
			УдалитьФайлы(Имя);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
			ОтменитьТранзакцию();
		КонецПопытки;  
		
		Возврат ТаблицаЗначений;
		
КонецФункции //- ИнфоСофт Сумин Д.В. 03.03.23 УА #55086	
	
//+ ИнфоСофт Ивонин К.А. 15.12.22 УА #52439
&НаСервере
Функция ПрочитатьТабДокИзZIP(ИмяФайла, Отказ)
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ЧтениеZip = Новый ЧтениеZipФайла(ИмяФайла, "");
	
	Отказ = Истина;
	
	Для Каждого Элемент Из ЧтениеZip.Элементы Цикл
		
		Если Элемент.Расширение = "xlsx" Тогда
			Отказ = Ложь;
			ПутьКФайлуВоВременномКаталоге = КаталогВременныхФайлов();
			ЧтениеZip.Извлечь(Элемент, ПутьКФайлуВоВременномКаталоге, , "");					
			ПутьКФайлуВоВременномКаталоге = ПутьКФайлуВоВременномКаталоге + Элемент.Имя; 
			ТабличныйДокумент.Прочитать(ПутьКФайлуВоВременномКаталоге);
		КонецЕсли;
		
	КонецЦикла; 
	
	ЧтениеZip.Закрыть();
	
	Возврат ТабличныйДокумент;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 15.12.22 УА #52439

//+ ИнфоСофт Сумин Д.В. 03.03.23 УА #55086
&НаСервере
Процедура ДобавитьДокументВРезультирующуюТЧ(ДокументСсылка)
	СформированныеДокументы.Добавить().Документ = ДокументСсылка;	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 03.03.23 УА #55086	

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
&НаКлиенте
Процедура ЗаполнитьПоОтчету(Команда)

	ОчиститьСообщения();
    
    Если Не ЗначениеЗаполнено(АдресОтчетаВоВременномХранилище) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать файл отчета", , , "ПутьКФайлуОтчета");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоОтчетуНаСервере();	
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086 

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
&НаСервере
Процедура ЗаполнитьПоОтчетуНаСервере()
	//+ ИнфоСофт Сумин Д.В. 30.06.2023 УА #60267
	ТабличныйДокумент = ПрочитатьExcelФайлВТабличныйДокумент();
	Если ТабличныйДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	//Если РасширениеФайлаОтчетаZip Тогда  
	//	
	//	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище); 
	//	Имя = ПолучитьИмяВременногоФайла("zip");
	//	ФайлВременногоХранилища.Записать(Имя);
	//	
	//	ВызватьОшибку = Истина;
	//	ТабличныйДокумент = ПрочитатьТабДокИзZIP(Имя, ВызватьОшибку);
	//	
	//	Если ВызватьОшибку Тогда
	//		ОбщегоНазначения.СообщитьПользователю("Был выбран некорректный файл для загрузки отчета комиссионера WildBerries
	//			|проверьте выбранный файл", , , "ПутьКФайлу");
	//		Возврат;
	//	КонецЕсли;
	//	
	//Иначе
	//	
	//	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	//	Имя = ПолучитьИмяВременногоФайла("xlsx");
	//	ФайлВременногоХранилища.Записать(Имя);
	//	ТабличныйДокумент = Новый ТабличныйДокумент;
	//	ТабличныйДокумент.Прочитать(Имя);	
	//	
	//КонецЕсли;     
	//
	//ТабличныйДокумент.Область().Разъединить();
	//- ИнфоСофт Сумин Д.В. 30.06.2023 УА #60267
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.ИС_WB_НаименованиеУслугИзОтчетаWildberries"));
	Данные.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("НДС", Новый ОписаниеТипов("Число")); 
	
	НомерДата = ТабличныйДокумент.Область("R5C7").Текст;
	ДатаДокумента = Дата(СтрЗаменить(СтрРазделить(НомерДата, " ")[2], "-", "") + "000000"); 
	
	ЗаполнитьДанныеПоУслугамОтчета(ТабличныйДокумент);	
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086   

//+ ИнфоСофт Сумин Д.В. 19.08.22 УА #48780
&НаСервере
Процедура ЗаполнитьДанныеПоУслугамОтчета(ТабличныйДокумент)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.Ссылка КАК Ссылка,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.НаименованиеУслугиИзОтчета КАК НаименованиеУслугиИзОтчета,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.Номенклатура КАК Номенклатура,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.СтатьяРасходов КАК СтатьяРасходов
	|ИЗ
	|	Справочник.ИС_WB_НаименованиеУслугИзОтчетаWildberries КАК ИС_WB_НаименованиеУслугИзОтчетаWildberries";
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение("Необходимо заполнить справочник ""Наименование услуш Wildberries.""");	
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОтражениеУслугWildberries.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.НаименованиеУслугиИзОтчета) Тогда
			ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон("Не заполнено поле ""Наименование услуги из отчета"" услуги %1, услуга не будет добавлена.", 
			Выборка.Ссылка));
			Продолжить; 
		КонецЕсли;     
		
		Если Не ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон("Не заполнено поле ""Номенклатура"" услуги %1, услуга не будет добавлена.", Выборка.Ссылка));  
			Продолжить;
		КонецЕсли;
		
		Для НомерСтроки = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
			
			Если СокрЛП(ТабличныйДокумент.Область("R" + НомерСтроки + "C3").Текст) = СокрЛП(Строка(Выборка.НаименованиеУслугиИзОтчета)) Тогда				
				
				НоваяСтрока = ОтражениеУслугWildberries.Добавить();
				НоваяСтрока.УслугаWildberries = Выборка.Ссылка;    
				НоваяСтрока.Номенклатура = Выборка.Номенклатура;
				НоваяСтрока.СтатьяРасходов = Выборка.СтатьяРасходов;			    
				
				Попытка
					НоваяСтрока.Сумма = Число(ТабличныйДокумент.Область("R" + НомерСтроки + "C13").Текст);
				Исключение
				КонецПопытки;   
				
				Попытка
					
					Если СокрЛП(Строка(Выборка.НаименованиеУслугиИзОтчета)) = "Сумма вознаграждения Вайлдберриз за текущий период (ВВ), без НДС" Тогда
						НомерСтроки = НомерСтроки + 1;
						НоваяСтрока.НДС = Число(ТабличныйДокумент.Область("R" + НомерСтроки + "C13").Текст);
					Иначе
						НоваяСтрока.НДС = Число(ТабличныйДокумент.Область("R" + НомерСтроки + "C14").Текст);	
					КонецЕсли;
					
				Исключение
				КонецПопытки;    
				
				Если НоваяСтрока.НДС > 0 Тогда
					НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("20%");
				Иначе				
					НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
				КонецЕсли;
				
				Прервать;   			
				
			КонецЕсли;
			
		КонецЦикла		
		
	КонецЦикла; 	
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.08.22 УА #48780 

//+ ИнфоСофт Сумин Д.В. 24.05.22 УА #44858
&НаКлиенте
Процедура СоздатьДокументПриобретенияУслуг(Команда)	 
	
	Если ОтражениеУслугWildberries.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите услуги для отражения в учете.");
		Возврат;
	КонецЕсли;
		
	СоздатьДокументПриобретенияНаСервере(); 
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 24.05.22 УА #44858

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
&НаСервере
Процедура СоздатьДокументПриобретенияНаСервере()
	
	ЗаголовокСтруктура = Новый Структура; 
	
	ЗаголовокСтруктура.Вставить("ДатаДокумента", ДатаДокумента);
	ЗаголовокСтруктура.Вставить("Комментарий", НомерДата);
	
	ДанныеДокумента = ОтражениеУслугWildberries.Выгрузить();
	
	ДокументПриобретения = ИС_WB_Сервер.СоздатьДокументПриобретения(Профиль, ДанныеДокумента, ЗаголовокСтруктура);
	
	ДокументПриобретения = ДокументПриобретения.Ссылка;
	
	ДобавитьДокументВРезультирующуюТЧ(ДокументПриобретения.Ссылка);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086 

//+ ИнфоСофт Сумин Д.В. 28.06.22 УА #44858	
&НаКлиенте
Процедура СоздатьДокументВзаимозачетЗадолженности(Команда)
	Если Не ЗначениеЗаполнено(ДокументПриобретения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите документ приобретения.");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтчетКомиссионера) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите документ отчет комиссионера.");
		Возврат;
	КонецЕсли;
	
	СоздатьДокументВзаимозачетЗадолженностиНаСервере();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 28.06.22 УА #44858 

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
&НаСервере
Процедура СоздатьДокументВзаимозачетЗадолженностиНаСервере()
	ДокументВзаимозачет = ИС_WB_Сервер.СоздатьДокументВзаимозачетЗадолженности(Профиль, ДокументПриобретения, ОтчетКомиссионера);	
	ДобавитьДокументВРезультирующуюТЧ(ДокументВзаимозачет);
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086

//+ ИнфоСофт Сумин Д.В. 02.11.2023 УА #64784
&НаСервере
Процедура ЗагрузитьИностранныеПродажиНаСервере() 
	
	УстановитьПривилегированныйРежим(Истина);

	Если Не Элементы.СписокТранзакцийExcelWBИн.Видимость Тогда 
		
		Если Не ЗначениеЗаполнено(ПутьКФайлуДетализации) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не выбран файл",,, "ПутьКФайлуДетализации");
			Возврат;
		КонецЕсли;				
		
		ПродажиТЗ = ПолучитьТаблицуЗначенийПродажИзФайла();
		
		Отбор = Новый Структура("ТипДокумента", "Возврат");
		ВозвратыТЗ = ПродажиТЗ.Скопировать(Отбор);
		
		//+ ИнфоСофт Сумин Д.В. 10.11.2023 УА #66026
		МассивКУдалению = Новый Массив;
		Для Каждого Строка Из ПродажиТЗ Цикл
			Если Строка.ТипДокумента = "Возврат" Тогда
				МассивКУдалению.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Элемент Из МассивКУдалению Цикл
			ПродажиТЗ.Удалить(Элемент);	
		КонецЦикла;
		//- ИнфоСофт Сумин Д.В. 10.11.2023 УА #66026

		ТаблицаРезультирующаяПродажи = ИС_WB_Сервер.ПолучитьРезультирующиюТаблицуИнПродаж(ПродажиТЗ, Профиль);
			
		ДобавитьВТаблицу(ТаблицаРезультирующаяПродажи, Ложь);
		
		ТаблицаРезультирующаяВозвраты = ИС_WB_Сервер.ПолучитьРезультирующиюТаблицуИнПродаж(ВозвратыТЗ, Профиль);
		ДобавитьВТаблицу(ТаблицаРезультирующаяВозвраты, Истина); 
		
		СписокТранзакцийExcelWBИн.Сортировать("Номенклатура Возр");
		
		Для Каждого Строка Из СписокТранзакцийExcelWBИн Цикл
			Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьПользователю("Проверьте сопоставление для создания документов!"); 
				Элементы.СписокТранзакцийExcelWBИн.Видимость = Истина; 
				//+ ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
				Элементы.ПодобратьПоАртикулуИн.Видимость = Истина;
				//- ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
	Иначе 
		
		Для Каждого Строка Из СписокТранзакцийExcelWBИн Цикл
			Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьПользователю("Проверьте сопоставление для создания документов!");
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаРезультирующаяПродажи = СписокТранзакцийExcelWBИн.Выгрузить(Новый Структура("Возврат", Ложь));	
		ТаблицаРезультирующаяВозвраты = СписокТранзакцийExcelWBИн.Выгрузить(Новый Структура("Возврат", Истина));
		
	КонецЕсли;

	ЗаголовокСтруктура = ПолучитьДанныеЗаголовкаИзФайла();
	
	Если Не СоздаватьПриОшибке Тогда
		НачатьТранзакцию(); 
	КонецЕсли;	
	
	ЕстьОшибка = Ложь;
		
	ПараметрыСебестоимости = Новый Структура("СпособРасчета, ВидЦены", ВариантФормированияСебестоимости, ВидЦеныСебестоимость);
	
	МассивДокументов = Новый Массив();
	
	//+ ИнфоСофт Сумин Д.В. 21.11.2023 УА #61641
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"); 
	Если ИспользоватьСоглашенияСКлиентами Тогда
		КомиссионныеПродажи25 = Профиль.Соглашение.КомиссионныеПродажи25;
	Иначе
		КомиссионныеПродажи25 = Профиль.Договор.КомиссионныеПродажи25;
	КонецЕсли;	
    //- ИнфоСофт Сумин Д.В. 21.11.2023 УА #61641

	Попытка 
		//+ ИнфоСофт Сумин Д.В. 21.11.2023 УА #61641
        Если НЕ КомиссионныеПродажи25 Тогда
		//Если Не ЗначениеЗаполнено(Профиль.Соглашение) Или НЕ Профиль.Соглашение.КомиссионныеПродажи25 Тогда
		//- ИнфоСофт Сумин Д.В. 21.11.2023 УА #61641
			ДокументВозвратКомиссия = ИС_WB_Сервер.СоздатьДокументВозвратТоваров(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура, Истина); 
			МассивДокументов.Добавить(ДокументВозвратКомиссия.Ссылка);
			
			ДокументРТУ = ИС_WB_Сервер.СоздатьДокументРТУ(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура, Ложь); 
			МассивДокументов.Добавить(ДокументРТУ.Ссылка);
			
			Если ТаблицаРезультирующаяВозвраты.Количество() > 0 Тогда 
				ДокументВозвратТоваровОтКлиента = ИС_WB_Сервер.СоздатьДокументВозвратТоваров(Профиль, ТаблицаРезультирующаяВозвраты, ЗаголовокСтруктура, Ложь, ПараметрыСебестоимости);
				МассивДокументов.Добавить(ДокументВозвратТоваровОтКлиента.Ссылка);
				
				ДокументПередачаНаКомиссию = ИС_WB_Сервер.СоздатьДокументРТУ(Профиль, ТаблицаРезультирующаяВозвраты, ЗаголовокСтруктура, Истина);
				МассивДокументов.Добавить(ДокументПередачаНаКомиссию.Ссылка);	
			КонецЕсли;  
		Иначе 
			//+ ИнфоСофт Стояк Ю.К. 23.11.2023 УА #64836			
			ДокументЗаявкаНаВозвратКомиссия = Неопределено;
			
			Если Константы.ИспользоватьЗаявкиНаВозвратТоваровОтКлиентов.Получить() Тогда
				ДокументЗаявкаНаВозвратКомиссия = ИС_WB_Сервер.СоздатьДокументЗаявкаНаВозврат(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура); 
				МассивДокументов.Добавить(ДокументЗаявкаНаВозвратКомиссия.Ссылка);
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 23.11.2023 УА #64836
			
			ДокументВозвратКомиссия = ИС_WB_Сервер.СоздатьДокументПоступлениеТоваровОтХранителя(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура, ДокументЗаявкаНаВозвратКомиссия);
			МассивДокументов.Добавить(ДокументВозвратКомиссия.Ссылка);
			
			ДокументРТУ = ИС_WB_Сервер.СоздатьДокументРТУ(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура, Ложь);
			МассивДокументов.Добавить(ДокументРТУ.Ссылка);
			
			ОблагаетсяНДС = ИС_WB_СерверУТ11_5.ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация);
			
			Если ОблагаетсяНДС И ДокументРТУ.Проведен Тогда 
				СчетФактура = ИС_WB_СерверУТ11_5.СоздатьСчетФактуру(ДокументРТУ.Ссылка);
				МассивДокументов.Добавить(СчетФактура.Ссылка);  
			КонецЕсли; 
			
			Если ТаблицаРезультирующаяВозвраты.Количество() > 0 Тогда 
				ДокументВозвратТоваровОтКлиента = ИС_WB_Сервер.СоздатьДокументВозвратТоваров(Профиль, ТаблицаРезультирующаяВозвраты, ЗаголовокСтруктура, Ложь, ПараметрыСебестоимости);
				МассивДокументов.Добавить(ДокументВозвратТоваровОтКлиента.Ссылка);
				
				ДокументПередачаТоваровНаХранение = ИС_WB_Сервер.СоздатьПередачуТоваровНаХранение(Профиль, ТаблицаРезультирующаяВозвраты, ЗаголовокСтруктура);
				МассивДокументов.Добавить(ДокументПередачаТоваровНаХранение.Ссылка);
			КонецЕсли;
		КонецЕсли; 
		
	Исключение
		ЕстьОшибка = Истина;
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;
	
	Если Не СоздаватьПриОшибке И ЕстьОшибка Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	Если Не СоздаватьПриОшибке И Не ЕстьОшибка Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;

	Для Каждого Элемент Из МассивДокументов Цикл
		ДобавитьДокументВРезультирующуюТЧ(Элемент);	
	КонецЦикла;		
	
    УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 02.11.2023 УА #64784

//+ ИнфоСофт Сумин Д.В. 30.06.2023 УА #60267
&НаСервере
Функция ПрочитатьExcelФайлВТабличныйДокумент()  
	
	Если РасширениеФайлаОтчетаZip Тогда  
		
		ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище); 
		Имя = ПолучитьИмяВременногоФайла("zip");
		ФайлВременногоХранилища.Записать(Имя);
		
		ВызватьОшибку = Истина;
		ТабличныйДокумент = ПрочитатьТабДокИзZIP(Имя, ВызватьОшибку);
		
		Если ВызватьОшибку Тогда
			ОбщегоНазначения.СообщитьПользователю("Был выбран некорректный файл для загрузки отчета комиссионера WildBerries
				|проверьте выбранный файл", , , "ПутьКФайлу");
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		
		ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
		Имя = ПолучитьИмяВременногоФайла("xlsx");
		ФайлВременногоХранилища.Записать(Имя);
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Прочитать(Имя);	
		
	КонецЕсли;     
	
	ТабличныйДокумент.Область().Разъединить();
	
	Возврат ТабличныйДокумент;
	
КонецФункции  //- ИнфоСофт Сумин Д.В. 30.06.2023 УА #60267

//+ ИнфоСофт Сумин Д.В. 30.06.2023 УА #60267
&НаСервере
Функция ПолучитьСуммуУслугВБ(ТабличныйДокумент) 
	Сумма = 0;
	Для НомерСтроки = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
		Если СокрЛП(ТабличныйДокумент.Область("R" + НомерСтроки + "C1").Текст) = "Итого Вознаграждение Вайлдберриз за объем реализованного Товара за текущий период с учетом возврата Товара:" Тогда							    	
			Попытка
				НомерСтроки = НомерСтроки + 1;
				Сумма = ИС_WB_Сервер.СтрокаВЧисло(ТабличныйДокумент.Область("R" + НомерСтроки + "C13").Текст);
			Исключение
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Сумма;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 30.06.2023 УА #60267

//+ ИнфоСофт Сумин Д.В. 03.07.2023 УА #60267
&НаСервере
Функция ПолучитьНастройкиЗаполненияВВ()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ИС_WB_НаименованиеУслугИзОтчетаWildberries.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ИС_WB_НаименованиеУслугИзОтчетаWildberries.Номенклатура.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)) КАК СтавкаНДС
	|ИЗ
	|	Справочник.ИС_WB_НаименованиеУслугИзОтчетаWildberries КАК ИС_WB_НаименованиеУслугИзОтчетаWildberries
	|ГДЕ
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.НаименованиеУслугиИзОтчета = ""Сумма вознаграждения Вайлдберриз за текущий период (ВВ), без НДС""
	|";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураНастроек = Новый Структура;
	
	Если РезультатЗапроса.Пустой() Тогда
		СтруктураНастроек.Вставить("СтавкаНДС", Справочники.СтавкиНДС.ПустаяСсылка());	
		СтруктураНастроек.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());  
		
		Возврат СтруктураНастроек;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	СтруктураНастроек.Вставить("СтавкаНДС", Выборка.СтавкаНДС);	
	СтруктураНастроек.Вставить("Номенклатура", Выборка.Номенклатура);
	
	Возврат СтруктураНастроек;     
	
КонецФункции //- ИнфоСофт Сумин Д.В. 03.07.2023 УА #60267	

//+ ИнфоСофт Стояк Ю.К. 07.09.2023 УА #62429
&НаСервере
Процедура ДобавитьВТаблицу(Таблица, ЭтоВозврат)
	
	Для Каждого Строка Из Таблица Цикл
		
		НСтр = СписокТранзакцийExcelWBИн.Добавить(); 
		
		НСтр.Номенклатура = Строка.Номенклатура;
		НСтр.Характеристика = Строка.Характеристика;
		НСтр.Упаковка = Строка.Упаковка;
		НСтр.КПеречислениюПродавцуЗаРеализованныйТовар = Строка.КПеречислениюПродавцуЗаРеализованныйТовар;
		НСтр.Количество = Строка.Количество;
		НСтр.ВайлдберризРеализовалТоварПр = Строка.ВайлдберризРеализовалТоварПр;
		НСтр.УпаковкаКоличество = Строка.УпаковкаКоличество;
		НСтр.Размер = Строка.Размер;
		НСтр.ЭтоНабор = Строка.ЭтоНабор;
		НСтр.Название = Строка.Название;
		НСтр.Код = Строка.Код;
		НСтр.Баркод = Строка.Баркод;
		НСтр.Номер = Строка.Номер;
		НСтр.Возврат = ЭтоВозврат;
		//+ ИнфоСофт Мурсалимов Д.Р. 15.12.23 УА #64799
		НСтр.Артикул = СокрЛП(Строка.Артикул);
		НСтр.РазмерПоставщика = СокрЛП(Строка.РазмерПоставщика);
		//- ИнфоСофт Мурсалимов Д.Р. 15.12.23 УА #64799
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 07.09.2023 УА #62429

//+ ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
&НаСервере
Функция ВыполнитьГруппировкуПоНоменклатуре(ДанныеДляДокумента)  
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Данные.Номенклатура КАК Номенклатура,
	|	Данные.Характеристика КАК Характеристика,
	|	Данные.Упаковка КАК Упаковка,
	|	Данные.Количество КАК Количество,
	|	Данные.ЦенаРозничная КАК ЦенаРозничная,
	|	Данные.СуммаПродажи КАК СуммаПродажи,
	|	Данные.ЦенаПродажи КАК ЦенаПродажи,
	|	Данные.Размер КАК Размер,
	|	Данные.ЭтоНабор КАК ЭтоНабор,
	|	Данные.Название КАК Название,
	|	Данные.Баркод КАК Баркод,
	|	Данные.Номер КАК Номер,
	|	Данные.Код КАК Код,
	|	Данные.КоличествоВУпаковке КАК КоличествоВУпаковке
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&Данные КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ВТ_Данные.Упаковка) КАК Упаковка,
	|	СУММА(ВТ_Данные.Количество) КАК Количество,
	|	МАКСИМУМ(ВТ_Данные.ЦенаРозничная) КАК ЦенаРозничная,
	|	СУММА(ВТ_Данные.СуммаПродажи) КАК СуммаПродажи,
	|	МАКСИМУМ(ВТ_Данные.ЦенаПродажи) КАК ЦенаПродажи,
	|	МАКСИМУМ(ВТ_Данные.ЭтоНабор) КАК ЭтоНабор,
	|	МАКСИМУМ(ВТ_Данные.КоличествоВУпаковке) КАК КоличествоВУпаковке
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.Номенклатура,
	|	ВТ_Данные.Характеристика");
	
	Запрос.УстановитьПараметр("Данные", ДанныеДляДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеДляДокумента = РезультатЗапроса.Выгрузить();
	
	МассивУдаляемыхСтрока = Новый Массив;
	
	Для Каждого Строка Из ДанныеДляДокумента Цикл
		Если Строка.Количество = 0 Тогда
			МассивУдаляемыхСтрока.Добавить(Строка);	
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Элемент Из МассивУдаляемыхСтрока Цикл
		ДанныеДляДокумента.Удалить(Элемент);	
	КонецЦикла;
	
	Возврат ДанныеДляДокумента;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595

//+ ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730
&НаСервере
Процедура ОбработатьБрак(ДокОтчет, БракТЗ) 
	
	БракТЗ = ПолучитьСоотвествиеНоменклаутры(БракТЗ);  
	
	Брак.Загрузить(БракТЗ);
	
	Для Каждого Элемент Из БракТЗ Цикл
		СоздатьДокументКорректировкиЗадолженности(ДокОтчет, Элемент); 
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730	 

//+ ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730
&НаСервере
Процедура ОбработатьПотери(ДокОтчет, ПотериТЗ) 
	
	ПотериТЗ = ПолучитьСоотвествиеНоменклаутры(ПотериТЗ);
	
	Потери.Загрузить(ПотериТЗ);
	
	ДокументСписания = СоздатьДокументСписанияТоваровКомиссионера(ДокОтчет, ПотериТЗ);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730	

//+ ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730
&НаСервере
Функция ПолучитьТзИзМассива(Массив)
	
	ТЗ = Новый ТаблицаЗначений;
	
	СтрокаТип = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(30));
	
	Для Каждого Колонка Из Массив[0].Владелец().Колонки Цикл
		Если Стрдлина(Колонка.Имя) > 1 Тогда
			ТЗ.Колонки.Добавить(Колонка.Имя, СтрокаТип);
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Элемент Из Массив Цикл
		НоваяСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);	
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730

//+ ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730
&НаСервере
Функция ПолучитьСоотвествиеНоменклаутры(ТЗ)
	
	Данные = Новый ТаблицаЗначений;
	//Данные.Колонки.Добавить("Баркод");
	Данные.Колонки.Добавить("Баркод", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Данные.Колонки.Добавить("ВайлдберризРеализовалТовар_Пр_", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,2)));
	
	Для Каждого Строка Из ТЗ Цикл 
		НоваяСтрока = Данные.Добавить();
		НоваяСтрока.Баркод 							= Строка.Баркод;
		НоваяСтрока.ВайлдберризРеализовалТовар_Пр_ 	= Число(Строка.ВайлдберризРеализовалТовар_Пр_);		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Данные.Баркод КАК Баркод,
	|	Данные.ВайлдберризРеализовалТовар_Пр_ КАК Сумма
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&Данные КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Данные.Сумма) КАК Сумма,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ИС_WB_ШтрихкодыРазмеров.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|			ПО ИС_WB_ШтрихкодыРазмеров.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
	|		ПО ВТ_Данные.Баркод = ИС_WB_ШтрихкодыРазмеров.Штрихкод
	|			И (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	|	ИС_WB_ШтрихкодыРазмеров.Штрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Штрихкод КАК Штрихкод,
	|	МАКСИМУМ(ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка, ВТ_ОсновныеДанные.Номенклатура.ЕдиницаИзмерения)) КАК Упаковка
	|ПОМЕСТИТЬ ВТ_Упаковка
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО (ВТ_ОсновныеДанные.Штрихкод = ШтрихкодыНоменклатуры.Штрихкод)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОсновныеДанные.Штрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Сумма КАК Сумма,
	|	ВТ_ОсновныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ОсновныеДанные.Характеристика КАК Характеристика,
	|	ВТ_ОсновныеДанные.Штрихкод КАК Штрихкод,
	|	ВТ_Упаковка.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновныеДанные.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоНабор
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Упаковка КАК ВТ_Упаковка
	|		ПО ВТ_ОсновныеДанные.Штрихкод = ВТ_Упаковка.Штрихкод"); 
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Данные", Данные);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Сумин Д.В. 29.11.2023 УА #63730

//+ ИнфоСофт Сумин Д.В. 30.11.2023 УА #63730
&НаСервере
Процедура СоздатьДокументКорректировкиЗадолженности(ДокОтчет, БракСтрока)  
	
	Корректировка = Документы.КорректировкаЗадолженности.СоздатьДокумент();	
	
	Корректировка.Дата = ТекущаяДатаСеанса();
	
	Корректировка.Организация = ДокОтчет.Организация;
	
	Корректировка.Контрагент = ДокОтчет.Контрагент;
	
	Корректировка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности; 
	
	Корректировка.ЭтоНачисление = Истина;
	
	Корректировка.КорреспонденцияСДоходами = Ложь;
	
	Корректировка.РасчетыМеждуОрганизациями = Ложь;
	
	СтрокаТЧ = Корректировка.Задолженность.Добавить();
	
	СтрокаТЧ.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	
	СтрокаТЧ.Партнер = Докотчет.Партнер;
	
	СтрокаТЧ.ВалютаВзаиморасчетов = Докотчет.Валюта; 
	
	СтрокаТЧ.Сумма = БракСтрока.Сумма;
	
	СтрокаТЧ.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", Докотчет.Ссылка);

	СтрокаТЧ.ДатаПлатежа = Корректировка.Дата; 
	
	Корректировка.Записать(РежимЗаписиДокумента.Запись);
	
	ДобавитьДокументВРезультирующуюТЧ(Корректировка.Ссылка);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 30.11.2023 УА #63730	

//+ ИнфоСофт Сумин Д.В. 30.11.2023 УА #63730
&НаСервере
Функция СоздатьДокументСписанияТоваровКомиссионера(ДокОтчет, ПотериТЗ)
	
	ДокументСписания = Документы.ОтчетКомиссионераОСписании.СоздатьДокумент();
	
	ДокументСписания.Дата = ТекущаяДатаСеанса();
	
	ДокументСписания.Организация = ДокОтчет.Организация;
	
	ДокументСписания.Партнер = ДокОтчет.Партнер;
	
	ДокументСписания.Контрагент = ДокОтчет.Контрагент; 
	
	ДокументСписания.Соглашение = ДокОтчет.Соглашение;
	
	ДокументСписания.Валюта = ДокОтчет.Валюта;
	
	ДокументСписания.НалогообложениеНДС = ДокОтчет.НалогообложениеНДС;
	
	ДокументСписания.ЦенаВключаетНДС = ДокОтчет.ЦенаВключаетНДС;
	
	ДокументСписания.ДатаПлатежа = ТекущаяДатаСеанса();
	
	ДокументСписания.Договор = ДокОтчет.Договор; 
	
	ДокументСписания.ПорядокРасчетов = ДокОтчет.ПорядокРасчетов;
	
	ДокументСписания.ПорядокРасчетов = ДокОтчет.ПорядокРасчетов;
	
	Если ДокументСписания.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС Тогда
		ПродажаОблагаетсяНДС = Истина;
	Иначе
		ПродажаОблагаетсяНДС = Ложь;
	КонецЕсли;	
		
	Для Каждого Элемент Из ПотериТЗ Цикл
		
		Если Элемент.ЭтоНабор Тогда
			ТоварыНабора = ИС_WB_СерверУТ11_5.ПолучитьТаблицуТоваровНабораNew(Элемент.Номенклатура, Элемент.Характеристика, Профиль);  
			
			Если ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Или
				ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам Тогда
				
				МассивКоэффициентов = ИС_WB_СерверУТ11_5.РассчитатьКоэффициентыИзЦен(ТоварыНабора.ВыгрузитьКолонку("КомплектующиеЦена"), Элемент.Номенклатура);
			Иначе
				МассивКоэффициентов = ТоварыНабора.ВыгрузитьКолонку("ДоляСтоимости");
			КонецЕсли;
			
			СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Элемент.Сумма, МассивКоэффициентов);
				
	  		Для Каждого ЭлементНабора Из ТоварыНабора Цикл 
				
				НоваяСтрока = ДокументСписания.Товары.Добавить();
				
				НоваяСтрока.Номенклатура = ЭлементНабора.Номенклатура;
				НоваяСтрока.Характеристика = ЭлементНабора.Характеристика;
				НоваяСтрока.Количество = ЭлементНабора.КоличествоУпаковок;
				НоваяСтрока.КоличествоУпаковок = ЭлементНабора.КоличествоУпаковок;
								
				НоваяСтрока.Цена = СуммыПродажи[0] / ЭлементНабора.КоличествоУпаковок;
				НоваяСтрока.Сумма = СуммыПродажи[0];
				НоваяСтрока.СуммаСНДС = СуммыПродажи[0];			 
				НоваяСтрока.СтавкаНДС = ЭлементНабора.Номенклатура.СтавкаНДС;
				НоваяСтрока.Упаковка = ЭлементНабора.Упаковка;
				
				СуммыПродажи.Удалить(0);
	
			КонецЦикла;	
		Иначе	
			НоваяСтрока = ДокументСписания.Товары.Добавить();
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;
			НоваяСтрока.Характеристика = Элемент.Характеристика;
			НоваяСтрока.Упаковка = Элемент.Упаковка;
			НоваяСтрока.КоличествоУпаковок = 1;
			Если Элемент.Упаковка.Числитель = 0 Тогда
				НоваяСтрока.Количество = 1;	
			Иначе	
				НоваяСтрока.Количество = Элемент.Упаковка.Числитель; 
			КонецЕсли;
			НоваяСтрока.Цена = Элемент.Сумма;
			НоваяСтрока.Сумма = Элемент.Сумма;
			НоваяСтрока.СуммаСНДС = Элемент.Сумма;
			НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС;
		КонецЕсли;
	КонецЦикла;	
	
	Если ПродажаОблагаетсяНДС Тогда 
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументСписания));	
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокументСписания.Товары, СтруктураДействий, Неопределено);	
	КонецЕсли;	
	
	ДокументСписания.Записать(РежимЗаписиДокумента.Запись);
	
	ДобавитьДокументВРезультирующуюТЧ(ДокументСписания.Ссылка);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 30.11.2023 УА #63730	

//+ ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
&НаКлиенте
Процедура ПодобратьПоАртикулу(Команда)
	
	ПодобратьПоАртикулуНаСервере(Элементы.Отчеты.ТекущаяСтраница.Имя);	
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799  

//+ ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
&НаСервере
Процедура ПодобратьПоАртикулуНаСервере(Отчеты)
	
	ТЗРезультирующая = Новый ТаблицаЗначений;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 28.03.24 УА #72971
	ТЗРезультирующая.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ТЗРезультирующая.Колонки.Добавить("Размер", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	//- ИнфоСофт Мурсалимов Д.Р. 28.03.24 УА #72971
		
	Если Отчеты = "РоссийскиеПродажи" Тогда  
		
		ТаблицаСопоставления = СписокТранзакцийExcelWB;
		
	ИначеЕсли Отчеты = "ИностранныеПродажи" Тогда 
		
		ТаблицаСопоставления = СписокТранзакцийExcelWBИн;
		
	Иначе      
		
		ТаблицаСопоставления = СписокТранзакцийExcelWB; 
		
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаСопоставления Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			НоваяСтрока = ТЗРезультирующая.Добавить();
			//+ ИнфоСофт Мурсалимов Д.Р. 27.03.24 УА #72971
			НоваяСтрока.Артикул = СокрЛП(Строка.Артикул);
			НоваяСтрока.Размер = СокрЛП(Строка.РазмерПоставщика);
			//- ИнфоСофт Мурсалимов Д.Р. 27.03.24 УА #72971
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ТЗРезультирующая.Свернуть("Артикул, Размер");
	
	Если ТЗРезультирующая.Количество() = 0 Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Нет данных для обработки!"); 
		Возврат;
		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ДанныеТЗ.Артикул КАК Артикул,
	|	ДанныеТЗ.Размер КАК Размер
	|ПОМЕСТИТЬ ВТ_ДанныеТЗ
	|ИЗ
	|	&ТЗРезультирующая КАК ДанныеТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_Номенклатура.Ссылка КАК Ссылка,
	|	ВТ_ДанныеТЗ.Артикул КАК Артикул,
	|	ВТ_ДанныеТЗ.Размер КАК Размер
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.ИС_WB_Номенклатура КАК ИС_WB_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеТЗ КАК ВТ_ДанныеТЗ
	|		ПО ИС_WB_Номенклатура.vendorCode = ВТ_ДанныеТЗ.Артикул
	|ГДЕ
	|	ИС_WB_Номенклатура.Профиль = &Профиль
	|	И НЕ ВТ_ДанныеТЗ.Размер ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Ссылка КАК НоменклатураWB,
	|	ВТ_Номенклатура.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(ИС_WB_РазмерыНоменклатур.techSize) > 1
	|			ТОГДА ВТ_Номенклатура.Размер
	|		ИНАЧЕ ИС_WB_РазмерыНоменклатур.techSize
	|	КОНЕЦ КАК Размер
	|ПОМЕСТИТЬ ВТ_РазмерНоменклатуры
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|		ПО (ИС_WB_РазмерыНоменклатур.Владелец = ВТ_Номенклатура.Ссылка)
	|			И (ИС_WB_РазмерыНоменклатур.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Номенклатура.Ссылка,
	|	ИС_WB_РазмерыНоменклатур.techSize,
	|	ВТ_Номенклатура.Размер,
	|	ВТ_Номенклатура.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ВТ_РазмерНоменклатуры.Артикул КАК Артикул, 
	|	ВТ_РазмерНоменклатуры.Размер КАК Размер,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоНабор
	|ПОМЕСТИТЬ ВТ_Результирующая
	|ИЗ
	|	ВТ_РазмерНоменклатуры КАК ВТ_РазмерНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|		ПО ВТ_РазмерНоменклатуры.НоменклатураWB = ИС_WB_РазмерыНоменклатур.Владелец
	|			И ВТ_РазмерНоменклатуры.Размер = ИС_WB_РазмерыНоменклатур.techSize
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_РазмерыНоменклатур.Ссылка = ИС_WB_СоответствиеРазмеров.РазмерWB)
	|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
	|ГДЕ
	|	ИС_WB_РазмерыНоменклатур.Профиль = &Профиль
	|	И НЕ ИС_WB_РазмерыНоменклатур.ПометкаУдаления
	|	И НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ШтрихкодыНоменклатуры.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					ИЛИ ШтрихкодыНоменклатуры.Упаковка ЕСТЬ NULL
	|				ТОГДА ВТ_Результирующая.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка
	|		КОНЕЦ) КАК Упаковка,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Числитель, 1)) = 0
	|			ТОГДА 1
	|		ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Числитель, 1))
	|	КОНЕЦ КАК КоличествоВУпаковке,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Упаковка
	|ИЗ
	|	ВТ_Результирующая КАК ВТ_Результирующая
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО (ШтрихкодыНоменклатуры.Номенклатура = ВТ_Результирующая.Номенклатура)
	|			И (ШтрихкодыНоменклатуры.Характеристика = ВТ_Результирующая.Характеристика)
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыНоменклатуры.Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результирующая.Номенклатура КАК Номенклатура,
	|	ВТ_Результирующая.Характеристика КАК Характеристика, 
	|	ВТ_Результирующая.Артикул КАК Артикул,   
	|	ВТ_Результирующая.Размер КАК РазмерПоставщика,
	|	ВТ_Результирующая.ЭтоНабор КАК ЭтоНабор,
	|	ЕСТЬNULL(ВТ_Упаковка.Упаковка, ВТ_Результирующая.Номенклатура.ЕдиницаИзмерения) КАК Упаковка,
	|	ЕСТЬNULL(ВТ_Упаковка.КоличествоВУпаковке, 1) КАК КоличествоВУпаковке
	|ИЗ
	|	ВТ_Результирующая КАК ВТ_Результирующая
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Упаковка КАК ВТ_Упаковка
	|		ПО ВТ_Результирующая.Номенклатура = ВТ_Упаковка.Номенклатура
	|			И ВТ_Результирующая.Характеристика = ВТ_Упаковка.Характеристика";

	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("ТЗРезультирующая", ТЗРезультирующая);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = ТаблицаСопоставления.НайтиСтроки(Новый Структура("Артикул", Выборка.Артикул));
		
		Для Каждого Элемент Из НайденныеСтроки Цикл
			
			Если Не ЗначениеЗаполнено(Элемент.Номенклатура) Тогда
				
				ЗаполнитьЗначенияСвойств(Элемент, Выборка, "Номенклатура,Характеристика,Упаковка,ЭтоНабор,РазмерПоставщика");
	
				Если Отчеты = "РоссийскиеПродажи" Тогда  
					
					Элемент.КоличествоВУпаковке = Выборка.КоличествоВУпаковке;
	
				Иначе      
					
					Элемент.УпаковкаКоличество = Выборка.КоличествоВУпаковке; 
					
				КонецЕсли;	
								
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
&Насервере
Функция ПолучитьДанныеПоЛогистике(Профиль, Логистика)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.Номенклатура КАК Номенклатура,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.СтатьяРасходов КАК СтатьяРасходов,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_WB_НаименованиеУслугИзОтчетаWildberries КАК ИС_WB_НаименованиеУслугИзОтчетаWildberries
	|ГДЕ
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.НаименованиеУслугиИзОтчета = ""Стоимость услуг Вайлдберриз по организации международной перевозки"""; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение("Необходимо корректно заполнить справочник: ""Наименование услуг Wildberries"". Не найдена услуга по доставке.");	
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	ДанныеЛогистики = Новый ТаблицаЗначений;
	
	ДанныеЛогистики.Колонки.Добавить("УслугаWildberries", Новый ОписаниеТипов("СправочникСсылка.ИС_WB_НаименованиеУслугИзОтчетаWildberries")); 
	ДанныеЛогистики.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ДанныеЛогистики.Колонки.Добавить("НДС", Новый ОписаниеТипов("Число"));
	ДанныеЛогистики.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДанныеЛогистики.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	ДанныеЛогистики.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	
	СтрокаТЗ = ДанныеЛогистики.Добавить();
	
	СтрокаТЗ.УслугаWildberries = Выборка.Ссылка;
	СтрокаТЗ.Сумма = Логистика;
	СтрокаТЗ.Номенклатура = Выборка.Номенклатура; 
	СтрокаТЗ.СтатьяРасходов = Выборка.СтатьяРасходов;
	
	ОблагаетсяНДС = ИС_WB_СерверУТ11_5.ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация); 
	
	Если ОблагаетсяНДС Тогда
		СтрокаТЗ.НДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(Логистика, 20, Истина);
		СтрокаТЗ.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("20%");
	Иначе
		СтрокаТЗ.НДС = 0;
		СтрокаТЗ.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");	
	КонецЕсли;
	
	Возврат ДанныеЛогистики;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
