
#Область ОбработчикиСобытий

//+ ИнфоСофт Ивонин К.А. 21.03.24 УА #71892
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Сбер_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_Сбер_Склады КАК ИС_Сбер_Склады
	|ГДЕ
	|	ИС_Сбер_Склады.Профиль = &Профиль
	|	И НЕ ИС_Сбер_Склады.ПометкаУдаления";
		
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() И Не ЗначениеЗаполнено(Ссылка) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Для каждого Профиля Маркетплейса можно создать только один склад МегаМаркета");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.03.24 УА #71892

#КонецОбласти
