
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Заварин К.В. 13.03.25 УА #89418
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Для Каждого Элемент Из Параметры.НоменклатураОтправлений Цикл
		НоваяСтрока = НоменклатураКУпаковке.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.03.25 УА #89418 

//+ ИнфоСофт Заварин К.В. 14.03.25 УА #89418
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	ОчиститьСообщения();
	
	ДанныеШтрихкода = Новый Структура; 
	
	ДанныеШтрихкода.Вставить("ФорматBase64", Ложь); 
	ДанныеШтрихкода.Вставить("Штрихкод", СокрЛП(Данные));
	ДанныеШтрихкода.Вставить("Количество", 1);
	
	ИС_MP_МаркировкаКлиентСервер.ЗакодироватьШтрихкодДанныхBase64(ДанныеШтрихкода); 
	
	ПараметрыСканирования = ИС_MP_МаркировкаКлиент.ПараметрыСканирования(ЭтаФорма);  
	
	РезультатОбработкиШтрихкода = ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования);	
		
		ВыполнитьПроверкуНаПечатьOzon(РезультатОбработкиШтрихкода);
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 14.03.25 УА #89418 

//+ ИнфоСофт Заварин К.В. 13.03.25 УА #89418
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	 КопироватьДанныеФормы(ВладелецФормы.Объект, Объект); 
	 
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.03.25 УА #89418

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Заварин К.В. 13.03.25 УА #89418
&НаСервере
Функция ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения = Неопределено)

	Возврат ИС_MP_Маркировка.ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения, ЭтаФорма.УникальныйИдентификатор);	
			
КонецФункции //- ИнфоСофт Заварин К.В. 13.03.25 УА #89418 

//+ ИнфоСофт Заварин К.В. 14.03.25 УА #89418
&НаКлиенте
Процедура ВыполнитьПроверкуНаПечатьOzon(РезультатОбработкиШтрихкода)
	
	ДанныеШтрихкода = РезультатОбработкиШтрихкода.ДанныеШтрихкода; 	
	
	СтрокаТЗДанныеСборки = Неопределено;   
	
	Для Каждого Строка Из НоменклатураКУпаковке Цикл
		Если Строка.Номенклатура = ДанныеШтрихкода.Номенклатура И Строка.Характеристика = ДанныеШтрихкода.Характеристика И Строка.Количество > Строка.КоличествоФакт Тогда
			СтрокаТЗДанныеСборки = Строка;
			Строка.КоличествоФакт = Строка.КоличествоФакт + 1;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если СтрокаТЗДанныеСборки = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'По отсканированному штрихкоду не найдено доступного заказа для печати этикетки.'"));
		Возврат;
	КонецЕсли;	
	
	ЭтаФорма.Отправление = СтрокаТЗДанныеСборки.Отправление;
	
    ВыполнитьПроверкуНаОкончаниеОбработки();
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 14.03.25 УА #89418

//+ ИнфоСофт Заварин К.В. 14.03.25 УА #89418
&НаКлиенте
Процедура ВыполнитьПроверкуНаОкончаниеОбработки() 
	
	ПрерватьВыполнение = Истина;
	
	Для Каждого Строка Из НоменклатураКУпаковке Цикл
		Если Строка.Количество > Строка.КоличествоФакт Тогда
			ПрерватьВыполнение = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если ПрерватьВыполнение Тогда
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("ТоварыПодобраны", Истина);
		ПараметрыЗакрытия.Вставить("Отправление", ЭтаФорма.Отправление);
		ЭтаФорма.Закрыть(ПараметрыЗакрытия);	
	КонецЕсли;	
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 14.03.25 УА #89418	

#КонецОбласти