#Область ОбработчикиСобытийФормы 

//+ ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого Элемент Из Объект.products Цикл
		Элемент.Отправление = 1;
	КонецЦикла;
	
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	Если Объект.ЗаказФБО Тогда
		Элементы.productsРазделитьТоварНаОтправления.Доступность = Ложь;
		Элементы.СписокСобратьЗаказ.Доступность = Ложь;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989
&НаКлиенте
Процедура РазделитьТоварНаОтправления(Команда)
	
	ТекущаяСтрока = Элементы.products.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Для выполнения команды требуется выбрать строку табличной части.'");
		ПоказатьПредупреждение( , ТекстСообщения);
	Иначе
		
		ТекущаяСтрока = Элементы.products.ТекущиеДанные;
		
		Если ТекущаяСтрока.quantity < 1 Тогда
			ТекстСообщения = НСтр("ru = 'Невозможно разбить строку с количеством меньше двух.'");
			ПоказатьПредупреждение( , ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Заголовок 	= НСтр("ru = 'Введите количество товара в новой строке'");
		Оповещение 	= Новый ОписаниеОповещения("РазделитьТоварНаОтправленияНаСервере", ЭтотОбъект);
		ПоказатьВводЧисла(Оповещение, 1, Заголовок, 10, 0);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989

//+ ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989
&НаКлиенте
Процедура СобратьЗаказ(Команда)
	СобратьЗаказНаСервере();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989
&НаКлиенте
Процедура РазделитьТоварНаОтправленияНаСервере(Количество, СтруктураПараметров) Экспорт
	
	ТекущаяСтрока = Элементы.products.ТекущиеДанные;
	Если Количество = Неопределено Тогда
		Возврат;
	ИначеЕсли Количество = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть равно нулю.'");
		ПоказатьПредупреждение( , ТекстСообщения);
		Возврат;
	ИначеЕсли Количество < 0 Тогда
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть отрицательным.'");
		ПоказатьПредупреждение( , ТекстСообщения);
		Возврат;
	ИначеЕсли Количество > ТекущаяСтрока.quantity Тогда
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть больше количества в текущей.'");
		ПоказатьПредупреждение( , ТекстСообщения);
		Возврат;
	ИначеЕсли Количество = ТекущаяСтрока.quantity Тогда
		ТекстСообщения = НСтр("ru = 'Количество в новой строке должно отличаться от количества в текущей.'");
		ПоказатьПредупреждение( , ТекстСообщения);
		Возврат;
	КонецЕсли;

	ИндексТекущейСтроки 	 = Объект.products.Индекс(ТекущаяСтрока);
	НоваяСтрока 			 = Объект.products.Вставить(ИндексТекущейСтроки + 1);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);

	НоваяСтрока.quantity   		= Количество;
	НоваяСтрока.Сумма   		= НоваяСтрока.quantity * НоваяСтрока.price;
	НоваяСтрока.Отправление		= ТекущаяСтрока.Отправление + 1;
	ТекущаяСтрока.quantity 		= ТекущаяСтрока.quantity - НоваяСтрока.quantity;
	ТекущаяСтрока.Сумма 		= ТекущаяСтрока.Сумма - НоваяСтрока.Сумма;

	Элементы.products.ТекущаяСтрока  = НоваяСтрока.ПолучитьИдентификатор();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989

//+ ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989
&НаСервере
Процедура СобратьЗаказНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_СтатусыСборочныхЗаданий.status КАК status	
		|ИЗ
		|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
		|		ПО ИС_Ozon_Заказ.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ
		|ГДЕ
		|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ = &Заказ
		|	И ИС_Ozon_Заказ.Ссылка = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивЗаданий = РезультатЗапроса.Выгрузить();
	
	МассивОтправлений = Новый Массив;
	
	Если МассивЗаданий[0].status = Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_packaging Тогда	 
		
		Объект.products.Сортировать("Отправление");
		Тело = Новый Структура;
		Упаковки = Новый Массив;
		СоставОтправлений = Новый Массив;
		НомерОтправления = Объект.products[0].Отправление;
		
		Для Каждого Элемент Из Объект.products Цикл 
			
			Состав = Новый Структура;
			//+ ИнфоСофт Мурсалимов Д.Р. 26.02.24 УА #71286
			Состав.Вставить("product_id", Число(Элемент.НоменклатураOzon.sku));
			//Состав.Вставить("product_id", Число(Элемент.НоменклатураOzon.Код));
			//- ИнфоСофт Мурсалимов Д.Р. 26.02.24 УА #71286
			Состав.Вставить("quantity", Элемент.quantity);   
			
			Если НомерОтправления <> Элемент.Отправление Тогда 
								
				products = Новый Структура;
				products.Вставить("products", СоставОтправлений); 
				Упаковки.Добавить(products);
				СоставОтправлений = Новый Массив;  
				СоставОтправлений.Добавить(Состав);
				
				НомерОтправления = Элемент.Отправление;   
				
			Иначе
				СоставОтправлений.Добавить(Состав);				
			КонецЕсли;
			
		КонецЦикла;
		
		products = Новый Структура;
		products.Вставить("products", СоставОтправлений); 
		Упаковки.Добавить(products);
		
		Тело.Вставить("packages", Упаковки);
		Тело.Вставить("posting_number", Объект.Номер);
		
		Результат = ИС_Ozon_Сервер.РазбитьНаОтправления(Объект.Профиль, Тело);
		
		Если Результат Тогда
			
			Если ЗначениеЗаполнено(Объект.Заказ)Тогда
				//+ ИнфоСофт Заварин К.В. 25.09.24 УА #73468
				//ИС_Ozon_Сервер.ОтменитьЗаказ(Объект.Ссылка, Объект.Профиль);
				ИС_Ozon_Сервер.ОтменитьЗаказ(Объект.Ссылка, Объект.Профиль, Ложь);
				//- ИнфоСофт Заварин К.В. 25.09.24 УА #73468
				Объект.Заказ = Документы.ЗаказКлиента.ПустаяСсылка();
			КонецЕсли;
			
			ЭтотОбъект.Записать();
			ИС_Ozon_Сервер.ПолучитьЗаказы(Объект.Профиль, Объект.Дата - 1);
			ЭтотОбъект.Прочитать();
			
		КонецЕсли;
				
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989

#КонецОбласти