
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901
Функция ПолучитьТекстЗапросаЦен() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ИС_WB_РазмерыНоменклатур.Ссылка) КАК ПолеСопоставления,
	|	ИС_WB_РазмерыНоменклатур.Профиль КАК Профиль,
	|	ИС_WB_РазмерыНоменклатур.Владелец КАК НоменклатураWB,
	|	ИС_WB_РазмерыНоменклатур.Владелец.Код КАК nmId
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|ГДЕ
	|	ИС_WB_РазмерыНоменклатур.Профиль = &Профиль
	|	И НЕ ИС_WB_РазмерыНоменклатур.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_РазмерыНоменклатур.Профиль,
	|	ИС_WB_РазмерыНоменклатур.Владелец,
	|	ИС_WB_РазмерыНоменклатур.Владелец.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.ПолеСопоставления КАК ПолеСопоставления,
	|	ИС_МП_РучныеЦены.Цена КАК Цена,
	|	NULL КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_РучныеЦеныОбъединение
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_РучныеЦены КАК ИС_МП_РучныеЦены
	|		ПО (ИС_МП_РучныеЦены.Профиль = &Профиль)
	|			И (ИС_МП_РучныеЦены.Маркетплейс = &Маркетплейс)
	|			И (ИС_МП_РучныеЦены.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦены))
	|			И (ВТ_Номенклатура.ПолеСопоставления = (ВЫРАЗИТЬ(ИС_МП_РучныеЦены.КарточкаМП КАК Справочник.ИС_WB_РазмерыНоменклатур)))
	|ГДЕ
	|	ИС_МП_РучныеЦены.Профиль = &Профиль
	|	И ИС_МП_РучныеЦены.Маркетплейс = &Маркетплейс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.ПолеСопоставления,
	|	NULL,
	|	ИС_МП_РучныеЦеныСоСкидкой.Цена
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_РучныеЦены КАК ИС_МП_РучныеЦеныСоСкидкой
	|		ПО (ИС_МП_РучныеЦеныСоСкидкой.Профиль = &Профиль)
	|			И (ИС_МП_РучныеЦеныСоСкидкой.Маркетплейс = &Маркетплейс)
	|			И (ИС_МП_РучныеЦеныСоСкидкой.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой))
	|			И (ВТ_Номенклатура.ПолеСопоставления = (ВЫРАЗИТЬ(ИС_МП_РучныеЦеныСоСкидкой.КарточкаМП КАК Справочник.ИС_WB_РазмерыНоменклатур)))
	|ГДЕ
	|	ИС_МП_РучныеЦеныСоСкидкой.Профиль = &Профиль
	|	И ИС_МП_РучныеЦеныСоСкидкой.Маркетплейс = &Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.ПолеСопоставления КАК ПолеСопоставления,
	|	ИС_МП_ПоследниеЦены.Цена КАК Цена,
	|	NULL КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_ПоследниеЦеныОбъединение
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_ПоследниеВыгруженныеЦены КАК ИС_МП_ПоследниеЦены
	|		ПО (ИС_МП_ПоследниеЦены.Профиль = &Профиль)
	|			И (ИС_МП_ПоследниеЦены.Маркетплейс = &Маркетплейс)
	|			И (ИС_МП_ПоследниеЦены.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦены))
	|			И (ВТ_Номенклатура.ПолеСопоставления = (ВЫРАЗИТЬ(ИС_МП_ПоследниеЦены.КарточкаМП КАК Справочник.ИС_WB_РазмерыНоменклатур)))
	|ГДЕ
	|	ИС_МП_ПоследниеЦены.Профиль = &Профиль
	|	И ИС_МП_ПоследниеЦены.Маркетплейс = &Маркетплейс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.ПолеСопоставления,
	|	NULL,
	|	ИС_МП_ПоследниеЦеныСоСкидкой.Цена
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_ПоследниеВыгруженныеЦены КАК ИС_МП_ПоследниеЦеныСоСкидкой
	|		ПО (ИС_МП_ПоследниеЦеныСоСкидкой.Профиль = &Профиль)
	|			И (ИС_МП_ПоследниеЦеныСоСкидкой.Маркетплейс = &Маркетплейс)
	|			И (ИС_МП_ПоследниеЦеныСоСкидкой.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой))
	|			И (ВТ_Номенклатура.ПолеСопоставления = (ВЫРАЗИТЬ(ИС_МП_ПоследниеЦеныСоСкидкой.КарточкаМП КАК Справочник.ИС_WB_РазмерыНоменклатур)))
	|ГДЕ
	|	ИС_МП_ПоследниеЦеныСоСкидкой.Профиль = &Профиль
	|	И ИС_МП_ПоследниеЦеныСоСкидкой.Маркетплейс = &Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РучныеЦеныОбъединение.ПолеСопоставления КАК ПолеСопоставления,
	|	СУММА(ВТ_РучныеЦеныОбъединение.Цена) КАК Цена,
	|	СУММА(ВТ_РучныеЦеныОбъединение.ЦенаСоСкидкой) КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_РучныеЦены
	|ИЗ
	|	ВТ_РучныеЦеныОбъединение КАК ВТ_РучныеЦеныОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РучныеЦеныОбъединение.ПолеСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеЦеныОбъединение.ПолеСопоставления КАК ПолеСопоставления,
	|	СУММА(ВТ_ПоследниеЦеныОбъединение.Цена) КАК Цена,
	|	СУММА(ВТ_ПоследниеЦеныОбъединение.ЦенаСоСкидкой) КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_ПоследниеЦены
	|ИЗ
	|	ВТ_ПоследниеЦеныОбъединение КАК ВТ_ПоследниеЦеныОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоследниеЦеныОбъединение.ПолеСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.ПолеСопоставления КАК ПолеСопоставления,
	|	ВТ_Номенклатура.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_Номенклатура.nmId КАК nmId,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)) КАК ХарактеристикаЦО,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Упаковка, &ПустаяУпаковка) КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Упаковка.Числитель, 1)
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель, 1)
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL КАК ЕстьСопоставление,
	|	ВТ_РучныеЦены.Цена КАК РучнаяЦена,
	|	НЕ ВТ_РучныеЦены.Цена ЕСТЬ NULL КАК ЕстьРучнаяЦена,
	|	ВТ_РучныеЦены.ЦенаСоСкидкой КАК РучнаяЦенаСоСкидкой,
	|	НЕ ВТ_РучныеЦены.ЦенаСоСкидкой ЕСТЬ NULL КАК ЕстьРучнаяЦенаСоСкидкой,
	|	ЕСТЬNULL(ВТ_ПоследниеЦены.Цена, 0) КАК ПоследняяВыгруженнаяЦена,
	|	НЕ ВТ_ПоследниеЦены.Цена ЕСТЬ NULL КАК ЕстьПоследняяВыгруженнаяЦена,
	|	ЕСТЬNULL(ВТ_ПоследниеЦены.ЦенаСоСкидкой, 0) КАК ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	НЕ ВТ_ПоследниеЦены.ЦенаСоСкидкой ЕСТЬ NULL КАК ЕстьПоследняяВыгруженнаяЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ВТ_Номенклатура.ПолеСопоставления = ИС_WB_СоответствиеРазмеров.РазмерWB
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РучныеЦены КАК ВТ_РучныеЦены
	|		ПО (ВТ_РучныеЦены.ПолеСопоставления = ВТ_Номенклатура.ПолеСопоставления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследниеЦены КАК ВТ_ПоследниеЦены
	|		ПО (ВТ_ПоследниеЦены.ПолеСопоставления = ВТ_Номенклатура.ПолеСопоставления)";	
	
	Текст = Текст + ";";
	
	Текст = Текст + ИС_МП_УправлениеЦенами.ТекстЗапросаЦен();
	
	Текст = Текст +	
	
	"ВЫБРАТЬ
	|	ВТ_Сопоставление.ПолеСопоставления КАК РазмерWB,
	|	ВТ_Сопоставление.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_Сопоставление.nmId КАК nmId,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка,
	|	ВТ_Сопоставление.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Сопоставление.ЕстьСопоставление КАК ЕстьСопоставление,
	|	ВТ_Сопоставление.РучнаяЦена КАК РучнаяЦена,
	|	ВТ_Сопоставление.ЕстьРучнаяЦена КАК ЕстьРучнаяЦена,
	|	ВТ_Сопоставление.РучнаяЦенаСоСкидкой КАК РучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьРучнаяЦенаСоСкидкой КАК ЕстьРучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦена КАК ПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦена КАК ЕстьПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦенаСоСкидкой КАК ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой КАК ЕстьПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Цены.Цена КАК Цена,
	|	ВТ_Цены.ЦенаСоСкидкой КАК ЦенаСоСкидкой,
	|	ВТ_Цены.ЦенаFBO КАК ЦенаFBO,
	|	МАКСИМУМ(ИС_WB_ШтрихкодыРазмеров.Штрихкод) КАК Штрихкод
	|ИЗ
	|	ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_Цены.ПолеСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
	|			И ВТ_Сопоставление.ПолеСопоставления = ИС_WB_ШтрихкодыРазмеров.Размер
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сопоставление.ПолеСопоставления,
	|	ВТ_Сопоставление.НоменклатураWB,
	|	ВТ_Сопоставление.nmId,
	|	ВТ_Сопоставление.Номенклатура,
	|	ВТ_Сопоставление.Характеристика,
	|	ВТ_Сопоставление.Упаковка,
	|	ВТ_Сопоставление.ЭтоНабор,
	|	ВТ_Сопоставление.ЕстьСопоставление,
	|	ВТ_Сопоставление.РучнаяЦена,
	|	ВТ_Сопоставление.ЕстьРучнаяЦена,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦена,
	|	ВТ_Цены.Цена,
	|	ВТ_Цены.ЦенаСоСкидкой,
	|	ВТ_Цены.ЦенаFBO,
	|	ВТ_Сопоставление.РучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьРучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Сопоставление.ЕстьСопоставление УБЫВ,
	|	ВТ_Сопоставление.РучнаяЦена УБЫВ";
	
	Возврат Текст;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 12.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 22.03.23 УА #55822
Функция ПолучитьТекстЗапросаСборочныхЗаданий() Экспорт
	
	//+ ИнфоСофт Заварин К.В. 05.09.24 УА #79742
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ИС_WB_СборочноеЗадание.Заказ КАК Заказ1C
	|ПОМЕСТИТЬ ВТ_ЗаказыСоСтатусами
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание)
	|			И (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Профиль = &Профиль)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И &ВсеОтправления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка,
	|	ИС_WB_СборочноеЗадание.Заказ
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	|			И (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Профиль = &Профиль)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	//+ ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461
	//|	И ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус В(&Статусы)
	|	И (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус В(&Статусы)	
	|		ИЛИ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB В(&СтатусыВБ))
	|	И НЕ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB В (&ИсключающиесяСтатусыВБ)
	//- ИнфоСофт Стояк Ю.К. 02.03.2025 УА #87461	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаказыСоСтатусами.Ссылка КАК Ссылка,
	|	ПередачаТоваровХранителю.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	ВТ_ЗаказыСоСтатусами КАК ВТ_ЗаказыСоСтатусами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ВТ_ЗаказыСоСтатусами.Заказ1C = ПередачаТоваровХранителю.ЗаказКлиента
	|			И (НЕ ВТ_ЗаказыСоСтатусами.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ВТ_ЗаказыСоСтатусами.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаказыСоСтатусами.Ссылка,
	|	ПередачаТоваровХранителюТовары.Ссылка
	|ИЗ
	|	ВТ_ЗаказыСоСтатусами КАК ВТ_ЗаказыСоСтатусами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО ВТ_ЗаказыСоСтатусами.Заказ1C = ПередачаТоваровХранителюТовары.ЗаказКлиента
	|			И (НЕ ВТ_ЗаказыСоСтатусами.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ВТ_ЗаказыСоСтатусами.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаказыСоСтатусами.Ссылка,
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	ВТ_ЗаказыСоСтатусами КАК ВТ_ЗаказыСоСтатусами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_ЗаказыСоСтатусами.Заказ1C = РеализацияТоваровУслуг.ЗаказКлиента
	|			И (НЕ ВТ_ЗаказыСоСтатусами.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ВТ_ЗаказыСоСтатусами.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаказыСоСтатусами.Ссылка,
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	ВТ_ЗаказыСоСтатусами КАК ВТ_ЗаказыСоСтатусами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_ЗаказыСоСтатусами.Заказ1C = РеализацияТоваровУслугТовары.ЗаказКлиента
	|			И (НЕ ВТ_ЗаказыСоСтатусами.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ВТ_ЗаказыСоСтатусами.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВТ_Реализации.Реализация) КАК Реализация,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_КоличествоРеализаций
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//+ ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ВТ_РасходныеОрдера
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаказыСоСтатусами КАК ВТ_ЗаказыСоСтатусами
	|	ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = ВТ_ЗаказыСоСтатусами.Заказ1C
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//- ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ВТ_РасходныеОрдера.Ссылка) КАК Ссылка,
	|	ВТ_РасходныеОрдера.Распоряжение КАК Распоряжение,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_РасходныеОрдераКоличество
	|ИЗ
	|	ВТ_РасходныеОрдера КАК ВТ_РасходныеОрдера
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасходныеОрдера.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|ВЫБРАТЬ
	|	ДокументИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ДокументИС_WB_СборочноеЗадание.ПометкаУдаления КАК ПометкаУдаления,
	|	ДокументИС_WB_СборочноеЗадание.Номер КАК Номер,
	|	ДокументИС_WB_СборочноеЗадание.Дата КАК Дата,
	|	ДокументИС_WB_СборочноеЗадание.Проведен КАК Проведен,
	|	ДокументИС_WB_СборочноеЗадание.Профиль КАК Профиль,
	|	ДокументИС_WB_СборочноеЗадание.article КАК article,
	|	ДокументИС_WB_СборочноеЗадание.convertedPrice КАК convertedPrice,
	|	ДокументИС_WB_СборочноеЗадание.ТипДоставки КАК ТипДоставки,
	|	ДокументИС_WB_СборочноеЗадание.ТипТовара КАК ТипТовара,
	|	ДокументИС_WB_СборочноеЗадание.orderUid КАК orderUid,
	|	ДокументИС_WB_СборочноеЗадание.price КАК price,
	|	ДокументИС_WB_СборочноеЗадание.ЦенаВВалютеУчета КАК ЦенаВВалютеУчета,
	|	ДокументИС_WB_СборочноеЗадание.rid КАК rid,
	|	ДокументИС_WB_СборочноеЗадание.ВалютаПродажи КАК ВалютаПродажи,
	|	ДокументИС_WB_СборочноеЗадание.Валюта КАК Валюта,
	|	ДокументИС_WB_СборочноеЗадание.Заказ КАК Заказ,
	|	ДокументИС_WB_СборочноеЗадание.НоменклатураWB КАК НоменклатураWB,
	|	ДокументИС_WB_СборочноеЗадание.РазмерWB КАК РазмерWB,
	|	ДокументИС_WB_СборочноеЗадание.Склад КАК Склад,
	|	ДокументИС_WB_СборочноеЗадание.МоментВремени КАК МоментВремени,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Поставка КАК Поставка,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Поставка.Код КАК КодПоставки,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус КАК Статус,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB КАК СтатусWB,
	|   ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.ДатаДоставкиС КАК ДатаДоставкиС,
    |	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.ДатаДоставкиПо КАК ДатаДоставкиПо,
	|	ВЫБОР
	|		КОГДА ВТ_КоличествоРеализаций.Реализация ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ВТ_КоличествоРеализаций.Количество = 1
	|			ТОГДА ВТ_КоличествоРеализаций.Реализация
	|		ИНАЧЕ ""Список реализаций""
	|	КОНЕЦ КАК Реализация,
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|	ВЫБОР
	|		КОГДА ВТ_РасходныеОрдераКоличество.Ссылка ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ВТ_РасходныеОрдераКоличество.Количество = 1
	|			ТОГДА ВТ_РасходныеОрдераКоличество.Ссылка
	|		ИНАЧЕ ""Список ордеров""
	|	КОНЕЦ КАК РасходныйОрдер,
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201 
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
	|	ИС_WB_СоответствиеРазмеров.Упаковка КАК Упаковка,
	//+ ИнфоСофт Тимофеева А.А. 04.09.2025 УА #79192 
	|	ВЫБОР        
	|		КОГДА ВТ_ЗаказыСоСтатусами.Заказ1C.Проведен
	|			ТОГДА 3
	|		КОГДА НЕ ВТ_ЗаказыСоСтатусами.Заказ1C.Проведен
	|			ТОГДА 1
	|       ИНАЧЕ 4
	|	КОНЕЦ КАК СтатусПроведенияЗаказа
	//- ИнфоСофт Тимофеева А.А. 04.09.2025 УА #79192
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ДокументИС_WB_СборочноеЗадание
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаказыСоСтатусами КАК ВТ_ЗаказыСоСтатусами
	|		ПО ДокументИС_WB_СборочноеЗадание.Ссылка = ВТ_ЗаказыСоСтатусами.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_СоответствиеРазмеров.РазмерWB = ДокументИС_WB_СборочноеЗадание.РазмерWB)
	|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО ДокументИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	|			И (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Профиль = &Профиль)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоРеализаций КАК ВТ_КоличествоРеализаций
	|		ПО ДокументИС_WB_СборочноеЗадание.Ссылка = ВТ_КоличествоРеализаций.Ссылка
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201 
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныеОрдераКоличество КАК ВТ_РасходныеОрдераКоличество
	|		ПО ДокументИС_WB_СборочноеЗадание.Заказ = ВТ_РасходныеОрдераКоличество.Распоряжение
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201 
	|ГДЕ
	|	ДокументИС_WB_СборочноеЗадание.Профиль = &Профиль";	
	//- ИнфоСофт Заварин К.В. 05.09.24 УА #79742	
	
	Возврат ТекстЗапроса;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.03.23 УА #55822

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
Процедура СоздатьЗаказы(Профиль, МассивЗаданий) Экспорт
	
	Событие = ПолучитьИмяСобытия("СоздатьЗаказы");
	//+ ИнфоСофт Заварин К.В. 01.04.24 УА #67778
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.waiting);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sorted);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sold);
	//+ ИнфоСофт Заварин К.В. 15.07.24 УА #79737
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.canceled_by_client); 
    МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.reject);
	//- ИнфоСофт Заварин К.В. 15.07.24 УА #79737
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ready_for_pickup);
	МассивСтатусов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.postponed_delivery);
	//- ИнфоСофт Заварин К.В. 01.04.24 УА #67778
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//+ ИнфоСофт Власова И.С. 18.12.24 УА #89287
	//"ВЫБРАТЬ
	//|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	//|		ПО ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	//|ГДЕ
	//|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
	////+ ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	//|	И ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB В (&Статусы)
	////- ИнфоСофт Заварин К.В. 30.03.24 УА #67778
	//|	И ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	//|	И (НЕ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус = ЗНАЧЕНИЕ(Перечисление.ИС_WB_СтатусыСборочныхЗаданий.cancel)
	//|			ИЛИ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус ЕСТЬ NULL)";
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СборочныеЗадания
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
	|	И ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|;	
	|	
	|////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	ВТ_СборочныеЗадания.Ссылка КАК Ссылка,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус КАК Статус,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB КАК СтатусWB
	|ПОМЕСТИТЬ ВТ_Статусы
	|ИЗ
	|	ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО ВТ_СборочныеЗадания.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	|;	
	|	
	|////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Статусы.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Статусы КАК ВТ_Статусы
	|ГДЕ
	|	ВТ_Статусы.СтатусWB В (&Статусы)
	|	И НЕ ВТ_Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.ИС_WB_СтатусыСборочныхЗаданий.cancel)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Статусы.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Статусы КАК ВТ_Статусы
	|ГДЕ
	|	ВТ_Статусы.СтатусWB В (&Статусы)
	|	И ВТ_Статусы.Статус ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Статусы.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Статусы КАК ВТ_Статусы
	|ГДЕ
	|	ВТ_Статусы.Статус ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Статусы.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Статусы КАК ВТ_Статусы
	|ГДЕ	
	|	ВТ_Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.ИС_WB_СтатусыСборочныхЗаданий.ПустаяСсылка)
	|	И ВТ_Статусы.СтатусWB = ЗНАЧЕНИЕ(Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ПустаяСсылка)";
	//- ИнфоСофт Власова И.С. 18.12.24 УА #89287
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивКСозданию = Новый Массив();
	Пока Выборка.Следующий() Цикл
		МассивКСозданию.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	ФукнциональныеОпции = ИС_WB_СерверПовтИсп.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	//+ ИнфоСофт Макарова Н.Е. 04.04.2025 УА #88298
	АктивныйЗаказКлиента = ИС_WB_Сервер.ПолучитьАктивныйЗаказКлиента(Профиль);
	
	Если АктивныйЗаказКлиента <> Неопределено Тогда
		
		ФукнциональныеОпции.Вставить("АктивныйЗаказКлиента", АктивныйЗаказКлиента);
		
	КонецЕсли;
	//- ИнфоСофт Макарова Н.Е. 04.04.2025 УА #88298
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если МассивКСозданию.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ФукнциональныеОпции.РежимСозданияЗаказов = 0 Тогда // Один к одному
		
		Для Каждого СборочноеЗадание Из МассивКСозданию Цикл
			
			Заказ = СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции);
			
			Если Не Заказ.Пустая() Тогда
				
				ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
				ДокОбъект.Заказ = Заказ;
				
				Попытка
					ДокОбъект.Записать();
					
					//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
					ИС_MP_РаботаСЗаказами.ЗаписатьЗаказОтчетаКомиссионера(Профиль
					, Перечисления.ИС_МП_Маркетплейсы.ВБ
					, СборочноеЗадание.rid
					, СборочноеЗадание
					, Заказ);
					//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746
					
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;
				
			КонецЕсли; 	
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	Если ФукнциональныеОпции.РежимСозданияЗаказов = 1 Тогда // Пакетный режим
		
		//+ ИнфоСофт Сумин Д.В. 25.05.23 УА #59052
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_СборочноеЗадание.Ссылка КАК СборочноеЗадание,
		|	ИС_WB_СборочноеЗадание.Склад КАК Склад
		|ИЗ
		|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
		|ГДЕ
		|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
		|ИТОГИ ПО
		|	Склад";
		Запрос.УстановитьПараметр("МассивСсылок", МассивКСозданию);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();
			Заказ = Неопределено;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Заказ = СоздатьИлиДополнитьЗаказУТ11_5(ВыборкаДетальныеЗаписи.СборочноеЗадание, ФукнциональныеОпции, Заказ);
				
				Если Не Заказ.Пустая() И Заказ <> Неопределено Тогда	
					ДокОбъект = ВыборкаДетальныеЗаписи.СборочноеЗадание.ПолучитьОбъект();
					ДокОбъект.Заказ = Заказ;
					
					Попытка
						ДокОбъект.Записать();
						
						//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
						ИС_MP_РаботаСЗаказами.ЗаписатьЗаказОтчетаКомиссионера(Профиль
						, Перечисления.ИС_МП_Маркетплейсы.ВБ
						
						//+ ИнфоСофт Заварин К.В. 10.12.24 УА #89234
						//, СборочноеЗадание.rid
						//, СборочноеЗадание
						//, Заказ);
						, ВыборкаДетальныеЗаписи.СборочноеЗадание.rid
						, ВыборкаДетальныеЗаписи.СборочноеЗадание
						, Заказ);
						//- ИнфоСофт Заварин К.В. 10.12.24 УА #89234
						
						//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746
						
					Исключение
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
					КонецПопытки; 
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;	
		
		//Заказ = СоздатьИлиДополнитьЗаказУТ11_5(МассивКСозданию[0], ФукнциональныеОпции);
		//	
		//Если Не Заказ.Пустая() Тогда
		//
		//	ДокОбъект = МассивКСозданию[0].ПолучитьОбъект();
		//	ДокОбъект.Заказ = Заказ;
		//	
		//	Попытка
		//		ДокОбъект.Записать();
		//	Исключение
		//		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//	КонецПопытки;
		//
		//КонецЕсли;
		//		
		//МассивКСозданию.Удалить(0);
		//
		//Для Каждого СборочноеЗадание Из МассивКСозданию Цикл
		//	
		//	Заказ = СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, Заказ);
		//	
		//	Если Не Заказ.Пустая() Тогда
		//	
		//		ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
		//		ДокОбъект.Заказ = Заказ;
		//		
		//		Попытка
		//			ДокОбъект.Записать();
		//		Исключение
		//			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//		КонецПопытки;
		//	
		//	КонецЕсли; 	
		//	
		//КонецЦикла;
		//
		//- ИнфоСофт Сумин Д.В. 25.05.23 УА #59052
		
		Возврат;
		
	КонецЕсли;
	

	Если ФукнциональныеОпции.РежимСозданияЗаказов = 2 Тогда // Формирование в течение дня
		
		//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		Если НЕ ФукнциональныеОпции.ИспользоватьРазбиениеПоСкладам Тогда // без разбиения, создается только 1 заказ
			
			Если ФукнциональныеОпции.АктивныйЗаказКлиента.Пустая() Тогда
				
				Заказ = СоздатьИлиДополнитьЗаказУТ11_5(МассивКСозданию[0], ФукнциональныеОпции);
				
				Если Не Заказ.Пустая() Тогда
					
					ДокОбъект = МассивКСозданию[0].ПолучитьОбъект();
					ДокОбъект.Заказ = Заказ;
					
					Попытка
						ДокОбъект.Записать();
					Исключение
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
					КонецПопытки;
					
				КонецЕсли;
				
				ПрофильОбъект = Профиль.ПолучитьОбъект();
				ПрофильОбъект.АктивныйЗаказКлиента = Заказ;
				
				Попытка
					ПрофильОбъект.Записать();
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;
				
				МассивКСозданию.Удалить(0);
				
			Иначе
				Заказ = ФукнциональныеОпции.АктивныйЗаказКлиента;
			КонецЕсли;
			
			Для Каждого СборочноеЗадание Из МассивКСозданию Цикл
				
				БуферЗаказа = СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, Заказ);
				
				Если Не БуферЗаказа.Пустая() Тогда 
					
					ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
					ДокОбъект.Заказ = Заказ;
					
					Попытка
						ДокОбъект.Записать(); 
						
						//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
						ИС_MP_РаботаСЗаказами.ЗаписатьЗаказОтчетаКомиссионера(Профиль
						, Перечисления.ИС_МП_Маркетплейсы.ВБ
						, СборочноеЗадание.rid
						, СборочноеЗадание
						, Заказ);
						//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746
						
					Исключение
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
					КонецПопытки;    
					
				КонецЕсли;
				//- ИнфоСофт Стояк Ю.К. 02.02.2024 УА #70111
				
			КонецЦикла;
			
			Возврат;
			
		Иначе 
			
			Для Каждого СборочноеЗадание Из МассивКСозданию Цикл 
				
				ДобавитьЗапись = Ложь;
				
				АктивныйЗаказ = ПолучитьАктивныйЗаказКлиентаВБ(СборочноеЗадание);
				
				Если АктивныйЗаказ = Неопределено Тогда
					ДобавитьЗапись = Истина;	
				КонецЕсли;	
				
				Заказ = СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, АктивныйЗаказ); 
				
				Если Заказ = Документы.ЗаказКлиента.ПустаяСсылка() Тогда
					Текст = "Отсутствует сопоставление по заказу. Номер: " + СокрЛП(СборочноеЗадание.Номер); 
					ОбщегоНазначения.СообщитьПользователю(Текст);
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
					Продолжить;	
				КонецЕсли;	
				
				Если ДобавитьЗапись Тогда
					ДобавитьЗаписьВРегистрЗаказовВБ(Заказ, СборочноеЗадание);	
				КонецЕсли;	
				
				ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
				ДокОбъект.Заказ = Заказ;
				
				Попытка
					ДокОбъект.Записать(); 
					//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648					
					ИС_MP_РаботаСЗаказами.ЗаписатьЗаказОтчетаКомиссионера(Профиль
					, Перечисления.ИС_МП_Маркетплейсы.ВБ
					, СборочноеЗадание.rid
					, СборочноеЗадание					
					, Заказ);
                    //- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;	
			КонецЦикла;
			
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	
	ВызватьИсключение("Неизвестный режим формирования заказов");
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
Процедура СоздатьРеализации(Профиль, МассивЗаданий) Экспорт
	
	Событие = ПолучитьИмяСобытия("СоздатьРеализации");
	
	Запрос = Новый Запрос;	
	Запрос.Текст =
	//+ ИнфоСофт Стояк Ю.К. 04.06.2024 УА #76978
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Заказ КАК Заказ,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СборочноеЗадание.Склад, ЗНАЧЕНИЕ(Справочник.ИС_ВБ_Склады.ПустаяСсылка))) КАК Склад,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СборочноеЗадание.Склад.АвтоматическиСоздаватьОрдерНаОтгрузку, ЛОЖЬ)) КАК АвтоматическиСоздаватьОрдерНаОтгрузку,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СборочноеЗадание.Заказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке, ЛОЖЬ)) КАК ИспользоватьОрдернуюСхемуПриОтгрузке,
	|	МАКСИМУМ(ИС_WB_СборочноеЗадание.Склад.СтатусРасходногоОрдера) КАК СтатусРасходногоОрдера,
	|	МАКСИМУМ(ИС_WB_СборочноеЗадание.Склад.СтатусСтрокиРасходногоОрдера) КАК СтатусСтрокиРасходногоОрдера
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
	|	И НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_СборочноеЗадание.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	ВЫРАЗИТЬ(ВТ_Заказы.Заказ.Комментарий КАК СТРОКА(500)) КАК Комментарий,
	|	СУММА(ВЫБОР
	|			КОГДА РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоРТУ
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО (РеализацияТоваровУслугТовары.ЗаказКлиента = ВТ_Заказы.Заказ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказы.Заказ,
	|	ВЫРАЗИТЬ(ВТ_Заказы.Заказ.Комментарий КАК СТРОКА(500))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ,
	|	ВЫРАЗИТЬ(ВТ_Заказы.Заказ.Комментарий КАК СТРОКА(500)),
	|	СУММА(ВЫБОР
	|			КОГДА РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Заказы.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказы.Заказ,
	|	ВЫРАЗИТЬ(ВТ_Заказы.Заказ.Комментарий КАК СТРОКА(500))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ,
	|	ВЫРАЗИТЬ(ВТ_Заказы.Заказ.Комментарий КАК СТРОКА(500)),
	|	СУММА(ВЫБОР
	|			КОГДА ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО (ПередачаТоваровХранителюТовары.ЗаказКлиента = ВТ_Заказы.Заказ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказы.Заказ,
	|	ВЫРАЗИТЬ(ВТ_Заказы.Заказ.Комментарий КАК СТРОКА(500))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ,
	|	ВЫРАЗИТЬ(ВТ_Заказы.Заказ.Комментарий КАК СТРОКА(500)),
	|	СУММА(ВЫБОР
	|			КОГДА ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ВТ_Заказы.Заказ = ПередачаТоваровХранителю.ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказы.Заказ,
	|	ВЫРАЗИТЬ(ВТ_Заказы.Заказ.Комментарий КАК СТРОКА(500))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Заказ КАК Заказ,
	|	ВТ_Реализации.Комментарий КАК Комментарий,
	|	СУММА(ВТ_Реализации.КоличествоРТУ) КАК КоличествоРТУ
	|ПОМЕСТИТЬ ВТ_РТУ
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Заказ,
	|	ВТ_Реализации.Комментарий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РТУ.Заказ КАК Заказ,
	|	ВТ_РТУ.Комментарий КАК Комментарий,
	|	ВТ_РТУ.КоличествоРТУ КАК КоличествоРТУ,
	|	ВТ_Заказы.АвтоматическиСоздаватьОрдерНаОтгрузку КАК АвтоматическиСоздаватьОрдерНаОтгрузку,
	|	ВТ_Заказы.ИспользоватьОрдернуюСхемуПриОтгрузке КАК ИспользоватьОрдернуюСхемуПриОтгрузке,
	|	ВТ_Заказы.Заказ.Склад КАК Склад,
	|	ВТ_Заказы.Заказ.Дата КАК Дата,
	|	ВТ_Заказы.Склад КАК СкладВБ,
	|	ВТ_Заказы.СтатусРасходногоОрдера КАК СтатусРасходногоОрдера,
	|	ВТ_Заказы.СтатусСтрокиРасходногоОрдера КАК СтатусСтрокиРасходногоОрдера
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ КАК ВТ_РТУ
	|		ПО ВТ_Заказы.Заказ = ВТ_РТУ.Заказ
	|ГДЕ
	|	ВТ_РТУ.КоличествоРТУ = 0
	|ИТОГИ ПО
	|	Склад";
	//- ИнфоСофт Стояк Ю.К. 04.06.2024 УА #76978	
	Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
		
	ФукнциональныеОпции = ИС_WB_СерверПовтИсп.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	//+ ИнфоСофт Макарова Н.Е. 04.04.2025 УА #88298
	АктивныйЗаказКлиента = ИС_WB_Сервер.ПолучитьАктивныйЗаказКлиента(Профиль);
	
	Если АктивныйЗаказКлиента <> Неопределено Тогда
		
		ФукнциональныеОпции.Вставить("АктивныйЗаказКлиента", АктивныйЗаказКлиента);
		
	КонецЕсли;
	//- ИнфоСофт Макарова Н.Е. 04.04.2025 УА #88298
	
	Комиссия25 = Профиль.Договор.КомиссионныеПродажи25;
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 28.05.24 УА #77595
	ПорядокОформленияНакладныхРасходныхОрдеров = Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить();
	//- ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
	
	Если ФукнциональныеОпции.РежимСозданияРеализаций = 1 Тогда // Пакетный режим
		
		ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСклад.Следующий() Цикл
		    
		    Выборка = ВыборкаСклад.Выбрать();
			
			//+ ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
			МассивДляЗаполнения = Новый Массив;
			
			Пока Выборка.Следующий() Цикл		
				МассивДляЗаполнения.Добавить(Выборка.Заказ);			
			КонецЦикла;
			
			Если ПорядокОформленияНакладныхРасходныхОрдеров 
				= Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные Тогда
				
				Выборка.Сбросить();
				Выборка.Следующий();
				
				СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25, МассивДляЗаполнения);
				
				Выборка.Сбросить();
				
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
						ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
																	, Выборка.СтатусРасходногоОрдера
																	, Выборка.СтатусСтрокиРасходногоОрдера);	
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				Выборка.Сбросить();
				
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
						ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
																	, Выборка.СтатусРасходногоОрдера
																	, Выборка.СтатусСтрокиРасходногоОрдера);	
					КонецЕсли;
					
				КонецЦикла;
				
				Выборка.Сбросить();
				Выборка.Следующий();
				
				СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25, МассивДляЗаполнения);
							
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 28.05.24 УА #77595
					
		КонецЦикла;
		
		Возврат; 
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        
        Если Выборка.Заказ = Null Тогда
        	Продолжить;
        КонецЕсли;
        
		//+ ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
		Если ПорядокОформленияНакладныхРасходныхОрдеров 
			= Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные Тогда
			
			СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25);
			Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
				ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
															, Выборка.СтатусРасходногоОрдера
															, Выборка.СтатусСтрокиРасходногоОрдера);
			КонецЕсли;
			
		Иначе
			
			Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
				ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
															, Выборка.СтатусРасходногоОрдера
															, Выборка.СтатусСтрокиРасходногоОрдера);				
			КонецЕсли;
			СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25);
			
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 28.05.24 УА #77595 
				
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Сумин Д.В. 05.05.23 УА #58023
Процедура СоздатьРеализациюПоЗакрытиюЗаказа(Профиль, ЗаказКлиента) Экспорт
	
	Событие = ПолучитьИмяСобытия("СоздатьРеализации");
	
	Комиссия25 = Профиль.Договор.КомиссионныеПродажи25;
	
	Если Комиссия25 Тогда
		ДокументРеализация = Документы.ПередачаТоваровХранителю.СоздатьДокумент();	
	Иначе
		ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	КонецЕсли;	
	
	Попытка
		ДокументРеализация.Заполнить(ЗаказКлиента); 
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		Возврат;
	КонецПопытки;
	
	ДокументРеализация.Дата = ЗаказКлиента.Дата + Профиль.КоличествоДнейКРеализации * 86400;
	ДокументРеализация.Комментарий = ЗаказКлиента.Комментарий;
	ДокументРеализация.Подразделение = ЗаказКлиента.Подразделение;
	
	Если Профиль.ПроводитьРеализации Тогда	
		Попытка
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;	
	Иначе
		ДокументРеализация.Записать();		
	КонецЕсли;		
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 05.05.23 УА #58023	

//+ ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901
Процедура УстановитьПараметрыЗапросаЦен(Запрос, Профиль) Экспорт
	
	Событие = ПолучитьИмяСобытия("УстановитьПараметрыЗапросаЦен");
	
	МассивПараметров = ИС_WB_Сервер.ПолучитьСписокПараметровЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, МассивПараметров);
	
	СтруктураЦен = ИС_WB_Сервер.ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
	
	Запрос.УстановитьПараметр("Маркетплейс"			, Перечисления.ИС_МП_Маркетплейсы.ВБ);
	Запрос.УстановитьПараметр("ВидЦены"				, СтруктураЦен.ВидЦены); 
	Запрос.УстановитьПараметр("ВидЦеныСоСкидкой"	, СтруктураЦен.ВидЦеныСоСкидкой);
	Запрос.УстановитьПараметр("ВидЦеныМинимальный"	, Справочники.ВидыЦен.ПустаяСсылка());
	//+ ИнфоСофт Заварин К.В. 03.09.24 УА #72696
	Запрос.УстановитьПараметр("ВидЦеныFBO"			, СтруктураЦен.ВидЦеныFBO);
	//- ИнфоСофт Заварин К.В. 03.09.24 УА #72696
	Запрос.УстановитьПараметр("Профиль"				, Профиль); 
	Запрос.УстановитьПараметр("ПустаяУпаковка"		, ИС_MP_СерверЛокализация.ПустаяСсылкаУпаковка());
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901

//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
Процедура ВыполнитьЗакрытиеЗаказов(Профиль) Экспорт
	
	Событие = ПолучитьИмяСобытия("ВыполнитьЗакрытиеЗаказов");
	
	ФукнциональныеОпции = ИС_WB_СерверПовтИсп.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	Если Не ФукнциональныеОпции.ИспользоватьРазбиениеПоСкладам Тогда 
		
		Если Не ЗначениеЗаполнено(Профиль.АктивныйЗаказКлиента) Тогда
			Возврат;
		КонецЕсли;  
		
		Если Профиль.АвтоматическиСоздаватьРеализации Тогда
			СоздатьРеализациюПоЗакрытиюЗаказа(Профиль, Профиль.АктивныйЗаказКлиента);	
		КонецЕсли;
		
		ПрофильОбъект = Профиль.ПолучитьОбъект();
		ПрофильОбъект.АктивныйЗаказКлиента = Документы.ЗаказКлиента.ПустаяСсылка();		
		ПрофильОбъект.Поставка = Справочники.ИС_ВБ_ПоставкиFBS.ПустаяСсылка();                                    
		ПрофильОбъект.ПоставкаКГТ = Справочники.ИС_ВБ_ПоставкиFBS.ПустаяСсылка();
		ПрофильОбъект.ПоставкаСГТ = Справочники.ИС_ВБ_ПоставкиFBS.ПустаяСсылка();
		
		Попытка
			ПрофильОбъект.Записать();
		Исключение
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
		КонецПопытки;
		
		Возврат; 
		
	Иначе			
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
		|	ИС_WB_ЗаказыВТечениеДня.СкладМП КАК СкладМП, 
		//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
		|	ИС_WB_ЗаказыВТечениеДня.Профиль КАК Профиль,
		|	ИС_WB_ЗаказыВТечениеДня.ЗаказКлиента КАК ЗаказКлиента,
		|	ЕСТЬNULL(ИС_WB_СборочноеЗадание.Склад.АвтоматическиСоздаватьОрдерНаОтгрузку, ЛОЖЬ) КАК АвтоматическиСоздаватьОрдерНаОтгрузку
		|ПОМЕСТИТЬ ВТ_УникальныеЗаписи
		|ИЗ
		|	РегистрСведений.ИС_WB_ЗаказыВТеченииДня КАК ИС_WB_ЗаказыВТечениеДня
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
		|		ПО ИС_WB_ЗаказыВТечениеДня.ЗаказКлиента = ИС_WB_СборочноеЗадание.Заказ
		|ГДЕ
		|	ИС_WB_ЗаказыВТечениеДня.Профиль = &Профиль
		|	И ИС_WB_ЗаказыВТечениеДня.ЗаказОткрыт
		|
		|СГРУППИРОВАТЬ ПО
		|	ИС_WB_ЗаказыВТечениеДня.СкладМП,
		|	ИС_WB_ЗаказыВТечениеДня.Профиль,
		|	ИС_WB_ЗаказыВТечениеДня.ЗаказКлиента,
		|	ЕСТЬNULL(ИС_WB_СборочноеЗадание.Склад.АвтоматическиСоздаватьОрдерНаОтгрузку, ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
		|	ВТ_УникальныеЗаписи.СкладМП КАК СкладМП, 
		//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
		|	ВТ_УникальныеЗаписи.Профиль КАК Профиль,
		|	ВТ_УникальныеЗаписи.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТ_УникальныеЗаписи.АвтоматическиСоздаватьОрдерНаОтгрузку КАК АвтоматическиСоздаватьОрдерНаОтгрузку,
		|	ВТ_УникальныеЗаписи.ЗаказКлиента.Комментарий КАК Комментарий
		|ИЗ
		|	ВТ_УникальныеЗаписи КАК ВТ_УникальныеЗаписи
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_УникальныеЗаписи.ЗаказКлиента.Дата,
		|	ВТ_УникальныеЗаписи.ЗаказКлиента.Номер";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		ПорядокОформленияНакладныхРасходныхОрдеров = Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить();
		
		АвтоматическиСоздаватьРеализации = ФукнциональныеОпции.АвтоматическиСоздаватьРеализации;
		
		Пока Выборка.Следующий() Цикл
			
			МенеджерЗаписи = РегистрыСведений.ИС_WB_ЗаказыВТеченииДня.СоздатьМенеджерЗаписи(); 
			
			//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
			МенеджерЗаписи.СкладМП = Выборка.СкладМП;
			//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
			
			МенеджерЗаписи.Профиль = Выборка.Профиль;
			МенеджерЗаписи.ЗаказКлиента = Выборка.ЗаказКлиента;
			МенеджерЗаписи.ЗаказОткрыт = Ложь;
			
			МенеджерЗаписи.Записать();
			
			Если Не АвтоматическиСоздаватьРеализации Тогда
				Продолжить;	
			КонецЕсли;
			
			Если ПорядокОформленияНакладныхРасходныхОрдеров 
				= Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные Тогда
				
				СоздатьРеализациюПоЗакрытиюЗаказа(Профиль, Выборка.ЗаказКлиента);
				
				Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.ЗаказКлиента.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
					ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(Выборка.ЗаказКлиента
					, Выборка.СтатусРасходногоОрдера
					, Выборка.СтатусСтрокиРасходногоОрдера);	
				КонецЕсли;			
				
			Иначе
				
				Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.ЗаказКлиента.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
					ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(Выборка.ЗаказКлиента
					, Выборка.СтатусРасходногоОрдера
					, Выборка.СтатусСтрокиРасходногоОрдера);	
				КонецЕсли;			
				
				СоздатьРеализациюПоЗакрытиюЗаказа(Профиль, Выборка.ЗаказКлиента);
				
			КонецЕсли;			
			
		КонецЦикла;
		
		Возврат; 
		
	КонецЕсли;		
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 20.02.23 УА #53535
Функция ПолучитьПрименениеНДСОрганизации(Организация)
		
	ОрганизацияПименяетУСН = ОрганизацияПименяетУСН(Организация);
		
	Если ОрганизацияПименяетУСН <> Неопределено И ОрганизацияПименяетУСН Тогда
		Возврат Ложь;	
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиУчетаНДССрезПоследних.ПрименяетсяОсвобождениеОтУплатыНДС КАК ПрименяетсяОсвобождениеОтУплатыНДС
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(, Организация = &Организация) КАК НастройкиУчетаНДССрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Не Выборка.ПрименяетсяОсвобождениеОтУплатыНДС;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 20.02.23 УА #53535

//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
Функция ПолучитьТаблицуТоваровНабора(ТоварыЗаказа) Экспорт
	
	Запрос = Новый Запрос;		
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ТоварыВзаказе.Сумма КАК Сумма,
	|	ТоварыВзаказе.Номенклатура КАК Номенклатура,
	|	ТоварыВзаказе.Характеристика КАК Характеристика,
	|	ТоварыВзаказе.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_ТоварыВЗаказе
	|ИЗ
	|	&ТоварыВзаказе КАК ТоварыВзаказе
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости) КАК ОбщаяДоляСтоимости,
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК Количество,
	|	ВТ_ТоварыВЗаказе.Сумма КАК Сумма,
	|	ВТ_ТоварыВЗаказе.Цена КАК Цена,
	|	ВТ_ТоварыВЗаказе.Номенклатура КАК Набор,
	|	ВТ_ТоварыВЗаказе.Характеристика КАК Характеристика	
	|ПОМЕСТИТЬ ВТ_Количество
	|ИЗ
	|	ВТ_ТоварыВЗаказе КАК ВТ_ТоварыВЗаказе
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО (ВТ_ТоварыВЗаказе.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец)
	|			И (ВТ_ТоварыВЗаказе.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыВЗаказе.Номенклатура,
	|	ВТ_ТоварыВЗаказе.Характеристика,
	|	ВТ_ТоварыВЗаказе.Сумма,
	|	ВТ_ТоварыВЗаказе.Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка, ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения) КАК Упаковка,	
	|	ВТ_Количество.ОбщаяДоляСтоимости КАК ОбщаяДоляСтоимости,
	|	ВТ_Количество.Количество КАК КоличествоОбщее,
	|	ВТ_Количество.Набор КАК Набор,
	|	ВТ_Количество.Характеристика КАК ХарактеристикаНабора,
	|	ВТ_Количество.Сумма КАК Сумма, 
	|	ВТ_Количество.Цена КАК Цена,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора
	|ИЗ
	|	ВТ_Количество КАК ВТ_Количество
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО (ВТ_Количество.Набор = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|				И ВТ_Количество.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";                          
			
	Запрос.УстановитьПараметр("ТоварыВзаказе", ТоварыЗаказа);
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005

//+ ИнфоСофт Ивонин К.А. 20.02.23 УА #53535
Функция РассчитатьСуммуНДС(Сумма, СтавкаНДС, СуммаВключаетНДС = Истина) Экспорт
	
	Если СуммаВключаетНДС Тогда
		СуммаНДС = Окр(Сумма - 100 * Сумма / (100 + СтавкаНДС), 2, РежимОкругления.Окр15как20);
	Иначе
		СуммаНДС = Окр(Сумма * СтавкаНДС / 100, 2, РежимОкругления.Окр15как20);
	КонецЕсли;
	
	Возврат СуммаНДС;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 21.02.23 УА #53535
Функция РассчитатьДолюСтоимости(ТоварыЗаказаТЗ, ВидЦены, Дата) Экспорт
	
	Доля = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Период,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура В(&Номенклатура)
	|				И Характеристика В(&Характеристика)) КАК ЦеныНоменклатурыСрезПоследних
	//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #72423
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";                                                                    
	//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #72423
	
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Номенклатура", ТоварыЗаказаТЗ.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Характеристика", ТоварыЗаказаТЗ.ВыгрузитьКолонку("Характеристика"));
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Таблица = РезультатЗапроса.Выгрузить(); 
	
	ОбщаяЦена = 0;
	ЦенаЭлемента = 0;
	
	Для Каждого Элемент Из Таблица Цикл		
		Строка = ТоварыЗаказаТЗ.Найти(Элемент.Номенклатура, "Номенклатура");
		//+ ИнфоСофт Стояк Ю.К. 12.10.2023 УА #64691		
		Если ЗначениеЗаполнено(Строка) Тогда
			ОбщаяЦена = ОбщаяЦена + Элемент.Цена * Строка.Количество;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Проверьте наличие цены на комплектующую " + Элемент.Номенклатура + "по виду цен " + ВидЦены + " на дату " + Дата);
			Возврат Неопределено;
		КонецЕсли;                                  
		//- ИнфоСофт Стояк Ю.К. 12.10.2023 УА #64691
	КонецЦикла; 
	
	МассивКоэффициентов = Новый Массив;
	
	//+ ИнфоСофт Сумин Д.В. 12.01.2024 УА #68609
	Если ТоварыЗаказаТЗ.Количество() <> Таблица.Количество() Тогда
		Для Каждого Строка Из ТоварыЗаказаТЗ Цикл 
			МассивКоэффициентов.Добавить(Строка.Количество);
		КонецЦикла;	
	Иначе	
		Если ОбщаяЦена <> 0 Тогда
			Для Каждого Элемент Из Таблица Цикл
				Строка = ТоварыЗаказаТЗ.Найти(Элемент.Номенклатура, "Номенклатура"); 
				МассивКоэффициентов.Добавить((Элемент.Цена * Строка.Количество) / ОбщаяЦена);
			КонецЦикла;              
		Иначе
			//+ ИнфоСофт Стояк Ю.К. 14.11.2023 УА #65997		
			ОбщегоНазначения.СообщитьПользователю("Проверьте заполненность вида цен в профиле или наличие цены на набор / комплектующие набора " + ТоварыЗаказаТЗ[0].Набор + " по виду цен " + ВидЦены + " на дату " + Дата);
			//- ИнфоСофт Стояк Ю.К. 14.11.2023 УА #65997
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	//Если ОбщаяЦена <> 0 Тогда
	//	Для Каждого Элемент Из Таблица Цикл
	//		Строка = ТоварыЗаказаТЗ.Найти(Элемент.Номенклатура, "Номенклатура"); 
	//		МассивКоэффициентов.Добавить((Элемент.Цена * Строка.Количество) / ОбщаяЦена);
	//	КонецЦикла;              
	//Иначе
	//	//+ ИнфоСофт Стояк Ю.К. 14.11.2023 УА #65997		
	//	ОбщегоНазначения.СообщитьПользователю("Проверьте заполненность вида цен в профиле или наличие цены на набор / комплектующие набора " + ТоварыЗаказаТЗ[0].Набор + " по виду цен " + ВидЦены + " на дату " + Дата);
	//	//- ИнфоСофт Стояк Ю.К. 14.11.2023 УА #65997
	//	Возврат Неопределено;
	//КонецЕсли;
	//- ИнфоСофт Сумин Д.В. 12.01.2024 УА #68609 
	
	Возврат МассивКоэффициентов;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Функция ПолучитьИмяСобытия(Имя)
	Возврат СтрШаблон("ИС.МП.ИС_WB_СерверУТ11_5.%1", Имя);
КонецФункции //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

//+ ИнфоСофт Сумин Д.В. 06.07.2023 УА #60267
Функция СоздатьОтчетКомиссионера(Данные, Профиль, СтруктураНастроек) Экспорт
	
	ДокОтчет = Документы.ОтчетКомиссионера.СоздатьДокумент();
		
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Партнер", Профиль.Партнер); 
	ПараметрыФормы.Вставить("Контрагент", Профиль.Контрагент);
	ПараметрыФормы.Вставить("Организация", Профиль.Организация);	
	ПараметрыФормы.Вставить("КонецПериода", ДокОтчет.КонецПериода);
	
	ДокОтчет.Заполнить(ПараметрыФормы);  
	
	//+ ИнфоСофт Мурсалимов Д.Р. 16.06.24 УА #77666
	ДокОтчет.Партнер = Профиль.Партнер; 
	ДокОтчет.Контрагент = Профиль.Контрагент;
	ДокОтчет.Организация = Профиль.Организация;	
	//- ИнфоСофт Мурсалимов Д.Р. 16.06.24 УА #77666
	
	ДокОтчет.Дата = НачалоДня(СтруктураНастроек.ДатаДокумента);
	ДокОтчет.НачалоПериода = НачалоДня(СтруктураНастроек.НачалоПериода);
	ДокОтчет.КонецПериода = НачалоДня(СтруктураНастроек.КонецПериода);
	
	ПродажаОблагаетсяНДС = ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация); 
	
	Если ПродажаОблагаетсяНДС Тогда 
		ДокОтчет.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;  		
	Иначе
		ДокОтчет.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;	
	КонецЕсли;
	
	ДокОтчет.ДатаПлатежа = СтруктураНастроек.ДатаДокумента;
		
	ДокОтчет.Соглашение = Профиль.Соглашение; 
	ДокОтчет.Договор = Профиль.Договор;	  
	
	//+ ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78655
	ИспользоватьПодразделения = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	
	Если ИспользоватьПодразделения Тогда
		ДокОтчет.Подразделение = Профиль.Подразделение;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78655
	
	//+ ИнфоСофт Сумин Д.В. 12.02.2024 УА #70615
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	ЗаполнитьХозОперацию = Истина;
	
	Если ИспользоватьСоглашенияСКлиентами И ДокОтчет.Соглашение.КомиссионныеПродажи25 Тогда 
		ДокОтчет.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионера;
		ЗаполнитьХозОперацию = Ложь;
	КонецЕсли;
	
	Если ЗаполнитьХозОперацию И ИспользоватьДоговорыСКлиентами И ДокОтчет.Договор.КомиссионныеПродажи25 Тогда 
		ДокОтчет.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионера;
		ЗаполнитьХозОперацию = Ложь;
	КонецЕсли;
	
	Если ЗаполнитьХозОперацию Тогда
		ДокОтчет.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;
	КонецЕсли;

	//Если ДокОтчет.Соглашение.КомиссионныеПродажи25 Тогда 
	//	ДокОтчет.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионера;
	//Иначе
	//	ДокОтчет.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;
	//КонецЕсли;
    //- ИнфоСофт Сумин Д.В. 12.02.2024 УА #70615
	
	ДокОтчет.СпособРасчетаВознаграждения = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается; 
	
	РассчитыватьВВ = СтруктураНастроек.ДанныеВВ.РассчитыватьВВ;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 15.03.24 УА #71529
	Если СтруктураНастроек.ДанныеВВ.Свойство("СпособРасчетаЦеныВозврата") Тогда
		
		ЦеныВозвратаПоВидуЦен = ?(СтруктураНастроек.ДанныеВВ.СпособРасчетаЦеныВозврата.СпособРасчета = 1, Истина, Ложь);
	
		ВидЦены = СтруктураНастроек.ДанныеВВ.СпособРасчетаЦеныВозврата.ВидЦены; 
		
	Иначе
		
		ЦеныВозвратаПоВидуЦен = Ложь;		
		
	КонецЕсли;
	
	////+ ИнфоСофт Мурсалимов Д.Р. 09.02.24 УА #69965
	//ЦеныВозвратаПоВидуЦен = ?(СтруктураНастроек.ДанныеВВ.СпособРасчетаЦеныВозврата.СпособРасчета = 1, Истина, Ложь);
	//
	//ВидЦены = СтруктураНастроек.ДанныеВВ.СпособРасчетаЦеныВозврата.ВидЦены;
	////- ИнфоСофт Мурсалимов Д.Р. 09.02.24 УА #69965
	//- ИнфоСофт Мурсалимов Д.Р. 15.03.24 УА #71529
	
	Если РассчитыватьВВ Тогда 
		ДокОтчет.УдержатьВознаграждение = Истина; 
		ДокОтчет.СпособРасчетаВознаграждения = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи;
		СуммаУслугВБ = СтруктураНастроек.ДанныеВВ.СуммаУслугВБ;
		
		//Убирем строки с возвратами
		МассивПродаж = Новый Массив;
		Для Каждого Строка Из Данные Цикл
			Если Строка.Количество > 0 Тогда
				МассивПродаж.Добавить(Строка.Количество);	
			КонецЕсли;
		КонецЦикла;	
		СредняяСтоимостьУслуги = Окр(СуммаУслугВБ / МассивПродаж.Количество(), 2);
		//Для избежания потерь по копейкам, рассчитаем разницу между исходной суммой и суммой вознаграждения в документе
		ПотеряннаяСумма = СуммаУслугВБ - СредняяСтоимостьУслуги * МассивПродаж.Количество();  
		ПотереннаяСуммаДобавлена = Ложь;
		МассивНастроек = Новый Массив;
		
		Для Каждого Строка Из Данные Цикл
			Если Строка.Количество < 0 Тогда
				МассивНастроек.Добавить(0);	
			Иначе
				Если Не ПотереннаяСуммаДобавлена Тогда
					//+ ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
					МассивНастроек.Добавить(Строка.СуммаПродажи + ПотеряннаяСумма);
					//МассивНастроек.Добавить(СредняяСтоимостьУслуги + ПотеряннаяСумма);
					//- ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595 
					ПотереннаяСуммаДобавлена = Истина;
				Иначе
					//+ ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
					МассивНастроек.Добавить(Строка.СуммаПродажи);
					//МассивНастроек.Добавить(СредняяСтоимостьУслуги);
					//- ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595 	
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		//+ ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
		МассивНастроек = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаУслугВБ, МассивНастроек);
		//- ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
	Иначе	
		ДокОтчет.УдержатьВознаграждение = Ложь; 
	КонецЕсли;
	
	ДокОтчет.Комментарий = СтруктураНастроек.Комментарий;
	
	СуммаДокумента = 0;
	Итератор = 0;
	
	Для Каждого Элемент Из Данные Цикл
		Если Элемент.ЭтоНабор Тогда
			
			//+ ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693
			//ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Элемент.Номенклатура, Элемент.Характеристика, Профиль);
			ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Профиль, Элемент.Номенклатура, Элемент.Характеристика);	
			//- ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693  
			
			Если ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Или
				ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам Тогда
				
				МассивКоэффициентов = РассчитатьКоэффициентыИзЦен(ТоварыНабора.ВыгрузитьКолонку("КомплектующиеЦена"), Элемент.Номенклатура);
			Иначе
				МассивКоэффициентов = ТоварыНабора.ВыгрузитьКолонку("ДоляСтоимости");
			КонецЕсли;
			
			//+ ИнфоСофт Сумин Д.В. 01.12.2023 УА #63730
			СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Элемент.СуммаПродажи, МассивКоэффициентов);
			//СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Элемент.ЦенаПродажи, МассивКоэффициентов);
			//- ИнфоСофт Сумин Д.В. 01.12.2023 УА #63730
			
			//Учитываем оплтау потерянного товара
			Если Элемент.ЦенаРозничная = 0 Тогда
				ЦенаРозничная = Элемент.ЦенаПродажи;                       
			Иначе
				ЦенаРозничная = Элемент.ЦенаРозничная;
			КонецЕсли;
			
			Если РассчитыватьВВ Тогда 
				Вознаграждение = МассивНастроек[Итератор]; 
				СуммыВознаграждения = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Вознаграждение, МассивКоэффициентов);
			КонецЕсли;
			
			СуммыПередачи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ЦенаРозничная, МассивКоэффициентов);
			
			Для Каждого ЭлементНабора Из ТоварыНабора Цикл 
				
				НоваяСтрока = ДокОтчет.Товары.Добавить();
				
				НоваяСтрока.Номенклатура = ЭлементНабора.Номенклатура;
				НоваяСтрока.Характеристика = ЭлементНабора.Характеристика;
				НоваяСтрока.Количество = ЭлементНабора.КоличествоУпаковок * Элемент.Количество;
				НоваяСтрока.КоличествоУпаковок = ЭлементНабора.КоличествоУпаковок * Элемент.Количество;
				
				//+ ИнфоСофт Мурсалимов Д.Р. 06.02.2024 УА #69965
				Если НоваяСтрока.Количество < 0 Тогда	
		
					Если Не ЦеныВозвратаПоВидуЦен Тогда
						
						НоваяСтрока.Цена = -(СуммыПередачи[0] / ЭлементНабора.КоличествоУпаковок / Элемент.Количество);
						НоваяСтрока.СуммаСНДС = -(СуммыПередачи[0]);
						НоваяСтрока.Сумма = -(СуммыПередачи[0]);
						
					Иначе
						
						ЦенаРозничная = ЗаполнитьСуммыПоВидуЦен(ВидЦены, ДокОтчет.Дата, ДокОтчет.Валюта, ЭлементНабора.Номенклатура, ЭлементНабора.Характеристика, ЭлементНабора.Номенклатура.ЕдиницаИзмерения);
						
						НоваяСтрока.Цена = -(ЦенаРозничная / НоваяСтрока.Количество);
						НоваяСтрока.Сумма = -(ЦенаРозничная); 
						НоваяСтрока.СуммаСНДС = -(ЦенаРозничная);
						
					КонецЕсли;		
					
				Иначе 
					
					НоваяСтрока.Цена = СуммыПередачи[0] / ЭлементНабора.КоличествоУпаковок / Элемент.Количество;
					НоваяСтрока.СуммаСНДС = СуммыПередачи[0];
					НоваяСтрока.Сумма = СуммыПередачи[0];
					
				КонецЕсли; 
				
				НоваяСтрока.ЦенаПродажи = СуммыПродажи[0] / ЭлементНабора.КоличествоУпаковок / Элемент.Количество;
				НоваяСтрока.СуммаПродажи = СуммыПродажи[0];	
				//- ИнфоСофт Мурсалимов Д.Р. 06.02.2024 УА #69965 
				
				Если РассчитыватьВВ И СуммыВознаграждения <> Неопределено Тогда 
					//+ ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
					НоваяСтрока.СуммаВознаграждения = СуммыВознаграждения[0];
					//НоваяСтрока.СуммаВознаграждения = СуммыВознаграждения[0] * Элемент.Количество;
					//- ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
				КонецЕсли;
				СуммаДокумента = СуммаДокумента + НоваяСтрока.СуммаПродажи; 
				
				НоваяСтрока.Упаковка = ЭлементНабора.Упаковка;
				
				Если ПродажаОблагаетсяНДС Тогда
					НДС = ЭлементНабора.Номенклатура.СтавкаНДС.Ставка;
					НоваяСтрока.СтавкаНДС = ЭлементНабора.Номенклатура.СтавкаНДС; 
					Если Не ЗначениеЗаполнено(НДС) Или НДС = 0 Тогда 
						НоваяСтрока.СуммаПродажиНДС = 0;
						НоваяСтрока.СуммаНДС = 0;
						Если РассчитыватьВВ Тогда
							НоваяСтрока.СуммаНДСВознаграждения = 0;
						КонецЕсли;
					Иначе
						НоваяСтрока.СуммаПродажиНДС = РассчитатьСуммуНДС(НоваяСтрока.ЦенаПродажи, НДС, Истина); 
						НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
						//+ ИнфоСофт Мурсалимов Д.Р. 06.02.2024 УА #69965
						Если НоваяСтрока.Количество < 0 Тогда 
							НоваяСтрока.СуммаПродажиНДС = -(НоваяСтрока.СуммаПродажиНДС);
					        НоваяСтрока.СуммаНДС = -(НоваяСтрока.СуммаНДС); 
						КонецЕсли;
						//- ИнфоСофт Мурсалимов Д.Р. 06.02.2024 УА #69965
						
						Если РассчитыватьВВ И СуммыВознаграждения <> Неопределено Тогда
							//+ ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
							НоваяСтрока.СуммаНДСВознаграждения = РассчитатьСуммуНДС(НоваяСтрока.СуммаВознаграждения, НДС, Истина);
							//НоваяСтрока.СуммаНДСВознаграждения = РассчитатьСуммуНДС(НоваяСтрока.СуммаВознаграждения, НДС, Истина) * Элемент.Количество;
							//- ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
						КонецЕсли;
					КонецЕсли;	
				Иначе
					НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
				КонецЕсли;
								
				СуммыПродажи.Удалить(0);
				СуммыПередачи.Удалить(0);
				Если РассчитыватьВВ И СуммыВознаграждения <> Неопределено Тогда 
					СуммыВознаграждения.Удалить(0);	
				КонецЕсли;	
			КонецЦикла;	
			
		Иначе
			НоваяСтрока = ДокОтчет.Товары.Добавить();
			
			Если РассчитыватьВВ Тогда 
				//+ ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
				НоваяСтрока.СуммаВознаграждения = МассивНастроек[Итератор];
				//НоваяСтрока.СуммаВознаграждения = МассивНастроек[Итератор] * Элемент.Количество;
				//- ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
			КонецЕсли;
			
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;
			НоваяСтрока.Характеристика = Элемент.Характеристика;
			НоваяСтрока.КоличествоУпаковок = Элемент.Количество;
			
			//+ ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
			//НоваяСтрока.Количество = Элемент.КоличествоВУпаковке * Элемент.Количество; 
			НоваяСтрока.Количество = Элемент.КоэффициентУпаковки * Элемент.Количество;
			//- ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
			
			//+ ИнфоСофт Мурсалимов Д.Р. 06.02.2024 УА #69965 
			Если НоваяСтрока.Количество < 0 Тогда
				
				Если Не ЦеныВозвратаПоВидуЦен Тогда
					
					НоваяСтрока.Цена = -(Элемент.ЦенаРозничная / НоваяСтрока.Количество);
					НоваяСтрока.Сумма = -(Элемент.ЦенаРозничная); 
					НоваяСтрока.СуммаСНДС = -(Элемент.ЦенаРозничная);
					
				Иначе
					
					ЦенаРозничная = ЗаполнитьСуммыПоВидуЦен(ВидЦены, ДокОтчет.Дата, ДокОтчет.Валюта, Элемент.Номенклатура, Элемент.Характеристика, Элемент.Номенклатура.ЕдиницаИзмерения);
				
				    НоваяСтрока.Цена = -(ЦенаРозничная / НоваяСтрока.Количество);
					НоваяСтрока.Сумма = -(ЦенаРозничная); 
					НоваяСтрока.СуммаСНДС = -(ЦенаРозничная);
					
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока.Цена = Элемент.ЦенаРозничная / НоваяСтрока.Количество;
				НоваяСтрока.Сумма = Элемент.ЦенаРозничная; 
				НоваяСтрока.СуммаСНДС = Элемент.ЦенаРозничная;	
				
			КонецЕсли;  
						
			НоваяСтрока.ЦенаПродажи = Элемент.СуммаПродажи / НоваяСтрока.Количество;
			НоваяСтрока.СуммаПродажи = Элемент.СуммаПродажи;	

			//НоваяСтрока.Цена = Элемент.ЦенаРозничная;
			//НоваяСтрока.Сумма = Элемент.ЦенаРозничная * Элемент.Количество; 
			//НоваяСтрока.СуммаСНДС = Элемент.ЦенаРозничная * Элемент.Количество;
			
			//НоваяСтрока.ЦенаПродажи = Элемент.ЦенаПродажи; 
			//НоваяСтрока.СуммаПродажи = НоваяСтрока.ЦенаПродажи * Элемент.Количество;
			//- ИнфоСофт Мурсалимов Д.Р. 06.02.2024 УА #69965
			
			СуммаДокумента = СуммаДокумента + НоваяСтрока.СуммаПродажи; 	
			НоваяСтрока.Упаковка = Элемент.Упаковка;
			
			Если ПродажаОблагаетсяНДС Тогда
				НДС = Элемент.Номенклатура.СтавкаНДС.Ставка;
				НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС; 
				Если Не ЗначениеЗаполнено(НДС) Или НДС = 0 Тогда 
					НоваяСтрока.СуммаПродажиНДС = 0;
					НоваяСтрока.СуммаНДС = 0;
					Если РассчитыватьВВ Тогда
						НоваяСтрока.СуммаНДСВознаграждения = 0;
					КонецЕсли;
				Иначе
					НоваяСтрока.СуммаПродажиНДС = РассчитатьСуммуНДС(НоваяСтрока.ЦенаПродажи, НДС, Истина);
					НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
 
					//+ ИнфоСофт Мурсалимов Д.Р. 06.02.2024 УА #69965
					Если НоваяСтрока.Количество < 0 Тогда 
						НоваяСтрока.СуммаПродажиНДС = -(НоваяСтрока.СуммаПродажиНДС);
						НоваяСтрока.СуммаНДС = -(НоваяСтрока.СуммаНДС); 
					КонецЕсли;
					//- ИнфоСофт Мурсалимов Д.Р. 06.02.2024 УА #69965
					
					Если РассчитыватьВВ Тогда
						//+ ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
						НоваяСтрока.СуммаНДСВознаграждения = РассчитатьСуммуНДС(НоваяСтрока.СуммаВознаграждения, НДС, Истина);
						//НоваяСтрока.СуммаНДСВознаграждения = РассчитатьСуммуНДС(НоваяСтрока.СуммаВознаграждения, НДС, Истина) * Элемент.Количество;
						//- ИнфоСофт Сумин Д.В. 23.11.2023 УА #64595
					КонецЕсли;
				КонецЕсли;	
			Иначе
				НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
			КонецЕсли;
				
		КонецЕсли;
		
		Если РассчитыватьВВ Тогда 
			Итератор = Итератор + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ДокОтчет.СуммаДокумента = СуммаДокумента;
	Если СтруктураНастроек.ДанныеВВ.РассчитыватьВВ Тогда 
		ДокОтчет.СуммаВознаграждения = СтруктураНастроек.ДанныеВВ.СуммаУслугВБ;
		ДокОтчет.ПроцентВознаграждения = ДокОтчет.СуммаВознаграждения * 100 / ДокОтчет.СуммаДокумента;
		ДокОтчет.Услуга = СтруктураНастроек.ДанныеВВ.НастройкиЗаполненияВВ.Номенклатура;
		Если ПродажаОблагаетсяНДС Тогда
			Если ЗначениеЗаполнено(СтруктураНастроек.ДанныеВВ.НастройкиЗаполненияВВ.СтавкаНДС) Тогда 
				ДокОтчет.СтавкаНДСВознаграждения = СтруктураНастроек.ДанныеВВ.НастройкиЗаполненияВВ.СтавкаНДС;
				ДокОтчет.СуммаНДСВознаграждения = РассчитатьСуммуНДС(ДокОтчет.СуммаВознаграждения, СтруктураНастроек.ДанныеВВ.НастройкиЗаполненияВВ.СтавкаНДС.Ставка, Истина);	
			КонецЕсли;
		Иначе
			ДокОтчет.СтавкаНДСВознаграждения = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
			ДокОтчет.СуммаНДСВознаграждения = 0;
		КонецЕсли;	
	КонецЕсли;	
	Попытка
		ДокОтчет.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		ДокОтчет.Записать();
	КонецПопытки;  
	
	Возврат ДокОтчет;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 06.07.2023 УА #60267 

//+ ИнфоСофт Сумин Д.В. 06.03.23 УА #55086
Функция ПолучитьРезультатПроверкиУчетаНДС(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|  НастройкиУчетаНДС.ПлательщикНДС КАК ПлательщикНДС
	|ИЗ
	|  РегистрСведений.НастройкиУчетаНДС.СрезПоследних(, ) КАК НастройкиУчетаНДС
	|ГДЕ
	|  НастройкиУчетаНДС.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.ПлательщикНДС;
		
КонецФункции //- ИнфоСофт Сумин Д.В. 06.03.23 УА #55086 

//+ ИнфоСофт Мурсалимов Д.Р. 05.11.24 УА #85693
Функция ПолучитьТаблицуТоваровНабораNew(Профиль, Номенклатура, Характеристика) Экспорт
	
	ИспользуетсяЦенообразование25 = Константы.ИспользуетсяЦенообразование25.Получить();
		
	МассивПараметров = ИС_WB_Сервер.ПолучитьСписокПараметровЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, МассивПараметров);
	
	СтруктураЦен = ИС_WB_Сервер.ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
	
	ВидЦены = СтруктураЦен.ВидЦены;
	
	Запрос = Новый Запрос;	
	
	Если ИспользуетсяЦенообразование25 Тогда
		
		Текст =
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Набор,
		//+ ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941            
		|	ВариантыКомплектацииНоменклатуры.Характеристика КАК ХарактеристикаНабора,
		//- ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ВидыНоменклатуры.НастройкиКлючаЦенПоХарактеристике = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		//+ ИнфоСофт Стояк Ю.К. 15.01.2025 УА #91082				
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
		//|			ТОГДА ВариантыКомплектацииНоменклатурыТовары.Характеристика		
		//- ИнфоСофт Стояк Ю.К. 15.01.2025 УА #91082
		|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка))
		//+ ИнфоСофт Стояк Ю.К. 15.01.2025 УА #91082		
		|	КОНЕЦ КАК ХарактеристикаДляЦО,                                          
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
		//- ИнфоСофт Стояк Ю.К. 15.01.2025 УА #91082
		|	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
		|	ВЫБОР
		|		КОГДА ВариантыКомплектацииНоменклатурыТовары.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ВариантыКомплектацииНоменклатурыТовары.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка.Знаменатель, 1)
		|	КОНЕЦ КАК КоэффициентУпаковки,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		//+ ИнфоСофт Мурсалимов Д.Р. 27.11.24 УА #88158
		//|	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦены,
		|	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)) КАК ВариантРасчетаЦены,	
		//- ИнфоСофт Мурсалимов Д.Р. 27.11.24 УА #88158
		|	ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости, 0) КАК ДоляСтоимости
		|ПОМЕСТИТЬ ВТ_СоставНаборов
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
		|ГДЕ
		|	ВариантыКомплектацииНоменклатуры.Владелец = &Владелец
		|	И ВариантыКомплектацииНоменклатуры.Характеристика = &Характеристика
		//+ ИнфоСофт Заварин К.В. 04.02.25 УА #92430
		|	И ВариантыКомплектацииНоменклатуры.ПометкаУдаления = Ложь
		//- ИнфоСофт Заварин К.В. 04.02.25 УА #92430
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СоставНаборов.Набор КАК Набор,
		//+ ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941
		|	ВТ_СоставНаборов.ХарактеристикаНабора КАК ХарактеристикаНабора,
		//- ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941
		|	ВТ_СоставНаборов.Номенклатура КАК Номенклатура,
		|	ВТ_СоставНаборов.Характеристика КАК Характеристика,
		|	ВТ_СоставНаборов.Упаковка КАК Упаковка,
		|	ВТ_СоставНаборов.КоэффициентУпаковки КАК КоэффициентУпаковки,
		|	ВТ_СоставНаборов.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТ_СоставНаборов.ВариантРасчетаЦены КАК ВариантРасчетаЦены,
		|	ВТ_СоставНаборов.ДоляСтоимости КАК ДоляСтоимости,
		|	ЕСТЬNULL(ЦеныКомплектации.Цена, 0) КАК КомплектующиеЦена
		|ПОМЕСТИТЬ ВТ_Комплектация
		|ИЗ
		|	ВТ_СоставНаборов КАК ВТ_СоставНаборов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		|				,
		|				(Номенклатура, ХарактеристикаЦО) В
		|						(ВЫБРАТЬ
		|							ВТ.Номенклатура,
		//+ ИнфоСофт Стояк Ю.К. 15.01.2025 УА #91082
		|							ВТ.ХарактеристикаДляЦО
		//|							ВТ.Характеристика
		//- ИнфоСофт Стояк Ю.К. 15.01.2025 УА #91082
		|						ИЗ
		|							ВТ_СоставНаборов КАК ВТ)
		|					И ВидЦены = &ВидЦены) КАК ЦеныКомплектации
		|		ПО ВТ_СоставНаборов.Номенклатура = ЦеныКомплектации.Номенклатура
		//+ ИнфоСофт Стояк Ю.К. 15.01.2025 УА #91082		
		//|			И ВТ_СоставНаборов.Характеристика = ЦеныКомплектации.ХарактеристикаЦО;
		|			И ВТ_СоставНаборов.ХарактеристикаДляЦО = ЦеныКомплектации.ХарактеристикаЦО;
		//- ИнфоСофт Стояк Ю.К. 15.01.2025 УА #91082
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	Иначе
		
		Текст =
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Набор,
		//+ ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941            
		|	ВариантыКомплектацииНоменклатуры.Характеристика КАК ХарактеристикаНабора,
		//- ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
		|	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
		|	ВЫБОР
		|		КОГДА ВариантыКомплектацииНоменклатурыТовары.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ВариантыКомплектацииНоменклатурыТовары.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка.Знаменатель, 1)
		|	КОНЕЦ КАК КоэффициентУпаковки,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		//+ ИнфоСофт Мурсалимов Д.Р. 27.11.24 УА #88158
		//|	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦены,
		|	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)) КАК ВариантРасчетаЦены,	
		//- ИнфоСофт Мурсалимов Д.Р. 27.11.24 УА #88158
		|	ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости, 0) КАК ДоляСтоимости
		|ПОМЕСТИТЬ ВТ_СоставНаборов
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
		|ГДЕ
		|	ВариантыКомплектацииНоменклатуры.Владелец = &Владелец
		|	И ВариантыКомплектацииНоменклатуры.Характеристика = &Характеристика
		//+ ИнфоСофт Заварин К.В. 04.02.25 УА #92430
		|	И ВариантыКомплектацииНоменклатуры.ПометкаУдаления = Ложь
		//- ИнфоСофт Заварин К.В. 04.02.25 УА #92430
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СоставНаборов.Набор КАК Набор,
		//+ ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941
		|	ВТ_СоставНаборов.ХарактеристикаНабора КАК ХарактеристикаНабора,
		//- ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941
		|	ВТ_СоставНаборов.Номенклатура КАК Номенклатура,
		|	ВТ_СоставНаборов.Характеристика КАК Характеристика,
		|	ВТ_СоставНаборов.Упаковка КАК Упаковка,
		|	ВТ_СоставНаборов.КоэффициентУпаковки КАК КоэффициентУпаковки,
		|	ВТ_СоставНаборов.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТ_СоставНаборов.ВариантРасчетаЦены КАК ВариантРасчетаЦены,
		|	ВТ_СоставНаборов.ДоляСтоимости КАК ДоляСтоимости,
		|	ЕСТЬNULL(ЦеныКомплектации.Цена, 0) КАК КомплектующиеЦена
		|ПОМЕСТИТЬ ВТ_Комплектация
		|ИЗ
		|	ВТ_СоставНаборов КАК ВТ_СоставНаборов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				,
		|				(Номенклатура, Характеристика) В
		|						(ВЫБРАТЬ
		|							ВТ.Номенклатура,
		|							ВТ.Характеристика
		|						ИЗ
		|							ВТ_СоставНаборов КАК ВТ)
		|					И ВидЦены = &ВидЦены) КАК ЦеныКомплектации
		|		ПО ВТ_СоставНаборов.Номенклатура = ЦеныКомплектации.Номенклатура
		|			И ВТ_СоставНаборов.Характеристика = ЦеныКомплектации.Характеристика;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";	
		
	КонецЕсли;
	
	Текст = Текст + 
	
	"ВЫБРАТЬ
	|	ВТ_Комплектация.Набор КАК Набор,
	//+ ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941
	|	ВТ_Комплектация.ХарактеристикаНабора КАК ХарактеристикаНабора,
	//- ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941
	|	ВТ_Комплектация.Номенклатура КАК Номенклатура,
	|	ВТ_Комплектация.Характеристика КАК Характеристика,
	|	ВТ_Комплектация.ВариантРасчетаЦены КАК ВариантРасчетаЦены,
	|	ВТ_Комплектация.Упаковка КАК Упаковка,
	|	ВТ_Комплектация.КоэффициентУпаковки КАК КоэффициентУпаковки,
	|	ВТ_Комплектация.ДоляСтоимости КАК ДоляСтоимости,
	//+ ИнфоСофт Мурсалимов Д.Р. 31.03.25 УА #96258
	|	ВЫБОР
	|		КОГДА ВТ_Комплектация.КоличествоУпаковок < 0
	|			ТОГДА 1
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Комплектация.КоличествоУпаковок КАК ЧИСЛО(10, 3))
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ВТ_Комплектация.КомплектующиеЦена < 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Комплектация.КомплектующиеЦена КАК ЧИСЛО(10, 3))
	|	КОНЕЦ КАК КомплектующиеЦена
	//- ИнфоСофт Мурсалимов Д.Р. 31.03.25 УА #96258
	|ПОМЕСТИТЬ ВТ_КомплектующиеЦены
	|ИЗ
	|	ВТ_Комплектация КАК ВТ_Комплектация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КомплектующиеЦены.Набор КАК Набор,
	//+ ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941
	|	ВТ_КомплектующиеЦены.ХарактеристикаНабора КАК ХарактеристикаНабора,
	//- ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941
	|	ВТ_КомплектующиеЦены.Номенклатура КАК Номенклатура,
	|	ВТ_КомплектующиеЦены.Характеристика КАК Характеристика,
	|	ВТ_КомплектующиеЦены.КомплектующиеЦена КАК КомплектующиеЦена,
	|	ВТ_КомплектующиеЦены.ДоляСтоимости КАК ДоляСтоимости,  
	|	ВТ_КомплектующиеЦены.ВариантРасчетаЦены КАК ВариантРасчетаЦены,
	|	ВТ_КомплектующиеЦены.Упаковка КАК Упаковка,
	|	ВТ_КомплектующиеЦены.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	ВТ_КомплектующиеЦены КАК ВТ_КомплектующиеЦены";	
	
	Запрос.Текст = Текст;
	
	Запрос.УстановитьПараметр("Владелец", 		Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("ВидЦены", 		ВидЦены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить(); 
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 05.11.24 УА #85693

//+ ИнфоСофт Сумин Д.В. 02.03.23 УА #55086
Функция РассчитатьКоэффициентыИзЦен(МассивЦен, Номенклатура) Экспорт 
	
	СуммаВсехЭлементов = 0;
	Для Каждого Элемент из МассивЦен Цикл
		СуммаВсехЭлементов = СуммаВсехЭлементов + Элемент;	
	КонецЦикла;
	
	Если СуммаВсехЭлементов = 0 Тогда
		ВызватьИсключение("Для комплектующих набора: " + Номенклатура + " не установлены цены.");	
	КонецЕсли;
	
	МассивКоэццициентов = Новый Массив;
	
	Для Каждого Элемент из МассивЦен Цикл
		Коэффициент = Элемент * 100 / СуммаВсехЭлементов;
		МассивКоэццициентов.Добавить(Коэффициент);
	КонецЦикла;
	
	Возврат МассивКоэццициентов; 
	
КонецФункции //- ИнфоСофт Сумин Д.В. 02.03.23 УА #55086	

//+ ИнфоСофт Сумин Д.В. 03.03.23 УА #55086
Функция СоздатьДокументРеализацияУслуг(Профиль, Брак, ЗаголовокСтруктура) Экспорт
	
	ПродажаОблагаетсяНДС = ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация); 
	
	ДокУслуги = Документы.РеализацияУслугПрочихАктивов.СоздатьДокумент();
	ДокУслуги.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	ДокУслуги.Организация = Профиль.Организация; 	
	ДокУслуги.Партнер = Профиль.Партнер; 
	ДокУслуги.Контрагент = Профиль.ДоговорРеализации.Контрагент;		  
	ДокУслуги.Валюта = Справочники.Валюты.НайтиПоКоду("643");
	ДокУслуги.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("643");	
	ДокУслуги.Менеджер = ПользователиКлиентСервер.ТекущийПользователь();
	ДокУслуги.Подразделение = Профиль.Подразделение;
	ДокУслуги.ДатаПлатежа = ЗаголовокСтруктура.ДатаДокумента;
	
	Если ИС_WB_Сервер.ЗначениеРеквизитаОбъектаТипаБулево(Профиль.СоглашениеРеализации, "ИспользуютсяДоговорыКонтрагентов") Тогда
		ДокУслуги.Договор = Профиль.ДоговорРеализации;
		ДокУслуги.ПорядокРасчетов = Профиль.ДоговорРеализации.ПорядокРасчетов; 
		ДокУслуги.Соглашение = Профиль.СоглашениеРеализации; 
	Иначе
		ДокУслуги.Соглашение = Профиль.СоглашениеРеализации;
		ДокУслуги.ПорядокРасчетов = Профиль.СоглашениеРеализации.ПорядокРасчетов;
	КонецЕсли;
	
	ДокУслуги.ЦенаВключаетНДС = Истина; 
	
	Если ПродажаОблагаетсяНДС Тогда 		
		ДокУслуги.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС; 
	Иначе
		ДокУслуги.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
	КонецЕсли; 
		
	ДокУслуги.Дата = ЗаголовокСтруктура.ДатаДокумента;				  
	ДокУслуги.Комментарий = ЗаголовокСтруктура.Комментарий + " Оплата брака/Частичная компенсация брака";
	
	Если Брак.СуммаБрака > 0 Тогда   
		
		НоваяСтрока = ДокУслуги.Доходы.Добавить();
		НоваяСтрока.Содержание = "Оплата брака";
		НоваяСтрока.Количество = 1; 
		
		Если ПродажаОблагаетсяНДС Тогда 
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("20%", Истина);	
			НДС = ИС_MP_РаботаСЗаказами.ПолучитьПроцентНДС(НоваяСтрока.СтавкаНДС);
			
			Если НДС = Неопределено Или НДС = 0 Тогда 
				НоваяСтрока.СуммаНДС = 0;		
			Иначе
				НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(Брак.СуммаБрака, НДС, Истина);
			КонецЕсли;	
		Иначе
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
		КонецЕсли;
		
		НоваяСтрока.Цена = Брак.СуммаБрака;  		
		НоваяСтрока.Сумма = НоваяСтрока.Цена;
		НоваяСтрока.СтатьяДоходов = Профиль.СтатьяДоходовОплатаБрака; 
		НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
		
	ИначеЕсли Брак.ЧастичнаяКомпенсацияСумма > 0 Тогда
		
		НоваяСтрока = ДокУслуги.Доходы.Добавить();
		НоваяСтрока.Содержание = "Частичная компенсация брака";
		НоваяСтрока.Количество = 1; 
		
		Если ПродажаОблагаетсяНДС Тогда 
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("20%", Истина);	
			НДС = ИС_MP_РаботаСЗаказами.ПолучитьПроцентНДС(НоваяСтрока.СтавкаНДС);
			
			Если НДС = Неопределено Или НДС = 0 Тогда 
				НоваяСтрока.СуммаНДС = 0;		
			Иначе
				НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(Брак.ЧастичнаяКомпенсацияСумма, НДС, Истина);
			КонецЕсли;	
		Иначе
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
		КонецЕсли;
		
		НоваяСтрока.Цена = Брак.ЧастичнаяКомпенсацияСумма;  		
		НоваяСтрока.Сумма = НоваяСтрока.Цена;
		НоваяСтрока.СтатьяДоходов = Профиль.СтатьяДоходовОплатаБрака; 
		НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
		
	КонецЕсли;
	
	Попытка
		ДокУслуги.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		ДокУслуги.Записать();
	КонецПопытки; 
	//ДокУслуги.Записать(РежимЗаписиДокумента.Проведение); 
	//- ИнфоСофт Сумин Д.В. 27.03.23 УА #56728
	
	Возврат ДокУслуги;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 03.03.23 УА #55086	

//+ ИнфоСофт Стояк Ю.К. 05.05.2023 УА #58008
Функция СоздатьДокументПриобретенияУслуг(Профиль, Брак, ЗаголовокСтруктура) Экспорт
	
	ПродажаОблагаетсяНДС = ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация); 
	
	ДокУслуги = Документы.ПриобретениеУслугПрочихАктивов.СоздатьДокумент();
	ДокУслуги.Дата = ЗаголовокСтруктура.ДатаДокумента;	
	ДокУслуги.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	ДокУслуги.Организация = Профиль.Организация;
	ДокУслуги.Партнер = Профиль.Партнер;	
	ДокУслуги.Контрагент = Профиль.ДоговорЗакупки.Контрагент;
	Комментарий = "Отчет номер " + ЗаголовокСтруктура.Комментарий; 	
	ДокУслуги.Валюта = Справочники.Валюты.НайтиПоКоду("643");	
	ДокУслуги.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("643");	
	ДокУслуги.ЦенаВключаетНДС = Истина;

	
	Если ИС_WB_Сервер.ЗначениеРеквизитаОбъектаТипаБулево(Профиль.СоглашениеЗакупки, "ИспользуютсяДоговорыКонтрагентов") Тогда
		ДокУслуги.Договор = Профиль.ДоговорЗакупки;		
		ДокУслуги.Соглашение = Профиль.СоглашениеЗакупки; 	
	Иначе
		ДокУслуги.Соглашение = Профиль.СоглашениеЗакупки;
	КонецЕсли;
	
	ДокУслуги.ЦенаВключаетНДС = Истина; 	 
	
	Если ПродажаОблагаетсяНДС Тогда 		
		ДокУслуги.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;     
		ДокУслуги.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС; 
	Иначе
		ДокУслуги.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
		ДокУслуги.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС; 
	КонецЕсли; 
	
	ДокУслуги.Комментарий = ЗаголовокСтруктура.Комментарий + " Частичная компенсация брака";
	
	НоваяСтрока = ДокУслуги.Расходы.Добавить();
	НоваяСтрока.Содержание = "Частичная компенсация брака";
	НоваяСтрока.Количество = 1; 
	
	Если ПродажаОблагаетсяНДС Тогда 
		НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("20%");	
		НДС = ИС_MP_РаботаСЗаказами.ПолучитьПроцентНДС(НоваяСтрока.СтавкаНДС);
		
		Если НДС = Неопределено Или НДС = 0 Тогда 
			НоваяСтрока.СуммаНДС = 0;		
		Иначе
			НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(-Брак.ЧастичнаяКомпенсацияСумма, НДС, Истина);
		КонецЕсли;	
	Иначе
		НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	НоваяСтрока.Цена = -Брак.ЧастичнаяКомпенсацияСумма;  		
	НоваяСтрока.Сумма = НоваяСтрока.Цена;                           
	НоваяСтрока.Подразделение = Профиль.Подразделение; 
	НоваяСтрока.СтатьяРасходов = Профиль.СтатьяРасходовОплатаБрака; 
	НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
	
	
	ДокУслуги.Записать();
	
	Возврат ДокУслуги;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 05.05.2023 УА #58008

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
Функция СоздатьДокументПриобретения(Профиль, ДанныеДокумента, ЗаголовокСтруктура) Экспорт  
	
	Документ = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
	
	Документ.Дата = ЗаголовокСтруктура.ДатаДокумента;
	Документ.Автор = ПользователиКлиентСервер.ТекущийПользователь();
	Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	Документ.Организация = Профиль.Организация;
	Документ.Партнер = Профиль.Партнер;	
	Документ.Контрагент = Профиль.Контрагент;
	Комментарий = "Отчет номер " + ЗаголовокСтруктура.Комментарий;
	Документ.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;  
	Документ.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным; 
	
	//+ ИнфоСофт Сумин Д.В. 21.11.2023 УА #61641
	Если ЗначениеЗаполнено(Профиль.ДоговорЗакупки) Тогда
		Валюта = Профиль.ДоговорЗакупки.ВалютаВзаиморасчетов;
	Иначе
		Валюта = Профиль.Договор.ВалютаВзаиморасчетов;
	КонецЕсли;	
	//Валюта = Профиль.ДоговорЗакупки.ВалютаВзаиморасчетов;
	//- ИнфоСофт Сумин Д.В. 21.11.2023 УА #61641
	
	Документ.Валюта = Валюта;
	Документ.ВалютаВзаиморасчетов = Валюта;
	Документ.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада;  
	Документ.Договор = Профиль.ДоговорЗакупки;
	Документ.Соглашение = Профиль.СоглашениеЗакупки;
	
	Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС; 		
	
	СуммаДокумента = 0;
	
	//+ ИнфоСофт Власова И.С. 22.08.24 УА #61503
	РаспределятьРасходыПоАртикулам = Профиль.РаспределятьРасходыПоАртикулам;
	//- ИнфоСофт Власова И.С. 22.08.24 УА #61503
	
	//+ ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #93329
	////+ ИнфоСофт Заварин К.В. 01.10.24 УА #61499
	//ПрименениеНДС = ИС_MP_Сервер.ПолучитьПрименениеНДСОрганизации(Профиль.Организация);
	////- ИнфоСофт Заварин К.В. 01.10.24 УА #61499
	ПрименениеНДС = ИС_МП_УправлениеЗаказами.ПолучитьПрименениеНДСОрганизации(Профиль.Организация);
	//- ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #93329
	
	Для Каждого Элемент Из ДанныеДокумента Цикл 
		
		Если Элемент.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Элемент.УслугаWildberries = Справочники.Номенклатура.ПустаяСсылка() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Отсутствует сопоставление для услуги %1, строка не будет добавлена", Элемент.Услуга)); 
			Продолжить;	
		КонецЕсли;	
		
		ЭлементТЧ = Документ.Товары.Добавить();
		//+ ИнфоСофт Власова И.С. 22.08.24 УА #61503
		//ЭлементТЧ.Номенклатура = Элемент.УслугаWildberries.Номенклатура;
		ЭлементТЧ.Номенклатура = Элемент.Номенклатура;
		//- ИнфоСофт Власова И.С. 22.08.24 УА #61503
		ЭлементТЧ.Количество = 1;
		ЭлементТЧ.КоличествоУпаковок = 1;
		ЭлементТЧ.Цена = Элемент.Сумма;
		ЭлементТЧ.СписатьНаРасходы = Истина;
		//+ ИнфоСофт Власова И.С. 22.08.24 УА #61503
		//ЭлементТЧ.СтатьяРасходов = Элемент.УслугаWildberries.СтатьяРасходов;
		ЭлементТЧ.СтатьяРасходов = Элемент.СтатьяРасходов;
		//- ИнфоСофт Власова И.С. 22.08.24 УА #61503
		
		//+ ИнфоСофт Заварин К.В. 01.10.24 УА #61499
		//ЭлементТЧ.СуммаНДС = Элемент.НДС; 
		//ЭлементТЧ.СуммаСНДС = Элемент.НДС + Элемент.Сумма; 	
		//ЭлементТЧ.СтавкаНДС = Элемент.СтавкаНДС; 
		//СуммаДокумента = СуммаДокумента + Элемент.НДС + Элемент.Сумма; 
		//ЭлементТЧ.Сумма = Элемент.Сумма;
		Если ПрименениеНДС Тогда
			ЭлементТЧ.СуммаНДС = Элемент.НДС; 
			ЭлементТЧ.СуммаСНДС = Элемент.НДС + Элемент.Сумма; 	
			ЭлементТЧ.СтавкаНДС = Элемент.СтавкаНДС; 
			СуммаДокумента = СуммаДокумента + Элемент.НДС + Элемент.Сумма; 
			ЭлементТЧ.Сумма = Элемент.Сумма;
		Иначе   
			ЭлементТЧ.Цена = Элемент.Сумма + Элемент.НДС;
			ЭлементТЧ.СуммаНДС = 0; 
			ЭлементТЧ.СуммаСНДС = Элемент.НДС + Элемент.Сумма; 	
			ЭлементТЧ.СтавкаНДС = Элемент.СтавкаНДС; 
			СуммаДокумента = СуммаДокумента + Элемент.НДС + Элемент.Сумма; 
			ЭлементТЧ.Сумма = Элемент.НДС + Элемент.Сумма;
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 01.10.24 УА #61499
		
		ЭлементТЧ.Подразделение = Профиль.Подразделение;	
		
		//+ ИнфоСофт Власова И.С. 22.08.24 УА #61503
		//Комментарий = Комментарий + "/" + Элемент.УслугаWildberries.Наименование
		Если Не РаспределятьРасходыПоАртикулам Тогда
			Комментарий = Комментарий + "/" + Элемент.УслугаWildberries.Наименование;
		КонецЕсли;
		
		ЭлементТЧ.АналитикаРасходов = Элемент.АналитикаРасходов;
		//- ИнфоСофт Власова И.С. 22.08.24 УА #61503
		
	КонецЦикла;	
	
	Документ.Комментарий = Комментарий;
	
	Документ.СуммаДокумента = СуммаДокумента;
	
	Если Документ.Товары.Количество() = 0 Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	//+ ИнфоСофт Сумин Д.В. 27.03.23 УА #56728
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		Документ.Записать();
	КонецПопытки; 
	//Документ.Записать(РежимЗаписиДокумента.Проведение); 
	//- ИнфоСофт Сумин Д.В. 27.03.23 УА #56728
	
	Возврат Документ.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086 

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
Функция СоздатьДокументВзаимозачетЗадолженности(Профиль, ДокументПриобретения, ОтчетКомиссионера) Экспорт  
	
	ДокументВзаимозачет = Документы.ВзаимозачетЗадолженности.СоздатьДокумент();
	
	ДокументВзаимозачет.Дата = ОтчетКомиссионера.Дата;
	ДокументВзаимозачет.Организация = Профиль.Организация; 
	//+ ИнфоСофт Сумин Д.В. 07.04.23 УА #56896
	ДокументВзаимозачет.КонтрагентДебитор = Профиль.Контрагент;
	ДокументВзаимозачет.КонтрагентКредитор = Профиль.Контрагент; 
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов") Тогда
	//	ДокументВзаимозачет.КонтрагентДебитор = Профиль.Контрагент;
	//	ДокументВзаимозачет.КонтрагентКредитор = Профиль.Контрагент;
	//Иначе 
	//	ДокументВзаимозачет.КонтрагентДебитор = Профиль.Партнер; 
	//	ДокументВзаимозачет.КонтрагентКредитор = Профиль.Партнер; 
	//КонецЕсли;
	//- ИнфоСофт Сумин Д.В. 07.04.23 УА #56896
	ДокументВзаимозачет.СуммаДокумента = ДокументПриобретения.СуммаДокумента;
	ДокументВзаимозачет.Валюта = ДокументПриобретения.Валюта;
	ДокументВзаимозачет.ВидОперации = Перечисления.ВидыОперацийВзаимозачетаЗадолженности.Произвольный;
	ДокументВзаимозачет.ТипДебитора = Перечисления.ТипыУчастниковВзаимозачета.Клиент;
	ДокументВзаимозачет.ТипКредитора = Перечисления.ТипыУчастниковВзаимозачета.Поставщик;
	ДокументВзаимозачет.СуммаРегл = ПересчитатьВСуммуРегл(ДокументПриобретения.СуммаДокумента, ДокументПриобретения.Валюта, ДокументПриобретения.Дата); 
	ДокументВзаимозачет.СуммаУпр = ПересчитатьВСуммуУпр(ДокументПриобретения.СуммаДокумента, ДокументПриобретения.Валюта, ДокументПриобретения.Дата); 
	
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #89596
	ДокументВзаимозачет.Подразделение = Профиль.Подразделение;
	//- ИнфоСофт Власова И.С. 14.03.25 УА #89596
	
	ДебиторскаяЗадолженностьТЧ = ДокументВзаимозачет.ДебиторскаяЗадолженность.Добавить();
	ДебиторскаяЗадолженностьТЧ.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	ДебиторскаяЗадолженностьТЧ.Партнер = ДокументПриобретения.Партнер; 
	
	//+ ИнфоСофт Заварин К.В. 27.11.24 УА #88411
	ДокументРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ДокументПриобретения.Ссылка);
	//- ИнфоСофт Заварин К.В. 27.11.24 УА #88411
	
	//+ ИнфоСофт Сумин Д.В. 06.03.2024 УА #71107
	Если ЗначениеЗаполнено(ОтчетКомиссионера.Соглашение) И ЗначениеЗаполнено(ОтчетКомиссионера.Соглашение.ПорядокРасчетов) Тогда
		ПорядокРасчетов = ОтчетКомиссионера.Соглашение.ПорядокРасчетов;
	Иначе
		ПорядокРасчетов = ОтчетКомиссионера.Договор.ПорядокРасчетов;	
	КонецЕсли;
	
	Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
		ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ОтчетКомиссионера.Ссылка);	
	Иначе
		ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ОтчетКомиссионера.Договор);	
	КонецЕсли; 
	
	//+ ИнфоСофт Заварин К.В. 27.11.24 УА #88411
	Если ЗначениеЗаполнено(ДокументПриобретения.Соглашение) И ЗначениеЗаполнено(ДокументПриобретения.Соглашение.ПорядокРасчетов) Тогда
		ПорядокРасчетов = ДокументПриобретения.Соглашение.ПорядокРасчетов;
	Иначе
		ПорядокРасчетов = ДокументПриобретения.Договор.ПорядокРасчетов;  
	КонецЕсли;
	
	Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
		ДокументРасчетов  = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ДокументПриобретения.Ссылка); 
	Иначе
		ДокументРасчетов  = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ДокументПриобретения.Договор); 
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 27.11.24 УА #88411
	
	ДебиторскаяЗадолженностьТЧ.ОбъектРасчетов = ОбъектРасчетов;
	//ДебиторскаяЗадолженностьТЧ.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ОтчетКомиссионера);
	//- ИнфоСофт Сумин Д.В. 06.03.2024 УА #71107
	
	ДебиторскаяЗадолженностьТЧ.СуммаВзаиморасчетов = ДокументПриобретения.СуммаДокумента;
	ДебиторскаяЗадолженностьТЧ.ВалютаВзаиморасчетов = ДокументПриобретения.ВалютаВзаиморасчетов;
	ДебиторскаяЗадолженностьТЧ.Организация = ДокументПриобретения.Организация; 
	ДебиторскаяЗадолженностьТЧ.СуммаРегл = ДокументВзаимозачет.СуммаРегл; 
	ДебиторскаяЗадолженностьТЧ.СуммаУпр = ДокументВзаимозачет.СуммаУпр;
	
	КредиторскаяЗадолженностьТЧ = ДокументВзаимозачет.КредиторскаяЗадолженность.Добавить();
	КредиторскаяЗадолженностьТЧ.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	КредиторскаяЗадолженностьТЧ.Партнер = ДокументПриобретения.Партнер;
	
	//+ ИнфоСофт Заварин К.В. 27.11.24 УА #88411
	//КредиторскаяЗадолженностьТЧ.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ДокументПриобретения.Ссылка);   
	КредиторскаяЗадолженностьТЧ.ОбъектРасчетов = ДокументРасчетов;
	//- ИнфоСофт Заварин К.В. 27.11.24 УА #88411
	
	КредиторскаяЗадолженностьТЧ.СуммаВзаиморасчетов = ДокументПриобретения.СуммаДокумента;
	КредиторскаяЗадолженностьТЧ.ВалютаВзаиморасчетов = ДокументПриобретения.ВалютаВзаиморасчетов;
	КредиторскаяЗадолженностьТЧ.Организация = ДокументПриобретения.Организация;
	КредиторскаяЗадолженностьТЧ.СуммаРегл = ДокументВзаимозачет.СуммаРегл; 
	КредиторскаяЗадолженностьТЧ.СуммаУпр = ДокументВзаимозачет.СуммаУпр;
	
	//+ ИнфоСофт Сумин Д.В. 27.03.23 УА #56728
	Попытка
		ДокументВзаимозачет.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		ДокументВзаимозачет.Записать();
	КонецПопытки; 
	//ДокументВзаимозачет.Записать(РежимЗаписиДокумента.Проведение); 
	//- ИнфоСофт Сумин Д.В. 27.03.23 УА #56728	 
	
	Возврат ДокументВзаимозачет.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086 

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
Функция СоздатьДокументВозвратТоваров(Профиль, ДанныеДокумента, ЗаголовокСтруктура, КомиссионнаяОперация, ПараметрыСебестоимости = Неопределено, Основание = Неопределено) Экспорт
	
	//+ ИнфоСофт Заварин К.В. 29.10.24 УА #86402
	Если Метаданные.Перечисления.Найти("СпособыОпределенияСебестоимости") = Неопределено Тогда
		
		СпособыОпределенияСебестоимостиВручную 			  = ИС_MP_Сервер.ПолучитьПеречислениеПоЗначению(Перечисления.СпособыОпределенияСебестоимостиВозврата, "Вручную");
		СпособыОпределенияСебестоимостиИзДокументаПродажи = ИС_MP_Сервер.ПолучитьПеречислениеПоЗначению(Перечисления.СпособыОпределенияСебестоимостиВозврата, "ИзДокументаПродажи");
		
	Иначе   
		
		СпособыОпределенияСебестоимостиВручную 			  = ИС_MP_Сервер.ПолучитьПеречислениеПоЗначению(Перечисления.СпособыОпределенияСебестоимости, "Вручную");
		СпособыОпределенияСебестоимостиИзДокументаПродажи = ИС_MP_Сервер.ПолучитьПеречислениеПоЗначению(Перечисления.СпособыОпределенияСебестоимости, "ИзДокументаПродажи");
		
	КонецЕсли; 
	//- ИнфоСофт Заварин К.В. 29.10.24 УА #86402
	
	Документ = Документы.ВозвратТоваровОтКлиента.СоздатьДокумент();
	
	//+ ИнфоСофт Конышев А.Е. 26.11.24 УА #88616
	Документ.Дата = ЗаголовокСтруктура.НачалоПериода + 1;
	//+ ИнфоСофт Мурсалимов Д.Р. 31.10.24 УА #86238                                                               
	//Документ.Дата = ЗаголовокСтруктура.НачалоПериода;
	//Документ.Дата = ЗаголовокСтруктура.ДатаДокумента;
	//- ИнфоСофт Мурсалимов Д.Р. 31.10.24 УА #86238
	//- ИнфоСофт Конышев А.Е. 26.11.24 УА #88616
	
	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	//ПродажаОблагаетсяНДС = ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация);
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Партнер", Профиль.Партнер);
	ПараметрыФормы.Вставить("Контрагент", Профиль.Контрагент);
	
	Если КомиссионнаяОперация Тогда
		ПараметрыФормы.Вставить("Договор", Профиль.Договор);
		Документ.Соглашение = Профиль.Соглашение;
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера;
	Иначе
		ПараметрыФормы.Вставить("Договор", Профиль.ДоговорРеализации);
		Документ.Соглашение = Профиль.СоглашениеРеализации;
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента;
	КонецЕсли;
	
	Документ.Заполнить(ПараметрыФормы); 
	//+ ИнфоСофт Сумин Д.В. 11.03.2024 УА #71107
	Если Основание <> Неопределено Тогда
		Документ.ДокументРеализации = Основание.Ссылка;	
	КонецЕсли;	
	//- ИнфоСофт Сумин Д.В. 11.03.2024 УА #71107  
	
	//+ ИнфоСофт Сумин Д.В. 22.03.2024 УА #70680	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	ЗаполнитьВалюту = Истина;
	
	Если ИспользоватьСоглашенияСКлиентами Тогда 
		Валюта = Профиль.Соглашение.Валюта;
		ЗаполнитьВалюту = Ложь;
	КонецЕсли;
	
	Если ЗаполнитьВалюту И ИспользоватьДоговорыСКлиентами Тогда 
		Валюта = Профиль.Договор.ВалютаВзаиморасчетов;
	КонецЕсли;
	
	Документ.Валюта = Валюта;

	//Документ.Валюта = Документ.Договор.ВалютаВзаиморасчетов;
	//- ИнфоСофт Сумин Д.В. 22.03.2024 УА #70680
	
	Документ.Комментарий = ЗаголовокСтруктура.Комментарий;
	
	Документ.Организация = Профиль.Организация;    
	
	Документ.Склад = Профиль.Склад; 
	
	Документ.Подразделение = Профиль.Подразделение;
	
	Документ.ЦенаВключаетНДС = Истина;
	
	ОблагаетсяНДС = ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация);
	
	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	//Если ОблагаетсяНДС Тогда
	//	Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;			
	//Иначе
	//	Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
	//КонецЕсли;
	НастройкиУчета = УчетНДСУП.ПараметрыУчетаПоОрганизации(Профиль.Организация, ТекущаяДатаСеанса());	
	Документ.НалогообложениеНДС = НастройкиУчета.ОсновноеНалогообложениеНДСПродажи;
	
	Если Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС  	
		Или Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН Тогда
		ПродажаОблагаетсяНДС = Истина;
	Иначе
		ПродажаОблагаетсяНДС = Ложь;
	КонецЕсли;
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	
	СуммаДокумента = 0;
	
	Для Каждого Элемент Из ДанныеДокумента Цикл
		Если Элемент.ЭтоНабор Тогда
			
			//+ ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693
			//ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Элемент.Номенклатура, Элемент.Характеристика, Профиль);
			ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Профиль, Элемент.Номенклатура, Элемент.Характеристика);	
			//- ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693
			
			Если ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Или
				ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам Тогда
				
				МассивКоэффициентов = РассчитатьКоэффициентыИзЦен(ТоварыНабора.ВыгрузитьКолонку("КомплектующиеЦена"), Элемент.Номенклатура);
			Иначе
				МассивКоэффициентов = ТоварыНабора.ВыгрузитьКолонку("ДоляСтоимости");
			КонецЕсли;
			
			СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Элемент.КПеречислениюПродавцуЗаРеализованныйТовар, МассивКоэффициентов);
			
			Для Каждого ЭлементНабора Из ТоварыНабора Цикл 
				
				НоваяСтрока = Документ.Товары.Добавить();
				
				//+ ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941				
				НоваяСтрока.НоменклатураНабора = ЭлементНабора.Набор;								
				НоваяСтрока.ХарактеристикаНабора = ЭлементНабора.ХарактеристикаНабора;
				//- ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941
				НоваяСтрока.Номенклатура = ЭлементНабора.Номенклатура;
				НоваяСтрока.Характеристика = ЭлементНабора.Характеристика;
				НоваяСтрока.Количество = ЭлементНабора.КоличествоУпаковок;
				НоваяСтрока.КоличествоУпаковок = ЭлементНабора.КоличествоУпаковок; 
				НоваяСтрока.Цена = СуммыПродажи[0] / НоваяСтрока.Количество; 
				НоваяСтрока.Сумма = СуммыПродажи[0]; 
				//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046  
				НоваяСтрока.Упаковка = ЭлементНабора.Номенклатура.ЕдиницаИзмерения;
				//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046
				
				//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				//Если ПродажаОблагаетсяНДС Тогда
				//	НДС = ЭлементНабора.Номенклатура.СтавкаНДС.Ставка;
				//	НоваяСтрока.СтавкаНДС = ЭлементНабора.Номенклатура.СтавкаНДС; 
				//	Если НДС = Неопределено Или НДС = 0 Тогда 
				//		НоваяСтрока.СуммаНДС = 0;		
				//	Иначе
				//	//+ ИнфоСофт Сумин Д.В. 12.12.2023 УА #59046
				//	НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.Сумма, НДС, Истина);
				//	//НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
				//	//- ИнфоСофт Сумин Д.В. 12.12.2023 УА #59046
				//	КонецЕсли;	
				//Иначе
				//	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
				//КонецЕсли;
				
				//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				
				//+ ИнфоСофт Стояк Ю.К. 01.09.2023 УА #61246			
				Если Не КомиссионнаяОперация И ЗначениеЗаполнено(ПараметрыСебестоимости) Тогда
					
					Если ПараметрыСебестоимости.СпособРасчета = 2 И ЗначениеЗаполнено(ПараметрыСебестоимости.ВидЦены) Тогда
						НоваяСтрока.Себестоимость = ЗаполнитьСуммыПоВидуЦен(ПараметрыСебестоимости.ВидЦены, Документ.Дата, Документ.Валюта, ЭлементНабора.Номенклатура, ЭлементНабора.Характеристика, ЭлементНабора.Номенклатура.ЕдиницаИзмерения);
						НоваяСтрока.СебестоимостьБезНДС = НоваяСтрока.Себестоимость; 
						
						//+ ИнфоСофт Заварин К.В. 29.10.24 УА #86402
						//НоваяСтрока.СпособОпределенияСебестоимости = Перечисления.СпособыОпределенияСебестоимости.Вручную;
						НоваяСтрока.СпособОпределенияСебестоимости = СпособыОпределенияСебестоимостиВручную;
						//- ИнфоСофт Заварин К.В. 29.10.24 УА #86402
						
						НоваяСтрока.ВидЦеныСебестоимости = ПараметрыСебестоимости.ВидЦены;
						НоваяСтрока.ДатаЗаполненияСебестоимостиПоВидуЦены = Документ.Дата;
					ИначеЕсли ПараметрыСебестоимости.СпособРасчета = 1 Тогда
						НоваяСтрока.Себестоимость = НоваяСтрока.Сумма;
						НоваяСтрока.СебестоимостьБезНДС = НоваяСтрока.Сумма;	
					КонецЕсли;
					
				КонецЕсли;
				//- ИнфоСофт Стояк Ю.К. 01.09.2023 УА #61246
				
				НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
				
				//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				Если ПродажаОблагаетсяНДС Тогда	
					СтавкаНДС = ИС_МП_УправлениеОтчетами.РассчитатьСтавкуНДС( Документ.Организация
																			, ТекущаяДатаСеанса()
																			, Документ.НалогообложениеНДС
																			, ЭлементНабора.Номенклатура);
					НДС 						= СтавкаНДС.Ставка;
					НоваяСтрока.СтавкаНДС 		= СтавкаНДС; 
					
					Если Не ЗначениеЗаполнено(НДС) Или НДС = 0 Тогда 
						НоваяСтрока.СуммаНДС = 0;						
					Иначе
						НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.СуммаСНДС, НДС, Истина);						
					КонецЕсли;
					
				Иначе
					НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
				КонецЕсли;
				//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				
				СуммыПродажи.Удалить(0);
				
				//+ ИнфоСофт Сумин Д.В. 11.03.2024 УА #71107
				Если Основание <> Неопределено Тогда
					НоваяСтрока.ДокументРеализации = Основание.Ссылка;
					
					//+ ИнфоСофт Заварин К.В. 29.10.24 УА #86402
					//НоваяСтрока.СпособОпределенияСебестоимости = Перечисления.СпособыОпределенияСебестоимости.ИзДокументаПродажи;
					НоваяСтрока.СпособОпределенияСебестоимости = СпособыОпределенияСебестоимостиИзДокументаПродажи;
					//- ИнфоСофт Заварин К.В. 29.10.24 УА #86402
					
				КонецЕсли;	
				//- ИнфоСофт Сумин Д.В. 11.03.2024 УА #71107
				
			КонецЦикла;	
			
		Иначе
			НоваяСтрока = Документ.Товары.Добавить();
			
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;
			НоваяСтрока.Характеристика = Элемент.Характеристика;
			 //+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046 
			 НоваяСтрока.Количество = Элемент.УпаковкаКоличество;
			//НоваяСтрока.Количество = Элемент.Количество;
			 //- ИнфоСофт Сумин Д.В. 29.05.23 УА #59046
			НоваяСтрока.КоличествоУпаковок = Элемент.Количество;
			//+ ИнфоСофт Сумин Д.В. 02.11.2023 УА #64784
			НоваяСтрока.Цена = Элемент.КПеречислениюПродавцуЗаРеализованныйТовар / Элемент.Количество;  
			НоваяСтрока.Сумма =  Элемент.КПеречислениюПродавцуЗаРеализованныйТовар;
			//НоваяСтрока.Цена = Элемент.КПеречислениюПродавцуЗаРеализованныйТовар;  
			//НоваяСтрока.Сумма =  НоваяСтрока.Цена * Элемент.Количество; 
			//- ИнфоСофт Сумин Д.В. 02.11.2023 УА #64784
			//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
			//Если ПродажаОблагаетсяНДС Тогда
			//	НДС = Элемент.Номенклатура.СтавкаНДС.Ставка;
			//	НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС; 
			//	Если НДС = Неопределено Или НДС = 0 Тогда 
			//		НоваяСтрока.СуммаНДС = 0;		
			//	Иначе
			//		//+ ИнфоСофт Сумин Д.В. 12.12.2023 УА #59046
			//		НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.Сумма, НДС, Истина);
			//		//НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
			//		//- ИнфоСофт Сумин Д.В. 12.12.2023 УА #59046
			//	КонецЕсли;	
			//Иначе
			//	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
			//КонецЕсли;
			//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
			
			//+ ИнфоСофт Стояк Ю.К. 01.09.2023 УА #61246			
			Если Не КомиссионнаяОперация И ЗначениеЗаполнено(ПараметрыСебестоимости) Тогда
				
				Если ПараметрыСебестоимости.СпособРасчета = 2 И ЗначениеЗаполнено(ПараметрыСебестоимости.ВидЦены) Тогда
					НоваяСтрока.Себестоимость = ЗаполнитьСуммыПоВидуЦен(ПараметрыСебестоимости.ВидЦены, Документ.Дата, Документ.Валюта, Элемент.Номенклатура, Элемент.Характеристика, Элемент.Упаковка);
					НоваяСтрока.СебестоимостьБезНДС = НоваяСтрока.Себестоимость;
					
					//+ ИнфоСофт Заварин К.В. 29.10.24 УА #86402
					//НоваяСтрока.СпособОпределенияСебестоимости = Перечисления.СпособыОпределенияСебестоимости.Вручную;
					НоваяСтрока.СпособОпределенияСебестоимости = СпособыОпределенияСебестоимостиВручную;
					//- ИнфоСофт Заварин К.В. 29.10.24 УА #86402
					
					НоваяСтрока.ВидЦеныСебестоимости = ПараметрыСебестоимости.ВидЦены;
					НоваяСтрока.ДатаЗаполненияСебестоимостиПоВидуЦены = Документ.Дата;
				ИначеЕсли ПараметрыСебестоимости.СпособРасчета = 1 Тогда
					НоваяСтрока.Себестоимость = НоваяСтрока.Сумма;
					НоваяСтрока.СебестоимостьБезНДС = НоваяСтрока.Сумма;	
				КонецЕсли;
				
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 01.09.2023 УА #61246
			
			НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
			
			//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
			Если ПродажаОблагаетсяНДС Тогда	
				СтавкаНДС = ИС_МП_УправлениеОтчетами.РассчитатьСтавкуНДС( Документ.Организация
																		, ТекущаяДатаСеанса()
																		, Документ.НалогообложениеНДС
																		, Элемент.Номенклатура);
				НДС 						= СтавкаНДС.Ставка;
				НоваяСтрока.СтавкаНДС 		= СтавкаНДС;	
				Если Не ЗначениеЗаполнено(НДС) Или НДС = 0 Тогда 					
					НоваяСтрока.СуммаНДС = 0;						
				Иначе
					НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.СуммаСНДС, НДС, Истина); 	
				КонецЕсли;
				
			Иначе
				НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
			КонецЕсли;
			//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
			
			//+ ИнфоСофт Сумин Д.В. 11.03.2024 УА #71107
			Если Основание <> Неопределено Тогда
				НоваяСтрока.ДокументРеализации = Основание.Ссылка;
				
				//+ ИнфоСофт Заварин К.В. 29.10.24 УА #86402
				//НоваяСтрока.СпособОпределенияСебестоимости = Перечисления.СпособыОпределенияСебестоимости.ИзДокументаПродажи;
				НоваяСтрока.СпособОпределенияСебестоимости = СпособыОпределенияСебестоимостиИзДокументаПродажи;
				//- ИнфоСофт Заварин К.В. 29.10.24 УА #86402
				
			КонецЕсли;	
			//- ИнфоСофт Сумин Д.В. 11.03.2024 УА #71107
		КонецЕсли;	
		
		//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046  
		Если Не Элемент.ЭтоНабор Тогда
			НоваяСтрока.Упаковка = Элемент.Упаковка; 
		КонецЕсли;
		//НоваяСтрока.Упаковка = Элемент.Номенклатура.ЕдиницаИзмерения; 
		//- ИнфоСофт Сумин Д.В. 29.05.23 УА #59046 

	КонецЦикла;	
	//+ ИнфоСофт Сумин Д.В. 27.03.23 УА #56728
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		Документ.Записать();
	КонецПопытки; 
	//Документ.Записать(РежимЗаписиДокумента.Проведение); 
	//- ИнфоСофт Сумин Д.В. 27.03.23 УА #56728
	
	Возврат Документ;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
Функция СоздатьДокументРТУ(Профиль, ДанныеДокумента, ЗаголовокСтруктура, КомиссионнаяОперация) Экспорт
	
	Документ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	
	
	//+ ИнфоСофт Конышев А.Е. 26.11.24 УА #88616
	Документ.Дата = ЗаголовокСтруктура.НачалоПериода + 1;
	//+ ИнфоСофт Мурсалимов Д.Р. 07.10.24 УА #84813                                                               
	//Документ.Дата = ЗаголовокСтруктура.НачалоПериода;
	//Документ.Дата = ЗаголовокСтруктура.ДатаДокумента;
	//- ИнфоСофт Мурсалимов Д.Р. 07.10.24 УА #84813
	//- ИнфоСофт Конышев А.Е. 26.11.24 УА #88616	
	
	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	//ПродажаОблагаетсяНДС = ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация);
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Партнер", Профиль.Партнер);
	ПараметрыФормы.Вставить("Контрагент", Профиль.Контрагент);
	
	Если КомиссионнаяОперация Тогда
		ПараметрыФормы.Вставить("Договор", Профиль.Договор);
		Документ.Заполнить(ПараметрыФормы);
		Документ.Договор = Профиль.Договор; 
		Документ.Соглашение = Профиль.Соглашение;
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;
	Иначе
		ПараметрыФормы.Вставить("Договор", Профиль.ДоговорРеализации);
		Документ.Заполнить(ПараметрыФормы);
		Документ.Договор = Профиль.ДоговорРеализации; 
		Документ.Соглашение = Профиль.СоглашениеРеализации;
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	КонецЕсли;
	
	//+ ИнфоСофт Сумин Д.В. 22.03.2024 УА #70680	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	ЗаполнитьВалюту = Истина;
	
	Если ИспользоватьСоглашенияСКлиентами Тогда 
		Валюта = Профиль.Соглашение.Валюта;
		ЗаполнитьВалюту = Ложь;
	КонецЕсли;
	
	Если ЗаполнитьВалюту И ИспользоватьДоговорыСКлиентами Тогда 
		Валюта = Профиль.Договор.ВалютаВзаиморасчетов;
	КонецЕсли;
	
	Документ.Валюта = Валюта;

	//+ ИнфоСофт Сумин Д.В. 17.07.2023 УА #60941
	//Документ.Валюта = Документ.Договор.ВалютаВзаиморасчетов;
	//
	//Документ.ВалютаВзаиморасчетов = Документ.Договор.ВалютаВзаиморасчетов;
	//- ИнфоСофт Сумин Д.В. 17.07.2023 УА #60941
	//- ИнфоСофт Сумин Д.В. 22.03.2024 УА #70680
	
	Документ.Контрагент = Профиль.Контрагент;
	
	Документ.Комментарий = ЗаголовокСтруктура.Комментарий;
	
	Документ.Организация = Профиль.Организация;    
	
	Документ.Склад = Профиль.Склад; 
		
	Документ.Подразделение = Профиль.Подразделение;
	
	Документ.ЦенаВключаетНДС = Истина; 
	
	Документ.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	
	Документ.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;  
	
	//+ ИнфоСофт Сумин Д.В. 10.03.23 УА #57440
	Документ.СкидкиРассчитаны = Истина; 
	//- ИнфоСофт Сумин Д.В. 10.03.23 УА #57440

	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	//ОблагаетсяНДС = ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация);
	//
	//Если ОблагаетсяНДС Тогда
	//	Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;			
	//Иначе
	//	Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
	//КонецЕсли;
	НастройкиУчета = УчетНДСУП.ПараметрыУчетаПоОрганизации(Профиль.Организация, ТекущаяДатаСеанса());
	Документ.НалогообложениеНДС = НастройкиУчета.ОсновноеНалогообложениеНДСПродажи;
	
	Если Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС 	
		Или Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН Тогда
		ПродажаОблагаетсяНДС = Истина;
	Иначе
		ПродажаОблагаетсяНДС = Ложь;
	КонецЕсли;
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	
	//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #85500
	Если ЗаголовокСтруктура.Свойство("ОснованиеДляПФ") Тогда
		Документ.Основание = ЗаголовокСтруктура.ОснованиеДляПФ;
	КонецЕсли;
	//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #85500
	
	СуммаДокумента = 0;
	
	Для Каждого Элемент Из ДанныеДокумента Цикл
		Если Элемент.ЭтоНабор Тогда
			
			//+ ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693
			//ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Элемент.Номенклатура, Элемент.Характеристика, Профиль);
			ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Профиль, Элемент.Номенклатура, Элемент.Характеристика);	
			//- ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693  
			
			Если ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Или
				ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам Тогда
				
				МассивКоэффициентов = РассчитатьКоэффициентыИзЦен(ТоварыНабора.ВыгрузитьКолонку("КомплектующиеЦена"), Элемент.Номенклатура);
			Иначе
				МассивКоэффициентов = ТоварыНабора.ВыгрузитьКолонку("ДоляСтоимости");
			КонецЕсли;
			
			СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Элемент.КПеречислениюПродавцуЗаРеализованныйТовар, МассивКоэффициентов);
			
			Для Каждого ЭлементНабора Из ТоварыНабора Цикл 
				
				НоваяСтрока = Документ.Товары.Добавить();
				
				//+ ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941				
				НоваяСтрока.НоменклатураНабора = ЭлементНабора.Набор;								
				НоваяСтрока.ХарактеристикаНабора = ЭлементНабора.ХарактеристикаНабора;
				//- ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941				
				НоваяСтрока.Склад = Документ.Склад;
				НоваяСтрока.Номенклатура = ЭлементНабора.Номенклатура;
				НоваяСтрока.Характеристика = ЭлементНабора.Характеристика;
				НоваяСтрока.Количество = ЭлементНабора.КоличествоУпаковок;
				НоваяСтрока.КоличествоУпаковок = ЭлементНабора.КоличествоУпаковок; 
				НоваяСтрока.Цена = СуммыПродажи[0] / НоваяСтрока.Количество; 
				НоваяСтрока.Сумма = СуммыПродажи[0]; 
				//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046  
				НоваяСтрока.Упаковка = ЭлементНабора.Номенклатура.ЕдиницаИзмерения;
				//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046
				
				//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				//Если ПродажаОблагаетсяНДС Тогда
				//	НДС = ЭлементНабора.Номенклатура.СтавкаНДС.Ставка;
				//	НоваяСтрока.СтавкаНДС = ЭлементНабора.Номенклатура.СтавкаНДС; 
				//	Если НДС = Неопределено Или НДС = 0 Тогда 
				//		НоваяСтрока.СуммаНДС = 0;		
				//	Иначе
				//		//+ ИнфоСофт Сумин Д.В. 12.12.2023 УА #59046
				//		НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.Сумма, НДС, Истина);
				//		//НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
				//		//- ИнфоСофт Сумин Д.В. 12.12.2023 УА #59046
				//	КонецЕсли;	
				//Иначе
				//	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
				//КонецЕсли;
				//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				
				НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
				
				//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				Если ПродажаОблагаетсяНДС Тогда	
					СтавкаНДС = ИС_МП_УправлениеОтчетами.РассчитатьСтавкуНДС( Документ.Организация
																			, ТекущаяДатаСеанса()
																			, Документ.НалогообложениеНДС
																			, ЭлементНабора.Номенклатура); 
					НДС 						= СтавкаНДС.Ставка;
					НоваяСтрока.СтавкаНДС 		= СтавкаНДС; 
					Если Не ЗначениеЗаполнено(НДС) Или НДС = 0 Тогда 
						НоваяСтрока.СуммаНДС = 0;						
					Иначе
						НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.СуммаСНДС, НДС, Истина);						
					КонецЕсли;
					
				Иначе
					НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
				КонецЕсли;
				//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				
				СуммыПродажи.Удалить(0);
				
			КонецЦикла;	
			
		Иначе
			НоваяСтрока = Документ.Товары.Добавить();
			НоваяСтрока.Склад = Документ.Склад;
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;
			НоваяСтрока.Характеристика = Элемент.Характеристика;
			//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046 
			НоваяСтрока.Количество = Элемент.УпаковкаКоличество;
			//НоваяСтрока.Количество = Элемент.Количество;
			//- ИнфоСофт Сумин Д.В. 29.05.23 УА #59046
			НоваяСтрока.КоличествоУпаковок = Элемент.Количество;
			//+ ИнфоСофт Сумин Д.В. 02.11.2023 УА #64784
			НоваяСтрока.Цена = Элемент.КПеречислениюПродавцуЗаРеализованныйТовар / Элемент.Количество;  
			НоваяСтрока.Сумма =  Элемент.КПеречислениюПродавцуЗаРеализованныйТовар;
			//НоваяСтрока.Цена = Элемент.КПеречислениюПродавцуЗаРеализованныйТовар;  
			//НоваяСтрока.Сумма =  НоваяСтрока.Цена * Элемент.Количество; 
			//- ИнфоСофт Сумин Д.В. 02.11.2023 УА #64784 
			
			//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
			//Если ПродажаОблагаетсяНДС Тогда
			//	НДС = Элемент.Номенклатура.СтавкаНДС.Ставка;
			//	НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС; 
			//	Если НДС = Неопределено Или НДС = 0 Тогда 
			//		НоваяСтрока.СуммаНДС = 0;		
			//	Иначе
			//		//+ ИнфоСофт Сумин Д.В. 12.12.2023 УА #59046
			//		НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.Сумма, НДС, Истина);
			//		//НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
			//		//- ИнфоСофт Сумин Д.В. 12.12.2023 УА #59046
			//	КонецЕсли;	
			//Иначе
			//	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
			//КонецЕсли;
			//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
			
			НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
			
			//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
			Если ПродажаОблагаетсяНДС Тогда
				СтавкаНДС = ИС_МП_УправлениеОтчетами.РассчитатьСтавкуНДС( Документ.Организация
																		, ТекущаяДатаСеанса()
																		, Документ.НалогообложениеНДС
																		, Элемент.Номенклатура);
				НДС 						= СтавкаНДС.Ставка;
				НоваяСтрока.СтавкаНДС 		= СтавкаНДС; 	
				Если Не ЗначениеЗаполнено(НДС) Или НДС = 0 Тогда 					
					НоваяСтрока.СуммаНДС = 0;						
				Иначе
					НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.СуммаСНДС, НДС, Истина); 	
				КонецЕсли;
				
			Иначе
				НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
			КонецЕсли;
			//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
			
		КонецЕсли;
		//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046  
		Если Не Элемент.ЭтоНабор Тогда
			НоваяСтрока.Упаковка = Элемент.Упаковка; 
		КонецЕсли;
		//НоваяСтрока.Упаковка = Элемент.Номенклатура.ЕдиницаИзмерения; 
		//- ИнфоСофт Сумин Д.В. 29.05.23 УА #59046 
		
	КонецЦикла;	

	//+ ИнфоСофт Сумин Д.В. 07.08.2023 УА #60602
	Если ЗаголовокСтруктура.ЗагрузитьКодыМаркировкиВДокументРеализации Тогда
		КодыМаркировки = ПолучитьКодыМаркировки(ЗаголовокСтруктура.МассивКиз);
		Для Каждого Элемент Из КодыМаркировки Цикл
			СтрокаТЧ = Документ.ШтрихкодыУпаковок.Добавить();
			СтрокаТЧ.ШтрихкодУпаковки = Элемент; 
		КонецЦикла;	
	КонецЕсли;	
	//- ИнфоСофт Сумин Д.В. 07.08.2023 УА #60602
	
	//+ ИнфоСофт Сумин Д.В. 27.03.23 УА #56728
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		Документ.Записать();
	КонецПопытки; 
	//Документ.Записать(РежимЗаписиДокумента.Проведение); 
	//- ИнфоСофт Сумин Д.В. 27.03.23 УА #56728
	
	Возврат Документ;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086	

//+ ИнфоСофт Ивонин К.А. 05.04.23 УА #57127
//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
//Функция ПроверитьСвободныеОстатки(ТаблицаТоваров, Склад) Экспорт
Функция ПроверитьСвободныеОстатки(ТаблицаТоваров, Склад, Назначения = Неопределено) Экспорт
	//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	
	//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083	
	Если Не ЗначениеЗаполнено(Назначения) Тогда
		Назначения = Новый Массив;
		Назначения.Добавить(Справочники.Назначения.ПустаяСсылка());
	КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	
	ЗапросОстатков = Новый Запрос;	
	ЗапросОстатков.Текст =
	//+ ИнфоСофт Сумин Д.В. 15.08.2023 УА #62101
	"ВЫБРАТЬ
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	ТЗ.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ТаблицаЗначений
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаЗначений.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаЗначений.Характеристика КАК Характеристика,
	|	РаспределениеЗапасов.Склад КАК Склад,
	//+ ИнфоСофт Заварин К.В. 11.02.25 УА #93503
	|	РаспределениеЗапасов.Свободно как Свободно,
	//- ИнфоСофт Заварин К.В. 11.02.25 УА #93503
	|	ВЫБОР
	|		КОГДА РаспределениеЗапасов.Свободно ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ РаспределениеЗапасов.Свободно > 0
	|	КОНЕЦ КАК ОстатокВНаличии
	|ИЗ
	|	ВТ_ТаблицаЗначений КАК ВТ_ТаблицаЗначений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО (ВТ_ТаблицаЗначений.Номенклатура = РаспределениеЗапасов.Номенклатура)
	|			И (ВТ_ТаблицаЗначений.Характеристика = РаспределениеЗапасов.Характеристика)
	|			И (РаспределениеЗапасов.Склад В ИЕРАРХИИ (&Склад))
	//+ ИнфоСофт Мурсалимов Д.Р. 11.10.23 УА #64600
	|			И (РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе))
	//- ИнфоСофт Мурсалимов Д.Р. 11.10.23 УА #64600
	//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	|			И (РаспределениеЗапасов.Назначение В (&Назначения))
	//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстатокВНаличии УБЫВ";
	//- ИнфоСофт Сумин Д.В. 15.08.2023 УА #62101
	
	ЗапросОстатков.УстановитьПараметр("ТЗ", ТаблицаТоваров);
	ЗапросОстатков.УстановитьПараметр("Склад", Склад);
	//+ ИнфоСофт Стояк Ю.К. 19.11.2024 УА #74083
	ЗапросОстатков.УстановитьПараметр("Назначения", Назначения);
	//- ИнфоСофт Стояк Ю.К. 19.11.2024 УА #74083
	
	РезультатЗапросаОстатков = ЗапросОстатков.Выполнить();
	
	ВыгрузкаОстатков = РезультатЗапросаОстатков.Выгрузить();
	
	Возврат ВыгрузкаОстатков;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 05.04.23 УА #57127

//+ ИнфоСофт Мурсалимов Д.Р. 14.08.24 УА #81483
Функция Комплектующие(Параметры, ДополнительныеПараметры) Экспорт
	
	Возврат НаборыВызовСервера.Комплектующие(Параметры, ДополнительныеПараметры);

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 14.08.24 УА #81483

//+ ИнфоСофт Сумин Д.В. 01.03.2024 УА #71107
Функция СоздатьДокументОтчетКомиссионера(ДанныеОбработки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	//Подготовка данных для документа
	СписокТранзакций = ДанныеОбработки.СтруктураДанных.СписокТранзакций; 
	
	ТаблицаПродаж = Новый ТаблицаЗначений;
	ТаблицаПродаж.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаПродаж.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаПродаж.Колонки.Добавить("Баркод", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
	ТаблицаПродаж.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,2)));
	//+ ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
	//ТаблицаПродаж.Колонки.Добавить("КоличествоВУпаковке", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,2)));
	ТаблицаПродаж.Колонки.Добавить("КоэффициентУпаковки", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,2)));
	//- ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
	ТаблицаПродаж.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,2)));
	ТаблицаПродаж.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТаблицаПродаж.Колонки.Добавить("ЭтоНабор", Новый ОписаниеТипов("Булево"));
	ТаблицаПродаж.Колонки.Добавить("СуммаПродажи", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,2)));
	ТаблицаПродаж.Колонки.Добавить("ЦенаРозничная", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,2)));	
	
	СуммаБрака = 0;
	
	ТаблицаПотерь = Новый ТаблицаЗначений;
	ТаблицаПотерь.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаПотерь.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаПотерь.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,2)));
	ТаблицаПотерь.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТаблицаПотерь.Колонки.Добавить("ЭтоНабор", Новый ОписаниеТипов("Булево"));
	
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
	ТаблицаОприходований = Новый ТаблицаЗначений;
	ТаблицаОприходований.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаОприходований.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаОприходований.Колонки.Добавить("Сумма",          Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,2)));
	ТаблицаОприходований.Колонки.Добавить("Упаковка",       Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТаблицаОприходований.Колонки.Добавить("ЭтоНабор",       Новый ОписаниеТипов("Булево"));
	ТаблицаОприходований.Колонки.Добавить("КПеречислениюПродавцуЗаРеализованныйТовар", 
															Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,2)));
	ТаблицаОприходований.Колонки.Добавить("УпаковкаКоличество", 
															Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,2)));
	ТаблицаОприходований.Колонки.Добавить("Количество",     Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,2)));														
	//- ИнфоСофт Власова И.С. 14.03.25 УА #83865
	
	//+ ИнфоСофт Сумин Д.В. 15.03.2024 УА #71773
	Если ДанныеОбработки.СтруктураДанных.СуммаУслугВБ = 0 Тогда
		РассчитатьКомиссионноеВознаграждение = Ложь;	
	Иначе		
		РассчитатьКомиссионноеВознаграждение = ДанныеОбработки.СтруктураДанных.РассчитатьКомиссионноеВознаграждение;
	КонецЕсли;
	//- ИнфоСофт Сумин Д.В. 15.03.2024 УА #71773 
	
	//+ ИнфоСофт Власова И.С. 03.04.25 УА #98046
	//МассивСуммПродаж = Новый Массив;
	
	СуммаПродажи = 0;
	//- ИнфоСофт Власова И.С. 03.04.25 УА #98046
	
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
	НастройкиОК = ДанныеОбработки.СтруктураДанных.НастройкиОтчетаКомиссионера;
	СгруппироватьПоНоменклатуре = ДанныеОбработки.СтруктураДанных.СгруппироватьПоНоменклатуре;
	
	СписыватьУтраченныеТовары   = ?(НастройкиОК.СписыватьУтраченныеТовары = Неопределено, Ложь, НастройкиОК.СписыватьУтраченныеТовары);
	ОприходоватьНайденныеТовары = ?(НастройкиОК.ОприходоватьНайденныеТовары = Неопределено, Ложь, НастройкиОК.ОприходоватьНайденныеТовары);
	
	СуммаУдержаний   = 0;
	СуммаКомпенсаций = 0;
	//- ИнфоСофт Власова И.С. 14.03.25 УА #83865
	
	Для Каждого Строка Из СписокТранзакций Цикл
		
		Коэффициент = -1;
		
		Если НРег(Строка.ТипДокумента) = "продажа" Тогда	
			Коэффициент = 1;
		КонецЕсли;
		
		Если Нрег(Строка.ОбоснованиеДляОплаты) = "частичная компенсация брака" 
			Или Нрег(Строка.ОбоснованиеДляОплаты) = "оплата брака" Тогда  
		//+ ИнфоСофт Мурсалимов Д.Р. 07.06.24 УА #76702
			//Или Нрег(Строка.ОбоснованиеДляОплаты) = "компенсация подмененного товара"	
		//- ИнфоСофт Мурсалимов Д.Р. 07.06.24 УА #76702
			
				СуммаБрака = СуммаБрака + (Строка.ВайлдберризРеализовалТовар_Пр_ * Коэффициент);
				Продолжить;
				
		//+ ИнфоСофт Мурсалимов Д.Р. 07.06.24 УА #76702		
		ИначеЕсли Нрег(Строка.ОбоснованиеДляОплаты) = "компенсация брака" 
			//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
			//Или Нрег(Строка.ОбоснованиеДляОплаты) = "компенсация подмененного товара" 
			//Или Нрег(Строка.ОбоснованиеДляОплаты) = "компенсация потерянного товара"
			//+ ИнфоСофт Стояк Ю.К. 25.06.2024 УА #78086
			//Или Нрег(Строка.ОбоснованиеДляОплаты) = "компенсация ущерба"
			//- ИнфоСофт Власова И.С. 14.03.25 УА #83865
			Или Нрег(Строка.ОбоснованиеДляОплаты) = "добровольная компенсация при возврате" Тогда
			
			//+ ИнфоСофт Заварин К.В. 11.12.24 УА #88301
			//+ ИнфоСофт Мурсалимов Д.Р. 16.10.24 УА #85010
			//Или Нрег(Строка.ОбоснованиеДляОплаты) = "коррекция продаж" 
			//- ИнфоСофт Мурсалимов Д.Р. 16.10.24 УА #85010
			//- ИнфоСофт Заварин К.В. 11.12.24 УА #88301
			
			//- ИнфоСофт Стояк Ю.К. 25.06.2024 УА #78086
					
				СуммаБрака = СуммаБрака + (Строка.КПеречислениюПродавцуЗаРеализованныйТовар * Коэффициент);
				Продолжить;
		//- ИнфоСофт Мурсалимов Д.Р. 07.06.24 УА #76702			
		
		ИначеЕсли Нрег(Строка.ОбоснованиеДляОплаты) = "авансовая оплата за товар без движения" Тогда
			
			//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
			Сумма = Число(Строка.ВайлдберризРеализовалТовар_Пр_);
			
			Если Коэффициент > 0 Тогда
				СуммаКомпенсаций  = СуммаКомпенсаций + Сумма;
				НоваяСтрокаПотерь = ТаблицаПотерь.Добавить();
			Иначе
				
				СуммаУдержаний    = СуммаУдержаний + Сумма;
				НоваяСтрокаПотерь = ТаблицаОприходований.Добавить();
				
				НоваяСтрокаПотерь.КПеречислениюПродавцуЗаРеализованныйТовар = Сумма;
				НоваяСтрокаПотерь.Количество         = 1;
				НоваяСтрокаПотерь.УпаковкаКоличество = 1;
				
			КонецЕсли;
			
			НоваяСтрокаПотерь.Номенклатура 	 = Строка.Номенклатура;
			НоваяСтрокаПотерь.Характеристика = Строка.Характеристика;
			НоваяСтрокаПотерь.Сумма 		 = Сумма;
			НоваяСтрокаПотерь.ЭтоНабор 		 = Строка.ЭтоНабор;
			НоваяСтрокаПотерь.Упаковка 		 = Строка.Упаковка; 
			//- ИнфоСофт Власова И.С. 14.03.25 УА #83865
			
			Продолжить;
			
		//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
		ИначеЕсли Нрег(Строка.ОбоснованиеДляОплаты) = "компенсация ущерба"
			Или Нрег(Строка.ОбоснованиеДляОплаты) = "компенсация подмененного товара" 
			Или Нрег(Строка.ОбоснованиеДляОплаты) = "компенсация потерянного товара" Тогда
			
			Сумма = Число(Строка.КПеречислениюПродавцуЗаРеализованныйТовар);
			
			Если Коэффициент > 0 Тогда 
				СуммаКомпенсаций  = СуммаКомпенсаций + Сумма;
				НоваяСтрокаПотерь = ТаблицаПотерь.Добавить();
			Иначе
				
				СуммаУдержаний    = СуммаУдержаний + Сумма;
				НоваяСтрокаПотерь = ТаблицаОприходований.Добавить();
				
				НоваяСтрокаПотерь.КПеречислениюПродавцуЗаРеализованныйТовар = Сумма;
				НоваяСтрокаПотерь.Количество         = 1;
				НоваяСтрокаПотерь.УпаковкаКоличество = 1;
				
			КонецЕсли;
			
			НоваяСтрокаПотерь.Номенклатура 	 = Строка.Номенклатура;
			НоваяСтрокаПотерь.Характеристика = Строка.Характеристика;
			НоваяСтрокаПотерь.Сумма 		 = Сумма;
			НоваяСтрокаПотерь.ЭтоНабор 		 = Строка.ЭтоНабор;
			НоваяСтрокаПотерь.Упаковка 		 = Строка.Упаковка;
			
			Продолжить;	
		//- ИнфоСофт Власова И.С. 14.03.25 УА #83865
			
		ИначеЕсли Нрег(Строка.ОбоснованиеДляОплаты) = "возмещение издержек по перевозке" Тогда 
			Продолжить;
			
		//+ ИнфоСофт Стояк Ю.К. 25.06.2024 УА #78086
		//ИначеЕсли Строка.Кол_во = 0 Тогда					
		ИначеЕсли Строка.Кол_во = 0 Или Строка.Кол_во = 2 Тогда			
		//- ИнфоСофт Стояк Ю.К. 25.06.2024 УА #78086
			Продолжить;
		
		КонецЕсли;	
				
		НоваяСтрока 						= ТаблицаПродаж.Добавить();
		НоваяСтрока.Номенклатура 			= Строка.Номенклатура;
		НоваяСтрока.Характеристика 			= Строка.Характеристика;
		НоваяСтрока.Баркод 					= Строка.Баркод;
		НоваяСтрока.Количество 				= Коэффициент * Число(Строка.Кол_во);
		НоваяСтрока.Упаковка 				= Строка.Упаковка;
		НоваяСтрока.ЭтоНабор 				= Строка.ЭтоНабор;
		//+ ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
		//НоваяСтрока.КоличествоВУпаковке 	= Число(Строка.КоличествоВУпаковке);
        НоваяСтрока.КоэффициентУпаковки 	= Число(Строка.КоэффициентУпаковки);
		//- ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
		НоваяСтрока.СуммаПродажи 			= Коэффициент * Число(Строка.ВайлдберризРеализовалТовар_Пр_);
		НоваяСтрока.ЦенаРозничная 			= Число(Строка.ЦенаРозничная);
		
		//+ ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
		//Если НоваяСтрока.КоличествоВУпаковке = 0 Тогда
		//	НоваяСтрока.КоличествоВУпаковке = НоваяСтрока.Количество;	
		//КонецЕсли;
		Если НоваяСтрока.КоэффициентУпаковки = 0 Тогда
			НоваяСтрока.КоэффициентУпаковки = НоваяСтрока.Количество;	
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
		
		Если РассчитатьКомиссионноеВознаграждение Тогда	
			
			//+ ИнфоСофт Власова И.С. 03.04.25 УА #98046
			//Если Коэффициент > 0 Тогда
			//	СуммаПродажи = НоваяСтрока.СуммаПродажи;	
			//Иначе
			//	СуммаПродажи = 0;
			//КонецЕсли;
			
			//МассивСуммПродаж.Добавить(СуммаПродажи);
			
			Если Коэффициент > 0 Или (Коэффициент < 0 И СгруппироватьПоНоменклатуре) Тогда
				СуммаПродажи = СуммаПродажи + НоваяСтрока.СуммаПродажи;	
			КонецЕсли;
			//- ИнфоСофт Власова И.С. 03.04.25 УА #98046
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Если ДанныеОбработки.СтруктураДанных.СгруппироватьПоНоменклатуре Тогда
		ТаблицаПродаж = СгруппироватьТаблицуПродажПоНоменклатуре(ТаблицаПродаж);	
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить("ТаблицаПродаж", 						ТаблицаПродаж);
	СтруктураДанных.Вставить("СгруппироватьПоНоменклатуре", 		ДанныеОбработки.СтруктураДанных.СгруппироватьПоНоменклатуре);
	СтруктураДанных.Вставить("РассчитатьКомиссионноеВознаграждение",РассчитатьКомиссионноеВознаграждение);
	СтруктураДанных.Вставить("ВариантФормированияЦеныВозврата", 	ДанныеОбработки.СтруктураДанных.ВариантФормированияЦеныВозврата); 
	//+ ИнфоСофт Заварин К.В. 25.06.24 УА #69434
	СтруктураДанных.Вставить("ВариантСозданияОтчета", 				ДанныеОбработки.СтруктураДанных.ВариантСозданияОтчета);
	//- ИнфоСофт Заварин К.В. 25.06.24 УА #69434
	СтруктураДанных.Вставить("ВидЦеныВозврата", 					ДанныеОбработки.СтруктураДанных.ВидЦеныВозврата);
	СтруктураДанных.Вставить("НомерОтчета", 						ДанныеОбработки.СтруктураДанных.НомерОтчета);
	СтруктураДанных.Вставить("Профиль", 							ДанныеОбработки.СтруктураДанных.Профиль);
	СтруктураДанных.Вставить("Партнер", 							ДанныеОбработки.СтруктураДанных.Партнер);
	СтруктураДанных.Вставить("Контрагент", 							ДанныеОбработки.СтруктураДанных.Контрагент);
	СтруктураДанных.Вставить("Организация", 						ДанныеОбработки.СтруктураДанных.Организация);
	СтруктураДанных.Вставить("ДатаНачала", 							ДанныеОбработки.СтруктураДанных.ДатаНачала);
	СтруктураДанных.Вставить("ДатаОкончания", 						ДанныеОбработки.СтруктураДанных.ДатаОкончания);
	СтруктураДанных.Вставить("Соглашение", 							ДанныеОбработки.СтруктураДанных.Соглашение);
	СтруктураДанных.Вставить("Договор", 							ДанныеОбработки.СтруктураДанных.Договор);
	//+ ИнфоСофт Власова И.С. 03.04.25 УА #98046
	//СтруктураДанных.Вставить("МассивСуммПродаж", 					МассивСуммПродаж);
	СтруктураДанных.Вставить("СуммаПродажи",     					СуммаПродажи);
	//- ИнфоСофт Власова И.С. 03.04.25 УА #98046
	СтруктураДанных.Вставить("СуммаУслугВБ", 						ДанныеОбработки.СтруктураДанных.СуммаУслугВБ);
	//+ ИнфоСофт Заварин К.В. 02.04.24 УА #66208
    СтруктураДанных.Вставить("НомерВходящегоДокумента", 			ДанныеОбработки.СтруктураДанных.НомерВходящегоДокумента);
	СтруктураДанных.Вставить("ДатаВходящегоДокумента", 				ДанныеОбработки.СтруктураДанных.ДатаВходящегоДокумента);
	//- ИнфоСофт Заварин К.В. 02.04.24 УА #66208
	СтруктураДанных.Вставить("Комментарий", 						ДанныеОбработки.СтруктураДанных.Комментарий);
	СтруктураДанных.Вставить("НоменклатураУслугиВБ", 				ДанныеОбработки.СтруктураДанных.НоменклатураУслугиВБ);
	//+ ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78655
	СтруктураДанных.Вставить("Подразделение", 						ДанныеОбработки.СтруктураДанных.Подразделение);
	//- ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78655
	
	//+ ИнфоСофт Макарова Н.Е. 10.04.2025 УА #76491
	Если ДанныеОбработки.СтруктураДанных.Свойство("ОтчетКомиссионераСсылка") Тогда
		
		СтруктураДанных.Вставить("ОтчетКомиссионераСсылка", 		ДанныеОбработки.СтруктураДанных.ОтчетКомиссионераСсылка);
		
	КонецЕсли;
	//- ИнфоСофт Макарова Н.Е. 10.04.2025 УА #76491
	
	//+ ИнфоСофт Мурсалимов Д.Р. 24.04.25 УА #99478
	Если ДанныеОбработки.СтруктураДанных.Свойство("ОчиститьРегистрыОК") Тогда
		СтруктураДанных.Вставить("ОчиститьРегистрыОК", 				ДанныеОбработки.СтруктураДанных.ОчиститьРегистрыОК);	
	КонецЕсли;
	
	Если ДанныеОбработки.СтруктураДанных.Свойство("НомерОтчета") Тогда
		СтруктураДанных.Вставить("НомерОтчета", 					ДанныеОбработки.СтруктураДанных.НомерОтчета);	
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 24.04.25 УА #99478
	
    Результат = Новый Структура;
	Результат.Вставить("НомерСтраницы", 3);
	МассивДокументов = Новый Массив;
	
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
	Профиль = ДанныеОбработки.СтруктураДанных.Профиль;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ;
	
	КомиссионныеПродажи25 = ИС_MP_Сервер.ПолучитьВерсиюКомиссионныхПродаж(Профиль, Маркетплейс);
	
	// Создание документов оприходования комиссионного товара (был потерян, но найден позднее и возвращен в продажу)
	// Компенсация удерживается с продавца
	Если ТаблицаОприходований.Количество() > 0 Тогда
		
		Если ОприходоватьНайденныеТовары Тогда
			
			// Оприходование излишков товаров для передачи комиссионеру
			ДанныеДокумента = ПолучитьСтруктуруОприходованияИзлишковТоваров();
			
			ДанныеДокумента.Дата          = НачалоДня(СтруктураДанных.ДатаНачала);
			ДанныеДокумента.Комментарий   = ДанныеОбработки.СтруктураДанных.Комментарий;
			ДанныеДокумента.Организация   = ДанныеОбработки.СтруктураДанных.Организация;
			ДанныеДокумента.Подразделение = ДанныеОбработки.СтруктураДанных.Подразделение;
			ДанныеДокумента.Склад         = Профиль.Склад;
			ДанныеДокумента.СтатьяДоходов = НастройкиОК.СтатьяПрочихДоходов;
			
			Для Каждого Строка Из ТаблицаОприходований Цикл
				
				НоваяСтрока = ДанныеДокумента.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				НоваяСтрока.Цена = Строка.Сумма;
				
			КонецЦикла;
			
			ОприходованиеТоваров = СоздатьИзменитьОприходованиеИзлишковТоваров(Профиль, ДанныеДокумента);
			
			Если Не ОприходованиеТоваров = Неопределено Тогда	
				
				МассивДокументов.Добавить(ОприходованиеТоваров);
				
				// Передача комиссионеру оприходованного товара
				ЗаголовокСтруктура = Новый Структура;
				
				ЗаголовокСтруктура.Вставить("ДатаДокумента", НачалоДня(СтруктураДанных.ДатаНачала));
				ЗаголовокСтруктура.Вставить("Комментарий", 	 ДанныеОбработки.СтруктураДанных.Комментарий);
				ЗаголовокСтруктура.Вставить("НачалоПериода", НачалоДня(СтруктураДанных.ДатаНачала));
				ЗаголовокСтруктура.Вставить("КонецПериода",  КонецДня(СтруктураДанных.ДатаОкончания));
				ЗаголовокСтруктура.Вставить("ЗагрузитьКодыМаркировкиВДокументРеализации", Ложь);
				
				ПередачаНаКомиссиюДокумент = СоздатьДокументРТУ(Профиль, ТаблицаОприходований, ЗаголовокСтруктура, Истина);
				
				Если Не ПередачаНаКомиссиюДокумент = Неопределено Тогда
					МассивДокументов.Добавить(ПередачаНаКомиссиюДокумент.Ссылка);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Корректировка задолженности на сумму удержания компенсации
		ДанныеКорректировки = ПолучитьСтруктуруКорректировкиЗадолженности();
		
		ДанныеКорректировки.Дата          		     = КонецДня(СтруктураДанных.ДатаОкончания);
		ДанныеКорректировки.Комментарий   		     = ДанныеОбработки.СтруктураДанных.Комментарий + ", удержание компенсации за потери";;
		ДанныеКорректировки.Организация   		     = ДанныеОбработки.СтруктураДанных.Организация;
		ДанныеКорректировки.Контрагент   		     = ДанныеОбработки.СтруктураДанных.Контрагент;
		ДанныеКорректировки.Договор   		         = ДанныеОбработки.СтруктураДанных.Договор;
		ДанныеКорректировки.Соглашение   		     = ДанныеОбработки.СтруктураДанных.Соглашение;
		ДанныеКорректировки.ХозяйственнаяОперация    = ПолучитьХозОперациюСписаниеДебиторскойЗадолженности();
		ДанныеКорректировки.КорреспонденцияСДоходами = Ложь;
		
		СтрокаЗадолженность = ДанныеКорректировки.Задолженность.Добавить();
		СтрокаЗадолженность.ТипРасчетов = ПолучитьТипРасчетовСПартнерамиРасчетыСПоставщиком();
		СтрокаЗадолженность.Партнер     = ДанныеОбработки.СтруктураДанных.Партнер;
		СтрокаЗадолженность.Сумма       = СуммаУдержаний;
		
		СтрокаДоходыРасходыАктивыПассивы = ДанныеКорректировки.ДоходыРасходыАктивыПассивы.Добавить();
		СтрокаДоходыРасходыАктивыПассивы.Статья        = НастройкиОК.СтатьяПрочихРасходов;
		СтрокаДоходыРасходыАктивыПассивы.Подразделение = ДанныеОбработки.СтруктураДанных.Подразделение;
		СтрокаДоходыРасходыАктивыПассивы.Сумма         = СуммаУдержаний;
		
		КорректировкаЗадолженности = СоздатьИзменитьКорректировкуЗадолженности(Профиль, ДанныеКорректировки);
		МассивДокументов.Добавить(КорректировкаЗадолженности);
		
	КонецЕсли;
	
	// Создание документа отчет комиссионера 
	ОтчетКомиссионера = СоздатьДокументОтчетКомиссионераNew(СтруктураДанных);
	МассивДокументов.Добавить(ОтчетКомиссионера.Ссылка);
	
	//Создание документов списания комиссионного товара по потерям
	Если ТаблицаПотерь.Количество() > 0 Тогда
		
		Если КомиссионныеПродажи25 Тогда
			
			ДанныеДокумента = ПолучитьСтруктуруОтчетаОСписанииТоваровУХранителя();
			
			ДанныеДокумента.Дата          		  = КонецДня(СтруктураДанных.ДатаОкончания);
			ДанныеДокумента.Партнер       		  = ДанныеОбработки.СтруктураДанных.Партнер;
			ДанныеДокумента.Контрагент    		  = ДанныеОбработки.СтруктураДанных.Контрагент;
			ДанныеДокумента.Соглашение    		  = ДанныеОбработки.СтруктураДанных.Соглашение;
			ДанныеДокумента.Организация           = ДанныеОбработки.СтруктураДанных.Организация;
			ДанныеДокумента.Договор               = ДанныеОбработки.СтруктураДанных.Договор;
			ДанныеДокумента.Комментарий           = ДанныеОбработки.СтруктураДанных.Комментарий;
			ДанныеДокумента.Подразделение         = ДанныеОбработки.СтруктураДанных.Подразделение;
			ДанныеДокумента.ХозяйственнаяОперация = ПолучитьХозОперациюСписаниеНедостачЗаСчетКомитента();
			ДанныеДокумента.СтатьяРасходов        = НастройкиОК.СтатьяПрочихРасходов;
			
			ДанныеДокумента.Товары = ТаблицаПотерь.Скопировать();
			
			ОтчетКомиссионераОСписании = СоздатьИзменитьОтчетОСписанииТоваровУХранителя(Профиль, ДанныеДокумента);
			
			Если Не ОтчетКомиссионераОСписании = Неопределено Тогда
				
				МассивДокументов.Добавить(ОтчетКомиссионераОСписании);
				
				Претензия = Неопределено;
				
				Если Константы.ФиксироватьПретензии.Получить() Тогда
					
					ДанныеЭлемента = ПолучитьСтруктуруПретензии();
					ЗаполнитьЗначенияСвойств(ДанныеЭлемента, ДанныеДокумента);
					
					ДанныеЭлемента.ДатаРегистрации		   = ДанныеДокумента.Дата;
	                ДанныеЭлемента.Наименование			   = ДанныеЭлемента.Комментарий;
					ДанныеЭлемента.ОписаниеПретензии	   = ДанныеЭлемента.Комментарий;
					ДанныеЭлемента.Сумма				   = СуммаКомпенсаций;
					ДанныеЭлемента.ЭтоПретензияПоставщику  = Истина;
					ДанныеЭлемента.ВестиРасчетыПоПретензии = Истина;
					
					Претензия = СоздатьИзменитьПретензиюКомиссионеру(Профиль, ДанныеЭлемента);
					
				КонецЕсли;
				
				ДанныеКорректировки = ПолучитьСтруктуруКорректировкиЗадолженности();
				
				ДанныеКорректировки.Дата          		     = КонецДня(СтруктураДанных.ДатаОкончания);
				ДанныеКорректировки.Комментарий   		     = ДанныеОбработки.СтруктураДанных.Комментарий;
				ДанныеКорректировки.Организация   		     = ДанныеОбработки.СтруктураДанных.Организация;
				ДанныеКорректировки.Контрагент   		     = ДанныеОбработки.СтруктураДанных.Контрагент;
				ДанныеКорректировки.Договор   		         = ДанныеОбработки.СтруктураДанных.Договор;
				ДанныеКорректировки.Соглашение   		     = ДанныеОбработки.СтруктураДанных.Соглашение;
				ДанныеКорректировки.ХозяйственнаяОперация    = ПолучитьХозОперациюСписаниеКредиторскойЗадолженности();
				ДанныеКорректировки.КорреспонденцияСДоходами = Истина;
				
				Если Не Претензия = Неопределено Тогда
					ДанныеКорректировки.Вставить("Претензия", Претензия);
				КонецЕсли;	 
					 
				СтрокаЗадолженность = ДанныеКорректировки.Задолженность.Добавить();
				СтрокаЗадолженность.ТипРасчетов = ПолучитьТипРасчетовСПартнерамиРасчетыСПоставщиком();
				СтрокаЗадолженность.Партнер     = ДанныеОбработки.СтруктураДанных.Партнер;
				СтрокаЗадолженность.Сумма       = СуммаКомпенсаций;
				
				СтрокаДоходыРасходыАктивыПассивы = ДанныеКорректировки.ДоходыРасходыАктивыПассивы.Добавить();
				СтрокаДоходыРасходыАктивыПассивы.Статья        = НастройкиОК.СтатьяПрочихДоходов;
				СтрокаДоходыРасходыАктивыПассивы.Подразделение = ДанныеОбработки.СтруктураДанных.Подразделение;
				СтрокаДоходыРасходыАктивыПассивы.Сумма         = СуммаКомпенсаций;
				
				КорректировкаЗадолженности = СоздатьИзменитьКорректировкуЗадолженности(Профиль, ДанныеКорректировки);
				МассивДокументов.Добавить(КорректировкаЗадолженности);
				
			КонецЕсли;
			
		Иначе	
			
			ТаблицаПотерь = СвернутьТаблицуПотерь(ТаблицаПотерь);
			
			СтруктураПотерь = Новый Структура;
			СтруктураПотерь.Вставить("ТаблицаПотерь", 		ТаблицаПотерь);
			СтруктураПотерь.Вставить("ОтчетКомиссионера", 	ОтчетКомиссионера.Ссылка);
			СтруктураПотерь.Вставить("Профиль", 			ДанныеОбработки.СтруктураДанных.Профиль);
			СтруктураПотерь.Вставить("СтатьяДоходов", 		НастройкиОК.СтатьяПрочихДоходов);
			СтруктураПотерь.Вставить("СтатьяРасходов", 		НастройкиОК.СтатьяПрочихРасходов);
			
			ОтчетКомиссионераОСписании = ПолучитьДокументСписанияТоваровКомиссионера(СтруктураПотерь);
			МассивДокументов.Добавить(ОтчетКомиссионераОСписании.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;	
	//- ИнфоСофт Власова И.С. 14.03.25 УА #83865	
	
	//Создание документа корректировки задолженности по браку
	Взаимозачет = Неопределено;
	Если СуммаБрака > 0 Тогда 
		
		//+ ИнфоСофт Заварин К.В. 14.10.24 УА #85478
		//Взаимозачет = ПолучитьДокументКорректировкиЗадолженности(ОтчетКомиссионера.Ссылка, СуммаБрака);    
		Взаимозачет = ПолучитьДокументКорректировкиЗадолженности(ДанныеОбработки.СтруктураДанных, ОтчетКомиссионера.Ссылка, СуммаБрака);
		//- ИнфоСофт Заварин К.В. 14.10.24 УА #85478
		
		МассивДокументов.Добавить(Взаимозачет.Ссылка);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат.Вставить("МассивДокументов", МассивДокументов);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 01.03.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 05.03.2024 УА #71107
Функция СвернутьТаблицуПотерь(ТаблицаПотерь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПотерь.Номенклатура КАК Номенклатура,
	|	ТаблицаПотерь.Характеристика КАК Характеристика,
	|	ТаблицаПотерь.ЭтоНабор КАК ЭтоНабор,
	|	ТаблицаПотерь.Сумма КАК Сумма,
	|	ТаблицаПотерь.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ВТ_Потери
	|ИЗ
	|	&ТаблицаПотерь КАК ТаблицаПотерь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Потери.Номенклатура КАК Номенклатура,
	|	ВТ_Потери.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ВТ_Потери.ЭтоНабор) КАК ЭтоНабор,
	|	СУММА(ВТ_Потери.Сумма) КАК Сумма,
	|	МАКСИМУМ(ВТ_Потери.Упаковка) КАК Упаковка
	|ИЗ
	|	ВТ_Потери КАК ВТ_Потери
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Потери.Номенклатура,
	|	ВТ_Потери.Характеристика";
	
	Запрос.УстановитьПараметр("ТаблицаПотерь", ТаблицаПотерь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Сумин Д.В. 05.03.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 28.02.2024 УА #71107
Функция ПодготовитьДанныеОПродажах(ДанныеОбработки) Экспорт
	
	//Получение данных продаж
	ДанныеПродаж = ДанныеОбработки.СтруктураДанных.СписокТранзакций;
	ВидОтчета = ДанныеОбработки.СтруктураДанных.ВидОтчета; 
	Профиль = ДанныеОбработки.СтруктураДанных.Профиль;
	
	МассивКолонок = Новый Массив;
	
	Для Каждого Элемент Из ДанныеПродаж.Колонки Цикл
		МассивКолонок.Добавить(Элемент.Имя);	
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_ДанныеОтчетовОПродажах.Параметр КАК Параметр,
	|	ИС_WB_ДанныеОтчетовОПродажах.Параметр.Наименование КАК ПараметрНаименование,
	|	ИС_WB_ДанныеОтчетовОПродажах.ЗначениеПараметра КАК ЗначениеПараметра,
	|	ИС_WB_ДанныеОтчетовОПродажах.СтрокаНомер КАК СтрокаНомер,
	|	ИС_WB_ДанныеОтчетовОПродажах.Профиль КАК Профиль,
	|	ИС_WB_ДанныеОтчетовОПродажах.НомерОтчета КАК НомерОтчета
	|ИЗ
	|	РегистрСведений.ИС_WB_ДанныеОтчетовОПродажах КАК ИС_WB_ДанныеОтчетовОПродажах
	|ГДЕ
	|	ИС_WB_ДанныеОтчетовОПродажах.НомерОтчета = &НомерОтчета
	|   И ИС_WB_ДанныеОтчетовОПродажах.Параметр.Наименование В (&МассивНаименований)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтрокаНомер
	|ИТОГИ ПО
	|	СтрокаНомер";
	
	Запрос.УстановитьПараметр("НомерОтчета", ДанныеОбработки.СтруктураДанных.НомерОтчета); 
	Запрос.УстановитьПараметр("МассивНаименований", МассивКолонок);
	Запрос.УстановитьПараметр("Профиль", ДанныеОбработки.СтруктураДанных.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ВыборкаСтрокаНомер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтрокаНомер.Следующий() Цикл
		НоваяСтрока = ДанныеПродаж.Добавить();
		
		НоваяСтрока.ВидОтчета = ВидОтчета;
		ВыборкаДетальныеЗаписи = ВыборкаСтрокаНомер.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ДанныеПродаж.Колонки.Найти(ВыборкаДетальныеЗаписи.ПараметрНаименование) <> Неопределено Тогда
				НоваяСтрока[ВыборкаДетальныеЗаписи.ПараметрНаименование] = ВыборкаДетальныеЗаписи.ЗначениеПараметра; 			
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//Добавление сопоставления
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 08.10.24 УА #84956
	"ВЫБРАТЬ
	|	ДанныеПродаж.ЦенаРеализация КАК ЦенаРеализация,
	|	ДанныеПродаж.Кол_во КАК Кол_во,
	|	ДанныеПродаж.ЦенаРозничная КАК ЦенаРозничная,
	|	ДанныеПродаж.ВайлдберризРеализовалТовар_Пр_ КАК ВайлдберризРеализовалТовар_Пр_,
	|	ДанныеПродаж.Название КАК Название,
	|	ДанныеПродаж.Баркод КАК Баркод,
	|	ДанныеПродаж._ КАК _,
	|	ДанныеПродаж.КодНоменклатуры КАК КодНоменклатуры,
	|	ДанныеПродаж.АртикулПоставщика КАК АртикулПоставщика,
	|	ДанныеПродаж.Размер КАК Размер,
	|	ДанныеПродаж.ТипДокумента КАК ТипДокумента,
	|	ДанныеПродаж.ОбоснованиеДляОплаты КАК ОбоснованиеДляОплаты,
	|	ДанныеПродаж.КПеречислениюПродавцуЗаРеализованныйТовар КАК КПеречислениюПродавцуЗаРеализованныйТовар,
	|	ДанныеПродаж.УслугиПоДоставкеТовараПокупателю КАК УслугиПоДоставкеТовараПокупателю,
	|	ДанныеПродаж.ВидыЛогистики_ШтрафовИДоплат КАК ВидыЛогистики_ШтрафовИДоплат,
	|	ДанныеПродаж.Srid КАК Srid,
	|	ДанныеПродаж.ВидОтчета КАК ВидОтчета
	|ПОМЕСТИТЬ ВТ_ДанныеПродаж
	|ИЗ
	|	&ДанныеПродаж КАК ДанныеПродаж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПродаж.Баркод КАК Баркод,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_ШтрихкодыРазмеров.Размер, ЗНАЧЕНИЕ(Справочник.ИС_WB_РазмерыНоменклатур.ПустаяСсылка))) КАК Размер
	|ПОМЕСТИТЬ ВТ_Размеры
	|ИЗ
	|	ВТ_ДанныеПродаж КАК ВТ_ДанныеПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО ВТ_ДанныеПродаж.Баркод = ИС_WB_ШтрихкодыРазмеров.Штрихкод
	|			И (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПродаж.Баркод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Размеры.Баркод КАК Баркод,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК Характеристика,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЭтоНабор,
	|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL
	|					ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель = 0
	|				ТОГДА 1
	|			ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель
	|		КОНЕЦ / ВЫБОР
	|			КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL
	|					ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель = 0
	|				ТОГДА 1
	|			ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель
	|		КОНЕЦ) КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	ВТ_Размеры КАК ВТ_Размеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ВТ_Размеры.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
	|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Размеры.Баркод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Размеры.Размер КАК РазмерВБ,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка,
	|	ВТ_Сопоставление.КоэффициентУпаковки КАК КоэффициентУпаковки,
	|	ВТ_ДанныеПродаж.ЦенаРеализация КАК ЦенаРеализация,
	|	ВТ_ДанныеПродаж.Кол_во КАК Кол_во,
	|	ВТ_ДанныеПродаж.ЦенаРозничная КАК ЦенаРозничная,
	|	ВТ_ДанныеПродаж.ВайлдберризРеализовалТовар_Пр_ КАК ВайлдберризРеализовалТовар_Пр_,
	|	ВТ_ДанныеПродаж.ТипДокумента КАК ТипДокумента,
	|	ВТ_ДанныеПродаж.ОбоснованиеДляОплаты КАК ОбоснованиеДляОплаты,
	|	ВТ_ДанныеПродаж.КПеречислениюПродавцуЗаРеализованныйТовар КАК КПеречислениюПродавцуЗаРеализованныйТовар,
	|	ВТ_ДанныеПродаж.УслугиПоДоставкеТовараПокупателю КАК УслугиПоДоставкеТовараПокупателю,
	|	ВТ_ДанныеПродаж.ВидыЛогистики_ШтрафовИДоплат КАК ВидыЛогистики_ШтрафовИДоплат,
	|	ВТ_ДанныеПродаж.Название КАК Название,
	|	ВТ_ДанныеПродаж.Баркод КАК Баркод,
	|	ВТ_ДанныеПродаж._ КАК _,
	|	ВТ_ДанныеПродаж.КодНоменклатуры КАК КодНоменклатуры,
	|	ВТ_ДанныеПродаж.АртикулПоставщика КАК АртикулПоставщика,
	|	ВТ_ДанныеПродаж.Размер КАК Размер,
	|	ВТ_ДанныеПродаж.Srid КАК Srid,
	|	ВТ_ДанныеПродаж.ВидОтчета КАК ВидОтчета
	|ИЗ
	|	ВТ_ДанныеПродаж КАК ВТ_ДанныеПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Размеры КАК ВТ_Размеры
	|		ПО ВТ_ДанныеПродаж.Баркод = ВТ_Размеры.Баркод
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ПО ВТ_ДанныеПродаж.Баркод = ВТ_Сопоставление.Баркод
	//+ ИнфоСофт Власова И.С. 19.02.25 УА #76703
	|ГДЕ
	|	%1
	//- ИнфоСофт Власова И.С. 19.02.25 УА #76703
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	//- ИнфоСофт Мурсалимов Д.Р. 08.10.24 УА #84956
	
	//+ ИнфоСофт Власова И.С. 19.02.25 УА #76703
	ТекстУсловия = "ИСТИНА";
	
	Если ВидОтчета = Перечисления.ИС_WB_ВидыОтчетов.Российский Тогда
		
		ТекстУсловия =
		    "НЕ ВЫРАЗИТЬ(ВТ_ДанныеПродаж.ТипДокумента КАК СТРОКА(100)) = """"
			|	И НЕ ВЫРАЗИТЬ(ВТ_ДанныеПродаж.АртикулПоставщика КАК СТРОКА(100)) = """" 
			|";	
	
	КонецЕсли;
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, ТекстУсловия);
	//- ИнфоСофт Власова И.С. 19.02.25 УА #76703
	
	Запрос.УстановитьПараметр("Профиль", 		Профиль);
	Запрос.УстановитьПараметр("ДанныеПродаж", 	ДанныеПродаж);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	
	ДанныеПродаж.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДанныеПродаж.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
	КонецЦикла;	
	
	Результат = Новый Структура;
	Результат.Вставить("НомерСтраницы", 2);
	Результат.Вставить("СписокТранзакций", ДанныеПродаж);
	
	Возврат Результат;
	
КонецФункции //+ ИнфоСофт Сумин Д.В. 28.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 06.03.2024 УА #71107
Функция ОбработатьИностранныеПродажи(ДанныеОбработки) Экспорт
	
	Профиль = ДанныеОбработки.СтруктураДанных.Профиль;
	
	ТаблицаРезультирующаяПродажи = ДанныеОбработки.СтруктураДанных.СписокТранзакций.Скопировать();
	ТаблицаРезультирующаяПродажи.Очистить();
	ТаблицаРезультирующаяПродажи.Колонки.Добавить("УпаковкаКоличество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2)));
	ТаблицаРезультирующаяПродажи.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2)));
	
	ТаблицаРезультирующаяВозвраты = ДанныеОбработки.СтруктураДанных.СписокТранзакций.Скопировать();
	ТаблицаРезультирующаяВозвраты.Очистить();
	ТаблицаРезультирующаяВозвраты.Колонки.Добавить("УпаковкаКоличество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2)));
	ТаблицаРезультирующаяВозвраты.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2)));
	ТаблицаРезультирующаяВозвраты.Колонки.Добавить("Основание", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	
	ТаблицаРезультирующаяЛогистика = ДанныеОбработки.СтруктураДанных.СписокТранзакций.Скопировать();
	ТаблицаРезультирующаяЛогистика.Очистить();
	
	Для каждого Строка Из ДанныеОбработки.СтруктураДанных.СписокТранзакций Цикл
		
		Если Нрег(Строка.ОбоснованиеДляОплаты) = "логистика" Тогда

			НоваяСтрока = ТаблицаРезультирующаяЛогистика.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);													
				
		КонецЕсли;
		
		//+ ИнфоСофт Мурсалимов Д.Р. 09.10.24 УА #84814
		Если Нрег(Строка.ОбоснованиеДляОплаты) = "коррекция логистики" Тогда

			НоваяСтрока = ТаблицаРезультирующаяЛогистика.Добавить();
			
			Если Строка.УслугиПоДоставкеТовараПокупателю < 0 Тогда
				Строка.УслугиПоДоставкеТовараПокупателю = -Строка.УслугиПоДоставкеТовараПокупателю;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);													
				
		КонецЕсли;                                
		//- ИнфоСофт Мурсалимов Д.Р. 09.10.24 УА #84814
		
		//+ ИнфоСофт Заварин К.В. 20.12.24 УА #90076
		Если Нрег(Строка.ОбоснованиеДляОплаты) = "корректировка эквайринга" Тогда

			НоваяСтрока = ТаблицаРезультирующаяЛогистика.Добавить();
			                                                                                        
			Строка.УслугиПоДоставкеТовараПокупателю = -Строка.КПеречислениюПродавцуЗаРеализованныйТовар;
									
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);													
				
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 20.12.24 УА #90076
		
		//+ ИнфоСофт Мурсалимов Д.Р. 31.10.24 УА #81932
		Если Нрег(Строка.ОбоснованиеДляОплаты) = "коррекция продаж" Тогда

			НоваяСтрока = ТаблицаРезультирующаяПродажи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);	
			
			НоваяСтрока.УпаковкаКоличество = Строка.Кол_во * Строка.КоэффициентУпаковки;
			НоваяСтрока.Количество = Строка.Кол_во;
				
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 31.10.24 УА #81932
		
		Если Нрег(Строка.ТипДокумента) = "продажа" И Нрег(Строка.ОбоснованиеДляОплаты) = "продажа" Тогда	
			
			НоваяСтрока = ТаблицаРезультирующаяПродажи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
 
			НоваяСтрока.УпаковкаКоличество = Строка.Кол_во * Строка.КоэффициентУпаковки;
			НоваяСтрока.Количество = Строка.Кол_во;

		ИначеЕсли Нрег(Строка.ТипДокумента) = "возврат" И Нрег(Строка.ОбоснованиеДляОплаты) = "возврат" Тогда

			НоваяСтрока = ТаблицаРезультирующаяВозвраты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
 
			НоваяСтрока.УпаковкаКоличество = Строка.Кол_во * Строка.КоэффициентУпаковки;
			НоваяСтрока.Количество = Строка.Кол_во;
			
		КонецЕсли;	
		
	КонецЦикла;	

	//+ ИнфоСофт Мурсалимов Д.Р. 19.09.24 УА #82106
	ВариантФормированияЦеныПродажи = ДанныеОбработки.СтруктураДанных.ВариантФормированияЦеныПродажи;
	
	ТаблицаРезультирующаяПродажи = ПолучитьСгруппированнуюТаблицуПродаж(ВариантФормированияЦеныПродажи, ТаблицаРезультирующаяПродажи);
	//- ИнфоСофт Мурсалимов Д.Р. 19.09.24 УА #82106
	
	//+ ИнфоСофт Мурсалимов Д.Р. 15.11.24 УА #86817
	ТаблицаРезультирующаяЛогистика.Свернуть("Srid, Номенклатура, Характеристика, АртикулПоставщика, Упаковка","УслугиПоДоставкеТовараПокупателю");
	//- ИнфоСофт Мурсалимов Д.Р. 15.11.24 УА #86817
		
	//Найдем документ продажи - основание по Srid для возврата
	ДокументыОснование = ПолучитьДокументыОснованияДляВозвратов(ТаблицаРезультирующаяВозвраты);
	
	//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
	ДокументыОснованиеПродаж = ПолучитьДокументыОснованияДляВозвратов(ТаблицаРезультирующаяПродажи); 
	//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746
	
	//+ ИнфоСофт Заварин К.В. 10.12.24 УА #88297
	//+ ИнфоСофт Мурсалимов Д.Р. 07.10.24 УА #84956
	//Рассчитаем итоговую сумму по продаже
	//Для Каждого Строка Из ТаблицаРезультирующаяПродажи Цикл
	//	
	//	СтруктураПоиска = Новый Структура;
	//	СтруктураПоиска.Вставить("Номенклатура", 	Строка.Номенклатура);
	//	СтруктураПоиска.Вставить("Характеристика", 	Строка.Характеристика);
	//	
	//	НайденныеСтроки = ТаблицаРезультирующаяЛогистика.НайтиСтроки(СтруктураПоиска);
	//	
	//	Для Каждого Элемент Из НайденныеСтроки Цикл
	//		
	//		//+ ИнфоСофт Мурсалимов Д.Р. 15.11.24 УА #86817
	//		Если Строка.КПеречислениюПродавцуЗаРеализованныйТовар - Элемент.УслугиПоДоставкеТовараПокупателю < 0 Тогда
	//			Продолжить;
	//		КонецЕсли;                                     
	//		//- ИнфоСофт Мурсалимов Д.Р. 15.11.24 УА #86817
	//		
	//		Строка.КПеречислениюПродавцуЗаРеализованныйТовар = Строка.КПеречислениюПродавцуЗаРеализованныйТовар - Элемент.УслугиПоДоставкеТовараПокупателю; 
	//		
	//		ТаблицаРезультирующаяЛогистика.Удалить(Элемент); 
	//	
	//	КонецЦикла;
	//	
	//КонецЦикла;
	//- ИнфоСофт Заварин К.В. 10.12.24 УА #88297
	
	Для Каждого Строка Из ТаблицаРезультирующаяПродажи Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("АртикулПоставщика", 	Строка.АртикулПоставщика);
			
		НайденныеСтроки = ТаблицаРезультирующаяЛогистика.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого Элемент Из НайденныеСтроки Цикл
			
			//+ ИнфоСофт Мурсалимов Д.Р. 15.11.24 УА #86817
			Если Строка.КПеречислениюПродавцуЗаРеализованныйТовар - Элемент.УслугиПоДоставкеТовараПокупателю < 0 Тогда
				Продолжить;
			КонецЕсли;                                     
			//- ИнфоСофт Мурсалимов Д.Р. 15.11.24 УА #86817
			
			Строка.КПеречислениюПродавцуЗаРеализованныйТовар = Строка.КПеречислениюПродавцуЗаРеализованныйТовар - Элемент.УслугиПоДоставкеТовараПокупателю; 
			
			ТаблицаРезультирующаяЛогистика.Удалить(Элемент);
		
		КонецЦикла;
		
	КонецЦикла;
	
	//+ ИнфоСофт Заварин К.В. 09.12.24 УА #88297
	Если ТаблицаРезультирующаяЛогистика.Количество() > 0 Тогда
		
		Для Каждого Строка Из ТаблицаРезультирующаяПродажи Цикл
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("АртикулПоставщика", 	Строка.АртикулПоставщика);
			
			НайденныеСтроки = ТаблицаРезультирующаяЛогистика.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				
				СуммаЛогистики = 0;
				
				Для Индекс = 0 По НайденныеСтроки.ВГраница() Цикл
					СуммаЛогистики = СуммаЛогистики + НайденныеСтроки[Индекс].УслугиПоДоставкеТовараПокупателю;
				КонецЦикла; 
				
				МассивКоэффициентов = Новый Массив;
				
				Для Каждого СтрокаМассив Из ТаблицаРезультирующаяПродажи Цикл
					
					Если НайденныеСтроки[0].АртикулПоставщика = СтрокаМассив.АртикулПоставщика Тогда
						МассивКоэффициентов.Добавить(1);	
					КонецЕсли;
					
				КонецЦикла;
				
				МассивНастроек = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаЛогистики, МассивКоэффициентов);
				
				НераспределеннаяСумма = СуммаЛогистики; 
				
				ТаблицаРезультирующаяПродажиПоАртикулу =  ТаблицаРезультирующаяПродажи.НайтиСтроки(СтруктураПоиска);
				
				//+ ИнфоСофт Заварин К.В. 16.12.24 УА #89659
				ПовторнаяСумма = 0; 
				КоличествоПовторов = 0;
				//- ИнфоСофт Заварин К.В. 16.12.24 УА #89659
				
				Пока НераспределеннаяСумма > 0 Цикл
					
					//+ ИнфоСофт Заварин К.В. 16.12.24 УА #89659
					Если ПовторнаяСумма = НераспределеннаяСумма Тогда
						КоличествоПовторов = КоличествоПовторов + 1;
					Иначе
						КоличествоПовторов = 0;	
					КонецЕсли; 
					
					Если КоличествоПовторов > 3 Тогда
						Прервать;	
					КонецЕсли;
					
					ПовторнаяСумма = НераспределеннаяСумма;
					//- ИнфоСофт Заварин К.В. 16.12.24 УА #89659
					
					Итератор = 0;
					
					Для Каждого СтрокаПродаж Из ТаблицаРезультирующаяПродажиПоАртикулу Цикл
						
						Если НайденныеСтроки[0].АртикулПоставщика = СтрокаПродаж.АртикулПоставщика Тогда  
							
							СуммаУслугиСтроки = МассивНастроек[Итератор];
							
							Если СтрокаПродаж.КПеречислениюПродавцуЗаРеализованныйТовар - СуммаУслугиСтроки >= 0 Тогда 		
								
								СтрокаПродаж.КПеречислениюПродавцуЗаРеализованныйТовар = СтрокаПродаж.КПеречислениюПродавцуЗаРеализованныйТовар - СуммаУслугиСтроки;		
								
								НераспределеннаяСумма = НераспределеннаяСумма - СуммаУслугиСтроки;
								
							КонецЕсли;     
							
							Итератор = Итератор + 1;
							
						КонецЕсли;
						
					КонецЦикла;
					
					МассивНастроек = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(НераспределеннаяСумма, МассивКоэффициентов);
					
				КонецЦикла;
				
				Для Индекс = 0 По НайденныеСтроки.ВГраница() Цикл
					ТаблицаРезультирующаяЛогистика.Удалить(НайденныеСтроки[Индекс]);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 09.12.24 УА #88297
	
	ПолностьюРаспределятьЛогистику = ДанныеОбработки.СтруктураДанных.ПолностьюРаспределятьЛогистику;
	
	Если ПолностьюРаспределятьЛогистику И ТаблицаРезультирующаяЛогистика.Количество() > 0 Тогда
		
		СуммаЛогистики = ТаблицаРезультирующаяЛогистика.Итог("УслугиПоДоставкеТовараПокупателю");
		
		МассивКоэффициентов = Новый Массив;
		
		Для Каждого Строка Из ТаблицаРезультирующаяПродажи Цикл		
			МассивКоэффициентов.Добавить(1);	
		КонецЦикла;
		
		МассивНастроек = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаЛогистики, МассивКоэффициентов);
		
		НераспределеннаяСумма = СуммаЛогистики;
		
		Пока НераспределеннаяСумма > 0 Цикл
			
			Итератор = 0;
			
			Для Каждого Строка Из ТаблицаРезультирующаяПродажи Цикл		
				
				СуммаУслугиСтроки = МассивНастроек[Итератор];
				
				Если Строка.КПеречислениюПродавцуЗаРеализованныйТовар - СуммаУслугиСтроки >= 0 Тогда 		
					
					Строка.КПеречислениюПродавцуЗаРеализованныйТовар = Строка.КПеречислениюПродавцуЗаРеализованныйТовар - СуммаУслугиСтроки;		
					
					НераспределеннаяСумма = НераспределеннаяСумма - СуммаУслугиСтроки;
					
				КонецЕсли;     
				
				Итератор = Итератор + 1;
				
			КонецЦикла;
			
			МассивНастроек = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(НераспределеннаяСумма, МассивКоэффициентов);
					
		КонецЦикла;
		
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 07.10.24 УА #84956
	
	ЗаголовокСтруктура = Новый Структура;
	
	ЗаголовокСтруктура.Вставить("ДатаДокумента", 	КонецДня(ДанныеОбработки.СтруктураДанных.ДатаОкончания));
	ЗаголовокСтруктура.Вставить("Комментарий", 		ДанныеОбработки.СтруктураДанных.Комментарий);
	ЗаголовокСтруктура.Вставить("НачалоПериода", 	ДанныеОбработки.СтруктураДанных.ДатаНачала);
	ЗаголовокСтруктура.Вставить("КонецПериода", 	КонецДня(ДанныеОбработки.СтруктураДанных.ДатаОкончания));
	ЗаголовокСтруктура.Вставить("ЗагрузитьКодыМаркировкиВДокументРеализации", Ложь);
	//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #85500
	Если ДанныеОбработки.СтруктураДанных.Свойство("ОснованиеДляПФ") Тогда
		ЗаголовокСтруктура.Вставить("ОснованиеДляПФ", ДанныеОбработки.СтруктураДанных.ОснованиеДляПФ);
	КонецЕсли;
	//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #85500
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"); 
	Если ИспользоватьСоглашенияСКлиентами Тогда
		КомиссионныеПродажи25 = Профиль.Соглашение.КомиссионныеПродажи25;
	Иначе
		КомиссионныеПродажи25 = Профиль.Договор.КомиссионныеПродажи25;
	КонецЕсли;	
	
	МассивДокументов = Новый Массив;
	
	Если НЕ КомиссионныеПродажи25 Тогда 
		
		//+ ИнфоСофт Мурсалимов Д.Р. 30.05.24 УА #76699
		Если ТаблицаРезультирующаяПродажи.Количество() > 0 Тогда
			
			//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
			Если ДанныеОбработки.СтруктураДанных.НайтиОснованиеДляВозврата Тогда
				
				ТаблицаВозвратов = ТаблицаРезультирующаяПродажи.Скопировать();
				ТаблицаВозвратов.Очистить();
				
				Для Каждого Строка Из ТаблицаРезультирующаяПродажи Цикл 
					
					Основание = Неопределено; 
					
					ОснованиеРТУ = ПолучитьОснованиеРТУ(Строка.Srid); 
					
					Если ОснованиеРТУ <> Неопределено Тогда
						Основание = ОснованиеРТУ;	
					КонецЕсли;
					
					ТаблицаВозвратов.Очистить();
					НоваяСтрока = ТаблицаВозвратов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					
					ДокументВозвратТоваровОтКлиента = ИС_WB_Сервер.СоздатьДокументВозвратТоваров(Профиль, ТаблицаВозвратов, ЗаголовокСтруктура, Истина,, Основание);
					МассивДокументов.Добавить(ДокументВозвратТоваровОтКлиента.Ссылка);
					
				КонецЦикла;	
				
			Иначе 
				
				ДокументВозвратТоваровОтКлиента = ИС_WB_Сервер.СоздатьДокументВозвратТоваров(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура, Истина);
				МассивДокументов.Добавить(ДокументВозвратТоваровОтКлиента.Ссылка);
				
			КонецЕсли;
			//ДокументВозвратКомиссия = ИС_WB_Сервер.СоздатьДокументВозвратТоваров(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура, Истина); 
			//МассивДокументов.Добавить(ДокументВозвратКомиссия.Ссылка);
			//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746
			
			ДокументРТУ = СоздатьДокументРТУ(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура, Ложь); 
			МассивДокументов.Добавить(ДокументРТУ.Ссылка);
			
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 06.06.24 УА #76699
		
		//+ ИнфоСофт Мурсалимов Д.Р. 06.06.24 УА #76699  
		Если ТаблицаРезультирующаяВозвраты.Количество() > 0 Тогда
			
			Если ДанныеОбработки.СтруктураДанных.НайтиОснованиеДляВозврата Тогда
				
				//+ ИнфоСофт Заварин К.В. 09.11.24 УА #87302
				МассивSrid = Новый Массив;
				
				Для Каждого СтрокаТЗ Из ТаблицаРезультирующаяПродажи Цикл
					
					МассивSrid.Добавить(СтрокаТЗ.Srid);
					
				КонецЦикла;
				//- ИнфоСофт Заварин К.В. 09.11.24 УА #87302
				
				ТаблицаВозвратов = ТаблицаРезультирующаяВозвраты.Скопировать();
				ТаблицаВозвратов.Очистить();
				
				Для Каждого Строка Из ТаблицаРезультирующаяВозвраты Цикл 
					
					Основание = Неопределено; 
					
					СтрокаПоиска = ДокументыОснование.НайтиСтроки(Новый Структура("Srid", Строка.Srid)); 
					
					//+ ИнфоСофт Заварин К.В. 09.11.24 УА #87302
					Если Не ДокументыОснование.Количество() = 0 Тогда							
						Основание = СтрокаПоиска[0].Документ;							
					ИначеЕсли Не МассивSrid.Найти(Строка.Srid) = Неопределено Тогда 					
						Основание = ДокументРТУ;							
					Иначе  
						Основание = Документы.РеализацияТоваровУслуг.ПустаяСсылка();								
					КонецЕсли;
					//Если СтрокаПоиска <> Неопределено Тогда
					//	Основание = СтрокаПоиска[0].Документ;	
					//КонецЕсли;
					//- ИнфоСофт Заварин К.В. 09.11.24 УА #87302
					
					ТаблицаВозвратов.Очистить();
					НоваяСтрока = ТаблицаВозвратов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					
					ДокументВозвратТоваровОтКлиента = ИС_WB_Сервер.СоздатьДокументВозвратТоваров(Профиль, ТаблицаВозвратов, ЗаголовокСтруктура, Ложь, ДанныеОбработки.СтруктураДанных.ВариантФормированияСебестоимости, Основание);
					МассивДокументов.Добавить(ДокументВозвратТоваровОтКлиента.Ссылка);
					
				КонецЦикла;	
				
			Иначе 
				
				ДокументВозвратТоваровОтКлиента = ИС_WB_Сервер.СоздатьДокументВозвратТоваров(Профиль, ТаблицаРезультирующаяВозвраты, ЗаголовокСтруктура, Ложь, ДанныеОбработки.СтруктураДанных.ВариантФормированияСебестоимости);
				МассивДокументов.Добавить(ДокументВозвратТоваровОтКлиента.Ссылка);
				
			КонецЕсли; 
			
			ДокументПередачаНаКомиссию = ИС_WB_Сервер.СоздатьДокументРТУ(Профиль, ТаблицаРезультирующаяВозвраты, ЗаголовокСтруктура, Истина);
			МассивДокументов.Добавить(ДокументПередачаНаКомиссию.Ссылка); 
			
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 06.06.24 УА #76699
		
	Иначе 
		
		ДокументЗаявкаНаВозвратКомиссия = Неопределено;
		
		//+ ИнфоСофт Мурсалимов Д.Р. 30.05.24 УА #76699
		Если ТаблицаРезультирующаяПродажи.Количество() > 0 Тогда
			
			Если Константы.ИспользоватьЗаявкиНаВозвратТоваровОтКлиентов.Получить() Тогда
				
				//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
				Если ДанныеОбработки.СтруктураДанных.НайтиОснованиеДляВозврата Тогда
					
					ТаблицаВозвратов = ТаблицаРезультирующаяПродажи.Скопировать();
					ТаблицаВозвратов.Очистить();
					
					Для Каждого Строка Из ТаблицаРезультирующаяПродажи Цикл 
						
						Основание = Неопределено; 
						
						ОснованиеРТУ = ПолучитьОснованиеРТУ(Строка.Srid); 
						
						Если ОснованиеРТУ <> Неопределено Тогда
							Основание = ОснованиеРТУ;	
						КонецЕсли;
						
						ТаблицаВозвратов.Очистить();
						НоваяСтрока = ТаблицаВозвратов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						
						ДокументЗаявкаНаВозвратКомиссия = ИС_WB_Сервер.СоздатьДокументЗаявкаНаВозврат(Профиль, ТаблицаВозвратов, ЗаголовокСтруктура, Основание); 
						МассивДокументов.Добавить(ДокументЗаявкаНаВозвратКомиссия.Ссылка);
						
						ДокументВозвратКомиссия = ИС_WB_Сервер.СоздатьДокументПоступлениеТоваровОтХранителя(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура, ДокументЗаявкаНаВозвратКомиссия);
					МассивДокументов.Добавить(ДокументВозвратКомиссия.Ссылка);
						
					КонецЦикла;	
					
				Иначе 
					
					ДокументЗаявкаНаВозвратКомиссия = ИС_WB_Сервер.СоздатьДокументЗаявкаНаВозврат(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура); 
					МассивДокументов.Добавить(ДокументЗаявкаНаВозвратКомиссия.Ссылка);
					
					ДокументВозвратКомиссия = ИС_WB_Сервер.СоздатьДокументПоступлениеТоваровОтХранителя(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура, ДокументЗаявкаНаВозвратКомиссия);
					МассивДокументов.Добавить(ДокументВозвратКомиссия.Ссылка);
					
				КонецЕсли;				
				
				//ДокументЗаявкаНаВозвратКомиссия = ИС_WB_Сервер.СоздатьДокументЗаявкаНаВозврат(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура); 
				//МассивДокументов.Добавить(ДокументЗаявкаНаВозвратКомиссия.Ссылка);
				
				//ДокументВозвратКомиссия = ИС_WB_Сервер.СоздатьДокументПоступлениеТоваровОтХранителя(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура, ДокументЗаявкаНаВозвратКомиссия);
				//	МассивДокументов.Добавить(ДокументВозвратКомиссия.Ссылка);
				
				//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746		
				
			//+ ИнфоСофт Заварин К.В. 09.12.24 УА #89129
			//Только УТ 11.5
			Иначе
				ДокументВозвратКомиссия = ИС_WB_Сервер.СоздатьДокументПоступлениеТоваровОтХранителя(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура, ДокументЗаявкаНаВозвратКомиссия);
				МассивДокументов.Добавить(ДокументВозвратКомиссия.Ссылка);
		
			//- ИнфоСофт Заварин К.В. 09.12.24 УА #89129
				
			КонецЕсли;
			
			
			ДокументРТУ = ИС_WB_Сервер.СоздатьДокументРТУ(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура, Ложь);
			МассивДокументов.Добавить(ДокументРТУ.Ссылка);
			
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 30.05.24 УА #76699
		
		ОблагаетсяНДС = ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация);
		
		Если ОблагаетсяНДС И ДокументРТУ.Проведен Тогда 
			СчетФактура = СоздатьСчетФактуру(ДокументРТУ.Ссылка);
			МассивДокументов.Добавить(СчетФактура.Ссылка);  
		КонецЕсли; 
		
		Если ТаблицаРезультирующаяВозвраты.Количество() > 0 Тогда 
			
			Если ДанныеОбработки.СтруктураДанных.НайтиОснованиеДляВозврата Тогда
				
				//+ ИнфоСофт Заварин К.В. 09.11.24 УА #87302
				МассивSrid = Новый Массив;
				
				Для Каждого СтрокаТЗ Из ТаблицаРезультирующаяПродажи Цикл
					
					МассивSrid.Добавить(СтрокаТЗ.Srid);
					
				КонецЦикла;
				//- ИнфоСофт Заварин К.В. 09.11.24 УА #87302
				
				ТаблицаВозвратов = ТаблицаРезультирующаяВозвраты.Скопировать();
				ТаблицаВозвратов.Очистить();
				
				Для Каждого Строка Из ТаблицаРезультирующаяВозвраты Цикл 
					Основание = Неопределено; 
					
					СтрокаПоиска = ДокументыОснование.НайтиСтроки(Новый Структура("Srid", Строка.Srid)); 
					
					//+ ИнфоСофт Заварин К.В. 09.11.24 УА #87302
					Если Не ДокументыОснование.Количество() = 0 Тогда							
						Основание = СтрокаПоиска[0].Документ;							
					ИначеЕсли Не МассивSrid.Найти(Строка.Srid) = Неопределено Тогда 					
						Основание = ДокументРТУ;							
					Иначе  
						Основание = Документы.РеализацияТоваровУслуг.ПустаяСсылка();								
					КонецЕсли;
					//Если СтрокаПоиска <> Неопределено Тогда
					//	Основание = СтрокаПоиска[0].Документ;	
					//КонецЕсли;
					//- ИнфоСофт Заварин К.В. 09.11.24 УА #87302
					
					ТаблицаВозвратов.Очистить();
					НоваяСтрока = ТаблицаВозвратов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
					
					ДокументВозвратТоваровОтКлиента = ИС_WB_Сервер.СоздатьДокументВозвратТоваров(Профиль, ТаблицаВозвратов, ЗаголовокСтруктура, Ложь, ДанныеОбработки.СтруктураДанных.ВариантФормированияСебестоимости, Основание);
					МассивДокументов.Добавить(ДокументВозвратТоваровОтКлиента.Ссылка);
					
				КонецЦикла;
			Иначе
				
				ДокументВозвратТоваровОтКлиента = ИС_WB_Сервер.СоздатьДокументВозвратТоваров(Профиль, ТаблицаРезультирующаяВозвраты, ЗаголовокСтруктура, Ложь, ДанныеОбработки.СтруктураДанных.ВариантФормированияСебестоимости, Основание);
				МассивДокументов.Добавить(ДокументВозвратТоваровОтКлиента.Ссылка);

			КонецЕсли;
			
			ДокументПередачаТоваровНаХранение = ИС_WB_Сервер.СоздатьПередачуТоваровНаХранение(Профиль, ТаблицаРезультирующаяВозвраты, ЗаголовокСтруктура);
			МассивДокументов.Добавить(ДокументПередачаТоваровНаХранение.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("НомерСтраницы",		 3);
	Результат.Вставить("МассивДокументов",	 МассивДокументов);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 06.03.2024 УА #71107

//+ ИнфоСофт Мурсалимов Д.Р. 08.10.24 УА #84956
Функция ПолучитьСгруппированнуюТаблицуПродаж(ВариантФормированияЦеныПродажи, ТаблицаРезультирующаяПродажи)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеПродаж.Номенклатура КАК Номенклатура,
	|	ДанныеПродаж.Характеристика КАК Характеристика,
	|	ДанныеПродаж.АртикулПоставщика КАК АртикулПоставщика,
	|	ДанныеПродаж.Упаковка КАК Упаковка, 
	|	ДанныеПродаж.ЭтоНабор КАК ЭтоНабор,
	//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746                
	|	ПОДСТРОКА(ДанныеПродаж.Srid, 0, 250) КАК Srid,
	//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746
	|	ДанныеПродаж.УпаковкаКоличество КАК УпаковкаКоличество,
	|	ДанныеПродаж.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА &ВариантФормированияЦеныПродажи = 0
	|			ТОГДА ДанныеПродаж.КПеречислениюПродавцуЗаРеализованныйТовар
	|		ИНАЧЕ ДанныеПродаж.ВайлдберризРеализовалТовар_Пр_
	|	КОНЕЦ КАК КПеречислениюПродавцуЗаРеализованныйТовар	
	|ПОМЕСТИТЬ ВТ_ДанныеПродаж
	|ИЗ
	|	&ДанныеПродаж КАК ДанныеПродаж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПродаж.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеПродаж.Характеристика КАК Характеристика, 
	|	ВТ_ДанныеПродаж.АртикулПоставщика КАК АртикулПоставщика,
	|	ВТ_ДанныеПродаж.Упаковка КАК Упаковка,
	|	ВТ_ДанныеПродаж.ЭтоНабор КАК ЭтоНабор,
	//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746                
	|	ВТ_ДанныеПродаж.Srid КАК Srid,
	//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746
	|	СУММА(ВТ_ДанныеПродаж.УпаковкаКоличество) КАК УпаковкаКоличество,	
	|	СУММА(ВТ_ДанныеПродаж.Количество) КАК Количество,
	|	СУММА(ВТ_ДанныеПродаж.КПеречислениюПродавцуЗаРеализованныйТовар) КАК КПеречислениюПродавцуЗаРеализованныйТовар
	|ИЗ
	|	ВТ_ДанныеПродаж КАК ВТ_ДанныеПродаж
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПродаж.Номенклатура,
	|	ВТ_ДанныеПродаж.Характеристика,
	|	ВТ_ДанныеПродаж.АртикулПоставщика,
	//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
	|	ВТ_ДанныеПродаж.Srid,      
	//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746
	|	ВТ_ДанныеПродаж.Упаковка,
	|	ВТ_ДанныеПродаж.ЭтоНабор";
	
	Запрос.УстановитьПараметр("ДанныеПродаж", 					ТаблицаРезультирующаяПродажи);
	Запрос.УстановитьПараметр("ВариантФормированияЦеныПродажи", ВариантФормированияЦеныПродажи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 08.10.24 УА #84956

//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629 
Функция ПолучитьАктивныйЗаказКлиентаВБ(СборочноеЗадание)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ                                                                
	|	ИС_WB_ЗаказыВТеченииДня.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	РегистрСведений.ИС_WB_ЗаказыВТеченииДня КАК ИС_WB_ЗаказыВТеченииДня
	|ГДЕ
	|	ИС_WB_ЗаказыВТеченииДня.ЗаказОткрыт
	|	И ИС_WB_ЗаказыВТеченииДня.Профиль = &Профиль
	|	И ИС_WB_ЗаказыВТеченииДня.СкладМП = &Склад";

	Запрос.УстановитьПараметр("Профиль", 	СборочноеЗадание.Профиль);
	Запрос.УстановитьПараметр("Склад", 		СборочноеЗадание.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	КонецЕсли; 	
	
	ВыборкаДетальныеЗаписи.Следующий();	
	
	Возврат ВыборкаДетальныеЗаписи.ЗаказКлиента;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629

//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
Процедура ДобавитьЗаписьВРегистрЗаказовВБ(Заказ, СборочноеЗадание)
	
	МенеджерЗаписи = РегистрыСведений.ИС_WB_ЗаказыВТеченииДня.СоздатьМенеджерЗаписи(); 
	
	МенеджерЗаписи.ЗаказКлиента = Заказ;
	МенеджерЗаписи.СкладМП 		= СборочноеЗадание.Склад; 
	МенеджерЗаписи.Профиль 		= СборочноеЗадание.Профиль;
	МенеджерЗаписи.ЗаказОткрыт 	= Истина;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629

//+ ИнфоСофт Власова И.С. 08.04.25 УА #78061
Функция СоздатьИзменитьВзаимозачетЗадолженности(Профиль, ДанныеДокумента, ДопПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ДокументСсылка") Тогда
		ДокументОбъект = ДопПараметры.ДокументСсылка.ПолучитьОбъект();
	Иначе	
		ДокументОбъект = Документы.ВзаимозачетЗадолженности.СоздатьДокумент();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеДокумента);
	
	ДокументОбъект.Ответственный = Пользователи.АвторизованныйПользователь();
	ДокументОбъект.Валюта        = Константы.ВалютаРегламентированногоУчета.Получить();
	
	СуммаКредитор = ДанныеДокумента.КредиторскаяЗадолженность.Итог("Сумма");
	СуммаДебитор  = ДанныеДокумента.ДебиторскаяЗадолженность.Итог("Сумма");
	
	СуммаВзаимозачета = Мин(СуммаКредитор, СуммаДебитор);
	
	СуммаДебитор  = СуммаВзаимозачета;
	СуммаКредитор = СуммаВзаимозачета;
	
	ДокументОбъект.ДебиторскаяЗадолженность.Очистить();
	
	Для Каждого Строка Из ДанныеДокумента.ДебиторскаяЗадолженность Цикл
		
		Если СуммаДебитор = 0 Тогда
			Прервать;
		КонецЕсли;
		
		НоваяСтрока = ДокументОбъект.ДебиторскаяЗадолженность.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		НоваяСтрока.Сумма                = ?(Строка.Сумма > СуммаДебитор, СуммаДебитор, Строка.Сумма);
		НоваяСтрока.СуммаВзаиморасчетов  = ПересчитатьВСуммуВзаиморасчетов(НоваяСтрока.Сумма, ДокументОбъект.Валюта, ДокументОбъект.Дата);
		НоваяСтрока.СуммаРегл            = ПересчитатьВСуммуРегл(НоваяСтрока.Сумма, ДокументОбъект.Валюта, ДокументОбъект.Дата);
		НоваяСтрока.СуммаУпр             = ПересчитатьВСуммуУпр(НоваяСтрока.Сумма, ДокументОбъект.Валюта, ДокументОбъект.Дата);
		
		СуммаДебитор = СуммаДебитор - НоваяСтрока.Сумма;
		
	КонецЦикла;
	
	ДокументОбъект.КредиторскаяЗадолженность.Очистить();
	
	Для Каждого Строка Из ДанныеДокумента.КредиторскаяЗадолженность Цикл
		
		Если СуммаКредитор = 0 Тогда
			Прервать;
		КонецЕсли;
		
		НоваяСтрока = ДокументОбъект.КредиторскаяЗадолженность.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		НоваяСтрока.Сумма                = ?(Строка.Сумма > СуммаКредитор, СуммаКредитор, Строка.Сумма);
		НоваяСтрока.СуммаВзаиморасчетов  = ПересчитатьВСуммуВзаиморасчетов(НоваяСтрока.Сумма, ДокументОбъект.Валюта, ДокументОбъект.Дата);
		НоваяСтрока.СуммаРегл            = ПересчитатьВСуммуРегл(НоваяСтрока.Сумма, ДокументОбъект.Валюта, ДокументОбъект.Дата);
		НоваяСтрока.СуммаУпр             = ПересчитатьВСуммуУпр(НоваяСтрока.Сумма, ДокументОбъект.Валюта, ДокументОбъект.Дата);
		
		СуммаКредитор = СуммаКредитор - НоваяСтрока.Сумма;
		
	КонецЦикла;
	
	ДокументОбъект.СуммаДокумента = ДокументОбъект.ДебиторскаяЗадолженность.Итог("СуммаВзаиморасчетов");
	ДокументОбъект.СуммаРегл      = ДокументОбъект.ДебиторскаяЗадолженность.Итог("СуммаРегл");
	ДокументОбъект.СуммаУпр       = ДокументОбъект.ДебиторскаяЗадолженность.Итог("СуммаУпр");
	
	Попытка	
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);	
	Исключение
		
		ТекстСообщения = "Не удалось провести взаимозачет задолженности.";
		ТекстОшибки    = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1|%2", ТекстСообщения, ТекстОшибки));
		
		Попытка	
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);	
		Исключение
			
			ТекстСообщения = "Не удалось записать взаимозачет задолженности.";
			ТекстОшибки    = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1|%2", ТекстСообщения, ТекстОшибки));
			
			Возврат Неопределено;
			
		КонецПопытки;
		
	КонецПопытки;
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции //- ИнфоСофт Власова И.С. 08.04.25 УА #78061

//+ ИнфоСофт Власова И.С. 08.04.25 УА #78061
Функция ПолучитьСтруктуруВзаимозачетаЗадолженности() Экспорт

	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("Дата");
	СтруктураДокумента.Вставить("Комментарий");
	СтруктураДокумента.Вставить("Организация");
	СтруктураДокумента.Вставить("Подразделение");
	СтруктураДокумента.Вставить("КонтрагентДебитор");
	СтруктураДокумента.Вставить("КонтрагентКредитор");
	СтруктураДокумента.Вставить("ВидОперации");
	СтруктураДокумента.Вставить("ТипДебитора");
	СтруктураДокумента.Вставить("ТипКредитора");
	
	ДебиторскаяЗадолженностьТЧ = Новый ТаблицаЗначений;
	ДебиторскаяЗадолженностьТЧ.Колонки.Добавить("ТипРасчетов");
	ДебиторскаяЗадолженностьТЧ.Колонки.Добавить("Партнер");
	ДебиторскаяЗадолженностьТЧ.Колонки.Добавить("Организация");
	ДебиторскаяЗадолженностьТЧ.Колонки.Добавить("Сумма");
	ДебиторскаяЗадолженностьТЧ.Колонки.Добавить("ВалютаВзаиморасчетов");
	ДебиторскаяЗадолженностьТЧ.Колонки.Добавить("ОбъектРасчетов");
	
	СтруктураДокумента.Вставить("ДебиторскаяЗадолженность", ДебиторскаяЗадолженностьТЧ);
	
	КредиторскаяЗадолженностьТЧ = Новый ТаблицаЗначений;
	КредиторскаяЗадолженностьТЧ.Колонки.Добавить("ТипРасчетов");
	КредиторскаяЗадолженностьТЧ.Колонки.Добавить("Партнер");
	КредиторскаяЗадолженностьТЧ.Колонки.Добавить("Организация");
	КредиторскаяЗадолженностьТЧ.Колонки.Добавить("Сумма");
	КредиторскаяЗадолженностьТЧ.Колонки.Добавить("ВалютаВзаиморасчетов");
	КредиторскаяЗадолженностьТЧ.Колонки.Добавить("ОбъектРасчетов");
	
	СтруктураДокумента.Вставить("КредиторскаяЗадолженность", КредиторскаяЗадолженностьТЧ);
	
	Возврат СтруктураДокумента;
	
КонецФункции //- ИнфоСофт Власова И.С. 08.04.25 УА #78061

//+ ИнфоСофт Власова И.С. 08.04.25 УА #78061
Функция ЗаполнитьДанныеВзаимозачетЗадолженности(Профиль, ДокументыДебитор, ДокументыКредитор, ЭтоПродажиЮрЛицам = Ложь) Экспорт
		
	ДанныеДокумента = ПолучитьСтруктуруВзаимозачетаЗадолженности();	
		
	Настройки = ИС_WB_СерверПовтИсп.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, Настройки);
	
	Если Не ЭтоПродажиЮрЛицам Тогда
		
		ДанныеДокумента.КонтрагентДебитор  = Настройки.Контрагент;
		ДанныеДокумента.КонтрагентКредитор = Настройки.Контрагент;
		ДанныеДокумента.ВидОперации 	   = Перечисления.ВидыОперацийВзаимозачетаЗадолженности.Произвольный;
		ДанныеДокумента.ТипДебитора        = Перечисления.ТипыУчастниковВзаимозачета.Клиент;
		ДанныеДокумента.ТипКредитора       = Перечисления.ТипыУчастниковВзаимозачета.Поставщик;
		
		Для Каждого Документ Из ДокументыДебитор Цикл
			
			НоваяСтрока = ДанныеДокумента.ДебиторскаяЗадолженность.Добавить();
			
			НоваяСтрока.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
			НоваяСтрока.Партнер     = Настройки.Партнер;
			НоваяСтрока.Организация = Настройки.Организация;
			
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
				
				РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ,
					"Валюта, СуммаДокумента, Договор, Соглашение");
				
				НоваяСтрока.ВалютаВзаиморасчетов = РеквизитыДокумента.Валюта;
				НоваяСтрока.Сумма                = РеквизитыДокумента.СуммаДокумента;
				
				ПорядокРасчетов = ВзаиморасчетыСервер.ПорядокРасчетов(Ложь, , РеквизитыДокумента.Соглашение, РеквизитыДокумента.Договор);
				
				Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
					НоваяСтрока.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", Документ);
				ИначеЕсли ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
					НоваяСтрока.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", РеквизитыДокумента.Договор);
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаЗадолженности") Тогда	
				
				СуммаЗадолженности   = Документ.Задолженность.Итог("Сумма"); 
				ВалютаВзаиморасчетов = Документ.Задолженность[0].ВалютаВзаиморасчетов;
				
				НоваяСтрока.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
				НоваяСтрока.Сумма                = СуммаЗадолженности;
				НоваяСтрока.ОбъектРасчетов       = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", Настройки.Договор);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Документ Из ДокументыКредитор Цикл
			
			НоваяСтрока = ДанныеДокумента.КредиторскаяЗадолженность.Добавить();
			
			НоваяСтрока.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
			НоваяСтрока.Партнер     = Настройки.Партнер;
			НоваяСтрока.Организация = Настройки.Организация;
			
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
				
				РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ,
					"ВалютаВзаиморасчетов, СуммаДокумента, Договор, Соглашение");
				
				НоваяСтрока.ВалютаВзаиморасчетов = РеквизитыДокумента.Валюта;
				НоваяСтрока.Сумма                = РеквизитыДокумента.СуммаДокумента;
				
				ПорядокРасчетов = ВзаиморасчетыСервер.ПорядокРасчетов(Ложь, , РеквизитыДокумента.Соглашение, РеквизитыДокумента.Договор);
				
				Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
					НоваяСтрока.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", Документ);
				ИначеЕсли ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
					НоваяСтрока.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", РеквизитыДокумента.Договор);
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаЗадолженности") Тогда	
				
				СуммаЗадолженности   = Документ.Задолженность.Итог("Сумма"); 
				ВалютаВзаиморасчетов = Документ.Задолженность[0].ВалютаВзаиморасчетов;
				
				НоваяСтрока.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
				НоваяСтрока.Сумма                = СуммаЗадолженности;
				НоваяСтрока.ОбъектРасчетов       = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", Настройки.Договор);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
	Возврат ДанныеДокумента;
	
КонецФункции //- ИнфоСофт Власова И.С. 08.04.25 УА #78061

//+ ИнфоСофт Сумин Д.В. 28.06.22 УА #44858 
Функция ПересчитатьВСуммуРегл(Сумма, Валюта, Дата) Экспорт
	Возврат РаботаСКурсамиВалют.ПересчитатьВВалюту(Сумма,
	Валюта,
	Константы.ВалютаРегламентированногоУчета.Получить(),
	Дата);
КонецФункции //- ИнфоСофт Сумин Д.В. 28.06.22 УА #44858 

//+ ИнфоСофт Сумин Д.В. 28.06.22 УА #44858
Функция ПересчитатьВСуммуУпр(Сумма, Валюта, Дата) Экспорт
	Возврат РаботаСКурсамиВалют.ПересчитатьВВалюту(Сумма,
	Валюта,
	Константы.ВалютаУправленческогоУчета.Получить(),
	Дата);
КонецФункции //- ИнфоСофт Сумин Д.В. 28.06.22 УА #44858

//+ ИнфоСофт Стояк Ю.К. 01.09.2023 УА #61246
Функция ЗаполнитьСуммыПоВидуЦен(ВидЦены, ДатаЗаполнения, ВалютаДокумента, Номенклатура, Характеристика, Упаковка) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаЗаполнения) Тогда
		Возврат 0;
	КонецЕсли;
	
	СтруктураПараметровОтбора = Новый Структура;
	СтруктураПараметровОтбора.Вставить("Валюта", 			ВалютаДокумента);
	СтруктураПараметровОтбора.Вставить("Дата", 				ДатаЗаполнения);
	СтруктураПараметровОтбора.Вставить("ВидЦены", 			ВидЦены);
	СтруктураПараметровОтбора.Вставить("Номенклатура", 		Номенклатура);
	СтруктураПараметровОтбора.Вставить("Характеристика", 	Характеристика);
	СтруктураПараметровОтбора.Вставить("Упаковка", 			Упаковка);
	СтруктураПараметровОтбора.Вставить("Серия", 			"");
	
	Цена = ЦеныПредприятияЗаполнениеСервер.ПолучитьЦенуПоОтбору(СтруктураПараметровОтбора);
	
	Возврат Цена;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 01.09.2023 УА #61246

//+ ИнфоСофт Сумин Д.В. 16.11.2023 УА #60080
Функция КоэффициентыРаспределенияПоДолям(ТабличнаяЧасть, Параметры)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Таблица.НомерСтроки                                       КАК НомерСтроки,
	|	Таблица.НоменклатураНабора                                КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора                              КАК ХарактеристикаНабора,
	|	Таблица.Номенклатура                                      КАК Номенклатура,
	|	Таблица.Характеристика                                    КАК Характеристика,
	|	Таблица.Упаковка                                          КАК Упаковка,
	|	Таблица.Количество                                        КАК Количество,
	|	Таблица.КоличествоУпаковок                                КАК КоличествоУпаковок
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&ТабличнаяЧасть КАК Таблица
	|;
	|
	|//////////////////////////
	|ВЫБРАТЬ
	|	Таблица.НомерСтроки                                       КАК НомерСтроки,
	|	Таблица.НоменклатураНабора                                КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора                              КАК ХарактеристикаНабора,
	|	Таблица.Номенклатура                                      КАК Номенклатура,
	|	Таблица.Характеристика                                    КАК Характеристика,
	|	Таблица.Упаковка                                          КАК Упаковка,
	|	Таблица.Количество                                        КАК Количество,
	|	Таблица.КоличествоУпаковок                                КАК КоличествоУпаковок,
	|	ВариантыКомплектацииНоменклатуры.Ссылка                   КАК ВариантыКомплектацииНоменклатуры,
	|	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора
	|ПОМЕСТИТЬ ТаблицаСВариантамиКомплектации
	|ИЗ
	|	Таблица КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ПО Таблица.НоменклатураНабора = ВариантыКомплектацииНоменклатуры.Владелец
	|			И Таблица.ХарактеристикаНабора = ВариантыКомплектацииНоменклатуры.Характеристика
	|			И ВариантыКомплектацииНоменклатуры.Основной
	|;
	|
	|/////
	|ВЫБРАТЬ
	|	Товары.Ссылка            КАК ВариантыКомплектацииНоменклатуры,
	|	Товары.Номенклатура      КАК Номенклатура,
	|	Товары.Характеристика    КАК Характеристика,
	|	СУММА(ВЫБОР
	|			КОГДА Товары.Количество <> 0
	|				ТОГДА Выбор Когда Товары.ДоляСтоимости = 0 Тогда 1 Иначе  Товары.ДоляСтоимости Конец/ Товары.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДоляСтоимости
	|ПОМЕСТИТЬ ДолиСтоимости
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Ссылка
	|;
	|
	|/////
	|ВЫБРАТЬ
	|	Таблица.НомерСтроки                                           КАК НомерСтроки,
	|	Таблица.НоменклатураНабора                                    КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора                                  КАК ХарактеристикаНабора,
	|	Таблица.Номенклатура                                          КАК Номенклатура,
	|	Таблица.Характеристика                                        КАК Характеристика,
	|	Таблица.Упаковка                                              КАК Упаковка,
	|	Таблица.Количество                                            КАК Количество,
	|	Таблица.КоличествоУпаковок                                    КАК КоличествоУпаковок,
	|	ВЫРАЗИТЬ(Таблица.Количество * ЕСТЬNULL(ДолиСтоимости.ДоляСтоимости, 0) КАК Число(15,2)) КАК Цена,
	|	Таблица.ВариантыКомплектацииНоменклатуры                      КАК ВариантыКомплектацииНоменклатуры,
	|	Таблица.ВариантРасчетаЦеныНабора                              КАК ВариантРасчетаЦеныНабора
	|ИЗ
	|	ТаблицаСВариантамиКомплектации КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДолиСтоимости КАК ДолиСтоимости
	|		ПО ДолиСтоимости.ВариантыКомплектацииНоменклатуры = Таблица.ВариантыКомплектацииНоменклатуры
	|			И Таблица.Номенклатура = ДолиСтоимости.Номенклатура
	|			И Таблица.Характеристика = ДолиСтоимости.Характеристика
	|");
	
	// Выгрузить из таблицы источника
	Если ТипЗнч(ТабличнаяЧасть) = Тип("ТаблицаЗначений") Тогда
		Запрос.Параметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть.Скопировать());
	Иначе
		Запрос.Параметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть.Выгрузить());
	КонецЕсли;
	
	ПараметрыРасчета = Новый Структура;
	Для Каждого Параметр Из Параметры Цикл
		ПараметрыРасчета.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	ПараметрыРасчета.Вставить("РассчитыватьНаборы", Ложь);
	
	ТЧ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЧ Из ТЧ Цикл
		СтрокаТЧ.Цена = Окр(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок, 2);
	КонецЦикла;
	
	Возврат ТЧ;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 16.11.2023 УА #60080 

//+ ИнфоСофт Сумин Д.В. 16.11.2023 УА #60080
Функция ВариантКомплектацииНоменклатурыПоУмолчанию(Знач Номенклатура, Знач Характеристика)

	ВариантКомплектацииНоменклатуры = Неопределено;

	Если Характеристика = Неопределено Тогда
		Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
						  |	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектацииНоменклатуры
						  |ИЗ
						  |	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
						  |ГДЕ
						  |	ВариантыКомплектацииНоменклатуры.Владелец = &Владелец
						  |	И ВариантыКомплектацииНоменклатуры.Характеристика = &Характеристика
						  |
						  |УПОРЯДОЧИТЬ ПО
						  |	ВариантыКомплектацииНоменклатуры.Основной УБЫВ,
						  |	ВариантыКомплектацииНоменклатуры.ПометкаУдаления");

	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВариантКомплектацииНоменклатуры = Выборка.ВариантКомплектацииНоменклатуры;
	КонецЕсли;

	Возврат ВариантКомплектацииНоменклатуры;

КонецФункции //- ИнфоСофт Сумин Д.В. 16.11.2023 УА #60080 

//+ ИнфоСофт Сумин Д.В. 04.03.2024 УА #71107
Функция СоздатьДокументОтчетКомиссионераNew(СтруктураДанных) Экспорт 
	
	//+ ИнфоСофт Макарова Н.Е. 10.04.2025 УА #76491
	Если СтруктураДанных.Свойство("ОтчетКомиссионераСсылка") Тогда
		
		ДокОтчет = СтруктураДанных.ОтчетКомиссионераСсылка.ПолучитьОбъект();
		ДокОтчет.УстановитьПометкуУдаления(Ложь);
		
	Иначе
		
		ДокОтчет = Документы.ОтчетКомиссионера.СоздатьДокумент();
		
	КонецЕсли;
	//- ИнфоСофт Макарова Н.Е. 10.04.2025 УА #76491
		
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Партнер", 		СтруктураДанных.Партнер); 
	ПараметрыФормы.Вставить("Контрагент",   СтруктураДанных.Контрагент);
	ПараметрыФормы.Вставить("Организация",  СтруктураДанных.Организация);	
	ПараметрыФормы.Вставить("КонецПериода", СтруктураДанных.ДатаОкончания);
	
	//+ ИнфоСофт Заварин К.В. 02.11.24 УА #86389
	//ДокОтчет.Заполнить(ПараметрыФормы);	
	//- ИнфоСофт Заварин К.В. 02.11.24 УА #86389
	
	//+ ИнфоСофт Мурсалимов Д.Р. 16.06.24 УА #77666
	ДокОтчет.Партнер = СтруктураДанных.Партнер; 
	ДокОтчет.Контрагент = СтруктураДанных.Контрагент;
	ДокОтчет.Организация = СтруктураДанных.Организация;	
	ДокОтчет.КонецПериода = СтруктураДанных.ДатаОкончания;
	//- ИнфоСофт Мурсалимов Д.Р. 16.06.24 УА #77666
	
	ДокОтчет.Дата = КонецДня(СтруктураДанных.ДатаОкончания);
	ДокОтчет.НачалоПериода = НачалоДня(СтруктураДанных.ДатаНачала);
	ДокОтчет.КонецПериода = НачалоДня(СтруктураДанных.ДатаОкончания);
	
	//+ ИнфоСофт Мурсалимов Д.Р. 27.02.25 УА #92506
	//ПродажаОблагаетсяНДС = ИС_WB_СерверУТ11_5.ПолучитьРезультатПроверкиУчетаНДС(СтруктураДанных.Организация); 
	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #95713 
	//ПродажаОблагаетсяНДС = ИС_МП_УправлениеОтчетами.ПолучитьПрименениеНДСОрганизации(СтруктураДанных.Организация);
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #95713 
	//- ИнфоСофт Мурсалимов Д.Р. 27.02.25 УА #92506
	
	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #95713
	//Если ПродажаОблагаетсяНДС Тогда 
	//	ДокОтчет.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;  		
	//Иначе
	//	ДокОтчет.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;	
	//КонецЕсли;
	
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #95713
	
	ДокОтчет.ДатаПлатежа = СтруктураДанных.ДатаОкончания;
	
	//+ ИнфоСофт Заварин К.В. 02.04.24 УА #66208
	ДокОтчет.НомерВходящегоДокумента = Формат(СтруктураДанных.НомерВходящегоДокумента, "ЧГ=");
	ДокОтчет.ДатаВходящегоДокумента = СтруктураДанных.ДатаВходящегоДокумента;
	//- ИнфоСофт Заварин К.В. 02.04.24 УА #66208
	
	ДокОтчет.Соглашение = СтруктураДанных.Соглашение; 
	ДокОтчет.Договор = СтруктураДанных.Договор;	  
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	//+ ИнфоСофт Заварин К.В. 02.11.24 УА #86389
	Если ИспользоватьСоглашенияСКлиентами Тогда
		ПараметрыФормы.Вставить("Соглашение", СтруктураДанных.Соглашение); 
		ПараметрыФормы.Вставить("ЗаполнятьПоСоглашению", Истина); 
	КонецЕсли; 

	ДокОтчет.Заполнить(ПараметрыФормы);
	//- ИнфоСофт Заварин К.В. 02.11.24 УА #86389
	
	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #95713 
	НастройкиУчета = УчетНДСУП.ПараметрыУчетаПоОрганизации(СтруктураДанных.Организация, ТекущаяДатаСеанса());	
	ДокОтчет.НалогообложениеНДС = НастройкиУчета.ОсновноеНалогообложениеНДСПродажи;
	
	Если ДокОтчет.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС Тогда  	
		ПродажаОблагаетсяНДС = Истина;
	ИначеЕсли ДокОтчет.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН Тогда
		ПродажаОблагаетсяНДС = Истина;
	Иначе
		ПродажаОблагаетсяНДС = Ложь;
	КонецЕсли;	
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #95713
	
	//+ ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78655
	ИспользоватьПодразделения = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	
	Если ИспользоватьПодразделения Тогда
		ДокОтчет.Подразделение = СтруктураДанных.Подразделение;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78655
	
	ЗаполнитьХозОперацию = Истина;
	
	Если ИспользоватьСоглашенияСКлиентами И ДокОтчет.Соглашение.КомиссионныеПродажи25 Тогда 
		ДокОтчет.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионера;
		ЗаполнитьХозОперацию = Ложь;
	КонецЕсли;
	
	Если ЗаполнитьХозОперацию И ИспользоватьДоговорыСКлиентами И ДокОтчет.Договор.КомиссионныеПродажи25 Тогда 
		ДокОтчет.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионера;
		ЗаполнитьХозОперацию = Ложь;
	КонецЕсли;
	
	Если ЗаполнитьХозОперацию Тогда
		ДокОтчет.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;
	КонецЕсли;
	
	РассчитатьКомиссионноеВознаграждение = СтруктураДанных.РассчитатьКомиссионноеВознаграждение;
	
	ЦеныВозвратаПоВидуЦен = ?(СтруктураДанных.ВариантФормированияЦеныВозврата = 1, Истина, Ложь);
	
	ВидЦены = СтруктураДанных.ВидЦеныВозврата;
	
	ТаблицаПродаж = СтруктураДанных.ТаблицаПродаж; 
	
	Если РассчитатьКомиссионноеВознаграждение Тогда 
		
		ДокОтчет.УдержатьВознаграждение = Истина; 
		ДокОтчет.СпособРасчетаВознаграждения = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи;
		СуммаУслугВБ = СтруктураДанных.СуммаУслугВБ;
		
		//+ ИнфоСофт Власова И.С. 03.04.25 УА #98046
		//МассивСуммПродаж = СтруктураДанных.МассивСуммПродаж;	
		//СредняяСтоимостьУслуги = Окр(СуммаУслугВБ / МассивСуммПродаж.Количество(), 2);
		//
		////Для избежания потерь по копейкам, рассчитаем разницу между исходной суммой и суммой вознаграждения в документе
		//ПотеряннаяСумма = СуммаУслугВБ - СредняяСтоимостьУслуги * МассивСуммПродаж.Количество();  
		//ПотереннаяСуммаДобавлена = Ложь;
		//МассивНастроекВознаграждение = Новый Массив;
		//
		//Для Каждого Строка Из ТаблицаПродаж Цикл
		//	Если Строка.Количество < 0 Тогда
		//		МассивНастроекВознаграждение.Добавить(0);	
		//	Иначе
		//		Если Не ПотереннаяСуммаДобавлена Тогда
		//			МассивНастроекВознаграждение.Добавить(Строка.СуммаПродажи + ПотеряннаяСумма);
		//			ПотереннаяСуммаДобавлена = Истина;
		//		Иначе
		//			МассивНастроекВознаграждение.Добавить(Строка.СуммаПродажи);		
		//		КонецЕсли;
		//	КонецЕсли;	
		//КонецЦикла;
		//
		//МассивНастроекВознаграждение = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаУслугВБ, СтруктураДанных.МассивСуммПродаж);
		
		СуммаПродаж = СтруктураДанных.СуммаПродажи;
		
		Если СуммаПродаж = 0 Тогда
			ТекстСообщения = "Сумма продаж по отчету равна 0, расчет комиссионного вознаграждения невозможен!";
			ВызватьИсключение(ТекстСообщения);
		КонецЕсли;
		//- ИнфоСофт Власова И.С. 03.04.25 УА #98046
		
	Иначе
		ДокОтчет.СпособРасчетаВознаграждения = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается; 
		ДокОтчет.УдержатьВознаграждение = Ложь; 
	КонецЕсли;
	
	ДокОтчет.Комментарий = СтруктураДанных.Комментарий;
	
	СуммаДокумента = 0;
	Итератор = 0;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506
	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #95713
	//ИС_МП_УправлениеОтчетами.ЗаполнитьСтавкуНДСПоОрганизацииНалогообложениеНДС(ДокОтчет); 
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #95713
	//- ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506
	
	//+ ИнфоСофт Мурсалимов Д.Р. 01.11.24 УА #85693
	Профиль = СтруктураДанных.Профиль;
	
	ДокОтчет.Товары.Очистить();
	
	Для Каждого Элемент Из ТаблицаПродаж Цикл
		
		Если Элемент.ЦенаРозничная = 0 Тогда
			Элемент.ЦенаРозничная = Элемент.СуммаПродажи;
		КонецЕсли;	
		
		//+ ИнфоСофт Заварин К.В. 04.12.24 УА #88962
		Если Элемент.СуммаПродажи = 0 Тогда
			Продолжить;  
		КонецЕсли;
		
		Если Элемент.ЦенаРозничная = 0 Тогда
			Продолжить;  
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 04.12.24 УА #88962
		
		Если Элемент.ЭтоНабор Тогда
						
			ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Профиль, Элемент.Номенклатура, Элемент.Характеристика);   
			
			//+ ИнфоСофт Мурсалимов Д.Р. 17.01.25 УА #91385
			Если Не ЗначениеЗаполнено(ТоварыНабора[0].ВариантРасчетаЦены) Тогда
				ТекстСообщения = "Для набора: " + Элемент.Номенклатура + " не определен вариант задания цены. Проверьте настройки формирования цены набора!";
				ВызватьИсключение(ТекстСообщения);	
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 17.01.25 УА #91385
			
			Если ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Или
					ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам Тогда
				
				МассивКоэффициентов = РассчитатьКоэффициентыИзЦен(ТоварыНабора.ВыгрузитьКолонку("КомплектующиеЦена"), Элемент.Номенклатура);
			Иначе
				МассивКоэффициентов = ТоварыНабора.ВыгрузитьКолонку("ДоляСтоимости");
			КонецЕсли;
			
			СуммыПродажи 	= ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Элемент.СуммаПродажи, МассивКоэффициентов);
			СуммыПередачи 	= ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Элемент.ЦенаРозничная, МассивКоэффициентов);
			
			Если РассчитатьКомиссионноеВознаграждение Тогда
				
				//+ ИнфоСофт Власова И.С. 03.04.25 УА #98046
				//Вознаграждение 		= МассивНастроекВознаграждение[Итератор];
				
				Вознаграждение = СуммаУслугВБ * (Элемент.СуммаПродажи / СуммаПродаж);
				//- ИнфоСофт Власова И.С. 03.04.25 УА #98046
				
				СуммыВознаграждения = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Вознаграждение, МассивКоэффициентов);
			КонецЕсли;	
			
			Для Каждого ЭлементНабора Из ТоварыНабора Цикл 
				
				НоваяСтрока = ДокОтчет.Товары.Добавить();
				
				НоваяСтрока.Номенклатура 		= ЭлементНабора.Номенклатура;
				НоваяСтрока.Характеристика 		= ЭлементНабора.Характеристика;
				НоваяСтрока.Количество 			= ЭлементНабора.КоличествоУпаковок * Элемент.Количество;
				НоваяСтрока.КоличествоУпаковок 	= ЭлементНабора.КоличествоУпаковок * Элемент.Количество;
				
				Если НоваяСтрока.Количество < 0 Тогда	
		
					Если Не ЦеныВозвратаПоВидуЦен Тогда
						
						НоваяСтрока.Цена 		= -(СуммыПередачи[0] / ЭлементНабора.КоличествоУпаковок / Элемент.Количество);
						НоваяСтрока.СуммаСНДС 	= -(СуммыПередачи[0]);
						НоваяСтрока.Сумма 		= -(СуммыПередачи[0]);
						
					Иначе
						
						ЦенаРозничная = ЗаполнитьСуммыПоВидуЦен(ВидЦены, ДокОтчет.Дата, ДокОтчет.Валюта, ЭлементНабора.Номенклатура, ЭлементНабора.Характеристика, ЭлементНабора.Номенклатура.ЕдиницаИзмерения);
						
						НоваяСтрока.Цена 		= -(ЦенаРозничная / НоваяСтрока.Количество);
						НоваяСтрока.Сумма 		= -(ЦенаРозничная); 
						НоваяСтрока.СуммаСНДС 	= -(ЦенаРозничная);
						
					КонецЕсли;		
					
				Иначе 
					
					НоваяСтрока.Цена 			= СуммыПередачи[0] / ЭлементНабора.КоличествоУпаковок / Элемент.Количество;
					НоваяСтрока.СуммаСНДС 		= СуммыПередачи[0];
					НоваяСтрока.Сумма 			= СуммыПередачи[0];
					
				КонецЕсли; 
				
				НоваяСтрока.ЦенаПродажи 		= СуммыПродажи[0] / ЭлементНабора.КоличествоУпаковок / Элемент.Количество;
				НоваяСтрока.СуммаПродажи 		= СуммыПродажи[0];	
				
				Если РассчитатьКомиссионноеВознаграждение И СуммыВознаграждения <> Неопределено Тогда 
					НоваяСтрока.СуммаВознаграждения = СуммыВознаграждения[0];
				КонецЕсли;
				
				СуммаДокумента = СуммаДокумента + НоваяСтрока.СуммаПродажи; 
				
				НоваяСтрока.Упаковка 			= ЭлементНабора.Упаковка;
				
				//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #95713
				НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
				//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #95713
				
				Если ПродажаОблагаетсяНДС Тогда
					
					//+ ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506
					//НДС 						= ЭлементНабора.Номенклатура.СтавкаНДС.Ставка;
					//НоваяСтрока.СтавкаНДС 	= ЭлементНабора.Номенклатура.СтавкаНДС;
					
					СтавкаНДС = ИС_МП_УправлениеОтчетами.РассчитатьСтавкуНДС( ДокОтчет.Организация
																			, ТекущаяДатаСеанса()
																			, ДокОтчет.НалогообложениеНДС
																			, ЭлементНабора.Номенклатура); 
					
					НДС 						= СтавкаНДС.Ставка;
					НоваяСтрока.СтавкаНДС 		= СтавкаНДС;
					//- ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506 
					
					Если Не ЗначениеЗаполнено(НДС) Или НДС = 0 Тогда 
						
						НоваяСтрока.СуммаПродажиНДС = 0;
						НоваяСтрока.СуммаНДС 		= 0;
						
						Если РассчитатьКомиссионноеВознаграждение Тогда
							НоваяСтрока.СуммаНДСВознаграждения = 0;
						КонецЕсли;
						
					Иначе
						
						//+ ИнфоСофт Заварин К.В. 25.03.25 УА #96812
						//НоваяСтрока.СуммаПродажиНДС = РассчитатьСуммуНДС(НоваяСтрока.ЦенаПродажи, НДС, Истина); 
						//НоваяСтрока.СуммаНДС 		= РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
						
						НоваяСтрока.СуммаПродажиНДС = РассчитатьСуммуНДС(НоваяСтрока.СуммаПродажи, НДС, Истина); 
						НоваяСтрока.СуммаНДС     = РассчитатьСуммуНДС(НоваяСтрока.СуммаСНДС, НДС, Истина);
						//- ИнфоСофт Заварин К.В. 25.03.25 УА #96812
						
						//+ ИнфоСофт Власова И.С. 03.04.25 УА #98046
						//Если НоваяСтрока.Количество < 0 Тогда 
						//	
						//	НоваяСтрока.СуммаПродажиНДС = -(НоваяСтрока.СуммаПродажиНДС);
						//    НоваяСтрока.СуммаНДС 		= -(НоваяСтрока.СуммаНДС); 
						//	
						//КонецЕсли;
						//- ИнфоСофт Власова И.С. 03.04.25 УА #98046
						
						Если РассчитатьКомиссионноеВознаграждение И СуммыВознаграждения <> Неопределено Тогда
							НоваяСтрока.СуммаНДСВознаграждения = РассчитатьСуммуНДС(НоваяСтрока.СуммаВознаграждения, НДС, Истина);
						КонецЕсли; 
						
					КонецЕсли;	
				Иначе
					НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
				КонецЕсли; 
				
				СуммыПродажи.Удалить(0);
				СуммыПередачи.Удалить(0);
				
				Если РассчитатьКомиссионноеВознаграждение И СуммыВознаграждения <> Неопределено Тогда 
					СуммыВознаграждения.Удалить(0);	
				КонецЕсли;
				
			КонецЦикла;	
			
		Иначе
			
			НоваяСтрока = ДокОтчет.Товары.Добавить();
			
			Если РассчитатьКомиссионноеВознаграждение Тогда 
				//+ ИнфоСофт Власова И.С. 03.04.25 УА #98046
				//НоваяСтрока.СуммаВознаграждения = МассивНастроекВознаграждение[Итератор];
				
				НоваяСтрока.СуммаВознаграждения = ?(Элемент.Количество > 0, СуммаУслугВБ * (Элемент.СуммаПродажи / СуммаПродаж), 0);
				//- ИнфоСофт Власова И.С. 03.04.25 УА #98046
			КонецЕсли;
			
			НоваяСтрока.Номенклатура 	= Элемент.Номенклатура;
			НоваяСтрока.Характеристика 	= Элемент.Характеристика; 
			
			Если Элемент.Количество = 0 Тогда
				
				НоваяСтрока.Количество 			= Элемент.КоэффициентУпаковки;	
				НоваяСтрока.КоличествоУпаковок 	= 1;
				
			Иначе 
				
				НоваяСтрока.Количество 			= Элемент.Количество * Элемент.КоэффициентУпаковки;
				НоваяСтрока.КоличествоУпаковок 	= Элемент.Количество;
				
			КонецЕсли; 
			
			Если НоваяСтрока.Количество < 0 Тогда	
				
				Если Не ЦеныВозвратаПоВидуЦен Тогда
					
					НоваяСтрока.Сумма 			= Элемент.ЦенаРозничная * НоваяСтрока.Количество;
					НоваяСтрока.Цена 			= НоваяСтрока.Сумма / НоваяСтрока.Количество; 
					НоваяСтрока.СуммаСНДС 		= НоваяСтрока.Сумма;
					
				Иначе
					
					ЦенаРозничная = ЗаполнитьСуммыПоВидуЦен(ВидЦены, ДокОтчет.Дата, ДокОтчет.Валюта, Элемент.Номенклатура, Элемент.Характеристика, Элемент.Номенклатура.ЕдиницаИзмерения);
					
					НоваяСтрока.Сумма 			= ЦенаРозничная * НоваяСтрока.Количество;
					НоваяСтрока.Цена 			= НоваяСтрока.Сумма / НоваяСтрока.Количество; 
					НоваяСтрока.СуммаСНДС 		= НоваяСтрока.Сумма;
					
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока.Сумма 				= Элемент.ЦенаРозничная * НоваяСтрока.Количество;
				НоваяСтрока.Цена 				= НоваяСтрока.Сумма / НоваяСтрока.Количество; 
				НоваяСтрока.СуммаСНДС 			= НоваяСтрока.Сумма;
				
			КонецЕсли;  
			
			НоваяСтрока.ЦенаПродажи 	= Элемент.СуммаПродажи / НоваяСтрока.Количество;
			НоваяСтрока.СуммаПродажи 	= Элемент.СуммаПродажи;	
			
			СуммаДокумента 				= СуммаДокумента + НоваяСтрока.СуммаПродажи; 	
			НоваяСтрока.Упаковка 		= Элемент.Упаковка;
			
			//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #95713
			НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
			//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #95713
			
			Если ПродажаОблагаетсяНДС Тогда
				
				//+ ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506
				//НДС 					= Элемент.Номенклатура.СтавкаНДС.Ставка;
				//НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС;
				
				СтавкаНДС = ИС_МП_УправлениеОтчетами.РассчитатьСтавкуНДС( ДокОтчет.Организация
																		, ТекущаяДатаСеанса()
																		, ДокОтчет.НалогообложениеНДС
																		, Элемент.Номенклатура); 
				
				НДС 					= СтавкаНДС.Ставка;
				НоваяСтрока.СтавкаНДС 	= СтавкаНДС;
				//- ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506 
				
				Если Не ЗначениеЗаполнено(НДС) Или НДС = 0 Тогда 
					
					НоваяСтрока.СуммаПродажиНДС = 0;
					НоваяСтрока.СуммаНДС 		= 0;
					
					Если РассчитатьКомиссионноеВознаграждение Тогда
						НоваяСтрока.СуммаНДСВознаграждения = 0;
					КонецЕсли;
					
				Иначе
					
					//+ ИнфоСофт Власова И.С. 31.03.25 УА #97477
					//НоваяСтрока.СуммаПродажиНДС = РассчитатьСуммуНДС(НоваяСтрока.ЦенаПродажи, НДС, Истина);
					//НоваяСтрока.СуммаНДС 		  = РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
					
					НоваяСтрока.СуммаПродажиНДС = РассчитатьСуммуНДС(НоваяСтрока.СуммаПродажи, НДС, Истина); 
					НоваяСтрока.СуммаНДС        = РассчитатьСуммуНДС(НоваяСтрока.СуммаСНДС, НДС, Истина);
					//- ИнфоСофт Власова И.С. 31.03.25 УА #97477
					
					//+ ИнфоСофт Власова И.С. 03.04.25 УА #98046
					//Если НоваяСтрока.Количество < 0 Тогда 
					//	НоваяСтрока.СуммаПродажиНДС = -(НоваяСтрока.СуммаПродажиНДС);
					//	НоваяСтрока.СуммаНДС 		= -(НоваяСтрока.СуммаНДС); 
					//КонецЕсли;
					//- ИнфоСофт Власова И.С. 03.04.25 УА #98046
					
					Если РассчитатьКомиссионноеВознаграждение Тогда
						НоваяСтрока.СуммаНДСВознаграждения = РассчитатьСуммуНДС(НоваяСтрока.СуммаВознаграждения, НДС, Истина);
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
			КонецЕсли;
			
		КонецЕсли;
		
		Если РассчитатьКомиссионноеВознаграждение Тогда 
			Итератор = Итератор + 1;
		КонецЕсли;
		
	КонецЦикла;
	//- ИнфоСофт Мурсалимов Д.Р. 01.11.24 УА #85693
	
	//+ ИнфоСофт Власова И.С. 03.04.25 УА #98046
	Если РассчитатьКомиссионноеВознаграждение Тогда
		
		ПогрешностьКомиссии = СуммаУслугВБ - ДокОтчет.Товары.Итог("СуммаВознаграждения");
		
		Если Не ПогрешностьКомиссии = 0 Тогда	
			
			Для Каждого Строка Из ДокОтчет.Товары Цикл	
				
				Если Строка.Количество > 0 И Строка.СуммаВознаграждения > ПогрешностьКомиссии Тогда	
					Строка.СуммаВознаграждения = Строка.СуммаВознаграждения + ПогрешностьКомиссии;
					Прервать;	
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 03.04.25 УА #98046
	
	ДокОтчет.СуммаДокумента = СуммаДокумента;
	Если РассчитатьКомиссионноеВознаграждение Тогда 
		ДокОтчет.СуммаВознаграждения = СтруктураДанных.СуммаУслугВБ;
		ДокОтчет.ПроцентВознаграждения = ДокОтчет.СуммаВознаграждения * 100 / ДокОтчет.СуммаДокумента;
		ДокОтчет.Услуга = СтруктураДанных.НоменклатураУслугиВБ;
		Если ПродажаОблагаетсяНДС Тогда
			ДокОтчет.СтавкаНДСВознаграждения = СтруктураДанных.НоменклатураУслугиВБ.СтавкаНДС;
			ДокОтчет.СуммаНДСВознаграждения = РассчитатьСуммуНДС(ДокОтчет.СуммаВознаграждения, СтруктураДанных.НоменклатураУслугиВБ.СтавкаНДС.Ставка, Истина);		
		Иначе
			ДокОтчет.СтавкаНДСВознаграждения = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
			ДокОтчет.СуммаНДСВознаграждения = 0;
		КонецЕсли;	
	КонецЕсли;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 25.02.25 УА #92506
	////+ Инфосотф Сумин Д.В. 25.04.2024 УА #72843
	//СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ПересчитатьСуммуНДС", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокОтчет));	
	//СтруктураДействий.Вставить("ПересчитатьСуммуПродажиНДС");
	//ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокОтчет.Товары, СтруктураДействий, Неопределено);
	////- Инфосотф Сумин Д.В. 25.04.2024 УА #72843
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("СкорректироватьСтавкуНДС", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ДокОтчет));
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокОтчет.Товары, СтруктураДействий, Неопределено);
	//- ИнфоСофт Мурсалимов Д.Р. 25.02.25 УА #92506
	
	//+ ИнфоСофт Мурсалимов Д.Р. 24.04.25 УА #99478
	ДокументЗаписан = Ложь;
	
	Если СтруктураДанных.ВариантСозданияОтчета = Истина Тогда
		
		Попытка
			ДокОтчет.Записать(РежимЗаписиДокумента.Проведение);
			ДокументЗаписан = Истина;
		Исключение
			ДокОтчет.Записать();
			ДокументЗаписан = Истина;
		КонецПопытки;
		
	Иначе
		
		ДокОтчет.Записать();
		ДокументЗаписан = Истина;
		
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("ОчиститьРегистрыОК") И СтруктураДанных.ОчиститьРегистрыОК Тогда
		
		Если СтруктураДанных.Свойство("НомерОтчета")
			И ЗначениеЗаполнено(СтруктураДанных.НомерОтчета)
			И ДокументЗаписан Тогда
			
			НаборЗаписей = РегистрыСведений.ИС_WB_ДанныеОтчетовОПродажах.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Профиль.Установить(СтруктураДанных.Профиль); 
			НаборЗаписей.Отбор.НомерОтчета.Установить(СтруктураДанных.НомерОтчета);
			
			НаборЗаписей.Записать();
			
		КонецЕсли;  
		
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 24.04.25 УА #99478
	
	Возврат ДокОтчет.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 04.03.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 05.03.2024 УА #71107
Функция ПолучитьДокументСписанияТоваровКомиссионера(СтруктураДанных)
	
	Профиль 		= СтруктураДанных.Профиль;
	ДокОтчет 		= СтруктураДанных.ОтчетКомиссионера; 
	ТаблицаПотерь 	= СтруктураДанных.ТаблицаПотерь;
	
	ДокументСписания = Документы.ОтчетКомиссионераОСписании.СоздатьДокумент();
	
	ДокументСписания.Дата = ДокОтчет.Дата;
	
	ДокументСписания.Организация = ДокОтчет.Организация;
	
	ДокументСписания.Партнер = ДокОтчет.Партнер;
	
	ДокументСписания.Контрагент = ДокОтчет.Контрагент; 
	
	ДокументСписания.Соглашение = ДокОтчет.Соглашение;
	
	ДокументСписания.Валюта = ДокОтчет.Валюта;
	
	ДокументСписания.НалогообложениеНДС = ДокОтчет.НалогообложениеНДС;
	
	ДокументСписания.ЦенаВключаетНДС = ДокОтчет.ЦенаВключаетНДС;
	
	ДокументСписания.ДатаПлатежа = ТекущаяДатаСеанса();
	
	ДокументСписания.Договор = ДокОтчет.Договор; 
	
	ДокументСписания.ПорядокРасчетов = ДокОтчет.ПорядокРасчетов;
	
	ДокументСписания.ПорядокРасчетов = ДокОтчет.ПорядокРасчетов;
	
	Если ДокументСписания.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС Тогда
		ПродажаОблагаетсяНДС = Истина;
	Иначе
		ПродажаОблагаетсяНДС = Ложь;
	КонецЕсли;	
	
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
	ДокументСписания.СтатьяДоходов  = СтруктураДанных.СтатьяДоходов;
	ДокументСписания.СтатьяРасходов = СтруктураДанных.СтатьяРасходов;
	//- ИнфоСофт Власова И.С. 14.03.25 УА #83865
	
	Для Каждого Элемент Из ТаблицаПотерь Цикл
		
		Если Элемент.ЭтоНабор Тогда
			
			//+ ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693
			//ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Элемент.Номенклатура, Элемент.Характеристика, Профиль);
			ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Профиль, Элемент.Номенклатура, Элемент.Характеристика);	
			//- ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693 
			
			Если ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Или
				ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам Тогда
				
				МассивКоэффициентов = РассчитатьКоэффициентыИзЦен(ТоварыНабора.ВыгрузитьКолонку("КомплектующиеЦена"), Элемент.Номенклатура);
			Иначе
				МассивКоэффициентов = ТоварыНабора.ВыгрузитьКолонку("ДоляСтоимости");
			КонецЕсли;
			
			СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Элемент.Сумма, МассивКоэффициентов);
				
	  		Для Каждого ЭлементНабора Из ТоварыНабора Цикл 
				
				НоваяСтрока = ДокументСписания.Товары.Добавить();
				
				НоваяСтрока.Номенклатура = ЭлементНабора.Номенклатура;
				НоваяСтрока.Характеристика = ЭлементНабора.Характеристика;
				НоваяСтрока.Количество = ЭлементНабора.КоличествоУпаковок;
				НоваяСтрока.КоличествоУпаковок = ЭлементНабора.КоличествоУпаковок;
								
				НоваяСтрока.Цена = СуммыПродажи[0] / ЭлементНабора.КоличествоУпаковок;
				НоваяСтрока.Сумма = СуммыПродажи[0];
				НоваяСтрока.СуммаСНДС = СуммыПродажи[0];			 
				НоваяСтрока.СтавкаНДС = ЭлементНабора.Номенклатура.СтавкаНДС;
				НоваяСтрока.Упаковка = ЭлементНабора.Упаковка;
				
				СуммыПродажи.Удалить(0);
	
			КонецЦикла;	
		Иначе	
			НоваяСтрока = ДокументСписания.Товары.Добавить();
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;
			НоваяСтрока.Характеристика = Элемент.Характеристика;
			НоваяСтрока.Упаковка = Элемент.Упаковка;
			НоваяСтрока.КоличествоУпаковок = 1;
			Если Элемент.Упаковка.Числитель = 0 Тогда
				НоваяСтрока.Количество = 1;	
			Иначе	
				НоваяСтрока.Количество = Элемент.Упаковка.Числитель; 
			КонецЕсли;
			НоваяСтрока.Цена = Элемент.Сумма;
			НоваяСтрока.Сумма = Элемент.Сумма;
			НоваяСтрока.СуммаСНДС = Элемент.Сумма;
			НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС;
		КонецЕсли;
	КонецЦикла;	
	
	Если ПродажаОблагаетсяНДС Тогда 
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументСписания));	
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокументСписания.Товары, СтруктураДействий, Неопределено);	
	КонецЕсли;	
	
	Попытка
		ДокументСписания.Записать(РежимЗаписиДокумента.Проведение);	
	Исключение	
		ДокументСписания.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	Возврат ДокументСписания;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 05.03.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 05.03.2024 УА #69374
//+ ИнфоСофт Заварин К.В. 14.10.24 УА #85478 
//Добавлена Структура данных 
Функция ПолучитьДокументКорректировкиЗадолженности(СтруктураДанных, ДокОтчет, Сумма) Экспорт 
//- ИнфоСофт Заварин К.В. 14.10.24 УА #85478  
	
	Корректировка = Документы.КорректировкаЗадолженности.СоздатьДокумент();	
	
	Корректировка.Дата = ДокОтчет.Дата;
	
	Корректировка.Организация = ДокОтчет.Организация;
	
	Корректировка.Контрагент = ДокОтчет.Контрагент;
	
	Корректировка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности; 
	
	Корректировка.ЭтоНачисление = Истина;
	
	Корректировка.КорреспонденцияСДоходами = Ложь;
	
	Корректировка.РасчетыМеждуОрганизациями = Ложь;
	
	СтрокаТЧ = Корректировка.Задолженность.Добавить();
	
	СтрокаТЧ.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	
	СтрокаТЧ.Партнер = Докотчет.Партнер;
	
	СтрокаТЧ.ВалютаВзаиморасчетов = Докотчет.Валюта; 
	
	СтрокаТЧ.Сумма = Сумма;
	
	//+ ИнфоСофт Заварин К.В. 14.10.24 УА #85478
	Если СтруктураДанных.Свойство("СтатьяЗадолженности") И ЗначениеЗаполнено(СтруктураДанных.СтатьяЗадолженности) Тогда
		
		СтрокаТЧРасчет = Корректировка.ДоходыРасходыАктивыПассивы.Добавить();
		
		СтрокаТЧРасчет.Статья = СтруктураДанных.СтатьяЗадолженности;
		
		//+ ИнфоСофт Власова И.С. 14.03.25 УА #89596
		СтрокаТЧРасчет.Подразделение = СтруктураДанных.Подразделение;
		
		Если ТипЗнч(СтрокаТЧРасчет.Статья) = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов") Тогда
			
			РеквизитыСтатьи = ДоходыИРасходыВызовСервераПовтИсп.ЗначенияРеквизитовСтатьи(СтрокаТЧРасчет.Статья);
			СтрокаТЧРасчет.АналитикаРасходов = ДоходыИРасходыКлиентСервер.ПолучитьАналитикуПоУмолчанию(РеквизитыСтатьи, Корректировка);
			
		КонецЕсли;
		//- ИнфоСофт Власова И.С. 14.03.25 УА #89596
		
	КонецЕсли;	
	//- ИнфоСофт Заварин К.В. 14.10.24 УА #85478

	
	Если ЗначениеЗаполнено(ДокОтчет.Соглашение) И ЗначениеЗаполнено(ДокОтчет.Соглашение.ПорядокРасчетов) Тогда
		ПорядокРасчетов = ДокОтчет.Соглашение.ПорядокРасчетов;
	Иначе
		ПорядокРасчетов = ДокОтчет.Договор.ПорядокРасчетов;	
	КонецЕсли;
	
	Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
		ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", Докотчет.Ссылка);	
	Иначе
		ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ДокОтчет.Договор);	
	КонецЕсли;	
	
	СтрокаТЧ.ОбъектРасчетов = ОбъектРасчетов;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "ДатаПлатежа") Тогда
		СтрокаТЧ.ДатаПлатежа = Корректировка.Дата;
	КонецЕсли;
	
	Попытка
		Корректировка.Записать(РежимЗаписиДокумента.Проведение);	
	Исключение	
		Корректировка.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;  
	
	Возврат Корректировка.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 05.03.2024 УА #69374

//+ ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005
Функция СгруппироватьТаблицуПродажПоНоменклатуре(СписокТранзакций)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПродаж.Номенклатура КАК Номенклатура,
	|	ТаблицаПродаж.Характеристика КАК Характеристика,
	|	ТаблицаПродаж.Баркод КАК Баркод,
	|	ТаблицаПродаж.Количество КАК Количество,
	|	ТаблицаПродаж.КоэффициентУпаковки КАК КоэффициентУпаковки,
	|	ТаблицаПродаж.Упаковка КАК Упаковка,
	|	ТаблицаПродаж.ЭтоНабор КАК ЭтоНабор,
	|	ТаблицаПродаж.СуммаПродажи КАК СуммаПродажи,
	|	ТаблицаПродаж.ЦенаРозничная КАК ЦенаРозничная
	|ПОМЕСТИТЬ ВТ_Продажи
	|ИЗ
	|	&ТаблицаПродаж КАК ТаблицаПродаж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура КАК Номенклатура,
	|	ВТ_Продажи.Характеристика КАК Характеристика,
	|	ВТ_Продажи.Баркод КАК Баркод,
	|	СУММА(ВТ_Продажи.Количество) КАК Количество,
	|	СУММА(ВТ_Продажи.СуммаПродажи) КАК СуммаПродажи,
	|	МАКСИМУМ(ВТ_Продажи.КоэффициентУпаковки) КАК КоэффициентУпаковки,
	|	МАКСИМУМ(ВТ_Продажи.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(ВТ_Продажи.ЭтоНабор) КАК ЭтоНабор,
	|	МАКСИМУМ(ВТ_Продажи.ЦенаРозничная) КАК ЦенаРозничная
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Продажи.Баркод,
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Характеристика";
	
	Запрос.УстановитьПараметр("ТаблицаПродаж", СписокТранзакций);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = СписокТранзакций.Скопировать();
	Результат.Очистить();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005

//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
Функция ПолучитьОснованиеРТУ(Srid = 0)
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ИС_MP_ЗаказыОтчетаКомиссионера.Заказ1С КАК Заказ1С
	|ПОМЕСТИТЬ ВТ_Заказ
	|ИЗ
	|	РегистрСведений.ИС_MP_ЗаказыОтчетаКомиссионера КАК ИС_MP_ЗаказыОтчетаКомиссионера
	|ГДЕ
	|	ИС_MP_ЗаказыОтчетаКомиссионера.ИдентификаторМП = &Srid
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПередачаТоваровХранителю.Ссылка КАК РТУ
	|ПОМЕСТИТЬ ВТ_РТУ
	|ИЗ
	|	ВТ_Заказ КАК ВТ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ВТ_Заказ.Заказ1С = ПередачаТоваровХранителю.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	ВТ_Заказ КАК ВТ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Заказ.Заказ1С = РеализацияТоваровУслуг.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_РТУ.РТУ КАК РТУ
	|ИЗ
	|	ВТ_РТУ КАК ВТ_РТУ
	|ГДЕ
	|	НЕ ВТ_РТУ.РТУ ЕСТЬ NULL";

	Запрос.УстановитьПараметр("Srid", Srid);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		РТУ = Выборка.РТУ;
		
	КонецЦикла;
	
	Возврат РТУ;
	
КонецФункции //- ИнфоСофт Заварин К.В. 01.11.24 УА #86746

//+ ИнфоСофт Сумин Д.В. 11.03.2024 УА #71107
Функция ПолучитьДокументыОснованияДляВозвратов(ТаблицаРезультирующаяВозвраты)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_ДанныеОтчетовОПродажах.НомерОтчета КАК НомерОтчета,
	|	ИС_WB_ДанныеОтчетовОПродажах.Параметр КАК Параметр,
	|	ИС_WB_ДанныеОтчетовОПродажах.ЗначениеПараметра КАК Srid,
	|	ИС_WB_ДанныеОтчетовОПродажах.СтрокаНомер КАК СтрокаНомер
	|ПОМЕСТИТЬ ВТ_НомерОтчета
	|ИЗ
	|	РегистрСведений.ИС_WB_ДанныеОтчетовОПродажах КАК ИС_WB_ДанныеОтчетовОПродажах
	|ГДЕ
	|	ИС_WB_ДанныеОтчетовОПродажах.ЗначениеПараметра В(&МассивSrid)
	|	И ИС_WB_ДанныеОтчетовОПродажах.НомерОтчета.ВидОтчета = ЗНАЧЕНИЕ(Перечисление.ИС_WB_ВидыОТчетов.Иностранный)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_НомерОтчета.НомерОтчета) КАК НомерОтчета,
	|	ВТ_НомерОтчета.Srid КАК Srid
	|ПОМЕСТИТЬ ВТ_НомерОтчетаПродажи
	|ИЗ
	|	ВТ_НомерОтчета КАК ВТ_НомерОтчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ДанныеОтчетовОПродажах КАК ИС_WB_ДанныеОтчетовОПродажах
	|		ПО ВТ_НомерОтчета.НомерОтчета = ИС_WB_ДанныеОтчетовОПродажах.НомерОтчета
	|			И ВТ_НомерОтчета.СтрокаНомер = ИС_WB_ДанныеОтчетовОПродажах.СтрокаНомер
	|ГДЕ
	|	ИС_WB_ДанныеОтчетовОПродажах.Параметр.Наименование = ""ОбоснованиеДляОплаты""
	|	И ИС_WB_ДанныеОтчетовОПродажах.ЗначениеПараметра = ""Продажа""
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НомерОтчета.Srid
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ИС_WB_НомерацияОтчетовОПродажахДокументы.Документ) КАК Документ,
	|	ВТ_НомерОтчетаПродажи.Srid КАК Srid
	|ИЗ
	|	ВТ_НомерОтчетаПродажи КАК ВТ_НомерОтчетаПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_НомерацияОтчетовОПродажах.Документы КАК ИС_WB_НомерацияОтчетовОПродажахДокументы
	|		ПО (ВТ_НомерОтчетаПродажи.НомерОтчета = ИС_WB_НомерацияОтчетовОПродажахДокументы.Ссылка)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ИС_WB_НомерацияОтчетовОПродажахДокументы.Документ.Ссылка) = ТИП(Документ.реализацияТоваровУслуг)
	|	И ИС_WB_НомерацияОтчетовОПродажахДокументы.Документ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НомерОтчетаПродажи.Srid";
	
	Запрос.УстановитьПараметр("МассивSrid", ТаблицаРезультирующаяВозвраты.ВыгрузитьКолонку("Srid"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	РезультирующаяТЗ = Новый ТаблицаЗначений;
	РезультирующаяТЗ.Колонки.Добавить("Документ");
	РезультирующаяТЗ.Колонки.Добавить("Srid");
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = РезультирующаяТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Возврат РезультирующаяТЗ;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 11.03.2024 УА #71107	

//+ ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
Процедура СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25, МассивДляЗаполнения = Неопределено)
	
	Событие = ПолучитьИмяСобытия("СоздатьРеализации1С");
	
	Если Комиссия25 Тогда
		ДокументРеализация = Документы.ПередачаТоваровХранителю.СоздатьДокумент();	
	Иначе
		ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	КонецЕсли;
	
	Если Не МассивДляЗаполнения = Неопределено Тогда
		
		Попытка	
			
			Если Комиссия25 Тогда
				СтруктураЗаполнения = СозданиеНаОснованииУТВызовСервера.ПередачаТоваровХранителюПараметрыОткрытияФормы(МассивДляЗаполнения);
			Иначе
				СтруктураЗаполнения = СозданиеНаОснованииУТВызовСервера.РеализацияТоваровУслугПараметрыОткрытияФормы(МассивДляЗаполнения);
			КонецЕсли;
			
			Если СтруктураЗаполнения = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			ДокументРеализация.Заполнить(СтруктураЗаполнения.Основание); 
			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки; 
		
	Иначе
		
		Попытка
			ДокументРеализация.Заполнить(Выборка.Заказ); 
		Исключение
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 04.03.25 УА #95186
	Если ДокументРеализация.Товары.Количество() = 0 Тогда
		
		ДокументРеализация.ЗаказКлиента 	= Неопределено;
		ДокументРеализация.ПометкаУдаления 	= Истина;
		 
		Попытка
			ДокументРеализация.Записать(РежимЗаписиДокумента.Запись);			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
			
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 04.03.25 УА #95186
	
	ДокументРеализация.Дата = Выборка.Дата + ФукнциональныеОпции.КоличествоДнейКРеализации * 86400;
	ДокументРеализация.Комментарий = Выборка.Комментарий;
	
	Если Не Комиссия25 Тогда
		ДокументРеализация.СкидкиРассчитаны = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФукнциональныеОпции.Подразделение) Тогда  
		ДокументРеализация.Подразделение = ФукнциональныеОпции.Подразделение;
	КонецЕсли;
	
	ЗаписыватьДокумент = Ложь;
	
	Если ФукнциональныеОпции.ПроводитьРеализации Тогда
		
		Попытка
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписыватьДокумент = Истина;
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст); 
		КонецПопытки;
		
	Иначе
		ЗаписыватьДокумент = Истина;	
	КонецЕсли;
	
	Если ЗаписыватьДокумент Тогда	
		
		Попытка
			ДокументРеализация.Записать();			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595

//+ ИнфоСофт Власова И.С. 22.08.24 УА #61503
Функция ПроверитьЗаполнениеНастроекКомиссии(Профиль) Экспорт
	
	РезультатПроверки = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_Профили.Контрагент КАК Контрагент,
		|	ИС_WB_Профили.Партнер КАК Партнер,
		|	ИС_WB_Профили.Договор КАК Договор,
		|	ИС_WB_Профили.Соглашение КАК Соглашение,
		|	ИС_WB_Профили.Соглашение.ИспользуютсяДоговорыКонтрагентов КАК СоглашениеИспользуютсяДоговорыКонтрагентов,
		|	ИС_WB_Профили.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
		|ГДЕ
		|	ИС_WB_Профили.Ссылка = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ;
		
		МассивНезаполненныхНастроек = Новый Массив;
		
		Если Не ЗначениеЗаполнено(Выборка.Контрагент) Тогда 
			МассивНезаполненныхНастроек.Добавить(НСтр("ru = 'Контрагент'"));	
		КонецЕсли;
		
		ИспользоватьПартнеровИКонтрагентов = Константы.ИспользоватьПартнеровИКонтрагентов.Получить();
		
		Если ИспользоватьПартнеровИКонтрагентов И Не ЗначениеЗаполнено(Выборка.Партнер) Тогда
			МассивНезаполненныхНастроек.Добавить(НСтр("ru = 'Партнер'"));	
		КонецЕсли;
		
		ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
				
		Если ИспользоватьСоглашенияСКлиентами И Не ЗначениеЗаполнено(Выборка.Соглашение) Тогда
			МассивНезаполненныхНастроек.Добавить(НСтр("ru = 'Соглашение закупки'"));	
		КонецЕсли;
		
		ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами"); 
		
		Если ИспользоватьДоговорыСКлиентами И 
			(Не ИспользоватьСоглашенияСКлиентами И Не ЗначениеЗаполнено(Выборка.Договор))
			Или (Не ЗначениеЗаполнено(Выборка.Договор) И ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Выборка.Соглашение) И Выборка.СоглашениеИспользуютсяДоговорыКонтрагентов) Тогда
		
		МассивНезаполненныхНастроек.Добавить(НСтр("ru = 'Договор'"));
			
		КонецЕсли;	
		
		Если МассивНезаполненныхНастроек.Количество() > 0 Тогда
			
			РезультатПроверки = Ложь;
			
			Для Каждого Настройка Из МассивНезаполненныхНастроек Цикл
				ИС_MP_Сервер.ПоказатьСообщениеОтсутствияЗаполненияНастройки(Настройка, Профиль, Маркетплейс); 
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатПроверки;	
	
КонецФункции //- ИнфоСофт Власова И.С. 22.08.24 УА #61503

//+ ИнфоСофт Власова И.С. 22.08.24 УА #61503
Функция ПроверитьЗаполнениеНастроекЗакупки(Профиль) Экспорт
	
	РезультатПроверки = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_Профили.Контрагент КАК Контрагент,
		|	ИС_WB_Профили.Партнер КАК Партнер,
		|	ИС_WB_Профили.ДоговорЗакупки КАК ДоговорЗакупки,
		|	ИС_WB_Профили.СоглашениеЗакупки КАК СоглашениеЗакупки,
		|	ИС_WB_Профили.СоглашениеЗакупки.ИспользуютсяДоговорыКонтрагентов КАК СоглашениеИспользуютсяДоговорыКонтрагентов,
		|	ИС_WB_Профили.РаспределятьРасходыПоАртикулам КАК РаспределятьРасходыПоАртикулам,
		|	ИС_WB_Профили.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
		|ГДЕ
		|	ИС_WB_Профили.Ссылка = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ;
		
		МассивНезаполненныхНастроек = Новый Массив;
		
		Если Не ЗначениеЗаполнено(Выборка.Контрагент) Тогда 
			МассивНезаполненныхНастроек.Добавить(НСтр("ru = 'Контрагент'"));	
		КонецЕсли;
		
		ИспользоватьПартнеровИКонтрагентов = Константы.ИспользоватьПартнеровИКонтрагентов.Получить();
		
		Если ИспользоватьПартнеровИКонтрагентов И Не ЗначениеЗаполнено(Выборка.Партнер) Тогда
			МассивНезаполненныхНастроек.Добавить(НСтр("ru = 'Партнер'"));	
		КонецЕсли;
		
		//+ ИнфоСофт Заварин К.В. 04.10.24 УА #85085
		//ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
		ИспользоватьСоглашенияСПоставщиками = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСПоставщиками");
		//- ИнфоСофт Заварин К.В. 04.10.24 УА #85085 
		
		Если ИспользоватьСоглашенияСПоставщиками И Не ЗначениеЗаполнено(Выборка.СоглашениеЗакупки) Тогда
			МассивНезаполненныхНастроек.Добавить(НСтр("ru = 'Соглашение закупки'"));	
		КонецЕсли;
		
		//+ ИнфоСофт Заварин К.В. 04.10.24 УА #85085
		//ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами"); 
		ИспользоватьДоговорыСПоставщиками = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками");		
		//- ИнфоСофт Заварин К.В. 04.10.24 УА #85085		 
		
		//+ ИнфоСофт Заварин К.В. 04.10.24 УА #85085
		//Если ИспользоватьДоговорыСКлиентами И 
		//	(Не ИспользоватьСоглашенияСКлиентами И Не ЗначениеЗаполнено(Выборка.Договор))
		//	Или (Не ЗначениеЗаполнено(Выборка.Договор) И ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Выборка.Соглашение) И Выборка.СоглашениеИспользуютсяДоговорыКонтрагентов) Тогда
		Если ИспользоватьДоговорыСПоставщиками И 
			(Не ИспользоватьСоглашенияСПоставщиками И Не ЗначениеЗаполнено(Выборка.ДоговорЗакупки))
			Или (Не ЗначениеЗаполнено(Выборка.ДоговорЗакупки) И ИспользоватьСоглашенияСПоставщиками 
			И ЗначениеЗаполнено(Выборка.СоглашениеЗакупки) И Выборка.СоглашениеИспользуютсяДоговорыКонтрагентов) Тогда
		//- ИнфоСофт Заварин К.В. 04.10.24 УА #85085
			
			МассивНезаполненныхНастроек.Добавить(НСтр("ru = 'Договор закупки'"));
			
		КонецЕсли;
		
		ИспользоватьПодразделения = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
		
		Если ИспользоватьПодразделения И Выборка.РаспределятьРасходыПоАртикулам И Не ЗначениеЗаполнено(Выборка.Подразделение) Тогда
			МассивНезаполненныхНастроек.Добавить(НСтр("ru = 'Подразделение'"));
		КонецЕсли;	
		
		Если МассивНезаполненныхНастроек.Количество() > 0 Тогда
			
			РезультатПроверки = Ложь;
			
			Для Каждого Настройка Из МассивНезаполненныхНастроек Цикл
				ИС_MP_Сервер.ПоказатьСообщениеОтсутствияЗаполненияНастройки(Настройка, Профиль, Маркетплейс); 
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатПроверки;	
	
КонецФункции //- ИнфоСофт Власова И.С. 22.08.24 УА #61503

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
Функция СоздатьИзменитьКорректировкуЗадолженности(Профиль, ДанныеДокумента, ДопПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ДокументСсылка") Тогда
		ДокументОбъект = ДопПараметры.ДокументСсылка.ПолучитьОбъект();
	Иначе	
		ДокументОбъект = Документы.КорректировкаЗадолженности.СоздатьДокумент();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеДокумента);
	
	ДокументОбъект.Автор = Пользователи.АвторизованныйПользователь();
	
	ДокументОбъект.Задолженность.Очистить();
	
	ПорядокРасчетов = ВзаиморасчетыСервер.ПорядокРасчетов(Ложь, , ДанныеДокумента.Соглашение, ДанныеДокумента.Договор);
	
	Валюты = ПолучитьВалютыЗаполненияДокумента(ДанныеДокумента.Организация, ДанныеДокумента.Договор, ДанныеДокумента.Соглашение);
	
	Валюта = Валюты.Валюта;
	ВалютаВзаиморасчетов = Валюты.ВалютаВзаиморасчетов;		
	
	Для Каждого Строка Из ДанныеДокумента.Задолженность Цикл
		
		НоваяСтрока = ДокументОбъект.Задолженность.Добавить();
		
		НоваяСтрока.ТипРасчетов          = Строка.ТипРасчетов;
		НоваяСтрока.Партнер              = Строка.Партнер;
		НоваяСтрока.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
		НоваяСтрока.Сумма                = Строка.Сумма;
		
		Если ЗначениеЗаполнено(ДокументОбъект.Претензия) Тогда
			
			НоваяСтрока.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ДокументОбъект.Претензия);
			Продолжить;
			
		КонецЕсли;
		
		Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным 
			И ДопПараметры.Свойство("ДокументНакладная") Тогда
			
			НоваяСтрока.ОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(ДопПараметры.ДокументНакладная, ДанныеДокумента.Организация);
			
		Иначе
			НоваяСтрока.ОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(ДанныеДокумента.Договор, ДанныеДокумента.Организация);
		КонецЕсли;
		
	КонецЦикла;
	
	ДокументОбъект.ДоходыРасходыАктивыПассивы.Очистить();
	
	Для Каждого Строка Из ДанныеДокумента.ДоходыРасходыАктивыПассивы Цикл
		
		НоваяСтрока = ДокументОбъект.ДоходыРасходыАктивыПассивы.Добавить();
		
		НоваяСтрока.Статья        = Строка.Статья;
		НоваяСтрока.Подразделение = Строка.Подразделение;
		НоваяСтрока.Валюта        = Валюта;
		НоваяСтрока.Сумма         = Строка.Сумма;
		
		Если ЗначениеЗаполнено(Строка.Статья) Тогда
			
			РеквизитыСтатьи = ДоходыИРасходыВызовСервераПовтИсп.ЗначенияРеквизитовСтатьи(Строка.Статья);
			
			Аналитика = ДоходыИРасходыКлиентСервер.ПолучитьАналитикуПоУмолчанию(РеквизитыСтатьи, ДокументОбъект.Ссылка);
			
			ТипЗначенияСтатьи = ТипЗнч(НоваяСтрока.Статья);
			
			Если ТипЗначенияСтатьи = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов") Тогда
				НоваяСтрока.АналитикаРасходов        = Аналитика;
			ИначеЕсли ТипЗначенияСтатьи = Тип("ПланВидовХарактеристикСсылка.СтатьиДоходов") Тогда
				НоваяСтрока.АналитикаДоходов         = Аналитика;
			Иначе
				НоваяСтрока.АналитикаАктивовПассивов = Аналитика;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка	
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);	
	Исключение
		
		ТекстСообщения = "Не удалось провести документ корректировки задолженности.";
		ТекстОшибки    = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1|%2", ТекстСообщения, ТекстОшибки));
		
		Попытка	
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);	
		Исключение
			
			ТекстСообщения = "Не удалось записать документ корректировки задолженности.";
			ТекстОшибки    = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1|%2", ТекстСообщения, ТекстОшибки));
			
			Возврат Неопределено;
			
		КонецПопытки;
		
	КонецПопытки;
	
	Возврат ДокументОбъект.Ссылка; 
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
Функция ПолучитьСтруктуруКорректировкиЗадолженности() Экспорт

	СтруктураДокумента = Новый Структура;
	
	СтруктураДокумента.Вставить("Дата");
	СтруктураДокумента.Вставить("Комментарий");
	СтруктураДокумента.Вставить("Организация");
	СтруктураДокумента.Вставить("Контрагент");
	СтруктураДокумента.Вставить("Договор");
	СтруктураДокумента.Вставить("Соглашение");
	СтруктураДокумента.Вставить("ХозяйственнаяОперация");
	СтруктураДокумента.Вставить("КорреспонденцияСДоходами");
	
	ЗадолженностьТЧ = Новый ТаблицаЗначений;
	ЗадолженностьТЧ.Колонки.Добавить("ТипРасчетов");
	ЗадолженностьТЧ.Колонки.Добавить("Партнер");
	ЗадолженностьТЧ.Колонки.Добавить("ВалютаВзаиморасчетов");
	ЗадолженностьТЧ.Колонки.Добавить("Сумма");
	
	СтруктураДокумента.Вставить("Задолженность", ЗадолженностьТЧ);
	
	ДоходыРасходыАктивыПассивыТЧ = Новый ТаблицаЗначений;
	ДоходыРасходыАктивыПассивыТЧ.Колонки.Добавить("Статья");
	ДоходыРасходыАктивыПассивыТЧ.Колонки.Добавить("Подразделение");
	ДоходыРасходыАктивыПассивыТЧ.Колонки.Добавить("Валюта");
	ДоходыРасходыАктивыПассивыТЧ.Колонки.Добавить("Сумма");
	
	СтруктураДокумента.Вставить("ДоходыРасходыАктивыПассивы", ДоходыРасходыАктивыПассивыТЧ);
	
	Возврат СтруктураДокумента;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
Функция ПолучитьТипРасчетовСПартнерамиРасчетыСКлиентом() Экспорт
	
	Возврат Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Власова И.С. 08.04.25 УА #78061
Функция ПересчитатьВСуммуВзаиморасчетов(Сумма, Валюта, Дата) Экспорт
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Возврат РаботаСКурсамиВалют.ПересчитатьВВалюту(Сумма,
				Валюта,
				ВалютаРегламентированногоУчета,
				Дата);
				
КонецФункции //- ИнфоСофт Власова И.С. 08.04.25 УА #78061

//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
Функция СоздатьИзменитьОприходованиеИзлишковТоваров(Профиль, ДанныеДокумента, ДопПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ДокументСсылка") Тогда
		ДокументОбъект = ДопПараметры.ДокументСсылка.ПолучитьОбъект();
	Иначе	
		ДокументОбъект = Документы.ОприходованиеИзлишковТоваров.СоздатьДокумент();
	КонецЕсли;
	
	ДокументОбъект.Дата          = ДанныеДокумента.Дата;
	ДокументОбъект.Комментарий   = ДанныеДокумента.Комментарий;
	ДокументОбъект.Организация   = ДанныеДокумента.Организация;
	ДокументОбъект.Подразделение = ДанныеДокумента.Подразделение;
	ДокументОбъект.Склад         = ДанныеДокумента.Склад;
	ДокументОбъект.СтатьяДоходов = ДанныеДокумента.СтатьяДоходов;
	ДокументОбъект.Комментарий   = ДанныеДокумента.Комментарий;
	ДокументОбъект.Валюта        = Константы.ВалютаРегламентированногоУчета.Получить();
	ДокументОбъект.Ответственный = Пользователи.АвторизованныйПользователь();
	ДокументОбъект.Автор         = ДокументОбъект.Ответственный;
	
	ДокументОбъект.АналитикаДоходов = ПланыВидовХарактеристик.СтатьиДоходов.ПолучитьАналитикуДоходовПоУмолчанию(ДокументОбъект.СтатьяДоходов, 
										ДанныеДокумента, ДанныеДокумента.Подразделение);
	
	ДокументОбъект.Товары.Очистить();
	
	Для Каждого Строка Из ДанныеДокумента.Товары Цикл
		
		Если Строка.ЭтоНабор Тогда
			
			ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Профиль, Строка.Номенклатура, Строка.Характеристика);	
					
	  		Для Каждого ЭлементНабора Из ТоварыНабора Цикл 
				
				НоваяСтрока = ДокументОбъект.Товары.Добавить();
				
				НоваяСтрока.Номенклатура   = ЭлементНабора.Номенклатура;
				НоваяСтрока.Характеристика = ЭлементНабора.Характеристика;
				НоваяСтрока.Количество     = ЭлементНабора.КоличествоУпаковок;
				НоваяСтрока.Цена           = ЭлементНабора.КомплектующиеЦена;
				НоваяСтрока.Сумма          = НоваяСтрока.Цена * НоваяСтрока.Количество;
	
			КонецЦикла;
			
		Иначе	
			
			НоваяСтрока = ДокументОбъект.Товары.Добавить();
			
			НоваяСтрока.Номенклатура   = Строка.Номенклатура;
			НоваяСтрока.Характеристика = Строка.Характеристика;
			НоваяСтрока.Количество     = 1;
			НоваяСтрока.Цена           = Строка.Цена;
			НоваяСтрока.Сумма          = НоваяСтрока.Цена * НоваяСтрока.Количество;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Попытка	
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);	
	Исключение
		
		ТекстСообщения = "Не удалось провести оприходование излишков товаров.";
		ТекстОшибки    = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1|%2", ТекстСообщения, ТекстОшибки));
		
		Попытка	
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);	
		Исключение
			
			ТекстСообщения = "Не удалось записать оприходование излишков товаров.";
			ТекстОшибки    = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1|%2", ТекстСообщения, ТекстОшибки));
			
			Возврат Неопределено;
			
		КонецПопытки;
		
	КонецПопытки;
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #83865

//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
Функция ПолучитьСтруктуруОприходованияИзлишковТоваров() Экспорт

	СтруктураДокумента = Новый Структура;
	
	СтруктураДокумента.Вставить("Дата");
	СтруктураДокумента.Вставить("Организация");
	СтруктураДокумента.Вставить("Договор");
	СтруктураДокумента.Вставить("СтатьяДоходов");
	СтруктураДокумента.Вставить("Комментарий");
	СтруктураДокумента.Вставить("Склад");
	СтруктураДокумента.Вставить("Подразделение");
	
	ТоварыТЧ = Новый ТаблицаЗначений;
	ТоварыТЧ.Колонки.Добавить("Номенклатура");
	ТоварыТЧ.Колонки.Добавить("Характеристика");
	ТоварыТЧ.Колонки.Добавить("ЭтоНабор");
	ТоварыТЧ.Колонки.Добавить("Количество");
	ТоварыТЧ.Колонки.Добавить("Цена");
	
	СтруктураДокумента.Вставить("Товары", ТоварыТЧ);
	
	Возврат СтруктураДокумента;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #83865

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
Функция ПолучитьВалютыЗаполненияДокумента(Организация, Договор, Соглашение) Экспорт
	
	Валюты = Новый Структура;
	
	Валюта               = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаВзаиморасчетов = Валюта;
	
	Если ЗначениеЗаполнено(Соглашение) Тогда 
		
		РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение, 
			"ИспользуютсяДоговорыКонтрагентов, Валюта, ВалютаВзаиморасчетов");
		
		Валюта = РеквизитыСоглашения.Валюта;
		
		Если РеквизитыСоглашения.ИспользуютсяДоговорыКонтрагентов Тогда	
			ВалютаВзаиморасчетов = Валюта;	
		Иначе		
			ВалютаВзаиморасчетов = РеквизитыСоглашения.ВалютаВзаиморасчетов;	
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Договор) Тогда		
		ВалютаВзаиморасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВалютаВзаиморасчетов");	
	КонецЕсли;
	
	Валюты.Вставить("Валюта",               Валюта);
	Валюты.Вставить("ВалютаВзаиморасчетов", ВалютаВзаиморасчетов);
	
	Возврат Валюты;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
Функция ПолучитьХозОперациюСписаниеДебиторскойЗадолженности() Экспорт	
	
	Возврат Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
Функция ПолучитьХозОперациюСписаниеКредиторскойЗадолженности() Экспорт
	
	Возврат Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
Функция ПолучитьТипРасчетовСПартнерамиРасчетыСПоставщиком() Экспорт
	
	Возврат Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #83865

//+ ИнфоСофт Сумин Д.В. 08.09.2023 УА #61973
Процедура ВыполнитьСозданиеРасходногоОрдера(ПараметрыНастроек)
	
	ПараметрыРасходногоОрдера = Новый Структура;
	//+ ИнфоСофт Сумин Д.В. 11.12.2023 #61973
	//Реализовано для ордерного склада, не для адресного 
	ПараметрыРасходногоОрдера.Вставить("Склад", ПараметрыНастроек.Заказ.Склад);
	ПараметрыРасходногоОрдера.Вставить("Помещение", Неопределено);
	ПараметрыРасходногоОрдера.Вставить("Получатель", ПараметрыНастроек.Заказ.Партнер);
	ПараметрыРасходногоОрдера.Вставить("ЗонаОтгрузки", Справочники.СкладскиеЯчейки.ПустаяСсылка()); 
	ПараметрыРасходногоОрдера.Вставить("ФоновоеЗадание", Ложь);
	//ПараметрыРасходногоОрдера.Вставить("Склад", ПараметрыНастроек.Заказ.Склад);
	//ПараметрыРасходногоОрдера.Вставить("Помещение", ПараметрыНастроек.СкладВБ.СкладскоеПомещение);
	//ПараметрыРасходногоОрдера.Вставить("Получатель", ПараметрыНастроек.Заказ.Партнер);
	//ПараметрыРасходногоОрдера.Вставить("ЗонаОтгрузки", ПараметрыНастроек.СкладВБ.СкладскаяЯчейкаОтгрузки); 
	//ПараметрыРасходногоОрдера.Вставить("ФоновоеЗадание", Истина);
	//- ИнфоСофт Сумин Д.В. 11.12.2023 #61973
	РаспоряженияНаОтгрузку = Новый Массив();
	РаспоряженияНаОтгрузку.Добавить(ПараметрыНастроек.Заказ);
	ПараметрыРасходногоОрдера.Вставить("РаспоряженияНаОтгрузку", РаспоряженияНаОтгрузку);
	ПараметрыРасходногоОрдера.Вставить("ЗаданиеНаПеревозку", Неопределено);
	
	РасходныйОрдерСтруктура = СкладыСервер.ПереоформитьРасходныеОрдера(ПараметрыРасходногоОрдера);	
	
	ВыполнитьИзменениеСтатусаРасходныхОрдеров(РасходныйОрдерСтруктура.ОформленныеОрдера, Перечисления.СтатусыРасходныхОрдеров.Отгружен, Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить);
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 08.09.2023 УА #61973

//+ ИнфоСофт Сумин Д.В. 08.09.2023 УА #61973
Процедура ВыполнитьИзменениеСтатусаРасходныхОрдеров(ОформленныеОрдеры, Статус, СтатусСтроки)  
		
	Для Каждого Строка Из ОформленныеОрдеры Цикл
		
		НачатьТранзакцию();
		
		Попытка
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("Документ.РасходныйОрдерНаТовары");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Строка.РасходныйОрдер);
			Блокировка.Заблокировать();
			
			РасходныйОрдерОбъект = Строка.РасходныйОрдер.ПолучитьОбъект(); // ДокументОбъект.РасходныйОрдерНаТовары
			РасходныйОрдерОбъект.ОтгрузкаПоЗаданиюНаПеревозку = Ложь;
			РасходныйОрдерОбъект.Статус = Статус;   
			
			Для Каждого Элемент Из РасходныйОрдерОбъект.ОтгружаемыеТовары Цикл
				Элемент.Действие = СтатусСтроки;		
			КонецЦикла;
			
			РасходныйОрдерОбъект.ДатаОтгрузки = НачалоДня(ТекущаяДатаСеанса());
			РасходныйОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать %Документ% фоновым заданием изменения статуса по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Строка.РасходныйОрдер);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Документы.РасходныйОрдерНаТовары,
			Строка.РасходныйОрдер,
			ТекстСообщения);
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 08.09.2023 УА #61973

//+ ИнфоСофт Ивонин К.А. 21.02.23 УА #53535
Функция ПроверитьОстаткиТваровНаСервере(ТоварыЗаказаТЗ, Склад, Организация) Экспорт  
	
	КоличестваХватает = Ложь;
	
	ДанныеПроверки = Новый Структура;
	ДанныеПроверки.Вставить("КоличестваХватает", КоличестваХватает);
	ДанныеПроверки.Вставить("Номенклатура", Неопределено);
	ДанныеПроверки.Вставить("Характеристика", Неопределено);	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК НоменклатураВЗаказе,
	|	Товары.Характеристика КАК ХарактеристикаВЗаказе,
	|	Товары.Количество КАК КоличествоВЗаказе
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) КАК ВНаличииОстаток,
	|	ВТ_Товары.НоменклатураВЗаказе КАК НоменклатураВЗаказе,
	|	ВТ_Товары.ХарактеристикаВЗаказе КАК ХарактеристикаВЗаказе,
	|	ВТ_Товары.КоличествоВЗаказе КАК КоличествоВЗаказе,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.КоличествоВЗаказе > ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК КоличестваХватает
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО ВТ_Товары.НоменклатураВЗаказе = РаспределениеЗапасов.Номенклатура
	|			И ВТ_Товары.ХарактеристикаВЗаказе = РаспределениеЗапасов.Характеристика
	|ГДЕ
	|	РаспределениеЗапасов.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТ_Товары.НоменклатураВЗаказе КАК НоменклатураВЗаказе
	|			ИЗ
	|				ВТ_Товары КАК ВТ_Товары)
	|	И РаспределениеЗапасов.Склад = &Склад
	|	И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|	И РаспределениеЗапасов.Характеристика В
	|			(ВЫБРАТЬ
	|				ВТ_Товары.ХарактеристикаВЗаказе КАК ХарактеристикаВЗаказе
	|			ИЗ
	|				ВТ_Товары КАК ВТ_Товары)
	|";
	
	Запрос.УстановитьПараметр("Товары", ТоварыЗаказаТЗ);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		ДанныеПроверки.Вставить("КоличестваХватает", КоличестваХватает); 		
		Возврат ДанныеПроверки;	
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	КоличестваХватает = Истина;
	
	Пока Выборка.Следующий() Цикл 
		
		Если Не Выборка.КоличестваХватает Тогда
			КоличестваХватает = Ложь;
			ДанныеПроверки.Вставить("Номенклатура", Выборка.НоменклатураВЗаказе);
			ДанныеПроверки.Вставить("Характеристика", Выборка.ХарактеристикаВЗаказе);
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеПроверки.Вставить("КоличестваХватает", КоличестваХватает);  
	
	Возврат ДанныеПроверки;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.02.23 УА #53535

//+ ИнфоСофт Сумин Д.В. 20.04.23 УА #57217
Функция СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, Заказ = Неопределено)
	
	Событие = ПолучитьИмяСобытия("СоздатьИлиДополнитьЗаказУТ11_5");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер,
	|	ИС_WB_СборочноеЗадание.Дата КАК Дата,
	|	ИС_WB_СборочноеЗадание.convertedPrice КАК convertedPrice,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB КАК НоменклатураWB,
	|	ИС_WB_СборочноеЗадание.РазмерWB КАК РазмерWB,
	|	ИС_WB_СборочноеЗадание.Склад КАК Склад,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ИС_WB_СоответствиеРазмеров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL 
	|			ТОГДА 1
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка.Числитель = 0
	|			ТОГДА 1 
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка = &ПустаяУпаковка
	|			ТОГДА 1
	|		ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL
	|		ТОГДА 1
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка = &ПустаяУпаковка
	|			ТОГДА 1
	|		ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	ИС_WB_СборочноеЗадание.Склад.Склад КАК СкладУТ,
	|	ИС_WB_СборочноеЗадание.Склад.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_WB_СборочноеЗадание.Склад.АдресДоставки КАК АдресДоставки,
	|	ИС_WB_СборочноеЗадание.Склад.СпособДоставки КАК СпособДоставки,
	|	ИС_WB_СборочноеЗадание.Склад.ЗонаДоставки КАК ЗонаДоставки,
	|	ИС_WB_СборочноеЗадание.Склад.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_WB_СборочноеЗадание.Склад.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ИС_WB_СборочноеЗадание.Склад.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	ИС_WB_СборочноеЗадание.Склад.Грузополучатель КАК Грузополучатель,
	|	ИС_WB_СборочноеЗадание.Склад.Грузоотправитель КАК Грузоотправитель,
	|	ИС_WB_СборочноеЗадание.Склад.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	ИС_WB_СборочноеЗадание.Ссылка КАК СборочноеЗадание
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В (&Ссылка)"; 	
	//- ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005 
	
	Запрос.УстановитьПараметр("Ссылка", СборочноеЗадание);
	Запрос.УстановитьПараметр("ПустаяУпаковка", ИС_МП_СерверЛокализация.ПустаяСсылкаУпаковка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	 
	Если Выборка.СкладУТ = Null Тогда
		ОбщегоНазначения.СообщитьПользователю("В личном кабинете Wildberries были созданы новые склады. Необходимо выполнить их загрузку.");
		Возврат Документы.ЗаказКлиента.ПустаяСсылка();	
	КонецЕсли;	
	
	Если Выборка.Номенклатура = NULL Тогда
		ОбщегоНазначения.СообщитьПользователю("Отсутствует сопоставление");
		Возврат Документы.ЗаказКлиента.ПустаяСсылка();
	КонецЕсли;
    
	//+ ИнфоСофт Сумин Д.В. 05.05.23 УА #58412
	Если Заказ = Неопределено Или Заказ = Документы.ЗаказКлиента.ПустаяСсылка() Тогда
		//Если Заказ = Неопределено Тогда
		//- ИнфоСофт Сумин Д.В. 05.05.23 УА #58412
		НовыйДокумент = Документы.ЗаказКлиента.СоздатьДокумент();
	Иначе
		НовыйДокумент = Заказ.ПолучитьОбъект();
		//+ ИнфоСофт Стояк Ю.К. 01.08.2024 УА #80362		
		Попытка
			НовыйДокумент.Заблокировать();    
		Исключение   
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Создание заказа", Текст + " Заказ " + НовыйДокумент.Ссылка);
			Возврат Неопределено;
		КонецПопытки;                               
		//- ИнфоСофт Стояк Ю.К. 01.08.2024 УА #80362		
	КонецЕсли;
	
	ГруппаСкладов = Выборка.ОбщаяГруппаСкладов;	
	Организация = ФукнциональныеОпции.Организация; 
	Партнер = ФукнциональныеОпции.Партнер; 
	Соглашение = ФукнциональныеОпции.Соглашение;
	Контрагент = ФукнциональныеОпции.Контрагент;
	Договор = ФукнциональныеОпции.Договор;
	
	ПродажаОблагаетсяНДС = ПолучитьПрименениеНДСОрганизации(Организация);
		
	Если Заказ = Неопределено Тогда					
		
		Если ФукнциональныеОпции.РежимСозданияЗаказов = 2 Тогда
			НовыйДокумент.Дата = ТекущаяДатаСеанса();
		Иначе
			НовыйДокумент.Дата = Выборка.Дата;
		КонецЕсли;
		
		//НовыйДокумент.Заполнить(ФукнциональныеОпции.Партнер);
				
		НовыйДокумент.Организация = Организация;
		НовыйДокумент.Подразделение = ФукнциональныеОпции.Подразделение; 
		
		НовыйДокумент.Партнер = Партнер;
		НовыйДокумент.Контрагент = Контрагент;      
		
		НовыйДокумент.НеОтгружатьЧастями = Ложь;
		//+ ИнфоСофт Сумин Д.В. 21.11.2023 УА #61641
		ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
		
		Если ИспользоватьСоглашенияСКлиентами Тогда
			НовыйДокумент.ПорядокРасчетов = Соглашение.ПорядокРасчетов;
			НовыйДокумент.Менеджер = Соглашение.Менеджер;
			//+ ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
			Если ЗначениеЗаполнено(Соглашение.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Соглашение.НаправлениеДеятельности;            
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
		Иначе
			НовыйДокумент.Менеджер = Договор.Менеджер;
			//+ ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
			Если ЗначениеЗаполнено(Договор.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Договор.НаправлениеДеятельности;            
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
		КонецЕсли; 
		
		НовыйДокумент.Договор = Договор;
		НовыйДокумент.Соглашение = Соглашение;
		//Если Соглашение.ИспользуютсяДоговорыКонтрагентов Тогда
		//	НовыйДокумент.Договор = Договор;
		//	НовыйДокумент.Соглашение = Соглашение;
		//	НовыйДокумент.Менеджер = НовыйДокумент.Договор.Менеджер;
		//Иначе
		//	НовыйДокумент.Соглашение = Соглашение;
		//	НовыйДокумент.ПорядокРасчетов = Соглашение.ПорядокРасчетов;
		//	НовыйДокумент.Менеджер = НовыйДокумент.Соглашение.Менеджер;
		//КонецЕсли;	 
		//- ИнфоСофт Сумин Д.В. 21.11.2023 УА #61641
		НовыйДокумент.Статус = ФукнциональныеОпции.СтатусЗаказаКлиента; 
		НовыйДокумент.Приоритет = ФукнциональныеОпции.ПриоритетЗаказа;
		
		НовыйДокумент.ЦенаВключаетНДС = Соглашение.ЦенаВключаетНДС;
		
		Если ЗначениеЗаполнено(Соглашение.Валюта) Тогда
			НовыйДокумент.Валюта = Соглашение.Валюта;
		ИначеЕсли ЗначениеЗаполнено(Договор.ВалютаВзаиморасчетов) Тогда
			НовыйДокумент.Валюта = Договор.ВалютаВзаиморасчетов;
		Иначе
			НовыйДокумент.Валюта = Справочники.Валюты.НайтиПоКоду("643");
		КонецЕсли;
		
		//+ ИнфоСофт Стояк Ю.К. 28.09.2023 УА #61974		
		Если ЗначениеЗаполнено(Договор) Тогда
			НовыйДокумент.ХозяйственнаяОперация = Договор.ХозяйственнаяОперация;	
		ИначеЕсли ЗначениеЗаполнено(Соглашение) Тогда                                                                       
			НовыйДокумент.ХозяйственнаяОперация = Соглашение.ХозяйственнаяОперация;	
		КонецЕсли;	
		//- ИнфоСофт Стояк Ю.К. 28.09.2023 УА #61974
		//НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;	
		
		//+ ИнфоСофт Заварин К.В. 05.12.24 УА #79415 
		Если ЗначениеЗаполнено(Соглашение) И Не Соглашение.ИспользуютсяДоговорыКонтрагентов Тогда 
			
			Если ЗначениеЗаполнено(Соглашение.ГруппаФинансовогоУчета) Тогда
				НовыйДокумент.ГруппаФинансовогоУчета 			= Соглашение.ГруппаФинансовогоУчета;            
			КонецЕсли;
			Если ЗначениеЗаполнено(Соглашение.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Соглашение.НаправлениеДеятельности;            
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Договор) Тогда 
			
			Если ЗначениеЗаполнено(Договор.ГруппаФинансовогоУчета) Тогда
				НовыйДокумент.ГруппаФинансовогоУчета 			= Договор.ГруппаФинансовогоУчета;            
			КонецЕсли;
			Если ЗначениеЗаполнено(Договор.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Договор.НаправлениеДеятельности;            
			КонецЕсли;
	
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 05.12.24 УА #79415
		
	    Если ФукнциональныеОпции.РежимСозданияЗаказов = 0 Тогда
	    	НовыйДокумент.Комментарий = "Создан на основание заказа WB "; 
	    Иначе
	    	НовыйДокумент.Комментарий = "Создан на основание заказов WB ";
	    КонецЕсли;
	    
	    Если ПродажаОблагаетсяНДС = Неопределено Тогда
	    	ВызватьИсключение("Не заполнена учетная политика организации");
	    КонецЕсли;
	    
		Если ПродажаОблагаетсяНДС Тогда
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;			
		Иначе
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Выборка.СпособДоставки) Тогда
			НовыйДокумент.СпособДоставки = Выборка.СпособДоставки; 
		Иначе
			НовыйДокумент.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;	
		КонецЕсли;
		
		НовыйДокумент.ЗонаДоставки = Выборка.ЗонаДоставки;
		
		Если ЗначениеЗаполнено(Выборка.АдресДоставки) Тогда
			НовыйДокумент.АдресДоставки = Выборка.АдресДоставки;
			НовыйДокумент.АдресДоставкиЗначение = Выборка.АдресДоставкиЗначение;
			НовыйДокумент.АдресДоставкиЗначенияПолей = Выборка.АдресДоставкиЗначенияПолей;
		КонецЕсли;   
		
		Если ЗначениеЗаполнено(Выборка.Грузополучатель) Тогда 
			НовыйДокумент.Грузополучатель = Выборка.Грузополучатель;		
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Выборка.Грузоотправитель) Тогда
			НовыйДокумент.Грузоотправитель = Выборка.Грузоотправитель;	
		КонецЕсли;
				
		Если ЗначениеЗаполнено(Выборка.ПеревозчикПартнер) Тогда
			НовыйДокумент.ПеревозчикПартнер = Выборка.ПеревозчикПартнер;	
		КонецЕсли;
		
		//+ ИнфоСофт Сумин Д.В. 21.11.2023 УА #61641
		Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Соглашение) Тогда 
			НовыйДокумент.ЗаполнитьУсловияПродажПоСоглашению();	
		КонецЕсли;
		//НовыйДокумент.ЗаполнитьУсловияПродажПоСоглашению();
		//- ИнфоСофт Сумин Д.В. 21.11.2023 УА #61641
		
		//+ ИнфоСофт Заварин К.В. 09.01.25 УА #90561
		Если ПродажаОблагаетсяНДС Тогда
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;			
		Иначе
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 09.01.25 УА #90561
		
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 05.12.24 УА #88585
	Отбор = Новый Структура;
	
	Отбор.Вставить("Дата", НовыйДокумент.Дата);
	Отбор.Вставить("Организация", Организация);
	ТЗОтветственныеЛицаОрг = ОтветственныеЛицаСервер.ПолучитьТаблицуОтветственныхЛицПоОтбору(Отбор);
	
	НовыйДокумент.Руководитель = "";
	НовыйДокумент.ГлавныйБухгалтер = "";
	
	Для Каждого Результат Из ТЗОтветственныеЛицаОрг Цикл
		
		Если Строка(Результат.ОтветственноеЛицо) = "Руководитель" Тогда
			НовыйДокумент.Руководитель = Результат.Ссылка;
		ИначеЕсли Строка(Результат.ОтветственноеЛицо) = "Главный бухгалтер" Тогда
			НовыйДокумент.ГлавныйБухгалтер = Результат.Ссылка;
		КонецЕсли;		
	КонецЦикла;
    //- ИнфоСофт Заварин К.В. 05.12.24 УА #88585
	
	//+ ИнфоСофт Заварин К.В. 12.12.24 УА #89604
	Если ЗначениеЗаполнено(Договор) Тогда
		НовыйДокумент.БанковскийСчет = "";
		НовыйДокумент.БанковскийСчет = Договор.БанковскийСчет;		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 12.12.24 УА #89604
	
	//+ ИнфоСофт Тюменцев А.А. 26.07.23 УА #60918
	НомерЭтикетки = ИС_WB_Сервер.ПолучитьНомерЭтикеткиДляСборочногоЗадания(СборочноеЗадание);
	//- ИнфоСофт Тюменцев А.А. 26.07.23 УА #60918
    Номер = СтрЗаменить(Выборка.Номер, Символы.НПП, ""); 
	НовыйДокумент.Комментарий = СтрШаблон("%1%2%3; ", НовыйДокумент.Комментарий, Номер, НомерЭтикетки);	
	
	//+ ИнфоСофт Сумин Д.В. 16.05.23 УА #58629 
	НовыйДокумент.НомерПоДаннымКлиента = Номер;
	НовыйДокумент.ДатаПоДаннымКлиента = НовыйДокумент.Дата;
	//- ИнфоСофт Сумин Д.В. 16.05.23 УА #58629

	Если Выборка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
		ЭтоНабор = Истина;
	Иначе 
		ЭтоНабор = Ложь;
	КонецЕсли;
	
	ТоварыЗаказа = Новый ТаблицаЗначений;
	ТоварыЗаказа.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТоварыЗаказа.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
	ТоварыЗаказа.Колонки.Добавить("Упаковка");
	//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
	
	ТоварыЗаказа.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10, 0)));
	ТоварыЗаказа.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	ТоварыЗаказа.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2))); 
	
	СтрокаТовары = ТоварыЗаказа.Добавить();
	СтрокаТовары.Номенклатура = Выборка.Номенклатура;
	СтрокаТовары.Характеристика = Выборка.Характеристика;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
	СтрокаТовары.Упаковка = Выборка.Упаковка;      
	//- ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
	
	СтрокаТовары.Количество = 1;
	СтрокаТовары.Цена = Выборка.convertedPrice;
	СтрокаТовары.Сумма = Выборка.convertedPrice;
		
	Если ЭтоНабор Тогда
		
		ТоварыЗаказаТЗ = ПолучитьТаблицуТоваровНабора(ТоварыЗаказа);
		
		МассивКоэфф = РассчитатьДолюСтоимости(ТоварыЗаказаТЗ, ФукнциональныеОпции.ВидЦены, НовыйДокумент.Дата);
		Если ТоварыЗаказаТЗ[0].ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям Тогда				
			СуммаПродажиПриДолях = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТоварыЗаказаТЗ[0].Сумма, ТоварыЗаказаТЗ.ВыгрузитьКолонку("ДоляСтоимости"));
		ИначеЕсли МассивКоэфф <> Неопределено Тогда
			СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТоварыЗаказаТЗ[0].Сумма, МассивКоэфф);
			//+ ИнфоСофт Стояк Ю.К. 12.10.2023 УА #64691
		Иначе
			
			МассивКоэфф = Новый Массив;
			
			Для Каждого Элемент Из ТоварыЗаказаТЗ Цикл				
				МассивКоэфф.Добавить(Элемент.Количество);			
			КонецЦикла;
			
			СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТоварыЗаказаТЗ[0].Сумма, МассивКоэфф);
			//- ИнфоСофт Стояк Ю.К. 12.10.2023 УА #64691
		КонецЕсли;                                  
		
	Иначе 
		ТоварыЗаказаТЗ = ТоварыЗаказа;
	КонецЕсли;       
	
	//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	Назначения = Новый Массив;
	
	Если Метаданные.Перечисления.Найти("ТипыОбъектовНазначений") <> Неопределено Тогда
		ЗапросНазначений = Новый Запрос;
		ЗапросНазначений.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
		|ИЗ
		|	Справочник.ИС_ВБ_Склады.НаправленияДеятельности КАК ИС_ВБ_СкладыНаправленияДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|		ПО ИС_ВБ_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности
		|			И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|ГДЕ
		|	ИС_ВБ_СкладыНаправленияДеятельности.Ссылка = &Ссылка
		|	И Назначения.ТипОбъектаНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовНазначений.НаправлениеДеятельности)";
		
		ЗапросНазначений.УстановитьПараметр("Ссылка", Выборка.Склад);
		
		РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
		
		Назначения = Новый Массив;
		
		ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
		
		Пока ВыборкаНазначения.Следующий() Цикл	
			Назначения.Добавить(ВыборкаНазначения.Назначение);
		КонецЦикла;  
		
	КонецЕсли;
	
	Если Назначения.Количество() = 0 Тогда		
		Назначения = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	
    Если ЗначениеЗаполнено(ГруппаСкладов) Тогда
	
		НовыйДокумент.Склад = ГруппаСкладов;
        //+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083		
		//РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, ГруппаСкладов);
		РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, ГруппаСкладов, Назначения);
		//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
		СтрокаРезультат = РезультатПроверки[0];
				
	    Если СтрокаРезультат.ОстатокВНаличии Тогда
	   		СкладСОстатком = СтрокаРезультат.Склад;
	   	Иначе 
	   		СкладСОстатком = Выборка.СкладУТ;
		КонецЕсли; 
		
		//+ ИнфоСофт Заварин К.В. 02.04.25 УА #97851
	ИначеЕсли Выборка.Склад.ИспользоватьОсновнойСкладВЗаказах Тогда
		
		Если ЗначениеЗаполнено(СборочноеЗадание.Склад.Склад) Тогда
			НовыйДокумент.Склад = СборочноеЗадание.Склад.Склад;
		Иначе
			НовыйДокумент.Склад = Выборка.Склад.ГруппаСкладов[0].Склад;
		КонецЕсли;
		
		СкладСОстатком = НовыйДокумент.Склад;
		
		РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, СкладСОстатком, Назначения);
		//- ИнфоСофт Заварин К.В. 02.04.25 УА #97851
		
	ИначеЕсли Выборка.ВыгружатьОстаткиИзГруппыСкладов И ФукнциональныеОпции.РежимСозданияЗаказов <> 2 Тогда
		
		Склады = Выборка.Склад.ГруппаСкладов.ВыгрузитьКолонку("Склад");
		//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083		
		//РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, Склады);
		РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, Склады, Назначения);
		//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083		
		
		СкладСОстатком = Выборка.СкладУТ;
		
		Для Каждого Строка Из Выборка.Склад.ГруппаСкладов Цикл
			
			НайденныйСклад = РезультатПроверки.НайтиСтроки(Новый Структура("Склад", Строка.Склад));
			Если НайденныйСклад.Количество() > 0 Тогда
			
				Если НайденныйСклад[0].ОстатокВНаличии Тогда 
			    	СкладСОстатком = НайденныйСклад[0].Склад;
			    	Прервать;
			    КонецЕсли;
			    
			КонецЕсли;
			
		КонецЦикла;
		
		//Если РезультатПроверки.ОстатокВНаличии Тогда
		//	СкладСОстатком = РезультатПроверки.Склад;
		//Иначе 
		//	СкладСОстатком = Выборка.СкладУТ;
		//КонецЕсли;
	   	
	   	НовыйДокумент.Склад = СкладСОстатком;
		
	Иначе
		НовыйДокумент.Склад = Выборка.СкладУТ;
		СкладСОстатком = Выборка.СкладУТ;
		//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083		
		//РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, СкладСОстатком);
		РезультатПроверки = ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, СкладСОстатком, Назначения);
		//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083		
	
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 02.04.25 УА #97851
	//+ ИнфоСофт Заварин К.В. 31.01.25 УА #88005
	//Если Выборка.Склад.ИспользоватьОсновнойСкладВЗаказах Тогда
	//	Если ЗначениеЗаполнено(СборочноеЗадание.Склад.Склад) Тогда
	//		НовыйДокумент.Склад = СборочноеЗадание.Склад.Склад;
	//	Иначе
	//		НовыйДокумент.Склад = Выборка.Склад.ГруппаСкладов[0].Склад;
	//	КонецЕсли;	
	//КонецЕсли;			
	//- ИнфоСофт Заварин К.В. 30.01.25 УА #88005 
	//- ИнфоСофт Заварин К.В. 02.04.25 УА #97851
	
	//+ ИнфоСофт Стояк Ю.К. 24.03.2025 УА #96721 
	ПострочнаяОтгрузка = Константы.ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента.Получить();
	//- ИнфоСофт Стояк Ю.К. 24.03.2025 УА #96721
	
	Для Каждого Элемент Из ТоварыЗаказаТЗ Цикл
		
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
			
		Если ЭтоНабор Тогда

			НоваяСтрока.НоменклатураНабора = Элемент.Набор;
			
			//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			НоваяСтрока.ХарактеристикаНабора = Элемент.ХарактеристикаНабора;
			//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			
			Если Элемент.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям Тогда
				Элемент.Сумма = СуммаПродажиПриДолях[0];
				СуммаПродажиПриДолях.Удалить(0);	
			Иначе					
			
				Если МассивКоэфф = Неопределено Тогда
					ОбщегоНазначения.СообщитьПользователю("Проверьте наличие цены на набор/его комплектующие " + Элемент.Набор);
					Элемент.Сумма = Элемент.Сумма / Элемент.КоличествоОбщее * Элемент.Количество;
				Иначе
					Элемент.Сумма = СуммыПродажи[0];
					СуммыПродажи.Удалить(0);
				КонецЕсли;
			
			КонецЕсли;
			
			Элемент.Цена = Элемент.Сумма / Элемент.Количество;
		
		КонецЕсли;
		
		НоваяСтрока.Номенклатура = Элемент.Номенклатура;
		НоваяСтрока.Характеристика = Элемент.Характеристика;
		
		НоваяСтрока.Склад = СкладСОстатком;
		
		НоваяСтрока.КоличествоУпаковок = Элемент.Количество;
		НоваяСтрока.Количество = Элемент.Количество;
				
		//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
		СтрокаСОстатком = РезультатПроверки.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад", Элемент.Номенклатура, Элемент.Характеристика, СкладСОстатком));
		
		ЕстьОстаток = ?(СтрокаСОстатком.Количество() > 0, СтрокаСОстатком[0].ОстатокВНаличии, Ложь);
		
		//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
		ИспользованВариантОбеспеченияПриНехватке = Ложь;
		//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
		
		//+ ИнфоСофт Стояк Ю.К. 08.04.2025 УА #98321		
		//+ ИнфоСофт Стояк Ю.К. 24.03.2025 УА #96721
		//Если Не ПострочнаяОтгрузка Тогда
		Если Не ПострочнаяОтгрузка И НовыйДокумент.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению") Тогда
		//- ИнфоСофт Стояк Ю.К. 08.04.2025 УА #98321		
			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;				
		//+ ИнфоСофт Стояк Ю.К. 08.04.2025 УА #98321		
		ИначеЕсли Не ПострочнаяОтгрузка 
			И НовыйДокумент.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОтгрузке") Тогда
			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
		//+ ИнфоСофт Заварин К.В. 23.04.25 УА #99565
		ИначеЕсли Не ПострочнаяОтгрузка 
			И НовыйДокумент.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.НеСогласован") Тогда
			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
		//- ИнфоСофт Заварин К.В. 23.04.25 УА #99565
		//- ИнфоСофт Стояк Ю.К. 08.04.2025 УА #98321
		ИначеЕсли Не ЕстьОстаток И ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияПриНехватке)Тогда
		//- ИнфоСофт Стояк Ю.К. 24.03.2025 УА #96721
			
			НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспеченияПриНехватке;
			//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
			//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
			ИспользованВариантОбеспеченияПриНехватке = Истина;
			//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
		ИначеЕсли Не ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспечения)  Тогда
			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;	
		Иначе
			НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспечения;
		КонецЕсли;
				
		СуткиВСекундах = 86400;
		Если ФукнциональныеОпции.РассчитыватьДатыОтгрузки Тогда
			
			ВремяОтсчета = ФукнциональныеОпции.ВремяОтсчета - Дата(1, 1, 1);
			ВремяЗаказа = НовыйДокумент.Дата - НачалоДня(НовыйДокумент.Дата);
			
			Если ВремяОтсчета > ВремяЗаказа Тогда
				НоваяСтрока.ДатаОтгрузки = НовыйДокумент.Дата + СуткиВСекундах;		
			Иначе	
				НоваяСтрока.ДатаОтгрузки = НовыйДокумент.Дата + СуткиВСекундах * ФукнциональныеОпции.КоличествоДнейКОтгрузке;	
			КонецЕсли;	
		
		Иначе
			НоваяСтрока.ДатаОтгрузки = НовыйДокумент.Дата + СуткиВСекундах;	
		КонецЕсли;	
		
		//+ ИнфоСофт Сумин Д.В. 14.04.23 УА #57665 
		ДатаОтгрузки = НоваяСтрока.ДатаОтгрузки;
		//- ИнфоСофт Сумин Д.В. 14.04.23 УА #57665 
		
		Если ПродажаОблагаетсяНДС Тогда					
			
			НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС;
			
			НДС = ИС_MP_РаботаСЗаказами.ПолучитьПроцентНДС(Элемент.Номенклатура.СтавкаНДС);
			
			//+ ИнфоСофт Мурсалимов Д.Р. 24.01.25 УА #91921
			//Если НДС = 0 Или НДС = Неопределено Тогда
			//	НоваяСтрока.СуммаНДС = Элемент.Сумма;						
			//Иначе
			//	НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(Элемент.Сумма, НДС, Истина);						
			//КонецЕсли;                                     
			
			Если НДС = 0 Или НДС = Неопределено Тогда
				НоваяСтрока.СуммаНДС = 0;						
			Иначе
				НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(Элемент.Сумма, НДС, Истина);						
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 24.01.25 УА #91921
			
			НоваяСтрока.Сумма = Элемент.Сумма;
			НоваяСтрока.СуммаСНДС = Элемент.Сумма;
			
		Иначе 					
			
			НоваяСтрока.СуммаНДС = 0;
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
			НоваяСтрока.Сумма = Элемент.Сумма;
			НоваяСтрока.СуммаСНДС = Элемент.Сумма;
			
		КонецЕсли;	
		
		НоваяСтрока.Цена = Элемент.Цена;
		
		//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
		НоваяСтрока.Количество 	= Выборка.КоэффициентУпаковки * НоваяСтрока.Количество;
		НоваяСтрока.Упаковка 	= Элемент.Упаковка;
		//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
		
		//+ ИнфоСофт Сумин Д.В. 29.06.2023 УА #59111
		Если Соглашение.ОбеспечиватьЗаказыОбособленно тогда
			НоваяСтрока.Обособленно = Истина;	
		КонецЕсли; 
		//- ИнфоСофт Сумин Д.В. 29.06.2023 УА #59111
		
		//+ ИнфоСофт Заварин К.В. 22.11.24 УА #79380
		Если ФукнциональныеОпции.СоздатьЗаказНаСборку Тогда
			
			НовыйДокумент.Записать();
			ИС_MP_РаботаСЗаказами.ПроверкаНаличияКомплектов(Перечисления.ИС_МП_Маркетплейсы.ВБ, НовыйДокумент, Выборка.Склад,, НоваяСтрока);
			НовыйДокумент = НовыйДокумент.ПолучитьОбъект();
			
		КонецЕсли;                                     
		//- ИнфоСофт Заварин К.В. 22.11.24 УА #79380
		
	КонецЦикла;
	
	//+ ИнфоСофт Сумин Д.В. 22.01.2024 УА #69246
	Если Не ЗначениеЗаполнено(ФукнциональныеОпции.СтатусЗаказаКлиента) Тогда
		Если ФукнциональныеОпции.СтатусЗаказаКлиента = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Тогда
			Статус = "КОбеспечению";
		ИначеЕсли ФукнциональныеОпции.СтатусЗаказаКлиента = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда	
			Статус = "КОтгрузке";	
		Иначе
			Статус = "НеСогласован";
		КонецЕсли;
		НовыйДокумент.УстановитьСтатус(Статус, Неопределено);
	КонецЕсли;	
	//Если ФукнциональныеОпции.СтатусЗаказаКлиента = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Тогда
	//	Статус = "КОбеспечению";
	//ИначеЕсли ФукнциональныеОпции.СтатусЗаказаКлиента = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда	
	//	Статус = "КОтгрузке";	
	//ИначеЕсли ФукнциональныеОпции.СтатусЗаказаКлиента = Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда
	//	Статус = "НеСогласован";
	//КонецЕсли;
	//НовыйДокумент.УстановитьСтатус(Статус, Неопределено);
	//- ИнфоСофт Сумин Д.В. 22.01.2024 УА #69246 	
	
	//+ ИнфоСофт Сумин Д.В. 14.04.23 УА #57665 
	НовыйДокумент.ДатаОтгрузки = ДатаОтгрузки;
	//- ИнфоСофт Сумин Д.В. 14.04.23 УА #57665 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 15.11.23 УА #66213
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах") Тогда
		НовыйДокумент.СкидкиРассчитаны = Истина;
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 15.11.23 УА #66213
	
	//+ ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	//+ ИнфоСофт Мурсалимов Д.Р. 12.03.24 УА #67173
	//Если ФукнциональныеОпции.СоздатьЗаказНаСборку Тогда
	//	
	//	НовыйДокумент.Записать();
	//	ИС_MP_РаботаСЗаказами.ПроверкаНаличияКомплектов(Перечисления.ИС_МП_Маркетплейсы.ВБ, НовыйДокумент, Выборка.Склад);
	//	НовыйДокумент = НовыйДокумент.ПолучитьОбъект();
	//	
	//КонецЕсли;                                     
	//- ИнфоСофт Мурсалимов Д.Р. 12.03.24 УА #67173
	//- ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	
	ЗаписыватьДокумент = Ложь;
	Если ФукнциональныеОпции.ПроводитьЗаказы Тогда
		
		Попытка
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 
			
		Исключение
			ЗаписыватьДокумент = Истина;
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
		
	Иначе
		ЗаписыватьДокумент = Истина;	
	КонецЕсли;

	Если ЗаписыватьДокумент Тогда	
		
		Попытка
			
			НовыйДокумент.Записать();
						
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			Возврат Документы.ЗаказКлиента.ПустаяСсылка();
		КонецПопытки;
		
	КонецЕсли; 
	
	//+ ИнфоСофт Стояк Ю.К. 12.08.2024 УА #81509
	Если НовыйДокумент.Заблокирован() Тогда
		НовыйДокумент.Разблокировать();
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 12.08.2024 УА #81509
	
	//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
	Если ИспользованВариантОбеспеченияПриНехватке Тогда	
		Текст = СтрШаблон("%1 создан с использованием варианта обеспечения при нехватке товара", НовыйДокумент.Ссылка);		
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст, УровеньЖурналаРегистрации.Информация);
	КонецЕсли;
	//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
	
    Возврат НовыйДокумент.Ссылка;
    	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 20.02.23 УА #53535
Функция ПолучитьЗначенияСтатусовЗаказа() 
	
	РасширенныеВозможностиЗаказа = Константы.ИспользоватьРасширенныеВозможностиЗаказаКлиента.Получить();
	ИспользоватьПострочнуюОтгрузку = Константы.ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента.Получить(); 
	
	Статусы = Новый Структура;
	
	Если РасширенныеВозможностиЗаказа И ИспользоватьПострочнуюОтгрузку Тогда
	               
		Статусы.Вставить("СтатусЗаказа", Перечисления.СтатусыЗаказовКлиентов.КОбеспечению);	
		Статусы.Вставить("СтатусСтроки", Перечисления.ВариантыОбеспечения.Отгрузить);
		
	ИначеЕсли РасширенныеВозможностиЗаказа И Не ИспользоватьПострочнуюОтгрузку Тогда
	
		Статусы.Вставить("СтатусЗаказа", Перечисления.СтатусыЗаказовКлиентов.КОтгрузке);	
		Статусы.Вставить("СтатусСтроки", Перечисления.ВариантыОбеспечения.Отгрузить);
		
	Иначе             
	
		Статусы.Вставить("СтатусЗаказа", Перечисления.СтатусыЗаказовКлиентов.НеСогласован);	
		Статусы.Вставить("СтатусСтроки", Перечисления.ВариантыОбеспечения.НеТребуется)
		
	КонецЕсли;
			
	Возврат Статусы;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 21.02.23 УА #53535
Функция ОрганизацияПименяетУСН(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
	|ИЗ
	//+ ИнфоСофт Заварин К.В. 24.12.24 УА #90141
	//|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(, Организация = &Организация) КАК НастройкиСистемыНалогообложенияСрезПоследних";
	|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&Период, Организация = &Организация) КАК НастройкиСистемыНалогообложенияСрезПоследних";
	//- ИнфоСофт Заварин К.В. 24.12.24 УА #90141
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	//+ ИнфоСофт Заварин К.В. 24.12.24 УА #90141
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	//- ИнфоСофт Заварин К.В. 24.12.24 УА #90141
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Если Выборка.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.02.23 УА #53535

//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
//Добавлено Основание
//+ ИнфоСофт Сумин Д.В. 06.03.23 УА #55086
Функция СоздатьДокументЗаявкаНаВозврат(Профиль, Данные, ЗаголовокСтруктура, Основание = Неопределено) Экспорт 
//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746 

	ОблагаетсяНДС = ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация);
	
	Документ = Документы.ЗаявкаНаВозвратТоваровОтКлиента.СоздатьДокумент(); 
	Документ.Статус = Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату;
	Документ.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	
	//+ ИнфоСофт Мурсалимов Д.Р. 31.10.24 УА #86238                                                               
	Документ.Дата = ЗаголовокСтруктура.НачалоПериода;
	//Документ.Дата = ЗаголовокСтруктура.ДатаДокумента;
	//- ИнфоСофт Мурсалимов Д.Р. 31.10.24 УА #86238
	
	Документ.ЦенаВключаетНДС = Истина;
	Документ.Партнер = Профиль.Партнер;
	Документ.Контрагент = Профиль.Контрагент;
	Документ.Соглашение = Профиль.Соглашение;
	Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера; 
	Документ.Организация = Профиль.Организация;
	Документ.Договор = Профиль.Договор;
	Документ.Комментарий = ЗаголовокСтруктура.Комментарий;
	Документ.Склад = Профиль.Склад; 
	Документ.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	//+ ИнфоСофт Сумин Д.В. 22.03.2024 УА #70680	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	//+ ИнфоСофт Заварин К.В. 28.03.25 УА #97195
	УказатьСкладВСтроке = Ложь;
			
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ.ВозвращаемыеТовары,"Склад") Тогда
		УказатьСкладВСтроке = Истина;	
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 28.03.25 УА #97195
	
	ЗаполнитьВалюту = Истина;
	
	Если ИспользоватьСоглашенияСКлиентами Тогда 
		Валюта = Профиль.Соглашение.Валюта;
		ЗаполнитьВалюту = Ложь;
	КонецЕсли;
	
	Если ЗаполнитьВалюту И ИспользоватьДоговорыСКлиентами Тогда 
		Валюта = Профиль.Договор.ВалютаВзаиморасчетов;
	КонецЕсли;
	Документ.Валюта = Валюта;
	//Документ.Валюта = Профиль.Договор.ВалютаВзаиморасчетов;
	//- ИнфоСофт Сумин Д.В. 22.03.2024 УА #70680
	Документ.Подразделение = Профиль.Подразделение; 
	Документ.ДатаПоступления = ЗаголовокСтруктура.ДатаДокумента;  
	Документ.ПоступлениеОднойДатой = Истина;
	Документ.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	Документ.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	Документ.ОплатаВВалюте = Ложь; 
	
	//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
	Если Основание <> Неопределено Тогда
		Документ.ДокументРеализации = Основание.Ссылка;
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746
	
	СуммаДокумента = 0;
		
	Для Каждого Элемент Из Данные Цикл
		Если Элемент.ЭтоНабор Тогда
			
			//+ ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693
			//ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Элемент.Номенклатура, Элемент.Характеристика, Профиль);
			ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Профиль, Элемент.Номенклатура, Элемент.Характеристика);	
			//- ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693  
			
			Если ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Или
				ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам Тогда
				
				МассивКоэффициентов = РассчитатьКоэффициентыИзЦен(ТоварыНабора.ВыгрузитьКолонку("КомплектующиеЦена"), Элемент.Номенклатура);
			Иначе
				МассивКоэффициентов = ТоварыНабора.ВыгрузитьКолонку("ДоляСтоимости");
			КонецЕсли;
			
			СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Элемент.КПеречислениюПродавцуЗаРеализованныйТовар, МассивКоэффициентов);
			
			Для Каждого ЭлементНабора Из ТоварыНабора Цикл 
				
				НоваяСтрока = Документ.ВозвращаемыеТовары.Добавить();				
				//+ ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941				
				НоваяСтрока.НоменклатураНабора = ЭлементНабора.Набор;								
				НоваяСтрока.ХарактеристикаНабора = ЭлементНабора.ХарактеристикаНабора;
				//- ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941
				НоваяСтрока.Номенклатура = ЭлементНабора.Номенклатура;
				НоваяСтрока.Характеристика = ЭлементНабора.Характеристика;
				НоваяСтрока.Количество = ЭлементНабора.КоличествоУпаковок; 
				НоваяСтрока.КоличествоУпаковок = ЭлементНабора.КоличествоУпаковок; 
				НоваяСтрока.Цена = СуммыПродажи[0] / НоваяСтрока.Количество; 
				НоваяСтрока.Сумма = СуммыПродажи[0]; 
				//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046  
				НоваяСтрока.Упаковка = ЭлементНабора.Номенклатура.ЕдиницаИзмерения;
				//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046

				Если ОблагаетсяНДС Тогда
					НДС = ЭлементНабора.Номенклатура.СтавкаНДС.Ставка;
					НоваяСтрока.СтавкаНДС = ЭлементНабора.Номенклатура.СтавкаНДС; 
					Если НДС = Неопределено Или НДС = 0 Тогда 
						НоваяСтрока.СуммаНДС = 0;		
					Иначе
						НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
					КонецЕсли;	
				Иначе
					НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
				КонецЕсли;
				
				НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
				
				//+ ИнфоСофт Заварин К.В. 28.03.25 УА #97195
				Если УказатьСкладВСтроке Тогда
					НоваяСтрока.Склад = Документ.Склад;		
				КонецЕсли;
				//- ИнфоСофт Заварин К.В. 28.03.25 УА #97195
				
				СуммыПродажи.Удалить(0);
				
			КонецЦикла;	
			
		Иначе
			НоваяСтрока = Документ.ВозвращаемыеТовары.Добавить();
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;
			НоваяСтрока.Характеристика = Элемент.Характеристика;
			//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046 
			НоваяСтрока.Количество = Элемент.УпаковкаКоличество;
			//НоваяСтрока.Количество = Элемент.Количество;
			//- ИнфоСофт Сумин Д.В. 29.05.23 УА #59046
			НоваяСтрока.КоличествоУпаковок = Элемент.Количество;
			//+ ИнфоСофт Сумин Д.В. 22.04.2024 УА #74509
			НоваяСтрока.Сумма = Элемент.КПеречислениюПродавцуЗаРеализованныйТовар;
			НоваяСтрока.Цена  = НоваяСтрока.Сумма / НоваяСтрока.Количество;  
			//НоваяСтрока.Цена = Элемент.КПеречислениюПродавцуЗаРеализованныйТовар;  
			//НоваяСтрока.Сумма =  НоваяСтрока.Цена * Элемент.Количество; 
			//- ИнфоСофт Сумин Д.В. 22.04.2024 УА #74509 
			
			Если ОблагаетсяНДС Тогда
				НДС = Элемент.Номенклатура.СтавкаНДС.Ставка;
				НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС; 
				Если НДС = Неопределено Или НДС = 0 Тогда 
					НоваяСтрока.СуммаНДС = 0;		
				Иначе
					НоваяСтрока.СуммаНДС = РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
				КонецЕсли;	
			Иначе
				НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
			КонецЕсли;
			
			//+ ИнфоСофт Заварин К.В. 28.03.25 УА #97195
			Если УказатьСкладВСтроке Тогда
				НоваяСтрока.Склад = Документ.Склад;		
			КонецЕсли;
			//- ИнфоСофт Заварин К.В. 28.03.25 УА #97195
			
			НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;		
		КонецЕсли;	
		//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046  
		Если Не Элемент.ЭтоНабор Тогда
			НоваяСтрока.Упаковка = Элемент.Упаковка; 
		КонецЕсли;
		//НоваяСтрока.Упаковка = Элемент.Номенклатура.ЕдиницаИзмерения; 
		//- ИнфоСофт Сумин Д.В. 29.05.23 УА #59046 	
	КонецЦикла;	
	
	Документ.СуммаДокумента = СуммаДокумента;
	
	//+ ИнфоСофт Сумин Д.В. 27.03.23 УА #56728
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		Документ.Записать();
	КонецПопытки; 
	//Документ.Записать(РежимЗаписиДокумента.Проведение); 
	//- ИнфоСофт Сумин Д.В. 27.03.23 УА #56728 
	
	Возврат Документ;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 06.03.23 УА #55086	

//+ ИнфоСофт Сумин Д.В. 06.03.23 УА #55086
Функция СоздатьДокументПоступлениеТоваровОтХранителя(ДокументЗаявкаНаВозвратКомиссия, Профиль, Данные, ЗаголовокСтруктура) Экспорт 
	
	Документ = Документы.ПоступлениеТоваровОтХранителя.СоздатьДокумент();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("АктОРасхождениях", Документы.АктОРасхожденияхПослеПриемки.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ДополнятьСериямиПоЗаявке", Ложь);
	ДанныеЗаполнения.Вставить("ИмяПоляЗаказ", "Распоряжение");
	ДанныеЗаполнения.Вставить("КлючевыеПоля", "Распоряжение, Номенклатура, Характеристика");
	ДанныеЗаполнения.Вставить("ОснованиеАкта", Документы.ПоступлениеТоваровОтХранителя.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ОформлениеЧерезРМ", Ложь);  
	ДанныеЗаполнения.Вставить("ФормаОткрыта", Ложь);
	
	РеквизитыШапки = Новый Структура;
	РеквизитыШапки.Вставить("Валюта", Справочники.Валюты.НайтиПоКоду("643"));
	РеквизитыШапки.Вставить("НаправлениеДеятельности", Справочники.НаправленияДеятельности.ПустаяСсылка());
	РеквизитыШапки.Вставить("Сделка", Справочники.СделкиСКлиентами.ПустаяСсылка());
	//+ ИнфоСофт Стояк Ю.К. 23.11.2023 УА #64836
	Если ДокументЗаявкаНаВозвратКомиссия <> Неопределено И ЗначениеЗаполнено(ДокументЗаявкаНаВозвратКомиссия.Ссылка) Тогда
		Документ.Дата = ДокументЗаявкаНаВозвратКомиссия.Дата;   
		
		МассивЗаказов = Новый массив;
		МассивЗаказов.Добавить(ДокументЗаявкаНаВозвратКомиссия.Ссылка);
		ДанныеЗаполнения.Вставить("МассивЗаказов", МассивЗаказов);
		ДанныеЗаполнения.Вставить("Организация", ДокументЗаявкаНаВозвратКомиссия.Организация);				
		ДанныеЗаполнения.Вставить("Подразделение", ДокументЗаявкаНаВозвратКомиссия.Подразделение);  		
		
		РеквизитыШапки.Вставить("Договор", ДокументЗаявкаНаВозвратКомиссия.Договор);
		РеквизитыШапки.Вставить("Контрагент", ДокументЗаявкаНаВозвратКомиссия.Контрагент);		
		РеквизитыШапки.Вставить("Организация", ДокументЗаявкаНаВозвратКомиссия.Организация);
		РеквизитыШапки.Вставить("Партнер", ДокументЗаявкаНаВозвратКомиссия.Партнер); 
		РеквизитыШапки.Вставить("Подразделение", ДокументЗаявкаНаВозвратКомиссия.Подразделение); 		
		РеквизитыШапки.Вставить("Склад", ДокументЗаявкаНаВозвратКомиссия.Склад);
		РеквизитыШапки.Вставить("Соглашение", ДокументЗаявкаНаВозвратКомиссия.Соглашение);
		РеквизитыШапки.Вставить("ХозяйственнаяОперация", ДокументЗаявкаНаВозвратКомиссия.ХозяйственнаяОперация);	
		
		ДанныеЗаполнения.Вставить("РеквизитыШапки", РеквизитыШапки);
		ДанныеЗаполнения.Вставить("Склад", ДокументЗаявкаНаВозвратКомиссия.Склад);		
		ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", ДокументЗаявкаНаВозвратКомиссия.ХозяйственнаяОперация);
		
		Документ.Заполнить(ДанныеЗаполнения); 
		
		Документ.Комментарий = ДокументЗаявкаНаВозвратКомиссия.Комментарий;
		
		Документ.Товары.Очистить();
		
		Для Каждого Элемент Из ДокументЗаявкаНаВозвратКомиссия.ВозвращаемыеТовары Цикл
			НоваяСтрока = Документ.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		КонецЦикла;	
		
	Иначе   
				
		//+ ИнфоСофт Мурсалимов Д.Р. 31.10.24 УА #86238                                                               
		Документ.Дата = ЗаголовокСтруктура.НачалоПериода;
		//Документ.Дата = ЗаголовокСтруктура.ДатаДокумента;
		//- ИнфоСофт Мурсалимов Д.Р. 31.10.24 УА #86238   
		
		ДанныеЗаполнения.Вставить("Организация", Профиль.Организация);				
		ДанныеЗаполнения.Вставить("Подразделение", Профиль.Подразделение);  		
		
		РеквизитыШапки.Вставить("Договор", Профиль.Договор);
		РеквизитыШапки.Вставить("Контрагент", Профиль.Контрагент);		
		РеквизитыШапки.Вставить("Организация", Профиль.Организация);
		РеквизитыШапки.Вставить("Партнер", Профиль.Партнер); 
		РеквизитыШапки.Вставить("Подразделение", Профиль.Подразделение); 		
		РеквизитыШапки.Вставить("Склад", Профиль.Склад);
		РеквизитыШапки.Вставить("Соглашение", Профиль.Соглашение);
		РеквизитыШапки.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера);	
		
		ДанныеЗаполнения.Вставить("РеквизитыШапки", РеквизитыШапки);
		ДанныеЗаполнения.Вставить("Склад", Профиль.Склад);		
		ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера);
		
		Документ.Заполнить(ДанныеЗаполнения); 
		
		Документ.Партнер = Профиль.Партнер; 
		Документ.Контрагент = Профиль.Контрагент;
		Документ.Договор = Профиль.Договор;
		Документ.Соглашение = Профиль.Соглашение;				
		
		Документ.Комментарий = ЗаголовокСтруктура.Комментарий;
		
		//+ ИнфоСофт Сумин Д.В. 22.03.2024 УА #70680	
		ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
		ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
		
		ЗаполнитьВалюту = Истина;
		
		Если ИспользоватьСоглашенияСКлиентами Тогда 
			Валюта = Профиль.Соглашение.Валюта;
			ЗаполнитьВалюту = Ложь;
		КонецЕсли;
		
		Если ЗаполнитьВалюту И ИспользоватьДоговорыСКлиентами Тогда 
			Валюта = Профиль.Договор.ВалютаВзаиморасчетов;
		КонецЕсли;
		
		Документ.Валюта = Валюта;
		//- ИнфоСофт Сумин Д.В. 22.03.2024 УА #70680
		
		Документ.Товары.Очистить();		
		
		Для Каждого Элемент Из Данные Цикл
			Если Элемент.ЭтоНабор Тогда
				
				//+ ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693
				//ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Элемент.Номенклатура, Элемент.Характеристика, Профиль);
				ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Профиль, Элемент.Номенклатура, Элемент.Характеристика);	
				//- ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693  
				
				Если ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Или
					ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам Тогда
					
					МассивКоэффициентов = РассчитатьКоэффициентыИзЦен(ТоварыНабора.ВыгрузитьКолонку("КомплектующиеЦена"), Элемент.Номенклатура);
				Иначе
					МассивКоэффициентов = ТоварыНабора.ВыгрузитьКолонку("ДоляСтоимости");
				КонецЕсли;
				
				СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Элемент.КПеречислениюПродавцуЗаРеализованныйТовар, МассивКоэффициентов);
				
				Для Каждого ЭлементНабора Из ТоварыНабора Цикл 
					
					НоваяСтрока = Документ.Товары.Добавить();
					//+ ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941				
					НоваяСтрока.НоменклатураНабора = ЭлементНабора.Набор;								
					НоваяСтрока.ХарактеристикаНабора = ЭлементНабора.ХарактеристикаНабора;
					//- ИнфоСофт Стояк Ю.К. 17.02.2025 УА #87941
					НоваяСтрока.Номенклатура = ЭлементНабора.Номенклатура;
					НоваяСтрока.Характеристика = ЭлементНабора.Характеристика;
					НоваяСтрока.Количество = ЭлементНабора.КоличествоУпаковок; 
					НоваяСтрока.КоличествоУпаковок = ЭлементНабора.КоличествоУпаковок; 
					НоваяСтрока.Цена = СуммыПродажи[0] / НоваяСтрока.Количество; 
					НоваяСтрока.Сумма = СуммыПродажи[0]; 					
					НоваяСтрока.Упаковка = ЭлементНабора.Номенклатура.ЕдиницаИзмерения;					
										
					СуммыПродажи.Удалить(0);
					
				КонецЦикла;	
				
			Иначе
				НоваяСтрока = Документ.Товары.Добавить();
				НоваяСтрока.Номенклатура = Элемент.Номенклатура;
				НоваяСтрока.Характеристика = Элемент.Характеристика;				
				НоваяСтрока.Количество = Элемент.УпаковкаКоличество;
				НоваяСтрока.КоличествоУпаковок = Элемент.Количество;
				НоваяСтрока.Цена = Элемент.КПеречислениюПродавцуЗаРеализованныйТовар / Элемент.Количество;  
				НоваяСтрока.Сумма =  Элемент.КПеречислениюПродавцуЗаРеализованныйТовар;
				
			КонецЕсли;	
			
			Если Не Элемент.ЭтоНабор Тогда
				НоваяСтрока.Упаковка = Элемент.Упаковка; 
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 23.11.2023 УА #64836
	
	//+ ИнфоСофт Сумин Д.В. 27.03.23 УА #56728
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		Документ.Записать();
	КонецПопытки; 
	//Документ.Записать(РежимЗаписиДокумента.Проведение); 
	//- ИнфоСофт Сумин Д.В. 27.03.23 УА #56728  
	
	Возврат Документ;  
	
КонецФункции //- ИнфоСофт Сумин Д.В. 06.03.23 УА #55086

//+ ИнфоСофт Сумин Д.В. 06.03.23 УА #55086
Функция СоздатьСчетФактуру(ДокРТУ) Экспорт
	
	ДокСчет = Документы.СчетФактураВыданный.СоздатьДокумент(); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументОснование", ДокРТУ.Ссылка);
	ДокСчет.Заполнить(ПараметрыФормы);
	ДокСчет.Дата = ДокРТУ.Дата;
	
	//+ ИнфоСофт Сумин Д.В. 27.03.23 УА #56728
	Попытка
		ДокСчет.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		ДокСчет.Записать();
	КонецПопытки; 
	//ДокСчет.Записать(РежимЗаписиДокумента.Проведение); 
	//- ИнфоСофт Сумин Д.В. 27.03.23 УА #56728 
	
	Возврат ДокСчет;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 06.03.23 УА #55086	

//+ ИнфоСофт Сумин Д.В. 06.03.23 УА #55086
Функция СоздатьПередачуТоваровНаХранение(Профиль, Данные, ЗаголовокСтруктура) Экспорт 
	
	Документ = Документы.ПередачаТоваровХранителю.СоздатьДокумент();
			
	ОблагаетсяНДС = ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация);
	
	Документ.Организация = Профиль.Организация;
	Документ.Партнер = Профиль.Партнер;
	Документ.Контрагент = Профиль.Контрагент;
	Документ.Соглашение = Профиль.Соглашение;
	Документ.Договор = Профиль.Договор;
	Документ.Валюта = Документ.Договор.ВалютаВзаиморасчетов;
	Документ.Склад = Профиль.Склад;
	Документ.Комментарий = ЗаголовокСтруктура.Комментарий;
	Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;
	
	//+ ИнфоСофт Конышев А.Е. 26.11.24 УА #88616
	Документ.Дата = ЗаголовокСтруктура.НачалоПериода + 1;
	//+ ИнфоСофт Мурсалимов Д.Р. 31.10.24 УА #86238                                                               
	//Документ.Дата = ЗаголовокСтруктура.НачалоПериода;
	//Документ.Дата = ЗаголовокСтруктура.ДатаДокумента;
	//- ИнфоСофт Мурсалимов Д.Р. 31.10.24 УА #86238
	//- ИнфоСофт Конышев А.Е. 26.11.24 УА #88616 
	
	Для Каждого Элемент Из Данные Цикл
		Если Элемент.ЭтоНабор Тогда
			
			//+ ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693
			//ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Элемент.Номенклатура, Элемент.Характеристика, Профиль);
			ТоварыНабора = ПолучитьТаблицуТоваровНабораNew(Профиль, Элемент.Номенклатура, Элемент.Характеристика);	
			//- ИнфоСофт Мурсалимов Д.Р. 11.11.24 УА #85693  
			
			Если ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Или
				ТоварыНабора[0].ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам Тогда
				
				МассивКоэффициентов = РассчитатьКоэффициентыИзЦен(ТоварыНабора.ВыгрузитьКолонку("КомплектующиеЦена"), Элемент.Номенклатура);
			Иначе
				МассивКоэффициентов = ТоварыНабора.ВыгрузитьКолонку("ДоляСтоимости");
			КонецЕсли;
			
			СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Элемент.КПеречислениюПродавцуЗаРеализованныйТовар, МассивКоэффициентов);
			
			Для Каждого ЭлементНабора Из ТоварыНабора Цикл 
				
				НоваяСтрока = Документ.Товары.Добавить();
				НоваяСтрока.Номенклатура = ЭлементНабора.Номенклатура;
				НоваяСтрока.Характеристика = ЭлементНабора.Характеристика;
				НоваяСтрока.КоличествоУпаковок = ЭлементНабора.КоличествоУпаковок;
				
				//+ ИнфоСофт Заварин К.В. 06.02.25 УА #88299
				//НоваяСтрока.Цена = СуммыПродажи[0] / НоваяСтрока.Количество; 
				НоваяСтрока.Цена = СуммыПродажи[0] / НоваяСтрока.КоличествоУпаковок;
				//- ИнфоСофт Заварин К.В. 06.02.25 УА #88299
				
				НоваяСтрока.Сумма = СуммыПродажи[0]; 
				//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046  
				НоваяСтрока.Упаковка = ЭлементНабора.Номенклатура.ЕдиницаИзмерения;
				//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046				
				СуммыПродажи.Удалить(0);
				
			КонецЦикла;	
			
		Иначе
			НоваяСтрока = Документ.Товары.Добавить();
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;
			НоваяСтрока.Характеристика = Элемент.Характеристика; 
			//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046 
			НоваяСтрока.Количество = Элемент.УпаковкаКоличество;
			НоваяСтрока.Склад = Профиль.Склад;
			//НоваяСтрока.Количество = Элемент.Количество;
			//- ИнфоСофт Сумин Д.В. 29.05.23 УА #59046
			НоваяСтрока.КоличествоУпаковок = Элемент.Количество;
			НоваяСтрока.Цена = Элемент.КПеречислениюПродавцуЗаРеализованныйТовар;  
			НоваяСтрока.Сумма =  НоваяСтрока.Цена * Элемент.Количество; 					
		КонецЕсли;	
		//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046  
		Если Не Элемент.ЭтоНабор Тогда
			НоваяСтрока.Упаковка = Элемент.Упаковка; 
		КонецЕсли;
		//НоваяСтрока.Упаковка = Элемент.Номенклатура.ЕдиницаИзмерения; 
		//- ИнфоСофт Сумин Д.В. 29.05.23 УА #59046 
	КонецЦикла;  
	
	//+ ИнфоСофт Сумин Д.В. 27.03.23 УА #56728
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		Документ.Записать();
	КонецПопытки; 
	//Документ.Записать(РежимЗаписиДокумента.Проведение); 
	//- ИнфоСофт Сумин Д.В. 27.03.23 УА #56728 
	
	Возврат Документ;    
	
КонецФункции //- ИнфоСофт Сумин Д.В. 06.03.23 УА #55086	

//+ ИнфоСофт Сумин Д.В. 13.03.23 УА #54516
Процедура ВыполнитьАлгоритмПроверкиТоваровНаКомплект(ЗаказКлиента, СкладВБ) Экспорт 
	
	//+ ИнфоСофт Сумин Д.В. 28.06.2023 УА #60128
	ЗапросНазначений = Новый Запрос;
	ЗапросНазначений.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
	|ИЗ
	|	Справочник.ИС_ВБ_Склады.НаправленияДеятельности КАК ИС_ВБ_СкладыНаправленияДеятельности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ИС_ВБ_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|ГДЕ
	|	ИС_ВБ_СкладыНаправленияДеятельности.Ссылка = &Ссылка";
	
	ЗапросНазначений.УстановитьПараметр("Ссылка", СкладВБ);
	
	РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
	
	Назначения = Новый Массив;
	
	ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
	
	Пока ВыборкаНазначения.Следующий() Цикл 
		Если ВыборкаНазначения.Назначение <> Справочники.Назначения.ПустаяСсылка() Тогда 
			Назначения.Добавить(ВыборкаНазначения.Назначение);
		КонецЕсли;
	КонецЦикла;
	//- ИнфоСофт Сумин Д.В. 28.06.2023 УА #60128
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//+ ИнфоСофт Сумин Д.В. 05.07.2023 УА #60128
	"ВЫБРАТЬ
	|	ТоварыВзаказе.Номенклатура КАК Номенклатура,
	|	ТоварыВзаказе.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ТоварыВЗаказе
	|ИЗ
	|	&ТоварыВзаказе КАК ТоварыВзаказе
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВариантыКомплектацииНоменклатурыТовары.Номенклатура ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЭтоКомплект,
	|	ВТ_ТоварыВЗаказе.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Комплектация
	|ИЗ
	|	ВТ_ТоварыВЗаказе КАК ВТ_ТоварыВЗаказе
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО (ВТ_ТоварыВЗаказе.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|				И ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыВЗаказе.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспределениеЗапасов.Свободно КАК КомплектСвободно,
	|	ВТ_Комплектация.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_КомплектОстаток
	|ИЗ
	|	ВТ_Комплектация КАК ВТ_Комплектация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО ВТ_Комплектация.Номенклатура = РаспределениеЗапасов.Номенклатура
	|ГДЕ
	|	РаспределениеЗапасов.Склад В (&Склад)
	|	И РаспределениеЗапасов.Назначение В(&Назначение)
	|	И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_КомплектОстаток.КомплектСвободно, 0) КАК КомплектСвободно,
	|	ВТ_Комплектация.ЭтоКомплект КАК ЭтоКомплект,
	|	ВТ_Комплектация.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ_Комплектация КАК ВТ_Комплектация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомплектОстаток КАК ВТ_КомплектОстаток
	|		ПО ВТ_Комплектация.Номенклатура = ВТ_КомплектОстаток.Номенклатура";
	//- ИнфоСофт Сумин Д.В. 05.07.2023 УА #60128
	
	//- ИнфоСофт Сумин Д.В. 26.04.23 УА #58025
	//Если СкладВБ.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ПустаяСсылка() Тогда
	//Назначение = Справочники.Назначения.ПустаяСсылка();	
	//Иначе	
	//	Назначение = Справочники.Назначения.НайтиПоРеквизиту("НаправлениеДеятельности", СкладВБ.НаправлениеДеятельности); 
	//КонецЕсли;
	//- ИнфоСофт Сумин Д.В. 26.04.23 УА #58025
	Запрос.УстановитьПараметр("ТоварыВЗаказе", ЗаказКлиента.Товары);
	Запрос.УстановитьПараметр("Склад", ЗаказКлиента.Склад);
	Запрос.УстановитьПараметр("Назначение", Назначения);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	ДанныеКомплектов = РезультатЗапроса.Выгрузить();
	
	Если Не ДанныеКомплектов[0].ЭтоКомплект Или ДанныеКомплектов[0].КомплектСвободно > 0 Тогда
		Возврат;	
	КонецЕсли;
	
	СоздатьЗаказНаСборкуКомплектов(ЗаказКлиента, СкладВБ);	
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 13.03.23 УА #54516 

//+ ИнфоСофт Сумин Д.В. 29.06.2023 УА #59111
Процедура СоздатьЗаказНаСборкуКомплектов(ЗаказКлиента, СкладВБ)
	
	ЗаказНаСборку = Документы.ЗаказНаСборку.СоздатьДокумент(); 
	ЗаказНаСборку.Комментарий = ЗаказКлиента.Комментарий; 
	ЗаказНаСборку.Дата = ЗаказКлиента.Дата;
	ЗаказНаСборку.Подразделение = ЗаказКлиента.Подразделение;  
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("АдресТовары", ПоместитьВоВременноеХранилище(ЗаказКлиента.Товары.Выгрузить(), Новый УникальныйИдентификатор)); 
	СтруктураДанных.Вставить("Основание", ЗаказКлиента.Ссылка);
	СтруктураДанных.Вставить("Склад", ЗаказКлиента.Склад);
	
	ЗаказНаСборку.Заполнить(СтруктураДанных);
	
	ЗаказНаСборку.Организация = ЗаказКлиента.Организация;
	
	ЗаказНаСборку.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;  
	
	ЗаказНаСборку.ДокументОснование = ЗаказКлиента.Ссылка;
	
	ЗаказНаСборку.Подразделение = ЗаказКлиента.Подразделение;
	
	ЗаказНаСборку.НачалоСборкиРазборки = ЗаказКлиента.Дата;
	ЗаказНаСборку.ОкончаниеСборкиРазборки = ЗаказКлиента.Дата; 
	
	ОбеспечиватьОбособленно = ЗаказКлиента.Соглашение.ОбеспечиватьЗаказыОбособленно;
	НаправленияДеятельностиИспользуются = СкладВБ.НаправленияДеятельности.Количество() > 0;
	
	Если ОбеспечиватьОбособленно И НаправленияДеятельностиИспользуются Тогда
		ЗаказНаСборку.НаправлениеДеятельности = ЗаказКлиента.Договор.НаправлениеДеятельности;
		
		//+ ИнфоСофт Сумин Д.В. 05.07.2023 УА #60434
		ЗаказНаСборку.Назначение = Справочники.Назначения.НайтиПоРеквизиту("НаправлениеДеятельности", ЗаказКлиента.Договор.НаправлениеДеятельности);
		//ЗаказНаСборку.Назначение = Справочники.Назначения.НайтиПоРеквизиту("НаправлениеДеятельности", СкладВБ.НаправленияДеятельности[0].НаправлениеДеятельности);
		//- ИнфоСофт Сумин Д.В. 05.07.2023 УА #60434
	КонецЕсли;	
	
	Для Каждого Элемент Из ЗаказНаСборку.Товары Цикл
		Элемент.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
		Если ОбеспечиватьОбособленно И НаправленияДеятельностиИспользуются Тогда
			Элемент.Обособленно = Истина;		
		КонецЕсли;
	КонецЦикла;
	//Если используется обособление, то сначала выполняется попытка проведения с обособлением товара. При неудаче выполняется поптыка проведения без обособления. 
	Попытка
		ЗаказНаСборку.Записать(РежимЗаписиДокумента.Проведение);	
	Исключение 
		
		Если ОбеспечиватьОбособленно И НаправленияДеятельностиИспользуются Тогда	
			Попытка
				Для Каждого Элемент Из ЗаказНаСборку.Товары Цикл
					Элемент.Обособленно = Ложь;		
				КонецЦикла;	
				ЗаказНаСборку.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ЗаказНаСборку.Статус = Перечисления.СтатусыВнутреннихЗаказов.КОбеспечению;
				Для Каждого Элемент Из ЗаказНаСборку.Товары Цикл
					Элемент.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
					Элемент.Обособленно = Ложь;	
					
				КонецЦикла;  
				ЗаписьЖурналаРегистрации("ИС.WB.РазборЗаказов", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаказНаСборку.Записать();	
			КонецПопытки;
		Иначе
			ЗаказНаСборку.Статус = Перечисления.СтатусыВнутреннихЗаказов.КОбеспечению;
			Для Каждого Элемент Из ЗаказНаСборку.Товары Цикл
				Элемент.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
				Элемент.Обособленно = Ложь;	
				
			КонецЦикла;  
			ЗаписьЖурналаРегистрации("ИС.WB.РазборЗаказов", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаказНаСборку.Записать();
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 29.06.2023 УА #59111	

//+ ИнфоСофт Сумин Д.В. 07.08.2023 УА #60602
Функция ПолучитьКодыМаркировки(МассивКиз) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода В(&МассивКиз)";
	
	Запрос.УстановитьПараметр("МассивКиз", МассивКиз);  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивКодов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивКодов.Добавить(Выборка.Ссылка);	
	КонецЦикла;	
	
	Возврат МассивКодов;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 07.08.2023 УА #60602

//+ ИнфоСофт Сумин Д.В. 08.09.2023 УА #61973
Процедура ВыполнитьСозданиеОтборРазмещениеТоваров(ОформленныеОрдеры) 
	
	Для Каждого Элемент Из ОформленныеОрдеры Цикл  	
		НовыйДокумент = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
		НовыйДокумент.Заполнить(Элемент.РасходныйОрдер);   	
		Попытка
			НовыйДокумент.Записать(РежимЗаписидокумента.Проведение);
		Исключение 
			НовыйДокумент.Записать(РежимЗаписидокумента.Запись);
			ТекстСообщения = НСтр("ru = 'Не удалось обработать %Документ% фоновым заданием по созданию отбора на размещение: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", НовыйДокумент);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.ОтборРазмещениеТоваров,
			НовыйДокумент,
			ТекстСообщения);
			ВызватьИсключение;	
		КонецПопытки;
	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 08.09.2023 УА #61973	

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
Функция ПолучитьХозОперациюНачислениеДебиторскойЗадолженности() Экспорт	
	
	Возврат Перечисления.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
Функция ПолучитьХозОперациюНачислениеКредиторскойЗадолженности() Экспорт
	
	Возврат Перечисления.ХозяйственныеОперации.НачислениеКредиторскойЗадолженности;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
Функция СоздатьИзменитьОтчетОСписанииТоваровУХранителя(Профиль, ДанныеДокумента, ДопПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ДокументСсылка") Тогда
		ДокументОбъект = ДопПараметры.ДокументСсылка.ПолучитьОбъект();
	Иначе	
		ДокументОбъект = Документы.ОтчетОСписанииТоваровУХранителя.СоздатьДокумент();
	КонецЕсли;
	
	ДокументОбъект.Дата                  = ДанныеДокумента.Дата;
	ДокументОбъект.Партнер               = ДанныеДокумента.Партнер;
	ДокументОбъект.Контрагент            = ДанныеДокумента.Контрагент;
	ДокументОбъект.Соглашение            = ДанныеДокумента.Соглашение;
	ДокументОбъект.ХозяйственнаяОперация = ДанныеДокумента.ХозяйственнаяОперация;
	ДокументОбъект.Организация           = ДанныеДокумента.Организация;
	ДокументОбъект.Договор               = ДанныеДокумента.Договор;
	ДокументОбъект.СтатьяРасходов        = ДанныеДокумента.СтатьяРасходов;
	ДокументОбъект.Комментарий           = ДанныеДокумента.Комментарий;
	ДокументОбъект.Подразделение         = ДанныеДокумента.Подразделение;
	ДокументОбъект.Ответственный         = Пользователи.АвторизованныйПользователь();
	ДокументОбъект.Автор                 = ДокументОбъект.Ответственный;
	ДокументОбъект.Валюта                = ?(ЗначениеЗаполнено(ДанныеДокумента.Соглашение), 
											ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДокумента.Соглашение, "Валюта"), 
											ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДокумента.Договор, "Валюта"));
											
	РеквизитыСтатьи = ДоходыИРасходыВызовСервераПовтИсп.ЗначенияРеквизитовСтатьи(ДанныеДокумента.СтатьяРасходов);										
	ДокументОбъект.АналитикаРасходов     = ДоходыИРасходыКлиентСервер.ПолучитьАналитикуПоУмолчанию(РеквизитыСтатьи, ДокументОбъект.Ссылка);
	
	ДокументОбъект.Товары.Очистить();
	
	Для Каждого Строка Из ДанныеДокумента.Товары Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		
		НоваяСтрока.Номенклатура   = Строка.Номенклатура;
		НоваяСтрока.Характеристика = Строка.Характеристика;
		НоваяСтрока.Цена           = Строка.Сумма;
		НоваяСтрока.Количество     = 1;
		НоваяСтрока.Сумма          = НоваяСтрока.Цена * НоваяСтрока.Количество;
		
	КонецЦикла;
	
	Попытка	
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);	
	Исключение
		
		ТекстСообщения = "Не удалось провести отчет о списании товаров у комиссионера.";
		ТекстОшибки    = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1|%2", ТекстСообщения, ТекстОшибки));
		
		Попытка	
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);	
		Исключение
			
			ТекстСообщения = "Не удалось записать отчет о списании товаров у комиссионера.";
			ТекстОшибки    = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1|%2", ТекстСообщения, ТекстОшибки));
			
			Возврат Неопределено;
			
		КонецПопытки;
		
	КонецПопытки;
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #83865

//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
Функция ПолучитьСтруктуруОтчетаОСписанииТоваровУХранителя() Экспорт

	СтруктураДокумента = Новый Структура;
	
	СтруктураДокумента.Вставить("Дата");
	СтруктураДокумента.Вставить("Партнер");
	СтруктураДокумента.Вставить("Контрагент");
	СтруктураДокумента.Вставить("Соглашение");
	СтруктураДокумента.Вставить("ХозяйственнаяОперация");
	СтруктураДокумента.Вставить("Организация");
	СтруктураДокумента.Вставить("Договор");
	СтруктураДокумента.Вставить("СтатьяРасходов");
	СтруктураДокумента.Вставить("Договор");
	СтруктураДокумента.Вставить("Комментарий");
	СтруктураДокумента.Вставить("Подразделение");
	
	ТоварыТЧ = Новый ТаблицаЗначений;
	ТоварыТЧ.Колонки.Добавить("Номенклатура");
	ТоварыТЧ.Колонки.Добавить("Характеристика");
	ТоварыТЧ.Колонки.Добавить("Количество");
	
	СтруктураДокумента.Вставить("Товары", ТоварыТЧ);
	
	Возврат СтруктураДокумента;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #83865

//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
Функция ПолучитьХозОперациюСписаниеНедостачЗаСчетКомитента() Экспорт
	
	Возврат Перечисления.ХозяйственныеОперации.СписаниеНедостачЗаСчетКомитента;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #83865

//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
Функция СоздатьИзменитьПретензиюКомиссионеру(Профиль, ДанныеЭлемента, ДопПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("СправочникСсылка") Тогда
		СправочникОбъект = ДопПараметры.СправочникСсылка.ПолучитьОбъект();
	Иначе	
		СправочникОбъект = Справочники.Претензии.СоздатьЭлемент();
	КонецЕсли;
	
	СправочникОбъект.ДатаРегистрации         = ДанныеЭлемента.ДатаРегистрации;
	СправочникОбъект.ДатаОкончания           = ДанныеЭлемента.ДатаРегистрации;
	СправочникОбъект.Комментарий             = ДанныеЭлемента.Комментарий;
	СправочникОбъект.Партнер                 = ДанныеЭлемента.Партнер;
	СправочникОбъект.Организация             = ДанныеЭлемента.Организация;
	СправочникОбъект.Контрагент              = ДанныеЭлемента.Контрагент;
	СправочникОбъект.Договор                 = ДанныеЭлемента.Договор;
	СправочникОбъект.Сумма                   = ДанныеЭлемента.Сумма;
	СправочникОбъект.ОписаниеПретензии       = ДанныеЭлемента.ОписаниеПретензии;
	СправочникОбъект.Наименование            = ?(ЗначениеЗаполнено(ДанныеЭлемента.Наименование),
												ДанныеЭлемента.Наименование,
												ДанныеЭлемента.ОписаниеПретензии);
	СправочникОбъект.ЭтоПретензияПоставщику  = ДанныеЭлемента.ЭтоПретензияПоставщику;
	СправочникОбъект.ВестиРасчетыПоПретензии = ДанныеЭлемента.ВестиРасчетыПоПретензии;
	СправочникОбъект.Ответственный           = Пользователи.АвторизованныйПользователь();
	СправочникОбъект.Статус                  = Перечисления.СтатусыПретензийКлиентов.Удовлетворена;
	
	СправочникОбъект.Валюта = ПолучитьВалютыЗаполненияДокумента(ДанныеЭлемента.Организация, ДанныеЭлемента.Договор, 
																Справочники.СоглашенияСКлиентами.ПустаяСсылка()).Валюта;
	
	Попытка		
		СправочникОбъект.Записать();		
	Исключение
		
		ТекстСообщения = "Не удалось записать претензию комиссионеру.";
		ТекстОшибки    = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1|%2", ТекстСообщения, ТекстОшибки));
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат СправочникОбъект.Ссылка;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #83865

//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
Функция ПолучитьСтруктуруПретензии() Экспорт

	СтруктураДокумента = Новый Структура;
	
	СтруктураДокумента.Вставить("ДатаРегистрации");
	СтруктураДокумента.Вставить("Партнер");
	СтруктураДокумента.Вставить("Контрагент");
	СтруктураДокумента.Вставить("Соглашение");
	СтруктураДокумента.Вставить("Организация");
	СтруктураДокумента.Вставить("Договор");
	СтруктураДокумента.Вставить("Комментарий");
	СтруктураДокумента.Вставить("ОписаниеПретензии");
	СтруктураДокумента.Вставить("Наименование");
	СтруктураДокумента.Вставить("Подразделение");
	СтруктураДокумента.Вставить("Сумма");
	СтруктураДокумента.Вставить("ЭтоПретензияПоставщику");
	СтруктураДокумента.Вставить("ВестиРасчетыПоПретензии");
	
	Возврат СтруктураДокумента;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #83865

#КонецОбласти

