
#Область ОбработчикиСобытий

//+ ИнфоСофт Заварин К.В. 25.10.24 УА #67817
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УпорядоченнаяТаблица = Новый ТаблицаЗначений;
	НарастающийИтогТаблица = Новый ТаблицаЗначений;
	
	СтруктураТаблиц = ИС_MP_РаботаСОтчетами.ПолучитьУпорядоченнуюТаблицуABCXYZ(Профиль, НачалоПериода, КонецПериода);	
	
	Если СтруктураТаблиц.УпорядоченнаяТаблица = Неопределено Тогда
		УпорядоченнаяТаблица = Новый ТаблицаЗначений;	
	КонецЕсли;		
	
	Если СтруктураТаблиц.НарастающийИтогТаблица = Неопределено Тогда
		НарастающийИтогТаблица = Новый ТаблицаЗначений;	
	КонецЕсли;
	
	ВнешниеНаборыДанных = Новый Структура;
	
	ВнешниеНаборыДанных.Вставить("УпорядоченнаяТаблица", СтруктураТаблиц.УпорядоченнаяТаблица); 
	ВнешниеНаборыДанных.Вставить("НарастающийИтогТаблица", СтруктураТаблиц.НарастающийИтогТаблица);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 25.10.24 УА #67817 

#КонецОбласти
