
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
Функция ПолучитьСписокПараметровЗаказов(Маркетплейс) Экспорт
	
	//Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
	//	Возврат ИС_WB_Сервер.ПолучитьСписокПараметровЗаказов();
	//КонецЕсли;
	//
	//Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
	//	Возврат ИС_Ozon_Сервер.ПолучитьСписокПараметровЗаказов();
	//КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Возврат ИС_ЯМ_Сервер.ПолучитьСписокПараметровЗаказов();
	КонецЕсли;

	//Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
	//	Возврат ИС_Сбер_Сервер.ПолучитьСписокПараметровЗаказов();
	//КонецЕсли;

	//Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
	//	Возврат ИС_АЛИ_Сервер.ПолучитьСписокПараметровЗаказов();
	//КонецЕсли;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277

//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
Функция ПолучитьСтруктуруПараметровЗаказов(Маркетплейс) Экспорт
	
	//Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
	//	Возврат ИС_WB_Сервер.ПолучитьСтруктуруПараметровЗаказов();
	//КонецЕсли;
	//
	//Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
	//	Возврат ИС_Ozon_Сервер.ПолучитьСтруктуруПараметровЗаказов();
	//КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Возврат ИС_ЯМ_Сервер.ПолучитьСтруктуруПараметровЗаказов();
	КонецЕсли;

	//Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
	//	Возврат ИС_Сбер_Сервер.ПолучитьСтруктуруПараметровЗаказов();
	//КонецЕсли;

	//Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
	//	Возврат ИС_АЛИ_Сервер.ПолучитьСтруктуруПараметровЗаказов();
	//КонецЕсли;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277

//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277   
Процедура ПолучитьРеквизитыЗаказов(Профиль, Объект) Экспорт
	
	МассивМаркетплейсов = ИС_MP_Сервер.ПолучитьМаркетплейсы();
	
	Для Каждого ТекМаркетплейс Из МассивМаркетплейсов Цикл 
		
		Если Не ТекМаркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
			Продолжить;
		КонецЕсли;
		
		Маркетплейс = ИС_MP_Сервер.ПолучитьНаименованиеМаркетплейса(ТекМаркетплейс); 
		
		МассивНастроек = ИС_МП_УправлениеЗаказами.ПолучитьСписокПараметровЗаказов(ТекМаркетплейс);
		
		СтруктураНастроекПрофиля = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, ТекМаркетплейс, МассивНастроек);
		
		Для Каждого Элемент Из СтруктураНастроекПрофиля Цикл
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, Маркетплейс + Элемент.Ключ) Тогда 
				Объект[Маркетплейс + Элемент.Ключ] = СтруктураНастроекПрофиля[Элемент.Ключ];
			КонецЕсли;	
			
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277

//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
Функция ЗаписатьРеквизитыЗаказов(Профиль, Объект) Экспорт
	
	МассивМаркетплейсов = ИС_MP_Сервер.ПолучитьМаркетплейсы();
	
	Для Каждого ТекМаркетплейс Из МассивМаркетплейсов Цикл 
		
		Если Не ТекМаркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
			Продолжить;
		КонецЕсли;
		
		Маркетплейс = ИС_MP_Сервер.ПолучитьНаименованиеМаркетплейса(ТекМаркетплейс);
		
		СтруктураНастроек = ИС_МП_УправлениеЗаказами.ПолучитьСтруктуруПараметровЗаказов(ТекМаркетплейс);
		
		Для Каждого Элемент Из СтруктураНастроек Цикл
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, Маркетплейс + Элемент.Ключ) Тогда 
				СтруктураНастроек[Элемент.Ключ] = Объект[Маркетплейс + Элемент.Ключ];
			КонецЕсли;	
			
		КонецЦикла;

		ИС_MP_Сервер.ЗаписатьЗначениеНастроек(Профиль, ТекМаркетплейс, СтруктураНастроек);
	
	КонецЦикла;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277

// Заполняет документ заказ данными с сайта.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект - объект документа Заказ покупателя.
//  РеквизитыЗаказа - Структура - содержит значения реквизитов заказа, загруженных с сайта:
//     * Ид - Идентификатор заказа, очень часто тоже что и номер.
//     * Дата				- дата создания заказа на сайте.
//     * Номер				- номер заказа на сайте.
//     * ДатаОтгрузки		- дата отгрузки товара по заказу.
//     * ВалютаДокументаКод	- трехзначный идентификатор валюты.
//     * ВидЦенНаименование	- наименование вида цены.
//     * СуммаВключаетНДС	- признак включения НДС.
//     * НаименованиеСкидки	- наименование скидки.
//     * ПроцентСкидки		- процент скидки.
//     * СуммаСкидки		- сумма скидки по заказу.
//     * СкладНаименование 	- наименование склада, точки самовывоза.
//     * ПодразделениеНаименование - наименование подразделения.
//     * Контрагент			- ссылка на контрагента, который уже был идентифицирован в базе.
//     * АдресДоставки      - строка адреса доставки.
//     * ТочкаСамовывоза	- ссылка на элемент справочника, который в прикладном решении является справочником точек самовывоза или Неопределено.
//     * Товары				- табличная часть документа.
//     * Комментарий		- текстовый комментарий.
//  СвойстваЗаказа - Соответствие - содержит строковое представления свойств (ключ) и значений (значение) заказа.
//  ПрикладныеПараметры - Структура - содержит параметры прикладного решения, добавленные на форму узла плана обмена.
//  ОписаниеОшибки - Строка - текстовое представление ошибки.
//  Успешно - Булево - признак заполнения документа.
//
Процедура ЗаполнитьЗаказ(ДокументОбъект, РеквизитыЗаказа, СвойстваЗаказа, 
		ПрикладныеПараметры, ОписаниеОшибки, Успешно) Экспорт

	Валюта = Неопределено;
	ОбработатьВалютуXML(Валюта, РеквизитыЗаказа.ВалютаДокументаКод);
	
	ДокументОбъект.Дата            = РеквизитыЗаказа.Дата;
	ДокументОбъект.Валюта          = Валюта;
	ДокументОбъект.Соглашение      = ПрикладныеПараметры.Соглашение;
	ДокументОбъект.Организация     = ПрикладныеПараметры.Организация;
	ДокументОбъект.Менеджер        = ПрикладныеПараметры.Менеджер;
	ДокументОбъект.Контрагент      = РеквизитыЗаказа.Контрагент;
	ДокументОбъект.Партнер         = РеквизитыЗаказа.Партнер;
	ДокументОбъект.ЦенаВключаетНДС = РеквизитыЗаказа.СуммаВключаетНДС;
	ДокументОбъект.Склад           = ?(ЗначениеЗаполнено(РеквизитыЗаказа.ТочкаСамовывоза),
	                                   РеквизитыЗаказа.ТочкаСамовывоза, 
	                                   ПрикладныеПараметры.Склад);
	
	УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(ПрикладныеПараметры.Соглашение);
	
	Если Не ЗначениеЗаполнено(УсловияПродаж.ИспользуютсяДоговорыКонтрагентов) 
		Или Не УсловияПродаж.ИспользуютсяДоговорыКонтрагентов Тогда
		ДокументОбъект.ОплатаВВалюте = УсловияПродаж.ОплатаВВалюте;
	Иначе
		ДокументОбъект.ОплатаВВалюте = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.Договор, "ОплатаВВалюте");
	КонецЕсли;
	
	ДокументОбъект.ВернутьМногооборотнуюТару = УсловияПродаж.ВозвращатьМногооборотнуюТару;
	ЗаполнитьЗначенияСвойств(ДокументОбъект,
	                         УсловияПродаж,
	                        "ХозяйственнаяОперация, ГруппаФинансовогоУчета,
	                        |ТребуетсяЗалогЗаТару, ФормаОплаты, ГрафикОплаты");
	Если ЗначениеЗаполнено(ДокументОбъект.ГрафикОплаты) И Не ЗначениеЗаполнено(ДокументОбъект.ФормаОплаты) Тогда
		ДокументОбъект.ФормаОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.ГрафикОплаты, "ФормаОплаты");
	КонецЕсли;

	Если ПрикладныеПараметры.ЗагружатьФормыОплаты Тогда
	
		МетодОплатыИД = СвойстваЗаказа.Получить("Метод оплаты ИД");
		МетодОплаты   = СвойстваЗаказа.Получить("Метод оплаты");
		
		Если Не МетодОплатыИД = Неопределено Тогда
			
			ТаблицаФормОплат = ПрикладныеПараметры.СоответствиеФормОплат;
			ЗначениеФормыОплаты = ТаблицаФормОплат.Найти(МетодОплатыИД, "КодОплатыНаСайте");
			Если ЗначениеФормыОплаты = Неопределено Тогда
				ЗначениеФормыОплаты = ТаблицаФормОплат.Найти(МетодОплаты, "ВидОплатыНаСайте");
			КонецЕсли;
			Если ЗначениеФормыОплаты = Неопределено Тогда
				ШаблонСообщения = 
					НСтр("ru = 'Методу оплаты с сайта ""%1"" с кодом ""%2"" не поставлена в соответствие форма оплаты.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, МетодОплаты, МетодОплатыИД);
				ДобавитьОписаниеОшибки(ОписаниеОшибки, ТекстОшибки);
			Иначе
				ДокументОбъект.ФормаОплаты = ЗначениеФормыОплаты.ФормаОплаты;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	ДокументОбъект.ВернутьМногооборотнуюТару = УсловияПродаж.ВозвращатьМногооборотнуюТару;
	ДокументОбъект.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(ДокументОбъект.Приоритет);
	Если УсловияПродаж.ИспользуютсяДоговорыКонтрагентов Тогда
		
		ДокументОбъект.Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(ДокументОбъект,
		                                                                  УсловияПродаж.ХозяйственнаяОперация,
		                                                                  Валюта);
		
	КонецЕсли;
	
	ПараметрыЗаполнения = Документы.ЗаказКлиента.ПараметрыЗаполненияНалогообложенияНДСПродажи(ДокументОбъект);
	УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(ДокументОбъект.НалогообложениеНДС, ПараметрыЗаполнения);
	
	Комментарий = "";
	Если Не ПустаяСтрока(РеквизитыЗаказа.Комментарий) Тогда
		Комментарий = Комментарий + НСтр("ru = 'Комментарий менеджера на сайте'") + ": " + РеквизитыЗаказа.Комментарий;
	КонецЕсли;
	
	КомментарийПокупателя = СвойстваЗаказа.Получить("Комментарии покупателя");
	Если Не КомментарийПокупателя = Неопределено 
			И Не ПустаяСтрока(КомментарийПокупателя) Тогда
		Комментарий = Комментарий + ?(ПустаяСтрока(Комментарий), "", Символы.ПС) 
			+ НСтр("ru = 'Комментарий покупателя на сайте'") + ": " + КомментарийПокупателя;
	КонецЕсли;
	
	ДокументОбъект.Комментарий   = Комментарий;
	
	СтатусЗаказа = СвойстваЗаказа.Получить("Статус заказа");
	Если Не СтатусЗаказа = Неопределено Тогда
		
		ТаблицаСтатусов = ПрикладныеПараметры.СоответствиеСтатусовЗаказов;
		ЗначениеСтатуса = ТаблицаСтатусов.Найти(СтатусЗаказа, "СтатусЗаказаНаСайте");
		
		Если Не ЗначениеСтатуса = Неопределено Тогда
			ДокументОбъект.Статус = ЗначениеСтатуса.СтатусЗаказаВБазе;
		Иначе
			ДокументОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
		КонецЕсли;
		
	Иначе
		
		ДокументОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
		
	КонецЕсли;
	
	Если РеквизитыЗаказа.Свойство("ДатаОтгрузки")
			И ЗначениеЗаполнено(РеквизитыЗаказа.ДатаОтгрузки) Тогда
		ДокументОбъект.ДатаОтгрузки = РеквизитыЗаказа.ДатаОтгрузки;
		ДокументОбъект.НеОтгружатьЧастями = Истина;
	КонецЕсли;
	
	ЗаполнитьТабличнуюЧастьДокумента(ДокументОбъект, РеквизитыЗаказа.Товары, ПрикладныеПараметры);
	ДокументОбъект.СуммаДокумента = ДокументОбъект.ПолучитьСуммуЗаказанныхСтрок();
		
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой")
			И Не ЗначениеЗаполнено(ДокументОбъект.СпособДоставки) Тогда
		ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	КонецЕсли;
	
	Если ДокументОбъект.СпособДоставки <> Перечисления.СпособыДоставки.Самовывоз Тогда
		ДокументОбъект.АдресДоставки = РеквизитыЗаказа.АдресДоставки;	
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах") Тогда
		ДокументОбъект.СкидкиРассчитаны = Истина;
	КонецЕсли;
	
	Успешно = Истина;
		
КонецПроцедуры

// Заполняет табличную часть "Товары" документа "Заказ клиента".
//
// Параметры:
//  Документ            - ДокументОбъект.ЗаказКлиента - документ, чья табличная часть "Товары" будет заполнена.
//  ТаблицаТоваровСайт  - ТаблицаЗначений - таблица заказанных товаров по данным с сайта.
//  ПрикладныеПараметры - Структура - содержит информацию настройках обмена, выполненных в форме узла.
//
Процедура ЗаполнитьТабличнуюЧастьДокумента(Документ, ТаблицаТоваровСайт, ПрикладныеПараметры) Экспорт
	
	СтруктураПересчетаСуммы = 
		ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Документ);
	СтруктураПересчетаЦены  = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВПродажахВТЧ(
		Документ, 
		Документ.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию"));
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	
	СтруктураДействий.Вставить(
		"ПроверитьЗаполнитьСклад",
		ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Документ, Ложь));
	
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьСодержание", Новый Структура("ЗаполнятьДляВсехУслуг", Истина));
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВПродажах", СтруктураПересчетаЦены);
	
	ПараметрыДокумента = Документы.ЗаказКлиента.ПараметрыДокументаДляДействийОбеспечения(Документ);
	ПоляСтрокой = "ВариантОбеспечения";
	ОбеспечениеВДокументахКлиентСервер.ДобавитьДействияОбеспечения(СтруктураДействий, ПоляСтрокой, ПараметрыДокумента);
	
	СтруктураДействийНабор = Новый Структура;
	СтруктураДействийНабор.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействийНабор.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействийНабор.Вставить("ПересчитатьСумму");
		
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	Документ.Товары.Очистить();
	ТаблицаТоварыДокумент = Документ.Товары.Выгрузить();
	ТаблицаТоварыДокумент.Колонки.Добавить("ТипНоменклатуры", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
	
	// Параметры, используемые для набора
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Дата", Документ.Дата);
	ДополнительныеПараметры.Вставить("Организация", Документ.Организация);
	ДополнительныеПараметры.Вставить("Соглашение", Документ.Соглашение);
	ДополнительныеПараметры.Вставить("Валюта", Документ.Валюта);
		
	Для Каждого ТекСтрока Из ТаблицаТоваровСайт Цикл
		
		ЭтоНабор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтрока.Номенклатура, "ТипНоменклатуры") = 
			Перечисления.ТипыНоменклатуры.Набор;
			
		Если ЭтоНабор Тогда
			ТоварыНабор = Документ.Товары.ВыгрузитьКолонки();	
				
			ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ЗаполнитьЗначенияСвойств(ПараметрыКомплектующих, ТекСтрока);
			ПараметрыКомплектующих.КоличествоУпаковок   = ПараметрыКомплектующих.Количество;
			ПараметрыКомплектующих.НоменклатураНабора   = ТекСтрока.Номенклатура;
			ПараметрыКомплектующих.ХарактеристикаНабора = ТекСтрока.Характеристика;
			ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
			
			ДополнительныеПараметры.Вставить("Цена", ТекСтрока.Цена);
			
			ПодобранныеТовары = НаборыВызовСервера.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
			Для Каждого ПодобранныйТовар Из ПодобранныеТовары Цикл
				
				НоваяСтрока = ТоварыНабор.Добавить();
				НоваяСтрока.СтавкаНДС = СтавкаНДСПоЗначениюПриЗагрузке(ТекСтрока.СтавкаНДС);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ПодобранныйТовар);
				
				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействийНабор, Неопределено);
				
			КонецЦикла;
						
			КоэффициентПересчета = ТекСтрока.Сумма / ТоварыНабор.Итог("Сумма");
			
			// Перенесем товары из набора в табличную часть
			ПогрешностьСтоимости = ТекСтрока.Сумма;
			ПогрешностьНДС       = ?(ЗначениеЗаполнено(ТекСтрока.СуммаНДС), ТекСтрока.СуммаНДС, 0);
			Для Каждого СтрНабора Из ТоварыНабор Цикл
				НоваяСтрока = ТаблицаТоварыДокумент.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрНабора);
				Если КоэффициентПересчета <> 1 Тогда
					НоваяСтрока.Сумма = НоваяСтрока.Сумма * КоэффициентПересчета;
					НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДС * КоэффициентПересчета;
				КонецЕсли;
				
				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);
				
				ПогрешностьСтоимости = ПогрешностьСтоимости - НоваяСтрока.Сумма;
				ПогрешностьНДС       = ПогрешностьНДС - НоваяСтрока.СуммаНДС;
			КонецЦикла;
			
			// Погрешность отнесем на стоимость последнего товара в наборе
			Если ПогрешностьСтоимости <> 0 Или ПогрешностьНДС <> 0 Тогда
				НоваяСтрока.Сумма     = НоваяСтрока.Сумма + ПогрешностьСтоимости;  	
				НоваяСтрока.СуммаНДС  = НоваяСтрока.СуммаНДС + ПогрешностьНДС;
				НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма + ?(Документ.ЦенаВключаетНДС, 0, НоваяСтрока.СуммаНДС);
			КонецЕсли;
		Иначе
			
			НоваяСтрока = ТаблицаТоварыДокумент.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			НоваяСтрока.СтавкаНДС = СтавкаНДСПоЗначениюПриЗагрузке(ТекСтрока.СтавкаНДС);
			НоваяСтрока.КоличествоУпаковок = ТекСтрока.Количество;
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Документ.Товары.Загрузить(ТаблицаТоварыДокумент);
		
КонецПроцедуры

//Функция проверяет наличие нового регистра сведений "Распределение запасов", 
//	с помощью которого, в новых версиях конфигураций, происходит получение остатков, расчет резервов и доступности по товарам
//
//  Возвращаемое значение:
//		Булево - Метаданные содержат РС.РасределениеЗапасов.
Функция ИспользуетсяНоваяСхемаДоступностиТоваров() Экспорт
	Возврат (Метаданные.НайтиПоПолномуИмени("РегистрСведений.РаспределениеЗапасов") <> Неопределено);
КонецФункции

//+ ИнфоСофт Мурсалимов Д.Р. 25.10.24 УА #85566
Функция СоздатьДокументВзаимозачетЗадолженности(ОбъектРасчетов, Документ, ОтчетКомиссионера) Экспорт  
	
	ДокументВзаимозачет = Документы.ВзаимозачетЗадолженности.СоздатьДокумент();
	
	ДокументВзаимозачет.Дата 							= Документ.Дата;
	ДокументВзаимозачет.Организация 					= Документ.Организация; 
	
	ДокументВзаимозачет.КонтрагентДебитор 				= Документ.Контрагент;
	ДокументВзаимозачет.КонтрагентКредитор 				= ОтчетКомиссионера.Контрагент; 
	
	ДокументВзаимозачет.СуммаДокумента 					= Документ.СуммаДокумента;
	ДокументВзаимозачет.Валюта 							= Документ.Валюта;
	ДокументВзаимозачет.ВидОперации						= Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаКлиентаМеждуКонтрагентами;
	ДокументВзаимозачет.ТипДебитора 					= Перечисления.ТипыУчастниковВзаимозачета.Клиент;
	ДокументВзаимозачет.ТипКредитора 					= Перечисления.ТипыУчастниковВзаимозачета.Клиент;
	ДокументВзаимозачет.СуммаРегл 						= ИС_WB_СерверУТ11_5.ПересчитатьВСуммуРегл(Документ.СуммаДокумента, Документ.Валюта, Документ.Дата); 
	ДокументВзаимозачет.СуммаУпр 						= ИС_WB_СерверУТ11_5.ПересчитатьВСуммуУпр(Документ.СуммаДокумента, Документ.Валюта, Документ.Дата); 
	
	ДебиторскаяЗадолженностьТЧ = ДокументВзаимозачет.ДебиторскаяЗадолженность.Добавить();
	
	ДебиторскаяЗадолженностьТЧ.ТипРасчетов				= Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	ДебиторскаяЗадолженностьТЧ.Партнер 					= Документ.Партнер; 	
	ДебиторскаяЗадолженностьТЧ.ОбъектРасчетов 			= Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ОбъектРасчетов);	
	ДебиторскаяЗадолженностьТЧ.СуммаВзаиморасчетов 		= Документ.СуммаДокумента;
	ДебиторскаяЗадолженностьТЧ.ВалютаВзаиморасчетов 	= Документ.Валюта;
	ДебиторскаяЗадолженностьТЧ.Организация 				= Документ.Организация; 
	ДебиторскаяЗадолженностьТЧ.СуммаРегл 				= ДокументВзаимозачет.СуммаРегл; 
	ДебиторскаяЗадолженностьТЧ.СуммаУпр 				= ДокументВзаимозачет.СуммаУпр;
	
	КредиторскаяЗадолженностьТЧ = ДокументВзаимозачет.КредиторскаяЗадолженность.Добавить();
	
	КредиторскаяЗадолженностьТЧ.ТипРасчетов 			= Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	КредиторскаяЗадолженностьТЧ.Партнер 				= ОтчетКомиссионера.Партнер;
	КредиторскаяЗадолженностьТЧ.ОбъектРасчетов			= Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ОтчетКомиссионера.Ссылка);
	КредиторскаяЗадолженностьТЧ.СуммаВзаиморасчетов 	= Документ.СуммаДокумента;
	КредиторскаяЗадолженностьТЧ.ВалютаВзаиморасчетов 	= Документ.Валюта;
	КредиторскаяЗадолженностьТЧ.Организация 			= Документ.Организация;
	КредиторскаяЗадолженностьТЧ.СуммаРегл 				= ДокументВзаимозачет.СуммаРегл; 
	КредиторскаяЗадолженностьТЧ.СуммаУпр 				= ДокументВзаимозачет.СуммаУпр;
	
	Попытка
		ДокументВзаимозачет.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		ДокументВзаимозачет.Записать();
	КонецПопытки; 	 
	
	Возврат ДокументВзаимозачет.Ссылка;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 25.10.24 УА #85566

//+ ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #93329
Функция ПолучитьПрименениеНДСОрганизации(Организация) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НастройкиУчетаНДС.ПрименяетсяОсвобождениеОтУплатыНДС
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НастройкиУчетаНДС.ПлательщикНДС
	|	КОНЕЦ КАК ПлательщикНДС
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(, ) КАК НастройкиУчетаНДС
	|ГДЕ
	|	НастройкиУчетаНДС.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.ПлательщикНДС;
		
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #93329

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Ищет валюту по коду валюту, переданному с сайта.
// Если валюту найти не удалось, получает валюту регламентированного учета.
//
// Параметры:
//  Валюта           - СправочникСсылка.Валюта - в данный параметр устанавливается найденная валюта
//  КодВалютыСтрока  - Строка - код валюты, по которому выполняется поиск.
//
Процедура ОбработатьВалютуXML(Валюта, КодВалютыСтрока) Экспорт
	
	Валюта = Справочники.Валюты.НайтиПоНаименованию(КодВалютыСтрока);
	
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Валюта = ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

// Получает значение ставки НДС по строковому значению, переданному с сайта.
//
// Параметры:
//  СтавкаНалогаСтрока - Строка - строковое представление ставки НДС
//
// Возвращаемое значение:
//   ПеречислениеСсылка.СтавкиНДС   - найденное по строковому описанию значение ставки НДС
//
Функция СтавкаНДСПоЗначениюПриЗагрузке(СтавкаНалогаСтрока) Экспорт
	
	Если ТипЗнч(СтавкаНалогаСтрока) = Тип("Число") Тогда
		СтавкаНалогаСтрока = Строка(СтавкаНалогаСтрока);
	КонецЕсли;
	
	СоответствиеСтавокНСД = УчетНДСРФ.СоответствиеСтавокНДССтроковымЗначениям();
	
	СтавкаНДС = СоответствиеСтавокНСД.Получить(СтавкаНалогаСтрока);
	
	Если СтавкаНДС = Неопределено Тогда
		СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	Возврат СтавкаНДС;
		
КонецФункции

// Заполняет дополнительные реквизиты документа "Заказ клиента" соответствующие номеру и дате заказа с сайта
//
// Параметры:
//  ДокументОбъект      - ДокументОбъект.ЗаказКлиента - документ, дополнительные реквизиты которого необходимо обновить
//  РеквизитыЗаказа     - Структура - содержит информацию о данных заказа, полученных с сайта.
//  ПрикладныеПараметры - Структура - содержит информацию настройках обмена, выполненных в форме узла.
//
Процедура ЗаполнитьНомерИДатуЗаказаДополнительныеРеквизиты(ДокументОбъект, РеквизитыЗаказа, ПрикладныеПараметры) Экспорт

	Если ЗначениеЗаполнено(ПрикладныеПараметры.ДополнительныйРеквизитЗаказаКлиентаДатаЗаказаНаСайте) Тогда
		НайденныеСтроки = ДокументОбъект.ДополнительныеРеквизиты.НайтиСтроки(
			Новый Структура("Свойство", ПрикладныеПараметры.ДополнительныйРеквизитЗаказаКлиентаДатаЗаказаНаСайте));
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаСвойства = ДокументОбъект.ДополнительныеРеквизиты.Добавить();
		Иначе
			СтрокаСвойства = НайденныеСтроки[0];
		КонецЕсли;
		СтрокаСвойства.Свойство = ПрикладныеПараметры.ДополнительныйРеквизитЗаказаКлиентаДатаЗаказаНаСайте;
		СтрокаСвойства.Значение = РеквизитыЗаказа.Дата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПрикладныеПараметры.ДополнительныйРеквизитЗаказаКлиентаНомерЗаказаНаСайте) Тогда
		НайденныеСтроки = ДокументОбъект.ДополнительныеРеквизиты.НайтиСтроки(
			Новый Структура("Свойство", ПрикладныеПараметры.ДополнительныйРеквизитЗаказаКлиентаНомерЗаказаНаСайте));
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаСвойства = ДокументОбъект.ДополнительныеРеквизиты.Добавить();
		Иначе
			СтрокаСвойства = НайденныеСтроки[0];
		КонецЕсли;
		СтрокаСвойства.Свойство = ПрикладныеПараметры.ДополнительныйРеквизитЗаказаКлиентаНомерЗаказаНаСайте;
		СтрокаСвойства.Значение = РеквизитыЗаказа.Номер;
	КонецЕсли;

КонецПроцедуры

// К существующему описанию добавляет текст
//
// Параметры:
//  Описание	 - Строка - Описание 
//  Дополнение	 - Строка - Дополнение
//
Процедура ДобавитьОписаниеОшибки(Описание, Дополнение) Экспорт

	Если ПустаяСтрока(Описание) Тогда
		Описание = Дополнение;
	Иначе
		Описание = Описание + Символы.ПС + Дополнение;
	КонецЕсли;

КонецПроцедуры

//+ ИнфоСофт Мурсалимов Д.Р. 18.09.24 УА #83662
Функция ВариантКомплектацииНоменклатурыПоУмолчанию(Знач Номенклатура, Знач Характеристика)

	ВариантКомплектацииНоменклатуры = Неопределено;

	Если Характеристика = Неопределено Тогда
		Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
						  |	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектацииНоменклатуры
						  |ИЗ
						  |	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
						  |ГДЕ
						  |	ВариантыКомплектацииНоменклатуры.Владелец = &Владелец
						  |	И ВариантыКомплектацииНоменклатуры.Характеристика = &Характеристика
						  |
						  |УПОРЯДОЧИТЬ ПО
						  |	ВариантыКомплектацииНоменклатуры.Основной УБЫВ,
						  |	ВариантыКомплектацииНоменклатуры.ПометкаУдаления");

	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВариантКомплектацииНоменклатуры = Выборка.ВариантКомплектацииНоменклатуры;
	КонецЕсли;

	Возврат ВариантКомплектацииНоменклатуры;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 18.09.24 УА #83662

//+ ИнфоСофт Мурсалимов Д.Р. 18.09.24 УА #83662
Функция КоэффициентыРаспределенияПоДолям(ТабличнаяЧасть, Параметры)

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	Таблица.НомерСтроки                                       КАК НомерСтроки,
						  |	Таблица.НоменклатураНабора                                КАК НоменклатураНабора,
						  |	Таблица.ХарактеристикаНабора                              КАК ХарактеристикаНабора,
						  |	Таблица.Номенклатура                                      КАК Номенклатура,
						  |	Таблица.Характеристика                                    КАК Характеристика,
						  |	Таблица.Упаковка                                          КАК Упаковка,
						  |	Таблица.Количество                                        КАК Количество,
						  |	Таблица.КоличествоУпаковок                                КАК КоличествоУпаковок
						  |ПОМЕСТИТЬ Таблица
						  |ИЗ
						  |	&ТабличнаяЧасть КАК Таблица
						  |;
						  |
						  |//////////////////////////
						  |ВЫБРАТЬ
						  |	Таблица.НомерСтроки                                       КАК НомерСтроки,
						  |	Таблица.НоменклатураНабора                                КАК НоменклатураНабора,
						  |	Таблица.ХарактеристикаНабора                              КАК ХарактеристикаНабора,
						  |	Таблица.Номенклатура                                      КАК Номенклатура,
						  |	Таблица.Характеристика                                    КАК Характеристика,
						  |	Таблица.Упаковка                                          КАК Упаковка,
						  |	Таблица.Количество                                        КАК Количество,
						  |	Таблица.КоличествоУпаковок                                КАК КоличествоУпаковок,
						  |	ВариантыКомплектацииНоменклатуры.Ссылка                   КАК ВариантыКомплектацииНоменклатуры,
						  |	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора
						  |ПОМЕСТИТЬ ТаблицаСВариантамиКомплектации
						  |ИЗ
						  |	Таблица КАК Таблица
						  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
						  |		ПО Таблица.НоменклатураНабора = ВариантыКомплектацииНоменклатуры.Владелец
						  |			И Таблица.ХарактеристикаНабора = ВариантыКомплектацииНоменклатуры.Характеристика
						  |			И ВариантыКомплектацииНоменклатуры.Основной
						  |;
						  |
						  |/////
						  |ВЫБРАТЬ
						  |	Товары.Ссылка            КАК ВариантыКомплектацииНоменклатуры,
						  |	Товары.Номенклатура      КАК Номенклатура,
						  |	Товары.Характеристика    КАК Характеристика,
						  |	СУММА(ВЫБОР
						  |			КОГДА Товары.Количество <> 0
						  |				ТОГДА Выбор Когда Товары.ДоляСтоимости = 0 Тогда 1 Иначе  Товары.ДоляСтоимости Конец/ Товары.Количество
						  |			ИНАЧЕ 0
						  |		КОНЕЦ) КАК ДоляСтоимости
						  |ПОМЕСТИТЬ ДолиСтоимости
						  |ИЗ
						  |	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Товары
						  |
						  |СГРУППИРОВАТЬ ПО
						  |	Товары.Номенклатура,
						  |	Товары.Характеристика,
						  |	Товары.Ссылка
						  |;
						  |
						  |/////
						  |ВЫБРАТЬ
						  |	Таблица.НомерСтроки                                           КАК НомерСтроки,
						  |	Таблица.НоменклатураНабора                                    КАК НоменклатураНабора,
						  |	Таблица.ХарактеристикаНабора                                  КАК ХарактеристикаНабора,
						  |	Таблица.Номенклатура                                          КАК Номенклатура,
						  |	Таблица.Характеристика                                        КАК Характеристика,
						  |	Таблица.Упаковка                                              КАК Упаковка,
						  |	Таблица.Количество                                            КАК Количество,
						  |	Таблица.КоличествоУпаковок                                    КАК КоличествоУпаковок,
						  |	ВЫРАЗИТЬ(Таблица.Количество * ЕСТЬNULL(ДолиСтоимости.ДоляСтоимости, 0) КАК Число(15,2)) КАК Цена,
						  |	Таблица.ВариантыКомплектацииНоменклатуры                      КАК ВариантыКомплектацииНоменклатуры,
						  |	Таблица.ВариантРасчетаЦеныНабора                              КАК ВариантРасчетаЦеныНабора
						  |ИЗ
						  |	ТаблицаСВариантамиКомплектации КАК Таблица
						  |		ЛЕВОЕ СОЕДИНЕНИЕ ДолиСтоимости КАК ДолиСтоимости
						  |		ПО ДолиСтоимости.ВариантыКомплектацииНоменклатуры = Таблица.ВариантыКомплектацииНоменклатуры
						  |			И Таблица.Номенклатура = ДолиСтоимости.Номенклатура
						  |			И Таблица.Характеристика = ДолиСтоимости.Характеристика
						  |");
	
	// Выгрузить из таблицы источника
	Если ТипЗнч(ТабличнаяЧасть) = Тип("ТаблицаЗначений") Тогда
		Запрос.Параметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть.Скопировать());
	Иначе
		Запрос.Параметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть.Выгрузить());
	КонецЕсли;

	ПараметрыРасчета = Новый Структура;
	Для Каждого Параметр Из Параметры Цикл
		ПараметрыРасчета.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	ПараметрыРасчета.Вставить("РассчитыватьНаборы", Ложь);

	ТЧ = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрокаТЧ Из ТЧ Цикл
		СтрокаТЧ.Цена = Окр(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок, 2);
	КонецЦикла;

	Возврат ТЧ;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 18.09.24 УА #83662

//+ ИнфоСофт Мурсалимов Д.Р. 23.09.24 УА #83662
Функция Комплектующие(Параметры, ДополнительныеПараметры) Экспорт

	Если ИС_МП_УправлениеЗаказами.ИспользуетсяНоваяСхемаДоступностиТоваров() Тогда
		Возврат КомплектующиеУТ11_5(Параметры, ДополнительныеПараметры);
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Если Не ЗначениеЗаполнено(Параметры.ВариантКомплектацииНоменклатуры) Тогда
		ВариантКомплектацииНоменклатуры = ВариантКомплектацииНоменклатурыПоУмолчанию(
			Параметры.НоменклатураНабора, Параметры.ХарактеристикаНабора);
	Иначе
		ВариантКомплектацииНоменклатуры = Параметры.ВариантКомплектацииНоменклатуры;
	КонецЕсли;

	Если Не Параметры.Свойство("КоличествоУпаковок") Тогда
		Параметры.Вставить("КоличествоУпаковок", 1);
	КонецЕсли;

	ПодобранныеТовары = Новый Массив;

	Если Не ЗначениеЗаполнено(ВариантКомплектацииНоменклатуры) Тогда
		ТекстОшибки = СтрШаблон("Для номенклатуры %1 %2 не определен состав набора", Параметры.НоменклатураНабора,
			Параметры.ХарактеристикаНабора);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат ПодобранныеТовары;
	КонецЕсли;  
	//+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133
	ВариантРасчетаЦеныНабора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВариантКомплектацииНоменклатуры, "ВариантРасчетаЦеныНабора");
	//- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133
	Колонки = Новый Массив;
	Колонки.Добавить("НомерСтроки");
	Колонки.Добавить("НоменклатураКомплекта");
	Колонки.Добавить("ХарактеристикаКомплекта");
	Колонки.Добавить("Номенклатура");
	Колонки.Добавить("Характеристика");
	Колонки.Добавить("Цена");
	Колонки.Добавить("ВидЦены");
	Колонки.Добавить("Упаковка");
	Колонки.Добавить("Количество");
	Колонки.Добавить("КоличествоУпаковок");
	Колонки.Добавить("ПроцентРучнойСкидки");
	Колонки.Добавить("СуммаРучнойСкидки");
	Колонки.Добавить("Доступно");
	Колонки.Добавить("ВНаличии");
	
	Комплектующие = НаборыСервер.СоздатьТаблицуСоставаНабора(Колонки);
	Комплектующие.Колонки.Добавить("ТипНоменклатуры", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ВидНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Комплектующие.Колонки.Добавить("Комиссия", Новый ОписаниеТипов("Число"));

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	СУММА(Т.Количество) КАК Количество
	|ПОМЕСТИТЬ ОстаткиИзЗаказов
	|ИЗ
	|	РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
	|ГДЕ
	|	Т.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
	|	И Т.Количество < 0
	|	И &ФильтрСкладыТ
	|СГРУППИРОВАТЬ ПО
	|	Т.Номенклатура,
	|	Т.Характеристика
	|////////////////////////////////////////////////////////////////////////////////////
	|
	|;
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки КАК НомерСтроки,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
	|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости
	|ПОМЕСТИТЬ
	|	ВариантыКомплектацииНоменклатурыТовары
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	СУММА(ЕСТЬNULL(СвободныеОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстатки.ВРезервеПодЗаказОстаток, 0) -
	|	ЕСТЬNULL(СвободныеОстатки.ВРезервеСоСкладаОстаток, 0) + ЕСТЬNULL(ОстаткиИзЗаказов.Количество, 0)) КАК Доступно,
	|	СУММА(ЕСТЬNULL(СвободныеОстатки.ВНаличииОстаток, 0)) КАК ВНаличии
	|ПОМЕСТИТЬ
	|	ДоступностьТоваров
	|ИЗ
	|	ВариантыКомплектацииНоменклатурыТовары КАК ВариантыКомплектацииНоменклатурыТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.СвободныеОстатки.Остатки(
	|			,
	|			(Номенклатура,Характеристика) В
	|				(ВЫБРАТЬ
	|					ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|					ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика
	|				ИЗ
	|					ВариантыКомплектацииНоменклатурыТовары КАК ВариантыКомплектацииНоменклатурыТовары)
	|			И &ФильтрСклады
	|		) КАК СвободныеОстатки
	|	ПО СвободныеОстатки.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
	|		И СвободныеОстатки.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ОстаткиИзЗаказов КАК ОстаткиИзЗаказов
	|		ПО ОстаткиИзЗаказов.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
	|		 И ОстаткиИзЗаказов.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика
	|;
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки КАК НомерСтроки,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
	|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости,
	|	ДоступностьТоваров.Доступно / ЕстьNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК Доступно,
	|	ДоступностьТоваров.ВНаличии / ЕстьNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК ВНаличии
	|ИЗ
	|	ВариантыКомплектацииНоменклатурыТовары КАК ВариантыКомплектацииНоменклатурыТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ ДоступностьТоваров КАК ДоступностьТоваров
	|	ПО ДоступностьТоваров.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
	|	И ДоступностьТоваров.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения)",
		"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Справочник.Номенклатура)"));

	Запрос.УстановитьПараметр("Ссылка", ВариантКомплектацииНоменклатуры);

	Если ДополнительныеПараметры.Свойство("Склады") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрСкладыТ", "Т.Склад В(&Склады)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрСклады", "Склад В (&Склады)");
		Запрос.УстановитьПараметр("Склады", ДополнительныеПараметры.Склады);
	Иначе
		Запрос.УстановитьПараметр("ФильтрСклады", Истина);
		Запрос.УстановитьПараметр("ФильтрСкладыТ", Истина);
	КонецЕсли;

	Выборка = Запрос.ВыполнитьПакет()[3].Выбрать();
	
	Пока Выборка.Следующий() Цикл

		НоваяСтрока = Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.КоличествоУпаковок   = НоваяСтрока.КоличествоУпаковок;
		НоваяСтрока.Количество           = НоваяСтрока.Количество;
		НоваяСтрока.НоменклатураНабора   = Параметры.НоменклатураНабора;
		НоваяСтрока.ХарактеристикаНабора = Параметры.ХарактеристикаНабора;
		
	КонецЦикла; 
	//+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133
	Если ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
		
		Если ДополнительныеПараметры.Свойство("ВидЦены") Тогда
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыЗаполнения.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыЗаполнения.Вставить("ВидЦены", ДополнительныеПараметры.ВидЦены);
			ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
			ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, ВидЦены");
			
			Если ДополнительныеПараметры.Свойство("Организация") И ЗначениеЗаполнено(ДополнительныеПараметры.Организация) Тогда
				ПараметрыЗаполнения.Вставить("Организация", ДополнительныеПараметры.Организация);
			КонецЕсли;
			
			ЦеныРассчитаны = ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
			Комплектующие,
			Неопределено, // Массив строк или структура отбора.
			ПараметрыЗаполнения);
		ИначеЕсли ДополнительныеПараметры.Свойство("Соглашение") Тогда
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыЗаполнения.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыЗаполнения.Вставить("Соглашение", ДополнительныеПараметры.Соглашение);
			ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
			ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, ВидЦены");
			
			Если ДополнительныеПараметры.Свойство("Организация") И ЗначениеЗаполнено(ДополнительныеПараметры.Организация) Тогда
				ПараметрыЗаполнения.Вставить("Организация", ДополнительныеПараметры.Организация);
			КонецЕсли;
			
			
			ЦеныРассчитаны = ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
			Комплектующие,
			Неопределено, // Массив строк или структура отбора.
			ПараметрыЗаполнения);
		КонецЕсли; 
		
		СуммаКРаспределению 		= ДополнительныеПараметры.Цена * Параметры.КоличествоУпаковок;
		СуммаПродажиКРаспределению  = ДополнительныеПараметры.СуммаПродажиКРаспределению;
		СуммаКомиссииКРаспределению = ДополнительныеПараметры.Комиссия;        
		
		СлужебнаяТЧ = Новый ТаблицаЗначений;
		СлужебнаяТЧ.Колонки.Добавить("СтрокаТЧ");
		СлужебнаяТЧ.Колонки.Добавить("НомерСтроки");
		
		//+ ИнфоСофт Власова И.С. 12.03.25 УА #95821
		//ОбщаяСтоимость = Комплектующие.Итог("Цена");
		ОбщаяСтоимость = 0;
		
		Для Каждого СтрокаТЧ Из Комплектующие Цикл
			
			Если ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
				СтоимостьНоменклатуры = СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок;
			Иначе	
				СтоимостьНоменклатуры = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
			КонецЕсли;
			
			ОбщаяСтоимость = ОбщаяСтоимость + СтоимостьНоменклатуры;
			
		КонецЦикла;
		//- ИнфоСофт Власова И.С. 12.03.25 УА #95821
		
		Для Каждого СтрокаТЧ Из Комплектующие Цикл
			
			ПараметрыТовара = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ЗаполнитьЗначенияСвойств(ПараметрыТовара, Параметры);
			
			ПараметрыТовара.Номенклатура       = СтрокаТЧ.Номенклатура;
			ПараметрыТовара.Характеристика     = СтрокаТЧ.Характеристика;
			ПараметрыТовара.Упаковка           = СтрокаТЧ.Упаковка;
			ПараметрыТовара.ТипНоменклатуры    = СтрокаТЧ.ТипНоменклатуры;
			ПараметрыТовара.ВидНоменклатуры    = СтрокаТЧ.ВидНоменклатуры;
			ПараметрыТовара.ЕдиницаИзмерения   = СтрокаТЧ.ЕдиницаИзмерения;
			ПараметрыТовара.ВидЦены            = СтрокаТЧ.ВидЦены;			
			ПараметрыТовара.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковок * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Количество         = СтрокаТЧ.Количество * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Доступно           = СтрокаТЧ.Доступно;
			ПараметрыТовара.ВНаличии           = СтрокаТЧ.ВНаличии;			
			ПараметрыТовара.Вставить("ПогрешностьКомиссия", 0);
			ПараметрыТовара.Вставить("ПогрешностьСуммаПродажи", 0);
			
			Если ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
				Или ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") Тогда
				ПараметрыТовара.Склад = Неопределено;
			КонецЕсли;
						
			ПараметрыТовара.ХарактеристикиИспользуются = ?(ЗначениеЗаполнено(ПараметрыТовара.Характеристика), Истина, Ложь);						
			
			//+ ИнфоСофт Власова И.С. 12.03.25 УА #95821
			Если ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
				СтоимостьНоменклатуры = СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок;
			Иначе	
				СтоимостьНоменклатуры = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
			КонецЕсли;
			//- ИнфоСофт Власова И.С. 12.03.25 УА #95821
			
			Если ПараметрыТовара.КоличествоУпаковок <> 0 И ОбщаяСтоимость <> 0 Тогда
				
				//+ ИнфоСофт Власова И.С. 12.03.25 УА #95821
				//ПараметрыТовара.Цена = Окр(((СтрокаТЧ.Цена / ОбщаяСтоимость) * СуммаКРаспределению)
				/// ПараметрыТовара.КоличествоУпаковок, 2);
				//ПараметрыТовара.Вставить("ЦенаПродажи", Окр(((СтрокаТЧ.Цена / ОбщаяСтоимость) * СуммаПродажиКРаспределению)
				/// ПараметрыТовара.КоличествоУпаковок, 2));
				//ПараметрыТовара.Вставить("Комиссия", Окр(((СтрокаТЧ.Цена / ОбщаяСтоимость) * СуммаКомиссииКРаспределению)
				/// ПараметрыТовара.КоличествоУпаковок, 2));
				
				ПараметрыТовара.Цена = Окр(((СтоимостьНоменклатуры / ОбщаяСтоимость) * СуммаКРаспределению)
					/ ПараметрыТовара.КоличествоУпаковок, 2);
				ПараметрыТовара.Вставить("ЦенаПродажи", Окр(((СтоимостьНоменклатуры / ОбщаяСтоимость) * СуммаПродажиКРаспределению)
					/ ПараметрыТовара.КоличествоУпаковок, 2));
				ПараметрыТовара.Вставить("Комиссия", Окр(((СтоимостьНоменклатуры / ОбщаяСтоимость) * СуммаКомиссииКРаспределению)
					/ ПараметрыТовара.КоличествоУпаковок, 2));
				//- ИнфоСофт Власова И.С. 12.03.25 УА #95821
				
			Иначе
				ПараметрыТовара.Цена = 0;
				ПараметрыТовара.Вставить("ЦенаПродажи", 0);
				ПараметрыТовара.Вставить("Комиссия", 0);
			КонецЕсли;
			
			//+ ИнфоСофт Власова И.С. 12.03.25 УА #95821
			//ОбщаяСтоимость = ОбщаяСтоимость - СтрокаТЧ.Цена;
			ОбщаяСтоимость = ОбщаяСтоимость - СтоимостьНоменклатуры;
			//- ИнфоСофт Власова И.С. 12.03.25 УА #95821
			
			СуммаКРаспределению = СуммаКРаспределению - ПараметрыТовара.Цена * ПараметрыТовара.КоличествоУпаковок;
			СуммаПродажиКРаспределению = СуммаПродажиКРаспределению - ПараметрыТовара.ЦенаПродажи * ПараметрыТовара.КоличествоУпаковок;
			СуммаКомиссииКРаспределению = СуммаКомиссииКРаспределению - ПараметрыТовара.Комиссия
			* ПараметрыТовара.КоличествоУпаковок;											
			
			СлужебнаяСтрока = СлужебнаяТЧ.Добавить();
			СлужебнаяСтрока.СтрокаТЧ = ПараметрыТовара;
			СлужебнаяСтрока.НомерСтроки = СтрокаТЧ.НомерСтроки;
			
		КонецЦикла; 
		
		Если (СуммаКРаспределению <> 0 Или СуммаПродажиКРаспределению <> 0 Или СуммаКомиссииКРаспределению <> 0) И СлужебнаяТЧ.Количество() > 0 Тогда
			
			ПоследняяСтрока = СлужебнаяТЧ[СлужебнаяТЧ.Количество() - 1];
			ИсходнаяСтрока = ПоследняяСтрока.СтрокаТЧ;
			ИсходнаяСтрока.Погрешность = СуммаКРаспределению;
			ИсходнаяСтрока.ПогрешностьКомиссия = СуммаКомиссииКРаспределению;
			//+ ИнфоСофт Заварин К.В. 10.04.25 УА #98479
			//ИсходнаяСтрока.ПогрешностьСуммаПродажи = СуммаПродажиКРаспределению;
			ИсходнаяСтрока.ПогрешностьСуммаПродажи =  Окр(СуммаПродажиКРаспределению, 2, РежимОкругления.Окр15как20);
			//- ИнфоСофт Заварин К.В. 10.04.25 УА #98479
			
		КонецЕсли;
		
	Иначе
	//- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133	
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И ДополнительныеПараметры.Свойство("Соглашение")
			И ЗначениеЗаполнено(ДополнительныеПараметры.Соглашение) Тогда
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыРасчета.Вставить("Соглашение", ДополнительныеПараметры.Соглашение);
			ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");
			
		Иначе
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыРасчета.Вставить("ВидЦены", ДополнительныеПараметры.ВидЦены);
			ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");
			
		КонецЕсли;
		
		КоэффициентыПропорциональностиРасчетаЦенНаборов = КоэффициентыРаспределенияПоДолям(Комплектующие.Скопировать(),
		ПараметрыРасчета);
		
		ОбщаяСтоимость = 0;
		Для Каждого ТекущаяСтрока Из КоэффициентыПропорциональностиРасчетаЦенНаборов Цикл
			ОбщаяСтоимость = ОбщаяСтоимость + ТекущаяСтрока.Цена;
		КонецЦикла;
		
		СуммаКРаспределению 		= ДополнительныеПараметры.Цена * Параметры.КоличествоУпаковок;
		СуммаПродажиКРаспределению  = ДополнительныеПараметры.СуммаПродажиКРаспределению;
		СуммаКомиссииКРаспределению = ДополнительныеПараметры.Комиссия;
		
		СлужебнаяТЧ = Новый ТаблицаЗначений;
		СлужебнаяТЧ.Колонки.Добавить("СтрокаТЧ");
		СлужебнаяТЧ.Колонки.Добавить("НомерСтроки");
		
		Комплектующие.Сортировать("КоличествоУпаковок Убыв");		
		Для Каждого ТекущаяСтрока Из Комплектующие Цикл
			
			Стоимость = КоэффициентыПропорциональностиРасчетаЦенНаборов.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки").Цена;
			
			ПараметрыТовара = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ЗаполнитьЗначенияСвойств(ПараметрыТовара, Параметры);
			
			ПараметрыТовара.Номенклатура       = ТекущаяСтрока.Номенклатура;
			ПараметрыТовара.Характеристика     = ТекущаяСтрока.Характеристика;
			ПараметрыТовара.Упаковка           = ТекущаяСтрока.Упаковка;
			ПараметрыТовара.ТипНоменклатуры    = ТекущаяСтрока.ТипНоменклатуры;
			ПараметрыТовара.ВидНоменклатуры    = ТекущаяСтрока.ВидНоменклатуры;
			ПараметрыТовара.ЕдиницаИзмерения   = ТекущаяСтрока.ЕдиницаИзмерения;
			ПараметрыТовара.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Количество         = ТекущаяСтрока.Количество * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Вставить("ПогрешностьКомиссия", 0);
			ПараметрыТовара.Вставить("ПогрешностьСуммаПродажи", 0);
			
			Если ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
				Или ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") Тогда
				ПараметрыТовара.Склад = Неопределено;
			КонецЕсли;
			
			Если ДополнительныеПараметры.Свойство("ВидЦены") Тогда
				ПараметрыТовара.ВидЦены = ДополнительныеПараметры.ВидЦены;
			Иначе
				ПараметрыТовара.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
			КонецЕсли;
			
			Если ПараметрыТовара.КоличествоУпаковок <> 0 И ОбщаяСтоимость <> 0 Тогда
				ПараметрыТовара.Цена = Окр(((Стоимость / ОбщаяСтоимость) * СуммаКРаспределению)
				/ ПараметрыТовара.КоличествоУпаковок, 2);
				ПараметрыТовара.Вставить("ЦенаПродажи", Окр(((Стоимость / ОбщаяСтоимость) * СуммаПродажиКРаспределению)
				/ ПараметрыТовара.КоличествоУпаковок, 2));
				ПараметрыТовара.Вставить("Комиссия", Окр(((Стоимость / ОбщаяСтоимость) * СуммаКомиссииКРаспределению)
				/ ПараметрыТовара.КоличествоУпаковок, 2));
			Иначе
				ПараметрыТовара.Цена = 0;
				ПараметрыТовара.Вставить("ЦенаПродажи", 0);
				ПараметрыТовара.Вставить("Комиссия", 0);
			КонецЕсли;
			
			ОбщаяСтоимость = ОбщаяСтоимость - Стоимость;
			СуммаКРаспределению = СуммаКРаспределению - ПараметрыТовара.Цена * ПараметрыТовара.КоличествоУпаковок;
			СуммаПродажиКРаспределению = СуммаПродажиКРаспределению - ПараметрыТовара.ЦенаПродажи * ПараметрыТовара.КоличествоУпаковок;
			СуммаКомиссииКРаспределению = СуммаКомиссииКРаспределению - ПараметрыТовара.Комиссия
			* ПараметрыТовара.КоличествоУпаковок;
			
			ПараметрыТовара.Доступно = ТекущаяСтрока.Доступно;
			ПараметрыТовара.ВНаличии = ТекущаяСтрока.ВНаличии;
			
			ПараметрыТовара.ХарактеристикиИспользуются = ?(ЗначениеЗаполнено(ПараметрыТовара.Характеристика), Истина, Ложь);
			
			СлужебнаяСтрока = СлужебнаяТЧ.Добавить();
			СлужебнаяСтрока.СтрокаТЧ = ПараметрыТовара;
			СлужебнаяСтрока.НомерСтроки = ТекущаяСтрока.НомерСтроки;
			
		КонецЦикла;
		
		Если (СуммаКРаспределению <> 0 Или СуммаПродажиКРаспределению <> 0 Или СуммаКомиссииКРаспределению <> 0) И СлужебнаяТЧ.Количество() > 0 Тогда
			
			ПоследняяСтрока = СлужебнаяТЧ[СлужебнаяТЧ.Количество() - 1];
			ИсходнаяСтрока = ПоследняяСтрока.СтрокаТЧ;
			ИсходнаяСтрока.Погрешность = СуммаКРаспределению;
			ИсходнаяСтрока.ПогрешностьКомиссия = СуммаКомиссииКРаспределению;
			//+ ИнфоСофт Заварин К.В. 10.04.25 УА #98479
			//ИсходнаяСтрока.ПогрешностьСуммаПродажи = СуммаПродажиКРаспределению;
			ИсходнаяСтрока.ПогрешностьСуммаПродажи =  Окр(СуммаПродажиКРаспределению, 2, РежимОкругления.Окр15как20);
			//- ИнфоСофт Заварин К.В. 10.04.25 УА #98479
			
		КонецЕсли;
	//+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133	
	КонецЕсли;
    //- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133
	СлужебнаяТЧ.Сортировать("НомерСтроки Возр");
	
	Для Каждого СтрокаТЧ Из СлужебнаяТЧ Цикл
		ПодобранныеТовары.Добавить(СтрокаТЧ.СтрокаТЧ);
	КонецЦикла;

	Возврат ПодобранныеТовары;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 23.09.24 УА #83662

//+ ИнфоСофт Мурсалимов Д.Р. 23.09.24 УА #83662
Функция КомплектующиеУТ11_5(Параметры, ДополнительныеПараметры) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если Не ЗначениеЗаполнено(Параметры.ВариантКомплектацииНоменклатуры) Тогда
		ВариантКомплектацииНоменклатуры = ВариантКомплектацииНоменклатурыПоУмолчанию(
			Параметры.НоменклатураНабора, Параметры.ХарактеристикаНабора);
	Иначе
		ВариантКомплектацииНоменклатуры = Параметры.ВариантКомплектацииНоменклатуры;
	КонецЕсли;

	Если Не Параметры.Свойство("КоличествоУпаковок") Тогда
		Параметры.Вставить("КоличествоУпаковок", 1);
	КонецЕсли;

	ПодобранныеТовары = Новый Массив;

	Если Не ЗначениеЗаполнено(ВариантКомплектацииНоменклатуры) Тогда
		ТекстОшибки = СтрШаблон("Для номенклатуры %1 %2 не определен состав набора", Параметры.НоменклатураНабора,
			Параметры.ХарактеристикаНабора);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат ПодобранныеТовары;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133
	ВариантРасчетаЦеныНабора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВариантКомплектацииНоменклатуры, "ВариантРасчетаЦеныНабора");
	//- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133
	
	Колонки = Новый Массив;
	Колонки.Добавить("НомерСтроки");
	Колонки.Добавить("НоменклатураКомплекта");
	Колонки.Добавить("ХарактеристикаКомплекта");
	Колонки.Добавить("Номенклатура");
	Колонки.Добавить("Характеристика");
	Колонки.Добавить("Цена");
	Колонки.Добавить("ВидЦены");
	Колонки.Добавить("Упаковка");
	Колонки.Добавить("Количество");
	Колонки.Добавить("КоличествоУпаковок");
	Колонки.Добавить("ПроцентРучнойСкидки");
	Колонки.Добавить("СуммаРучнойСкидки");
	Колонки.Добавить("Доступно");
	Колонки.Добавить("ВНаличии");
	
	Комплектующие = НаборыСервер.СоздатьТаблицуСоставаНабора(Колонки);
	Комплектующие.Колонки.Добавить("ТипНоменклатуры", 	Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ВидНоменклатуры", 	Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ЕдиницаИзмерения", 	Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Комплектующие.Колонки.Добавить("Комиссия", 			Новый ОписаниеТипов("Число"));

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки КАК НомерСтроки,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
	|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости,
	|	СУММА(ЕСТЬNULL(ДоступностьТоваров.ВНаличии, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)) КАК ВНаличии,
	|	СУММА(ЕСТЬNULL(ДоступностьТоваров.Свободно, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)) КАК Доступно
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ДоступностьТоваров
	|		ПО ДоступностьТоваров.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
	|			И ДоступностьТоваров.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика
	|			И ДоступностьТоваров.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|			И ДоступностьТоваров.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			И &ФильтрСклады
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ТипНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество,
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
	Справочники["УпаковкиЕдиницыИзмерения"].ТекстЗапросаКоэффициентаУпаковки(
	"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения)",
	"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Справочник.Номенклатура)"));
	
	Запрос.УстановитьПараметр("Ссылка", ВариантКомплектацииНоменклатуры);
	
	Если ДополнительныеПараметры.Свойство("Склады") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрСклады", "ДоступностьТоваров.Склад В (&Склады)");
		Запрос.УстановитьПараметр("Склады", ДополнительныеПараметры.Склады);
	Иначе
		Запрос.УстановитьПараметр("ФильтрСклады", Истина);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.КоличествоУпаковок   = НоваяСтрока.КоличествоУпаковок;
		НоваяСтрока.Количество           = НоваяСтрока.Количество;
		НоваяСтрока.НоменклатураНабора   = Параметры.НоменклатураНабора;
		НоваяСтрока.ХарактеристикаНабора = Параметры.ХарактеристикаНабора;
		
	КонецЦикла;
	
	//+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133	
	Если ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
		
		Если ДополнительныеПараметры.Свойство("ВидЦены") Тогда
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыЗаполнения.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыЗаполнения.Вставить("ВидЦены", ДополнительныеПараметры.ВидЦены);
			ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
			ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, ВидЦены");
			
			Если ДополнительныеПараметры.Свойство("Организация") И ЗначениеЗаполнено(ДополнительныеПараметры.Организация) Тогда
				ПараметрыЗаполнения.Вставить("Организация", ДополнительныеПараметры.Организация);
			КонецЕсли;
			
			ЦеныРассчитаны = ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
			Комплектующие,
			Неопределено, // Массив строк или структура отбора.
			ПараметрыЗаполнения);
		ИначеЕсли ДополнительныеПараметры.Свойство("Соглашение") Тогда
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыЗаполнения.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыЗаполнения.Вставить("Соглашение", ДополнительныеПараметры.Соглашение);
			ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
			ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, ВидЦены");
			
			Если ДополнительныеПараметры.Свойство("Организация") И ЗначениеЗаполнено(ДополнительныеПараметры.Организация) Тогда
				ПараметрыЗаполнения.Вставить("Организация", ДополнительныеПараметры.Организация);
			КонецЕсли;
			
			
			ЦеныРассчитаны = ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
			Комплектующие,
			Неопределено, // Массив строк или структура отбора.
			ПараметрыЗаполнения);
		КонецЕсли; 
		
		СуммаКРаспределению 		= ДополнительныеПараметры.Цена * Параметры.КоличествоУпаковок;
		СуммаПродажиКРаспределению  = ДополнительныеПараметры.СуммаПродажиКРаспределению;
		СуммаКомиссииКРаспределению = ДополнительныеПараметры.Комиссия;        
		
		СлужебнаяТЧ = Новый ТаблицаЗначений;
		СлужебнаяТЧ.Колонки.Добавить("СтрокаТЧ");
		СлужебнаяТЧ.Колонки.Добавить("НомерСтроки");
		
		//+ ИнфоСофт Власова И.С. 12.03.25 УА #95821
		//ОбщаяСтоимость = Комплектующие.Итог("Цена");
		ОбщаяСтоимость = 0;
		
		Для Каждого СтрокаТЧ Из Комплектующие Цикл
			
			Если ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
				СтоимостьНоменклатуры = СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок;
			Иначе	
				СтоимостьНоменклатуры = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
			КонецЕсли;
			
			ОбщаяСтоимость = ОбщаяСтоимость + СтоимостьНоменклатуры;
			
		КонецЦикла;
		//- ИнфоСофт Власова И.С. 12.03.25 УА #95821
		
		Для Каждого СтрокаТЧ Из Комплектующие Цикл
			
			ПараметрыТовара = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ЗаполнитьЗначенияСвойств(ПараметрыТовара, Параметры);
			
			ПараметрыТовара.Номенклатура       = СтрокаТЧ.Номенклатура;
			ПараметрыТовара.Характеристика     = СтрокаТЧ.Характеристика;
			ПараметрыТовара.Упаковка           = СтрокаТЧ.Упаковка;
			ПараметрыТовара.ТипНоменклатуры    = СтрокаТЧ.ТипНоменклатуры;
			ПараметрыТовара.ВидНоменклатуры    = СтрокаТЧ.ВидНоменклатуры;
			ПараметрыТовара.ЕдиницаИзмерения   = СтрокаТЧ.ЕдиницаИзмерения;
			ПараметрыТовара.ВидЦены            = СтрокаТЧ.ВидЦены;			
			ПараметрыТовара.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковок * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Количество         = СтрокаТЧ.Количество * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Доступно           = СтрокаТЧ.Доступно;
			ПараметрыТовара.ВНаличии           = СтрокаТЧ.ВНаличии;			
			ПараметрыТовара.Вставить("ПогрешностьКомиссия", 0);
			ПараметрыТовара.Вставить("ПогрешностьСуммаПродажи", 0);
			
			Если ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
				Или ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") Тогда
				ПараметрыТовара.Склад = Неопределено;
			КонецЕсли;
			
			ПараметрыТовара.ХарактеристикиИспользуются = ?(ЗначениеЗаполнено(ПараметрыТовара.Характеристика), Истина, Ложь);						
			
			//+ ИнфоСофт Власова И.С. 12.03.25 УА #95821
			Если ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
				СтоимостьНоменклатуры = СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок;
			Иначе	
				СтоимостьНоменклатуры = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
			КонецЕсли;
			//- ИнфоСофт Власова И.С. 12.03.25 УА #95821
			
			Если ПараметрыТовара.КоличествоУпаковок <> 0 И ОбщаяСтоимость <> 0 Тогда
				
				//+ ИнфоСофт Власова И.С. 12.03.25 УА #95821
				//ПараметрыТовара.Цена = Окр(((СтрокаТЧ.Цена / ОбщаяСтоимость) * СуммаКРаспределению)
				/// ПараметрыТовара.КоличествоУпаковок, 2);
				//ПараметрыТовара.Вставить("ЦенаПродажи", Окр(((СтрокаТЧ.Цена / ОбщаяСтоимость) * СуммаПродажиКРаспределению)
				/// ПараметрыТовара.КоличествоУпаковок, 2));
				//ПараметрыТовара.Вставить("Комиссия", Окр(((СтрокаТЧ.Цена / ОбщаяСтоимость) * СуммаКомиссииКРаспределению)
				/// ПараметрыТовара.КоличествоУпаковок, 2));
				
				ПараметрыТовара.Цена = Окр(((СтоимостьНоменклатуры / ОбщаяСтоимость) * СуммаКРаспределению)
					/ ПараметрыТовара.КоличествоУпаковок, 2);
				ПараметрыТовара.Вставить("ЦенаПродажи", Окр(((СтоимостьНоменклатуры / ОбщаяСтоимость) * СуммаПродажиКРаспределению)
					/ ПараметрыТовара.КоличествоУпаковок, 2));
				ПараметрыТовара.Вставить("Комиссия", Окр(((СтоимостьНоменклатуры / ОбщаяСтоимость) * СуммаКомиссииКРаспределению)
					/ ПараметрыТовара.КоличествоУпаковок, 2));
				//- ИнфоСофт Власова И.С. 12.03.25 УА #95821
				
			Иначе
				ПараметрыТовара.Цена = 0;
				ПараметрыТовара.Вставить("ЦенаПродажи", 0);
				ПараметрыТовара.Вставить("Комиссия", 0);
			КонецЕсли;
			
			//+ ИнфоСофт Власова И.С. 12.03.25 УА #95821
			//ОбщаяСтоимость = ОбщаяСтоимость - СтрокаТЧ.Цена;
			ОбщаяСтоимость = ОбщаяСтоимость - СтоимостьНоменклатуры;
			//- ИнфоСофт Власова И.С. 12.03.25 УА #95821
			
			СуммаКРаспределению = СуммаКРаспределению - ПараметрыТовара.Цена * ПараметрыТовара.КоличествоУпаковок;
			СуммаПродажиКРаспределению = СуммаПродажиКРаспределению - ПараметрыТовара.ЦенаПродажи * ПараметрыТовара.КоличествоУпаковок;
			СуммаКомиссииКРаспределению = СуммаКомиссииКРаспределению - ПараметрыТовара.Комиссия
			* ПараметрыТовара.КоличествоУпаковок;											
			
			СлужебнаяСтрока = СлужебнаяТЧ.Добавить();
			СлужебнаяСтрока.СтрокаТЧ = ПараметрыТовара;
			СлужебнаяСтрока.НомерСтроки = СтрокаТЧ.НомерСтроки;
			
		КонецЦикла; 
		
		Если (СуммаКРаспределению <> 0 Или СуммаПродажиКРаспределению <> 0 Или СуммаКомиссииКРаспределению <> 0) И СлужебнаяТЧ.Количество() > 0 Тогда
			
			ПоследняяСтрока = СлужебнаяТЧ[СлужебнаяТЧ.Количество() - 1];
			ИсходнаяСтрока = ПоследняяСтрока.СтрокаТЧ;
			ИсходнаяСтрока.Погрешность = СуммаКРаспределению;
			ИсходнаяСтрока.ПогрешностьКомиссия = СуммаКомиссииКРаспределению;
			//+ ИнфоСофт Заварин К.В. 10.04.25 УА #98479
			//ИсходнаяСтрока.ПогрешностьСуммаПродажи = СуммаПродажиКРаспределению;
			ИсходнаяСтрока.ПогрешностьСуммаПродажи =  Окр(СуммаПродажиКРаспределению, 2, РежимОкругления.Окр15как20);
			//- ИнфоСофт Заварин К.В. 10.04.25 УА #98479
			
		КонецЕсли;
		
	Иначе
	//- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133	
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И ДополнительныеПараметры.Свойство("Соглашение")
			И ЗначениеЗаполнено(ДополнительныеПараметры.Соглашение) Тогда
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыРасчета.Вставить("Соглашение", ДополнительныеПараметры.Соглашение);
			ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");
			
		Иначе
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыРасчета.Вставить("ВидЦены", ДополнительныеПараметры.ВидЦены);
			ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");
			
		КонецЕсли;
		
		КоэффициентыПропорциональностиРасчетаЦенНаборов = КоэффициентыРаспределенияПоДолям(Комплектующие.Скопировать(),
		ПараметрыРасчета);
		
		ОбщаяСтоимость = 0;
		Для Каждого ТекущаяСтрока Из КоэффициентыПропорциональностиРасчетаЦенНаборов Цикл
			ОбщаяСтоимость = ОбщаяСтоимость + ТекущаяСтрока.Цена;
		КонецЦикла;
		
		СуммаКРаспределению 		= ДополнительныеПараметры.Цена * Параметры.КоличествоУпаковок;
		СуммаПродажиКРаспределению 	= ДополнительныеПараметры.СуммаПродажиКРаспределению;
		СуммаКомиссииКРаспределению = ДополнительныеПараметры.Комиссия;
		
		СлужебнаяТЧ = Новый ТаблицаЗначений;
		СлужебнаяТЧ.Колонки.Добавить("СтрокаТЧ");
		СлужебнаяТЧ.Колонки.Добавить("НомерСтроки");
		
		Комплектующие.Сортировать("КоличествоУпаковок Убыв");
		
		Для Каждого ТекущаяСтрока Из Комплектующие Цикл
			
			Стоимость = КоэффициентыПропорциональностиРасчетаЦенНаборов.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки").Цена;
			
			ПараметрыТовара = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ЗаполнитьЗначенияСвойств(ПараметрыТовара, Параметры);
			
			ПараметрыТовара.Номенклатура       = ТекущаяСтрока.Номенклатура;
			ПараметрыТовара.Характеристика     = ТекущаяСтрока.Характеристика;
			ПараметрыТовара.Упаковка           = ТекущаяСтрока.Упаковка;
			ПараметрыТовара.ТипНоменклатуры    = ТекущаяСтрока.ТипНоменклатуры;
			ПараметрыТовара.ВидНоменклатуры    = ТекущаяСтрока.ВидНоменклатуры;
			ПараметрыТовара.ЕдиницаИзмерения   = ТекущаяСтрока.ЕдиницаИзмерения;
			ПараметрыТовара.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Количество         = ТекущаяСтрока.Количество * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Вставить("ПогрешностьКомиссия", 0);
			ПараметрыТовара.Вставить("ПогрешностьСуммаПродажи", 0);
			
			Если ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
				Или ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") Тогда
				ПараметрыТовара.Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
			КонецЕсли;
			
			Если ДополнительныеПараметры.Свойство("ВидЦены") Тогда
				ПараметрыТовара.ВидЦены = ДополнительныеПараметры.ВидЦены;
			Иначе
				ПараметрыТовара.ВидЦены =ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
			КонецЕсли;
			
			Если ПараметрыТовара.КоличествоУпаковок <> 0 И ОбщаяСтоимость <> 0 Тогда
				ПараметрыТовара.Цена = Окр(((Стоимость / ОбщаяСтоимость) * СуммаКРаспределению)
				/ ПараметрыТовара.КоличествоУпаковок, 2);
				ПараметрыТовара.Вставить("ЦенаПродажи", Окр(((Стоимость / ОбщаяСтоимость) * СуммаПродажиКРаспределению)
				/ ПараметрыТовара.КоличествоУпаковок, 2));	
				ПараметрыТовара.Вставить("Комиссия", Окр(((Стоимость / ОбщаяСтоимость) * СуммаКомиссииКРаспределению
				/ ПараметрыТовара.КоличествоУпаковок), 2));
			Иначе
				ПараметрыТовара.Цена = 0;
				ПараметрыТовара.Вставить("ЦенаПродажи", 0);
				ПараметрыТовара.Вставить("Комиссия", 0);
			КонецЕсли;
			
			ОбщаяСтоимость 				= ОбщаяСтоимость - Стоимость;
			СуммаКРаспределению 		= СуммаКРаспределению - ПараметрыТовара.Цена * ПараметрыТовара.КоличествоУпаковок;
			СуммаПродажиКРаспределению 	= СуммаПродажиКРаспределению - ПараметрыТовара.ЦенаПродажи * ПараметрыТовара.КоличествоУпаковок;
			СуммаКомиссииКРаспределению = СуммаКомиссииКРаспределению - ПараметрыТовара.Комиссия
			* ПараметрыТовара.КоличествоУпаковок;
			
			ПараметрыТовара.Доступно = ТекущаяСтрока.Доступно;
			ПараметрыТовара.ВНаличии = ТекущаяСтрока.ВНаличии;
			
			ПараметрыТовара.ХарактеристикиИспользуются = ?(ЗначениеЗаполнено(ПараметрыТовара.Характеристика), Истина, Ложь);
			
			СлужебнаяСтрока = СлужебнаяТЧ.Добавить();
			СлужебнаяСтрока.СтрокаТЧ = ПараметрыТовара;
			СлужебнаяСтрока.НомерСтроки = ТекущаяСтрока.НомерСтроки;
			
		КонецЦикла;
		
		Если (СуммаКРаспределению <> 0 Или СуммаПродажиКРаспределению <> 0 Или СуммаКомиссииКРаспределению <> 0) И СлужебнаяТЧ.Количество() > 0 Тогда
			
			ПоследняяСтрока = СлужебнаяТЧ[СлужебнаяТЧ.Количество() - 1];
			ИсходнаяСтрока = ПоследняяСтрока.СтрокаТЧ;
			ИсходнаяСтрока.Погрешность 				= СуммаКРаспределению;
			//+ ИнфоСофт Заварин К.В. 10.04.25 УА #98479
			//ИсходнаяСтрока.ПогрешностьСуммаПродажи = СуммаПродажиКРаспределению;
			ИсходнаяСтрока.ПогрешностьСуммаПродажи =  Окр(СуммаПродажиКРаспределению, 2, РежимОкругления.Окр15как20);
			//- ИнфоСофт Заварин К.В. 10.04.25 УА #98479
			ИсходнаяСтрока.ПогрешностьКомиссия 		= СуммаКомиссииКРаспределению;
			
		КонецЕсли;
	//+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133	
	КонецЕсли;
    //- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133
	СлужебнаяТЧ.Сортировать("НомерСтроки Возр");
	
	Для Каждого СтрокаТЧ Из СлужебнаяТЧ Цикл
		ПодобранныеТовары.Добавить(СтрокаТЧ.СтрокаТЧ);
	КонецЦикла;

	Возврат ПодобранныеТовары;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 23.09.24 УА #83662

#КонецОбласти
