
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 22.06.21 УА #37078
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИС_МП_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.06.21 УА #37078

//+ ИнфоСофт Ивонин К.А. 22.06.21 УА #37078
&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Если ЗначениеЗаполнено(Профиль) Тогда
		УстановитьОтборПоПрофилю();
	КонецЕсли;	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.06.21 УА #37078

//+ ИнфоСофт Ивонин К.А. 22.06.21 УА #37078
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	Очищать = Не ЗначениеЗаполнено(Профиль);
	УстановитьОтборПоПрофилю(Очищать);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.06.21 УА #37078

//+ ИнфоСофт Ивонин К.А. 03.02.25 УА #92406
&НаКлиенте
Процедура ПрофильОчистка(Элемент, СтандартнаяОбработка)
	УстановитьОтборПоПрофилю(Истина);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 03.02.25 УА #92406

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 24.05.21 УА #34786
&НаКлиенте
Процедура ЗагрузитьСклады(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСкладыНаСервере(Профиль);
	Элементы.Список.Обновить();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Загрузка завершена");
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.05.21 УА #34786

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 24.05.21 УА #34786
&НаСервереБезКонтекста
Процедура ЗагрузитьСкладыНаСервере(Профиль)	
	ИС_ВБ_Сервер.ЗагрузитьСклады(Профиль);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.05.21 УА #34786

//+ ИнфоСофт Ивонин К.А. 22.06.21 УА #37078
&НаСервере
Процедура УстановитьОтборПоПрофилю(Очистить = Ложь)
	
	Если Очистить Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Профиль");	
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Профиль", Профиль);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.06.21 УА #37078

#КонецОбласти
