#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 18.12.23 УА #67802
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда                         
		ПодключитьРасширениеДляРаботыСФайлами(Истина);
	#КонецЕсли
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 18.12.23 УА #67802

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаКлиенте
Процедура ПутьКФайлуОтчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	ОчиститьСообщения(); 
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл отчета комиссионера";
	ДиалогВыбораФайла.МножественныйВыбор =  Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	//+ ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567                                           
	РасширениеФайлаZip = Ложь;
	Если Элементы.СтраницаОсновная.ТекущаяСтраница.Имя = Элементы.СтраницаСбер.Имя Тогда 
		ДиалогВыбораФайла.Фильтр = "Архив ZIP (*.zip)|*.zip|CSV файлы(*.csv)|*.csv";
	Иначе
		ДиалогВыбораФайла.Фильтр = "Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	КонецЕсли;                                  
	//ДиалогВыбораФайла.Фильтр = "Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	//- ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567	
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Реквизит", "ПутьКФайлуОтчета"); 
	//+ ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567
	ДополнительныеПараметры.Вставить("ЭтоZip", "РасширениеФайлаZip");
	//- ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567
	ДополнительныеПараметры.Вставить("Адрес", "АдресОтчетаВоВременномХранилище");  
	ДополнительныеПараметры.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры));
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаКлиенте
Процедура ПрочитатьДанныеИзФайла(Команда)
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлуОтчета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл отчета.", , , "ПутьКФайлуОтчета");
		Возврат;
	КонецЕсли; 
	
	//+ ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419
	//Если НовыйФорматФайлаЯМ Тогда
	Если НовыйФорматФайлаЯМ Или ФорматФайлаДо31052024ЯМ Тогда
	//- ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419
	//+ ИнфоСофт Сумин Д.В. 13.05.2024 УА #74879	
		ПолучитьТаблицуЗначенийПродажИзФайлаЯндексПосле30032024();
	ИначеЕсли ФорматФайлаДо31032024ЯМ Тогда	
		ПолучитьТаблицуЗначенийПродажИзФайлаЯндекс(); 
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать формат файла.'"));
	КонецЕсли;
	//ПолучитьТаблицуЗначенийПродажИзФайлаЯндекс(); 
	//- ИнфоСофт Сумин Д.В. 13.05.2024 УА #74879 
	
	ЗаписатьДанныеПродаж(); 
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеФайлы = ДиалогВыбораФайла.ВыбранныеФайлы;
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЭтотОбъект[ДополнительныеПараметры.Реквизит] = ВыбранныеФайлы[0];
		
		ВыбранныйФайл = Новый Файл(ВыбранныеФайлы[0]); 
		//+ ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567		
		Расширение = ВыбранныйФайл.Расширение; 				                                  	
		
		Если Расширение = ".zip" Тогда  						
			ЭтотОбъект[ДополнительныеПараметры.ЭтоZip] = Истина;
		ИначеЕсли Элементы.СтраницаОсновная.ТекущаяСтраница.Имя = Элементы.СтраницаСбер.Имя Тогда  
			//+ ИнфоСофт Стояк Ю.К. 10.06.2024 УА #77384
			//ДатаОтчета = Дата(Сред(ВыбранныйФайл.ИмяБезРасширения, СтрДлина(ВыбранныйФайл.ИмяБезРасширения) - 9, 10) + " 00:00:00");			
			Попытка
				ДатаОтчета = Дата(Сред(ВыбранныйФайл.ИмяБезРасширения, СтрДлина(ВыбранныйФайл.ИмяБезРасширения) - 9, 10) + " 00:00:00");			
				//+ ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81299				
				ДатаДопФайла = ДатаОтчета;                  
				//- ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81299
			Исключение
				ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось получить дату отчета из названия файла. Укажите дату на форме!");
				Элементы.ДатаОтчета.Видимость = Истина;
			КонецПопытки;
			//- ИнфоСофт Стояк Ю.К. 10.06.2024 УА #77384
		КонецЕсли;                                  
		//- ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567
		
		ПутьКФайлуВоВременномКаталоге = ВыбранныеФайлы[0];
		ПоместитьФайлНаСервер(ДополнительныеПараметры.Адрес);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаКлиенте
Процедура ПоместитьФайлНаСервер(Адрес)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоместитьФайлНаСерверЗавершение", ЭтотОбъект, Новый Структура("Адрес", Адрес));
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , , , ПутьКФайлуВоВременномКаталоге, УникальныйИдентификатор);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаКлиенте
Процедура ВыполнитьСозданиеДокументов(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить профиль.",,,"Профиль");
	    Возврат;
	КонецЕсли;	
	
	ЗаполнитьДоговорыСоглашения();
	
	Если РеализацияЧерезКомиссионераЯМ Тогда
		//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
		//СформироватьРеализациюЧерезКомиссионераНаСервере();
		Если Не СформироватьРеализациюЧерезКомиссионераНаСервере() Тогда
			Возврат;
		КонецЕсли;	
		//- ИнфоСофт Власова И.С. 06.08.24 УА #67453	
	Иначе
		//+ ИнфоСофт Власова И.С. 06.08.24 УА #81190
		//СформироватьОтчетаКомиссионераНаСервере();
		СформироватьОтчетКомиссионераНаСервере();
		//- ИнфоСофт Власова И.С. 06.08.24 УА #81190	
	КонецЕсли;
	
	УстановитьНачальноеОформлениеЯМ();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаКлиенте
Процедура РеализацияЧерезКомиссионераПриИзменении(Элемент) 
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран период.", , , "Период");
		РеализацияЧерезКомиссионераЯМ = Ложь;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран период.", , , "Профиль");
		РеализацияЧерезКомиссионераЯМ = Ложь;
		Возврат;
	КонецЕсли; 
	
	Если РеализацияЧерезКомиссионераЯМ Тогда 
		
		Попытка
			ОтчетКомиссионераЯМ = Ложь; 
			
			ЯндексКонтрагенты.Очистить(); 
			
			Если СписокТранзакцийExcelЯМ.Количество() = 0 Тогда
				
				ПолучитьСписокТранзакцийПродаж();
				
				Если СписокТранзакцийExcelЯМ.Количество() = 0 Тогда
					
					ОбщегоНазначенияКлиент.СообщитьПользователю("В данном периоде не найдены продажи для выбранного профиля. Выполните загрузку файла о продажах.");
					РеализацияЧерезКомиссионераЯМ = Ложь;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ОшибкаСопоставления = ПолучитьРезультатПроверкиСопоставленияЯМ();
			
			Если ОшибкаСопоставления Тогда
				
				РеализацияЧерезКомиссионераЯМ = Ложь;
				
				//+ ИнфоСофт Заварин К.В. 28.03.25 УА #97359
				СписокТранзакцийExcelЯМ.Сортировать("Номенклатура", "");
				//- ИнфоСофт Заварин К.В. 28.03.25 УА #97359
				
				Возврат;
				
			Иначе
				Элементы.СписокТранзакцийExcelЯМ.Видимость = ложь;
			КонецЕсли;
			
			РезультатПроверки = ПолучитьРезультатПроверкиПродажЮрЛицам();  
			
			КонтрагентыСопоставлены = ПолучитьРезультатСопоставленияКонтрагентов();
			
			//+ ИнфоСофт Власова И.С. 05.08.24 УА #81190
			Если АвтоматическиСоздатьКонтрагентовЯМ И КонтрагентыСопоставлены = "НеЗаполненыДанныеКомиссии" Тогда
				РеализацияЧерезКомиссионераЯМ = Ложь;
				Возврат;
			КонецЕсли;	
			//- ИнфоСофт Власова И.С. 05.08.24 УА #81190
			
			Если РезультатПроверки.РеализацияЧерезКомиссионера Тогда
				ЗаполнитьКонтрагентыОтображениеНаСервере("Яндекс");	
				Элементы.ЯндексКонтрагентыОтображение.Видимость = Истина;
			Иначе 
				РеализацияЧерезКомиссионераЯМ = Ложь;
				ОтчетКомиссионера = Истина;
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(РезультатПроверки.СообщениеПользователю) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПроверки.СообщениеПользователю);
			КонецЕсли; 
			
			Если КонтрагентыСопоставлены Тогда
				Элементы.ГруппаСозданиеДокументов.Видимость = Истина;
			Иначе
				Элементы.СоздатьКонтрагентаЯМ.Видимость = Истина;
				Элементы.ГруппаСозданиеДокументов.Видимость = Ложь;
				РеализацияЧерезКомиссионераЯМ = Ложь;
			КонецЕсли;
			
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252 

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаКлиенте
Процедура ОтчетКомиссионераПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран период.", , , "Период");
		ОтчетКомиссионераЯМ = Ложь;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		РеализацияЧерезКомиссионераЯМ = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ОтчетКомиссионераЯМ Тогда
		
		Если СписокТранзакцийExcelЯМ.Количество() = 0 Тогда
			
			ПолучитьСписокТранзакцийПродаж();
			Если СписокТранзакцийExcelЯМ.Количество() = 0 Тогда
				
				ОбщегоНазначенияКлиент.СообщитьПользователю("В данном периоде не найдены продажи для выбранного профиля. Выполните загрузку файла о продажах.");
				ОтчетКомиссионера = Ложь;
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;  
		
		ОшибкаСопоставления = ПолучитьРезультатПроверкиСопоставленияЯМ();
		
		Если ОшибкаСопоставления Тогда
			ОтчетКомиссионераЯМ = Ложь;
			
			//+ ИнфоСофт Заварин К.В. 12.03.25 УА #95878
			СписокТранзакцийExcelЯМ.Сортировать("Номенклатура", "");
			//- ИнфоСофт Заварин К.В. 12.03.25 УА #95878
			
			Возврат;
		Иначе
			Элементы.СписокТранзакцийExcelЯМ.Видимость = ложь;
		КонецЕсли;
		
		
		//+ ИнфоСофт Заварин К.В. 12.03.25 УА #95878
		СписокТранзакцийExcelЯМ.Сортировать("Номенклатура", "");
		//- ИнфоСофт Заварин К.В. 12.03.25 УА #95878
		
		ЗаполнитьКонтрагентыОтображениеНаСервере("Яндекс");	
		РеализацияЧерезКомиссионераЯМ = Ложь;
		Элементы.СоздатьКонтрагентаЯМ.Видимость = Ложь;
		Элементы.ГруппаСозданиеДокументов.Видимость = Истина;
		Элементы.ЯндексКонтрагентыОтображение.Видимость = Ложь;
		
		//+ ИнфоСофт Заварин К.В. 18.09.24 УА #83149	
		Если АвтоматическиСоздатьКонтрагентовЯМ И ЗаполнитьКолонкуПокупательЯМ Тогда 
			
			ЯндексКонтрагенты.Очистить();
			
			РезультатПроверки = ПолучитьРезультатПроверкиПродажЮрЛицам();  
			
			КонтрагентыСопоставлены = ПолучитьРезультатСопоставленияКонтрагентов();
			
			Если КонтрагентыСопоставлены = "НеЗаполненыДанныеКомиссии" Тогда
				Возврат;
			КонецЕсли;	
			
			Если РезультатПроверки.РеализацияЧерезКомиссионера Тогда
				ЗаполнитьКонтрагентыОтображениеНаСервере("Яндекс");	
				Элементы.ЯндексКонтрагентыОтображение.Видимость = Истина;
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(РезультатПроверки.СообщениеПользователю) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПроверки.СообщениеПользователю);
			КонецЕсли;
			
			Если КонтрагентыСопоставлены Тогда
				Элементы.ГруппаСозданиеДокументов.Видимость = Истина;
			Иначе
				Элементы.СоздатьКонтрагентаЯМ.Видимость = Истина;
				Элементы.ГруппаСозданиеДокументов.Видимость = Ложь;
				РеализацияЧерезКомиссионераЯМ = Ложь;
			КонецЕсли; 
			
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 18.09.24 УА #83149
		
	КонецЕсли;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаКлиенте
Процедура ПоказатьПунктДва(Команда)
	Элементы.ГруппаНастройкиСозданиеДокументов.Видимость = Истина;
	Элементы.ПоказатьПунктДва.Видимость = Ложь;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 20.08.2023 УА #61252
&НаКлиенте
Процедура СоздатьКонтрагента(Команда) 
	
	Если ЗначениеЗаполнено(Элементы.ЯндексКонтрагентыОтображение.ТекущиеДанные.Партнер) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Контрагент уже создан.");
		Возврат;
	КонецЕсли;
	
	ЭлементыЗаполнения = Новый Структура();
	ЭлементыЗаполнения.Вставить("Инн", Элементы.ЯндексКонтрагентыОтображение.ТекущиеДанные.Инн);
	
	ИНН = Элементы.ЯндексКонтрагентыОтображение.ТекущиеДанные.Инн;
	Отбор = Новый Структура("ИНН", ИНН);
	
	НаименованиеКлиента = ЯндексКонтрагенты.НайтиСтроки(Отбор)[0].НаименованиеКлиента;
	
	ЭлементыЗаполнения.Вставить("Наименование", НаименованиеКлиента);
	ЭлементыЗаполнения.Вставить("СокращенноеНаименование", НаименованиеКлиента);
	ЭлементыЗаполнения.Вставить("ЮридическийАдрес", НаименованиеКлиента = ЯндексКонтрагенты.НайтиСтроки(Отбор)[0].АдресКлиента);
	
	ПараметрыФормы = Новый Структура("Основание", ЭлементыЗаполнения);
	ОткрытьФорму("Справочник.Партнеры.Форма.ПомощникНового", ПараметрыФормы); 
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924
&НаКлиенте
Процедура СоздатьКонтрагентаОзон(Команда) 
	
	Если ЗначениеЗаполнено(Элементы.OzonКонтрагентыОтображение.ТекущиеДанные.Партнер) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Контрагент уже создан.");
		Возврат;
	КонецЕсли;
	
	ЭлементыЗаполнения = Новый Структура();
	ЭлементыЗаполнения.Вставить("Инн", Элементы.OzonКонтрагентыОтображение.ТекущиеДанные.Инн);
	
	ИНН = Элементы.OzonКонтрагентыОтображение.ТекущиеДанные.Инн;
	Отбор = Новый Структура("ИНН", ИНН);
	
	НаименованиеКлиента = OzonКонтрагенты.НайтиСтроки(Отбор)[0].НаименованиеКлиента;
	
	ЭлементыЗаполнения.Вставить("Наименование", НаименованиеКлиента);
	ЭлементыЗаполнения.Вставить("СокращенноеНаименование", НаименованиеКлиента);
	ЭлементыЗаполнения.Вставить("ЮридическийАдрес", НаименованиеКлиента = OzonКонтрагенты.НайтиСтроки(Отбор)[0].АдресКлиента);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеСозданияКонтрагента", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура("Основание", ЭлементыЗаполнения);
	ОткрытьФорму("Справочник.Партнеры.Форма.ПомощникНового", ПараметрыФормы,,,,,Оповещение); 
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924

//+ ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252
&НаКлиенте
Процедура СтраницаОсновнаяПриСменеСтраницы(Элемент, ТекущаяСтраница) 
	
	АдресОтчетаВоВременномХранилище = "";
	ПутьКФайлуВоВременномКаталоге = "";
	ПутьКФайлуОтчета = "";
	//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567	
	ПутьКФайлуПродажЮрЛицамОзон = "";           
	//- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
	//+ ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
	ВариантФормированияЦеныВозврата = 0;
	Элементы.ВидЦеныВозвратаЯМ.Видимость = Ложь;  
	Элементы.ВидЦеныВозвратаOzon.Видимость = Ложь;
	//- ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897 
	//+ ИнфоСофт Стояк Ю.К. 10.06.2024 УА #77384
	Элементы.ДатаОтчета.Видимость = Ложь;
	//- ИнфоСофт Стояк Ю.К. 10.06.2024 УА #77384
	//+ ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81299	
	Элементы.ДатаДопФайла.Видимость = Истина;
	//- ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81299
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252
&НаКлиенте
Процедура ПрочитатьДанныеИзФайлаОзон(Команда)
	
	//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879 
	ОчиститьСообщения();
	//- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879

	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлуОтчета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл отчета.", , , "ПутьКФайлуОтчета");
		Возврат;
	КонецЕсли; 
	
	//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
	Если ФорматФайлаДо31032024 Тогда
		ПолучитьТаблицуЗначенийПродажИзФайлаOzon();
	ИначеЕсли НовыйФорматФайла Тогда
		ПолучитьТаблицуЗначенийПродажИзФайлаOzonПосле30032024();
		
	//+ ИнфоСофт Заварин К.В. 09.01.25 УА #90580	
	//+ ИнфоСофт Заварин К.В. 26.11.24 УА #74680
	//ИначеЕсли НовыйФорматФайлаВыкупленныеТовары Тогда
	//	ПолучитьТаблицуЗначенийВыкупленныхТоваровИзФайлаOzon();
	//- ИнфоСофт Заварин К.В. 26.11.24 УА #74680
	
	ИначеЕсли ФорматФайлаВыкупленныеТоварыДо30112014 Тогда
		ПолучитьТаблицуЗначенийВыкупленныхТоваровИзФайлаOzon();
		
	ИначеЕсли НовыйФорматФайлаВыкупленныеТовары Тогда
		ПолучитьТаблицуЗначенийВыкупленныхТоваровИзФайлаOzonПосле30112024();
	//- ИнфоСофт Заварин К.В. 09.01.25 УА #90580

	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать формат файла.'"));
	КонецЕсли;	
	//ПолучитьТаблицуЗначенийПродажИзФайлаOzon();
	//- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879 
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252
&НаКлиенте
Процедура ВыполнитьСозданиеДокументовОзон(Команда)   
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли; 
	
	//+ ИнфоСофт Заварин К.В. 27.11.24 УА #74680
	Если Не ОбработатьВыкупленныеТовары Тогда	
		//- ИнфоСофт Заварин К.В. 27.11.24 УА #74680
		
		ЗаполнитьДоговорыСоглашенияОзон();
		
		ОшибкаСопоставления = ПолучитьРезультатПроверкиСопоставленияОзон();
		
		Если РеализацияЧерезКомиссионераОзон Тогда
			//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
			//СформироватьРеализациюЧерезКомиссионераНаСервереОзон();
			Если Не СформироватьРеализациюЧерезКомиссионераНаСервереОзон() Тогда
				Возврат;
			КонецЕсли;	
			//- ИнфоСофт Власова И.С. 06.08.24 УА #67453
		Иначе
			//+ ИнфоСофт Власова И.С. 06.08.24 УА #81190
			//СформироватьОтчетаКомиссионераНаСервереОзон();
			СформироватьОтчетКомиссионераНаСервереОзон();
			//- ИнфоСофт Власова И.С. 06.08.24 УА #81190
		КонецЕсли;
		
		//+ ИнфоСофт Заварин К.В. 27.11.24 УА #74680
	Иначе
		ВыполнитьСозданиеДокументовВыкупленныхТоваровОзон();		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 27.11.24 УА #74680
	
	УстановитьНачальноеОформлениеОзон();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 13.10.2023 УА #63924
&НаКлиенте
Процедура ПрочитатьДанныеФайлаЮрЛлицОзон(Команда)  
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлуПродажЮрЛицамОзон) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл продаж.", , , "ПутьКФайлуПродажиЮрЛицам");
		Возврат;
	КонецЕсли; 
	
	ПрочитатьДанныеПродажЮрЛицОзон();	
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 13.10.2023 УА #63924

//+ ИнфоСофт Сумин Д.В. 13.10.2023 УА #63924
&НаКлиенте
Процедура ПутьКФайлуПродажиЮрЛицамНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	ОчиститьСообщения(); 
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл отчета продаж юридических лиц";
	ДиалогВыбораФайла.МножественныйВыбор =  Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.Фильтр = "Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Реквизит", "ПутьКФайлуПродажЮрЛицамОзон");
	ДополнительныеПараметры.Вставить("Адрес", "АдресПродажЮрЛицВоВременномХранилищеОзон");  
	ДополнительныеПараметры.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры));
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 13.10.2023 УА #63924

//+ ИнфоСофт Сумин Д.В. 08.11.2023 УА #63924
&НаКлиенте
Процедура ОтчетКомиссионераОзонПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ПериодOzon) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран период.", , , "Период");
		ОтчетКомиссионераОзон = Ложь;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		ОтчетКомиссионераОзон = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ОтчетКомиссионераОзон Тогда 
		
		Попытка
			
			РеализацияЧерезКомиссионераОзон = Ложь; 
			
			Если СписокТранзакцийExcelOzon.Количество() = 0 Тогда
				
				ПолучитьСписокТранзакцийПродажОзон();
				
				Если СписокТранзакцийExcelOzon.Количество() = 0 Тогда
					
					ОбщегоНазначенияКлиент.СообщитьПользователю("В данном периоде не найдены продажи для выбранного профиля. Выполните загрузку файла о продажах.");
					ОтчетКомиссионераОзон = Ложь;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ОшибкаСопоставления = ПолучитьРезультатПроверкиСопоставленияОзон();
			
			Если ОшибкаСопоставления Тогда
				ОтчетКомиссионераОзон = Ложь;
				Элементы.СписокТранзакцийExcelOzon.Видимость = Истина;
				СписокТранзакцийExcelOzon.Сортировать("Номенклатура", "");
				Возврат;
			КонецЕсли;
			
			Элементы.СписокТранзакцийExcelOzon.Видимость = Истина;
			СписокТранзакцийExcelOzon.Сортировать("Номенклатура", "");
			Элементы.ГруппаЭтапТриОзон.Видимость = Истина;
			//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
			РассчитатьИтоги();
			//- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
			
		Исключение	
		КонецПопытки;
		
		//+ ИнфоСофт Заварин К.В. 18.09.24 УА #83149	
		Если АвтоматическиСоздатьКонтрагентовОзон И ЗаполнитьКолонкуПокупательОзон Тогда 
			
			OzonКонтрагенты.Очистить();
			
			РезультатПроверки = ПолучитьРезультатПроверкиПродажЮрЛицамОзон();
			
			Если Не ВыполнитьАлгоритмСозданияКонтрагентов() Тогда
				Возврат;
			КонецЕсли;
			
			КонтрагентыСопоставлены = ПолучитьРезультатСопоставленияКонтрагентовОзон();
			
			Если РезультатПроверки.РеализацияЧерезКомиссионера Тогда  				
				ЗаполнитьКонтрагентыОтображениеНаСервере("Ozon");	
				Элементы.OzonКонтрагентыОтображение.Видимость = Истина;
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(РезультатПроверки.СообщениеПользователю) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПроверки.СообщениеПользователю);
			КонецЕсли; 
			
			Если КонтрагентыСопоставлены Тогда
				Элементы.ГруппаЭтапТриОзон.Видимость = Истина;
			Иначе
				Элементы.СоздатьКонтрагентаОзон.Видимость = Истина;
				//Элементы.ГруппаЭтапДваОзон.Видимость = Истина;
				Элементы.ГруппаЭтапТриОзон.Видимость = Ложь;
				ОбщегоНазначенияКлиент.СообщитьПользователю("По ИНН не найдены партнеры. Необходимо выполнить создание.");
			КонецЕсли;
			
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 18.09.24 УА #83149
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 08.11.2023 УА #63924

//+ ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567
&НаКлиенте
Процедура ПрочитатьДанныеИзФайлаСбер(Команда)
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлуОтчета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл отчета.", , , "ПутьКФайлуОтчета");
		Возврат;
	КонецЕсли;  
	
	Элементы.СписокТранзакцийСбер.Видимость = Ложь;
	
	ПрогрузитьТаблицуЗначенийПродажИзФайлаСбер(); 
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
&НаКлиенте
Процедура ПоказатьПунктыСбер(Команда)
	
	Если Не ЗначениеЗаполнено(ОтчетСбера) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не загружен/выбран отчет.", , , "ОтчетСбера");
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
	Если АльтернативныйСпособЗагрузкиСбер Тогда    
		Элементы.ГруппаЭтапТриСбер.Видимость = Истина;
		Элементы.ГруппаЭтапДваСбер.Видимость = Ложь; 
	Иначе
		Элементы.ГруппаЭтапДваСбер.Видимость = Истина; 
		Элементы.ГруппаЭтапТриСбер.Видимость = Истина; 		
	КонецЕсли;
	//Элементы.ГруппаЭтапДваСбер.Видимость = Истина; 
	//Элементы.ГруппаЭтапТриСбер.Видимость = Истина; 
	//Элементы.ПоказатьПунктыСбер.Видимость = Ложь; 
	//- ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
&НаКлиенте
Процедура ПрочитатьДанныеИзДопФайлаСбер(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлуПродажЮрЛицамОзон) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл отчета.", , , "ПутьКФайлуПродажЮрЛицамОзон");
		Возврат;
	КонецЕсли;		
	
	ПрогрузитьДопФайлСбер(); 
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
&НаКлиенте
Процедура ЗаписатьДанныеСбер(Команда)
	
	Если СписокТранзакцийСбер.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не прогружены данные.");	
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеПродажСбер();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
&НаКлиенте
Процедура ОтчетСбераПриИзменении(Элемент)  
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли;	
	
	ПутьКФайлуПродажЮрЛицамОзон = "";
	
	Элементы.ГруппаЭтапДваСбер.Видимость = Ложь; 
	Элементы.ГруппаЭтапТриСбер.Видимость = Ложь; 
	Элементы.ПоказатьПунктыСбер.Видимость = Истина;  
	Элементы.СписокТранзакцийСбер.Видимость = Ложь;
	
	ОтчетСбераПриИзмененииНаСервере();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
&НаКлиенте
Процедура ВыполнитьСозданиеДокументовСбер(Команда)   
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 10.06.2024 УА #77384
	Если НЕ ЗначениеЗаполнено(ДатаОтчета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена дата отчета.");
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 10.06.2024 УА #77384
			
	ОшибкаСопоставления = ПолучитьРезультатПроверкиСопоставленияСбер();
	
	Если Не ОшибкаСопоставления Тогда
		СформироватьОтчетаКомиссионераНаСервереСбер();	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
&НаКлиенте
Процедура ФорматФайлаДо31032024ПриИзменении(Элемент)
	Если ФорматФайлаДо31032024 Тогда
		НовыйФорматФайла = Ложь; 
		
		//+ ИнфоСофт Заварин К.В. 09.01.25 УА #90580
		//+ ИнфоСофт Заварин К.В. 26.11.24 УА #74680
		//ФорматФайлаВыкупленныеТовары = Ложь;
		//- ИнфоСофт Заварин К.В. 26.11.24 УА #74680
		ФорматФайлаВыкупленныеТоварыДо30112014 = Ложь;
		НовыйФорматФайлаВыкупленныеТовары = Ложь;
		//- ИнфоСофт Заварин К.В. 09.01.25 УА #90580		
	КонецЕсли;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879

//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
&НаКлиенте
Процедура НовыйФорматФайлаПриИзменении(Элемент)
	Если НовыйФорматФайла Тогда
		ФорматФайлаДо31032024 = Ложь;
		
		//+ ИнфоСофт Заварин К.В. 09.01.25 УА #90580
		//+ ИнфоСофт Заварин К.В. 26.11.24 УА #74680
		//ФорматФайлаВыкупленныеТовары = Ложь;
		//- ИнфоСофт Заварин К.В. 26.11.24 УА #74680
		ФорматФайлаВыкупленныеТоварыДо30112014 = Ложь;
		НовыйФорматФайлаВыкупленныеТовары = Ложь;
		//- ИнфоСофт Заварин К.В. 09.01.25 УА #90580		
	КонецЕсли;	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879

//+ ИнфоСофт Заварин К.В. 26.11.24 УА #74680
&НаКлиенте
Процедура ФорматФайлаВыкупленныеТоварыПриИзменении(Элемент)
	
	//+ ИнфоСофт Заварин К.В. 09.01.25 УА #90580
	//Если ФорматФайлаВыкупленныеТовары Тогда
	//	
	//	ФорматФайлаДо31032024 = Ложь;
	//	НовыйФорматФайла      = Ложь;
	//	
	//КонецЕсли;
	
	Если ФорматФайлаВыкупленныеТоварыДо30112014 Тогда
		
		ФорматФайлаДо31032024 = Ложь;
		НовыйФорматФайла      = Ложь;
		НовыйФорматФайлаВыкупленныеТовары = Ложь;
		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 09.01.25 УА #90580
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 26.11.24 УА #74680

//+ ИнфоСофт Заварин К.В. 09.01.25 УА #90580
&НаКлиенте
Процедура ФорматФайлаВыкупленныеТоварыПосле30112014ПриИзменении(Элемент)
	
	Если НовыйФорматФайлаВыкупленныеТовары Тогда
		
		ФорматФайлаДо31032024 = Ложь;
		НовыйФорматФайла      = Ложь;
		ФорматФайлаВыкупленныеТоварыДо30112014 = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 09.01.25 УА #90580

//+ ИнфоСофт Заварин К.В. 26.11.24 УА #74680
&НаКлиенте
Процедура ОбработатьВыкупленныеТоварыПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ПериодOzon) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран период.", , , "Период");
		ОбработатьВыкупленныеТовары = Ложь;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		ОбработатьВыкупленныеТовары = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ОбработатьВыкупленныеТовары Тогда 
		
		Попытка
			
			РеализацияЧерезКомиссионераОзон = Ложь; 
			ОтчетКомиссионераОзон = Ложь;
			Элементы.СписокТранзакцийExcelOzon.Видимость = Ложь;
			
			Если OzonСписокТранзакцийВыкупленныхТоваров.Количество() = 0 Тогда
				
				ПолучитьСписокТранзакцийВыкупленныхТоваровОзон();
				
				Если OzonСписокТранзакцийВыкупленныхТоваров.Количество() = 0 Тогда
					
					ОбщегоНазначенияКлиент.СообщитьПользователю("В данном периоде не найдены выкупленные товары для выбранного профиля. Выполните загрузку файла о выкупленных товарах.");
					ОбработатьВыкупленныеТовары = Ложь;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ОшибкаСопоставления = ПолучитьРезультатПроверкиСопоставленияВыкупленныхТоваровОзон();
			
			Если ОшибкаСопоставления Тогда
				ОбработатьВыкупленныеТовары = Ложь;
				Элементы.OzonСписокТранзакцийВыкупленныхТоваров.Видимость = Истина;
				OzonСписокТранзакцийВыкупленныхТоваров.Сортировать("Номенклатура", "");
				Возврат;
			КонецЕсли;
			
			Элементы.OzonСписокТранзакцийВыкупленныхТоваров.Видимость = Истина;
			OzonСписокТранзакцийВыкупленныхТоваров.Сортировать("Номенклатура", "");
			Элементы.ГруппаЭтапТриОзон.Видимость = Истина;
			
		Исключение	
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Заварин К.В. 26.11.24 УА #74680

//+ ИнфоСофт Сумин Д.В. 14.05.2024 УА #74879
&НаКлиенте
Процедура ФорматФайлаДо31032024ЯМПриИзменении(Элемент)
	Если ФорматФайлаДо31032024ЯМ Тогда
		НовыйФорматФайлаЯМ = Ложь;
		//+ ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419
		ФорматФайлаДо31052024ЯМ = Ложь;
		//- ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419
	КонецЕсли;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 14.05.2024 УА #74879

//+ ИнфоСофт Сумин Д.В. 14.05.2024 УА #74879
&НаКлиенте
Процедура НовыйФорматФайлаЯМПриИзменении(Элемент)
	Если НовыйФорматФайлаЯМ Тогда
		ФорматФайлаДо31032024ЯМ = Ложь;
		//+ ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419
		ФорматФайлаДо31052024ЯМ = Ложь;
		//- ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419
	КонецЕсли;	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 14.05.2024 УА #74879

//+ ИнфоСофт Стояк Ю.К. 28.06.2024 УА #78526
&НаКлиенте
Процедура ФорматФайлаДо30042024ПриИзменении(Элемент)
	Если ФорматФайлаДо30042024 = Истина Тогда
		Элементы.ДатаДопФайла.Видимость = Ложь;
	Иначе     
		Элементы.ДатаДопФайла.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 28.06.2024 УА #78526

//+ ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
&НаКлиенте
Процедура ВариантФормированияЦеныВозвратаПриИзменении(Элемент)
	
	Если ВариантФормированияЦеныВозврата = 1 Тогда
		Элементы.ВидЦеныВозвратаЯМ.Видимость = Истина;
		Элементы.ВидЦеныВозвратаOzon.Видимость = Истина;
	Иначе                                                
		Элементы.ВидЦеныВозвратаЯМ.Видимость = Ложь;  
		Элементы.ВидЦеныВозвратаOzon.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897

//+ ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419
&НаКлиенте
Процедура ФорматФайлаДо31052024ЯМПриИзменении(Элемент)
	Если ФорматФайлаДо31052024ЯМ Тогда
		ФорматФайлаДо31032024ЯМ = Ложь;
		НовыйФорматФайлаЯМ = Ложь;        
	КонецЕсли;
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419

//+ ИнфоСофт Власова И.С. 10.12.24 УА #87450
&НаКлиенте
Процедура ЗаполнитьКолонкуПокупательОзонПриИзменении(Элемент)
	
	Элементы.РозничныйПокупательОзон.Видимость = ЗаполнитьКолонкуПокупательОзон;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 10.12.24 УА #87450

//+ ИнфоСофт Власова И.С. 10.12.24 УА #87450
&НаКлиенте
Процедура ЗаполнитьКолонкуПокупательЯМПриИзменении(Элемент)
	
	Элементы.РозничныйПокупательЯМ.Видимость = ЗаполнитьКолонкуПокупательЯМ;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 10.12.24 УА #87450

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252	
&НаКлиенте
Процедура СохранитьСопоставление(Команда)
	Попытка
		СохранитьСопоставлениеНаСервере();	
		Элементы.ГруппаНастройкиСозданиеДокументов.Видимость = Истина;
		Элементы.СписокТранзакцийExcelЯМ.Видимость = Ложь;
		Элементы.СохранитьСопоставлениеЯМ.Видимость = Ложь;
	Исключение
	КонецПопытки;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252	

//+ ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252
&НаКлиенте
Процедура СохранитьСопоставлениеOzon(Команда)  
	
	Для Каждого Строка Из СопоставлениеOzon Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Или Не ЗначениеЗаполнено(Строка.НоменклатураOzon) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Сначала необходимо выполнить сопоставление.",,, "СопоставлениеOzon");	
			Возврат;
		КонецЕсли;	
	КонецЦикла;
	
	СохранитьСопоставлениеOzonНаСервере(); 
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252

#КонецОбласти 

#Область СлужебныеПроцедурыИФункцииOzon

//+ ИнфоСофт Мурсалимов Д.Р. 26.09.24 УА #65981
&НаСервере
Процедура ПолучитьТаблицуЗначенийПродажИзФайлаOzon()
			
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.Прочитать(Имя, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	//+ ИнфоСофт Сумин Д.В. 13.10.2023 УА #63924	
	ПериодРеализации = ПолучитьПериодРеализации(ТабличныйДокумент.ПолучитьОбласть("R4"  + "C5").ТекущаяОбласть.Текст);
	
	//+ ИнфоСофт Заварин К.В. 03.04.24 УА #66208
	НомерВходящегоДокумента = ПолучитьНомерВходящегоДокумента(ТабличныйДокумент.ПолучитьОбласть("R3"  + "C5").ТекущаяОбласть.Текст);
	ПериодРеализации.Вставить("НомерРеализации", НомерВходящегоДокумента);
	//- ИнфоСофт Заварин К.В. 03.04.24 УА #66208
	
	Если ПериодРеализации = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбран неверный файл. Необходим файл ""Позаказный отчет о реализации.""");	
		Возврат;
	КонецЕсли;  
	
	СписокТранзакцийExcelOzon.Очистить();
    
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	Для сч = 16 По КоличествоСтрок Цикл
		
		Попытка
			
			ТабДок 													= ТабличныйДокумент;
			
			РассчитаннаяСтрока 										= "R" + Формат(сч, "ЧГ=0;") + "C";
			
			НомерСтроки  											= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 1));
			
			Если НомерСтроки = "" Тогда Прервать; КонецЕсли;
			
			НоваяСтрока 											= СписокТранзакцийExcelOzon.Добавить(); 
									
			НоваяСтрока.НаименованиеТовара							= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 2));
			НоваяСтрока.offer_id									= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 3));
			НоваяСтрока.SKU											= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 4)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 4), Символы.НПП, "")));
			НоваяСтрока.ШтрихКодТовара								= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 5));
			НоваяСтрока.РеализованоНаСумму							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6), Символы.НПП, "")));
			НоваяСтрока.ДоплатаЗаСчетOzon							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7), Символы.НПП, "")));
			НоваяСтрока.Количество									= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8), Символы.НПП, "")));
			НоваяСтрока.ЦенаРеализация								= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9), Символы.НПП, "")));
			
			КомиссияЗаПродажуПоКатегорииПроцент						= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10));
			НоваяСтрока.КомиссияЗаПродажуПоКатегорииПроцент 		= СтрЗаменить(КомиссияЗаПродажуПоКатегорииПроцент, "%", "");
			
			НоваяСтрока.ЦенаПродовцаСУчетомСкидки					= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11), Символы.НПП, "")));
			НоваяСтрока.ИтогиКомиссияСУчетомСкидокИНаценок			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 12)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 12), Символы.НПП, "")));
			НоваяСтрока.ИтогиКНачислению							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 13)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 13), Символы.НПП, "")));	
			НоваяСтрока.ВозвращеноНаСумму							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14), Символы.НПП, "")));
			НоваяСтрока.ВозвратДоплатаЗаСчетOzon					= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 15)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 15), Символы.НПП, "")));
			НоваяСтрока.ВозвратКоличество							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 16)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 16), Символы.НПП, "")));
			НоваяСтрока.ВозвратЦенаРеализации						= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 17)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 17), Символы.НПП, "")));
			НоваяСтрока.ВозвратИтогиКомиссияСУчетомСкидокИНаценок	= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 18)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 18), Символы.НПП, "")));
			НоваяСтрока.ИтогоВозвращено								= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 19)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 19), Символы.НПП, "")));
			НоваяСтрока.НомерОтправления							= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 20));
			
			//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
			НоваяСтрока.ДатаОтправления								= СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 21));
			//НоваяСтрока.ДатаОтправления							= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 21).ТекущаяОбласть.Значение);	
			//- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879  
			
			//+ ИнфоСофт Сумин Д.В. 25.03.2024 УА #66622
			НоваяСтрока.НомерСчетФактуры							= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 22));
			
			ДатаСФ													= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 23));
			Если ЗначениеЗаполнено(ДатаСФ) Тогда
				НоваяСтрока.ДатаСчетФактуры 						= СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаСФ);
			КонецЕсли;
			//- ИнфоСофт Сумин Д.В. 25.03.2024 УА #66622
			
		Исключение
			Сообщение		= Новый СообщениеПользователю;
			Сообщение.Текст	= "Не удалось загрузить строку " + Строка(сч);
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ОтменитьТранзакцию();
	КонецПопытки; 
	
	//+ ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621	
	СписокТранзакций = ИС_Ozon_Сервер.ДобавитьСопоставление(СписокТранзакцийExcelOzon.Выгрузить(), Профиль);
	СписокТранзакцийExcelOzon.Загрузить(СписокТранзакций);
	//- ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621
	
	ЗаписатьДанныеПродажOzon(ПериодРеализации);
	
	СписокТранзакцийExcelOzon.Очистить();
	
	ОбщегоНазначения.СообщитьПользователю("Файл обработан, перейдите к пункту два.");
	
	//Элементы.ГруппаЭтапДваОзон.Видимость = Истина; 
	//Элементы.ПоказатьПунктДваОзон.Видимость = Ложь;
				
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 26.09.24 УА #65981

//+ ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252
&НаСервереБезКонтекста
Функция ПолучитьПериодРеализации(Строка)
	
	Если СтрНайти(Строка, "Реализация товаров за период с") < 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	//+ ИнфоСофт Сумин Д.В. 30.01.2024 УА #69135
	ДатаНачала = СтроковыеФункцииКлиентСервер.СтрокаВДату(Сред(Строка, 32, 11));
	ДатаОкончания = СтроковыеФункцииКлиентСервер.СтрокаВДату(Прав(Строка,11));
	//ДатаНачала = ОбщегоНазначенияКлиентСервер.СтрокаВДату(Сред(Строка, 32, 11));
	//ДатаОкончания = ОбщегоНазначенияКлиентСервер.СтрокаВДату(Прав(Строка,11));
	//- ИнфоСофт Сумин Д.В. 30.01.2024 УА #69135

	Если Не ЗначениеЗаполнено(ДатаНачала) Или Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	
	ПериодРеализации = Новый Структура;
	ПериодРеализации.Вставить("ДатаНачала", ДатаНачала);
	ПериодРеализации.Вставить("ДатаОкончания", ДатаОкончания);
	
	Возврат ПериодРеализации;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252

//+ ИнфоСофт Заварин К.В. 03.04.24 УА #66208
&НаСервере
Функция ПолучитьНомерВходящегоДокумента(Строка)
	
	//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
	Если НовыйФорматФайла Тогда
		НомерДокумента = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Сред(Строка, 21, 9));	
		
	//+ ИнфоСофт Заварин К.В. 10.01.25 УА #90580	
	//+ ИнфоСофт Заварин К.В. 26.11.24 УА #74680
	//ИначеЕсли ФорматФайлаВыкупленныеТовары Тогда
	//	НомерДокумента = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Сред(Строка, 31, 15));
	//- ИнфоСофт Заварин К.В. 26.11.24 УА #74680                                         
	
	ИначеЕсли НовыйФорматФайлаВыкупленныеТовары Тогда
		НомерДокумента = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Сред(Строка, 31, 15)); 
		
	ИначеЕсли ФорматФайлаВыкупленныеТоварыДо30112014 Тогда
		НомерДокумента = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Сред(Строка, 31, 15));
	//- ИнфоСофт Заварин К.В. 10.01.25 УА #90580
	
	Иначе
		НомерДокумента = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Сред(Строка, 21, 10));
	КонецЕсли;
	//НомерДокумента = Число(Сред(Строка, 21, 10));
	//- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879

	Если Не ЗначениеЗаполнено(НомерДокумента) Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	
	НомерРеализации = Новый Структура;
	НомерРеализации.Вставить("НомерРеализации", НомерДокумента);
	
	Возврат НомерДокумента;
	
КонецФункции //- ИнфоСофт Заварин К.В. 03.04.24 УА #66208

//+ ИнфоСофт Мурсалимов Д.Р. 25.10.24 УА #85566
&НаСервере
Функция ЗаписатьДанныеПродажOzon(ПериодРеализации)  
	
	НачатьТранзакцию();	
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ИС_Ozon_Продажи");
		ЭлементБлокировкиДанных.УстановитьЗначение("Профиль", Профиль);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		//+ ИнфоСофт Власова И.С. 19.02.25 УА #87138
		НаборЗаписей = РегистрыСведений.ИС_Ozon_Продажи.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Профиль.Установить(Профиль);
		НаборЗаписей.Отбор.ДатаНачала.Установить(ПериодРеализации.ДатаНачала);
		НаборЗаписей.Отбор.ДатаОкончания.Установить(ПериодРеализации.ДатаОкончания);
		
		НаборЗаписей.Записать();
		//- ИнфоСофт Власова И.С. 19.02.25 УА #87138
		
		Для Каждого Элемент Из СписокТранзакцийExcelOzon Цикл
			
			МенеджерЗаписи = РегистрыСведений.ИС_Ozon_Продажи.СоздатьМенеджерЗаписи(); 			
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Элемент);
			
			МенеджерЗаписи.Профиль 			= Профиль;

			МенеджерЗаписи.ДатаНачала 		= ПериодРеализации.ДатаНачала;
			МенеджерЗаписи.ДатаОкончания 	= ПериодРеализации.ДатаОкончания;
			МенеджерЗаписи.НомерДокумента	= ПериодРеализации.НомерРеализации;
			
			МенеджерЗаписи.Записать();                  

		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Заметки'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 25.10.24 УА #85566

//+ ИнфоСофт Заварин К.В. 26.11.24 УА #74680
&НаСервере
Функция ЗаписатьДанныеВыкупленныхТоваровOzon(ПериодРеализации)  
	
	НачатьТранзакцию();	
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ИС_Ozon_ВыкупленныеТовары");
		ЭлементБлокировкиДанных.УстановитьЗначение("Профиль", Профиль);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Для Каждого Элемент Из OzonСписокТранзакцийВыкупленныхТоваров Цикл
			
			МенеджерЗаписи = РегистрыСведений.ИС_Ozon_ВыкупленныеТовары.СоздатьМенеджерЗаписи(); 			
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Элемент);
			
			МенеджерЗаписи.Профиль 			= Профиль;

			МенеджерЗаписи.ДатаНачала 		= ПериодРеализации.ДатаНачала;
			МенеджерЗаписи.ДатаОкончания 	= ПериодРеализации.ДатаОкончания;
			МенеджерЗаписи.НомерДокумента	= ПериодРеализации.НомерРеализации;
			
			МенеджерЗаписи.Записать();                  

		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Заметки'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции //- ИнфоСофт Заварин К.В. 26.11.24 УА #74680

//+ ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566
&НаСервере
Функция ПолучитьСписокПродажОзон()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИС_Ozon_Продажи.offer_id КАК offer_id,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ЕдиницаИзмерения = ИС_Ozon_СоответствиеХарактеристик.Упаковка
	|			ТОГДА &ПустаяУпаковка
	|		ИНАЧЕ ИС_Ozon_СоответствиеХарактеристик.Упаковка
	|	КОНЕЦ КАК Упаковка
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	РегистрСведений.ИС_Ozon_Продажи КАК ИС_Ozon_Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО (ИС_Ozon_Продажи.offer_id = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id)
	|ГДЕ
	|	ИС_Ozon_Продажи.Профиль = &Профиль
	|	И ИС_Ozon_Продажи.ДатаНачала >= &ДатаНачала
	|	И ИС_Ozon_Продажи.ДатаОкончания <= &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Ozon_Продажи.Профиль КАК Профиль,
	|	ИС_Ozon_Продажи.offer_id КАК offer_id,
	|	ИС_Ozon_Продажи.SKU КАК SKU,
	|	ИС_Ozon_Продажи.ШтрихКодТовара КАК ШтрихКодТовара,
	|	ИС_Ozon_Продажи.НомерОтправления КАК НомерОтправления,
	|	ИС_Ozon_Продажи.ДатаНачала КАК ДатаНачала,
	|	ИС_Ozon_Продажи.ДатаОкончания КАК ДатаОкончания,
	|	ИС_Ozon_Продажи.НомерДокумента КАК НомерДокумента,
	|	ИС_Ozon_Продажи.ЦенаПродовцаСУчетомСкидки КАК ЦенаПродовцаСУчетомСкидки,
	|	ИС_Ozon_Продажи.КомиссияЗаПродажуПоКатегорииПроцент КАК КомиссияЗаПродажуПоКатегорииПроцент,
	|	ИС_Ozon_Продажи.ЦенаРеализация КАК ЦенаРеализация,
	|	ИС_Ozon_Продажи.СуммаЛояльностиРеализации КАК СуммаЛояльностиРеализации,
	|	ИС_Ozon_Продажи.Количество КАК Количество,
	|	ИС_Ozon_Продажи.РеализованоНаСумму КАК РеализованоНаСумму,
	|	ИС_Ozon_Продажи.ДоплатаЗаСчетOzon КАК ДоплатаЗаСчетOzon,
	|	ИС_Ozon_Продажи.ИтогиКомиссияСУчетомСкидокИНаценок КАК ИтогиКомиссияСУчетомСкидокИНаценок,
	|	ИС_Ozon_Продажи.ИтогиКНачислению КАК ИтогиКНачислению,
	|	ИС_Ozon_Продажи.ВозвратЦенаРеализации КАК ВозвратЦенаРеализации,
	|	ИС_Ozon_Продажи.СуммаЛояльностиВозврата КАК СуммаЛояльностиВозврата,
	|	ИС_Ozon_Продажи.ВозвратКоличество КАК ВозвратКоличество,
	|	ИС_Ozon_Продажи.ВозвращеноНаСумму КАК ВозвращеноНаСумму,
	|	ИС_Ozon_Продажи.ВозвратДоплатаЗаСчетOzon КАК ВозвратДоплатаЗаСчетOzon,
	|	ИС_Ozon_Продажи.ВозвратИтогиКомиссияСУчетомСкидокИНаценок КАК ВозвратИтогиКомиссияСУчетомСкидокИНаценок,
	|	ИС_Ozon_Продажи.ИтогоВозвращено КАК ИтогоВозвращено,
	|	ИС_Ozon_Продажи.ДатаОтправления КАК ДатаОтправления,
	|	ИС_Ozon_Продажи.НаименованиеТовара КАК НаименованиеТовара,
	|	ИС_Ozon_Продажи.НомерСчетФактуры КАК НомерСчетФактуры,
	|	ИС_Ozon_Продажи.ИНН КАК ИНН,
	|	ИС_Ozon_Продажи.ДатаСчетФактуры КАК ДатаСчетФактуры,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_Продажи.ИНН = """"
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПродажаЮрЛицу,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	//+ ИнфоСофт Заварин К.В. 08.04.25 УА #98478
	//|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.Характеристика КАК ХарактеристикаНоменклатуры, 
	//- ИнфоСофт Заварин К.В. 08.04.25 УА #98478
	|	ВТ_Сопоставление.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка
	|ИЗ
	|	РегистрСведений.ИС_Ozon_Продажи КАК ИС_Ozon_Продажи
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ПО ИС_Ozon_Продажи.offer_id = ВТ_Сопоставление.offer_id
	|ГДЕ
	|	ИС_Ozon_Продажи.Профиль = &Профиль
	|	И ИС_Ozon_Продажи.ДатаНачала >= &ДатаНачала
	|	И ИС_Ozon_Продажи.ДатаОкончания <= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("Профиль", 		Профиль);
	Запрос.УстановитьПараметр("ДатаНачала", 	НачалоДня(ПериодOzon.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", 	КонецДня(ПериодOzon.ДатаОкончания));
	Запрос.УстановитьПараметр("ПустаяУпаковка", ИС_МП_СерверЛокализация.ПустаяСсылкаУпаковка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СписокТранзакцийExcelOzon.Очистить();
	
	СписокТранзакций = СписокТранзакцийExcelOzon.Выгрузить();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = СписокТранзакций.Добавить(); 			
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.ИННПокупателя = Выборка.ИНН;
		
	КонецЦикла;
	
	//+ ИнфоСофт Ивонин К.А. 20.03.25 УА #96356
	//СписокТранзакций = ИС_Ozon_Сервер.ДобавитьСопоставлениеNew(СписокТранзакций, Профиль);
	СписокТранзакций = ИС_Озон_Сервер.ОбработатьУцененныеТовары(Профиль, СписокТранзакций);
	//- ИнфоСофт Ивонин К.А. 20.03.25 УА #96356
	
	Возврат СписокТранзакций;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566

//+ ИнфоСофт Заварин К.В. 27.11.24 УА #74680
&НаСервере
Функция ПолучитьСписокВыкупленныхТоваровОзон()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_ВыкупленныеТовары.Профиль КАК Профиль,
	|	ИС_Ozon_ВыкупленныеТовары.СтрокаНомер КАК СтрокаНомер,
	|	ИС_Ozon_ВыкупленныеТовары.offer_id КАК offer_id,
	|	ИС_Ozon_ВыкупленныеТовары.SKU КАК SKU,
	|	ИС_Ozon_ВыкупленныеТовары.ДатаНачала КАК ДатаНачала,
	|	ИС_Ozon_ВыкупленныеТовары.ДатаОкончания КАК ДатаОкончания,
	|	ИС_Ozon_ВыкупленныеТовары.ИсходныеСтоимостныеДанные КАК ИсходныеСтоимостныеДанные,
	|	ИС_Ozon_ВыкупленныеТовары.ДисконтПоКатегорииПроцент КАК ДисконтПоКатегорииПроцент,
	|	ИС_Ozon_ВыкупленныеТовары.ЦенаРеализация КАК ЦенаРеализация,
	|	ИС_Ozon_ВыкупленныеТовары.СтавкаНДСПроцент КАК СтавкаНДСПроцент,
	|	ИС_Ozon_ВыкупленныеТовары.Количество КАК Количество,
	|	ИС_Ozon_ВыкупленныеТовары.ИтогиКНачислению КАК ИтогиКНачислению,
	|	ИС_Ozon_ВыкупленныеТовары.ИНН КАК ИНН,
	|	ИС_Ozon_ВыкупленныеТовары.КПП КАК КПП,
	|	ИС_Ozon_ВыкупленныеТовары.НаименованиеТовара КАК НаименованиеТовара,
	|	ИС_Ozon_ВыкупленныеТовары.НомерДокумента КАК НомерДокумента
	|ПОМЕСТИТЬ ВТ_ВыкупленныеТовары
	|ИЗ
	|	РегистрСведений.ИС_Ozon_ВыкупленныеТовары КАК ИС_Ozon_ВыкупленныеТовары
	|ГДЕ
	|	ИС_Ozon_ВыкупленныеТовары.Профиль = &Профиль
	|	И ИС_Ozon_ВыкупленныеТовары.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ИС_Ozon_ВыкупленныеТовары.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыкупленныеТовары.offer_id КАК offer_id,
	|	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Характеристика) КАК Характеристика,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЭтоНабор,
	|	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИС_Ozon_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL
	|					ИЛИ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|				ТОГДА 1
	|			ИНАЧЕ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Числитель
	|		КОНЕЦ / ВЫБОР
	|			КОГДА ИС_Ozon_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL
	|					ИЛИ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|				ТОГДА 1
	|			ИНАЧЕ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Знаменатель
	|		КОНЕЦ) КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_ВыкупленныеТовары КАК ВТ_ВыкупленныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО ВТ_ВыкупленныеТовары.offer_id = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыкупленныеТовары.offer_id
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыкупленныеТовары.Профиль КАК Профиль,
	|	ВТ_ВыкупленныеТовары.СтрокаНомер КАК СтрокаНомер,
	|	ВТ_ВыкупленныеТовары.offer_id КАК offer_id,
	|	ВТ_ВыкупленныеТовары.SKU КАК SKU,
	|	ВТ_ВыкупленныеТовары.ДатаНачала КАК ДатаНачала,
	|	ВТ_ВыкупленныеТовары.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_ВыкупленныеТовары.ИсходныеСтоимостныеДанные КАК ИсходныеСтоимостныеДанные,
	|	ВТ_ВыкупленныеТовары.ДисконтПоКатегорииПроцент КАК ДисконтПоКатегорииПроцент,
	|	ВТ_ВыкупленныеТовары.ЦенаРеализация КАК ЦенаРеализация,
	|	ВТ_ВыкупленныеТовары.СтавкаНДСПроцент КАК СтавкаНДСПроцент,
	|	ВТ_ВыкупленныеТовары.Количество КАК Количество,
	|	ВТ_ВыкупленныеТовары.ИтогиКНачислению КАК ИтогиКНачислению,
	|	ВТ_ВыкупленныеТовары.ИНН КАК ИНН,
	|	ВТ_ВыкупленныеТовары.КПП КАК КПП,
	|	ВТ_ВыкупленныеТовары.НаименованиеТовара КАК НаименованиеТовара,
	|	ВТ_ВыкупленныеТовары.НомерДокумента КАК НомерДокумента,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ВТ_Номенклатура.КоэффициентУпаковки КАК КоэффициентУпаковки
	|ИЗ
	|	ВТ_ВыкупленныеТовары КАК ВТ_ВыкупленныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО ВТ_ВыкупленныеТовары.offer_id = ВТ_Номенклатура.offer_id";
	
	Запрос.УстановитьПараметр("Профиль", 		Профиль);
	Запрос.УстановитьПараметр("ДатаНачала", 	НачалоДня(ПериодOzon.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", 	КонецДня(ПериодOzon.ДатаОкончания)); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	OzonСписокТранзакцийВыкупленныхТоваров.Очистить();
	
	СписокТранзакций = OzonСписокТранзакцийВыкупленныхТоваров.Выгрузить();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = СписокТранзакций.Добавить(); 			
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
	КонецЦикла;
	 
	СписокТранзакций = ИС_Ozon_Сервер.ДобавитьСопоставлениеВыкупленныхТоваров(СписокТранзакций, Профиль);
	
	Возврат СписокТранзакций;
	
КонецФункции //- ИнфоСофт Заварин К.В. 27.11.24 УА #74680

//+ ИнфоСофт Сумин Д.В. 01.09.2023 УА #61252
&НаСервере   
Функция ПолучитьРезультатПроверкиСопоставленияОзон() 
	
	ОшибкаСопоставления = Ложь;
	
	Для Каждого Строка Из СписокТранзакцийExcelOzon Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			ОшибкаСопоставления = Истина;			
		КонецЕсли;
	КонецЦикла;

	Если ОшибкаСопоставления Тогда
		Сообщение = "Есть позиции, по которым не удалось найти сопоставление. Заполните пустые строки."; 
		Элементы.СписокТранзакцийExcelЯМ.Видимость = Истина; 
		ОбщегоНазначения.СообщитьПользователю(Сообщение);

	КонецЕсли; 
	
	Возврат ОшибкаСопоставления;
		
КонецФункции //- ИнфоСофт Сумин Д.В. 01.09.2023 УА #61252

//+ ИнфоСофт Заварин К.В. 27.11.24 УА #74680
Функция ПолучитьРезультатПроверкиСопоставленияВыкупленныхТоваровОзон() 
	
	ОшибкаСопоставления = Ложь;
	
	Для Каждого Строка Из OzonСписокТранзакцийВыкупленныхТоваров Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			ОшибкаСопоставления = Истина;			
		КонецЕсли;
	КонецЦикла;

	Если ОшибкаСопоставления Тогда
		Сообщение = "Есть позиции, по которым не удалось найти сопоставление. Заполните пустые строки."; 
		Элементы.OzonСписокТранзакцийВыкупленныхТоваров.Видимость = Истина; 
		ОбщегоНазначения.СообщитьПользователю(Сообщение);

	КонецЕсли; 
	
	Возврат ОшибкаСопоставления;
		
КонецФункции //- ИнфоСофт Заварин К.В. 27.11.24 УА #74680

//+ ИнфоСофт Сумин Д.В. 01.09.2023 УА #61252
&НаКлиенте
Процедура УстановитьНачальноеОформлениеОзон()
	
	//Элементы.ПоказатьПунктДваОзон.Видимость = Истина;
	//Элементы.ГруппаЭтапДваОзон.Видимость = Ложь;
	Элементы.ГруппаЭтапТриОзон.Видимость = Ложь;
	Элементы.СписокТранзакцийExcelOzon.Видимость = Ложь;
	Элементы.OzonКонтрагентыОтображение.Видимость = Ложь;
	ОтчетКомиссионераОзон = Ложь;
	РеализацияЧерезКомиссионераОзон = Ложь;
	ПутьКФайлуОтчета = "";  
	ПутьКФайлуПродажЮрЛицамОзон = "";
	OzonКонтрагенты.Очистить();
	OzonКонтрагентыОтображение.Очистить();
	СписокТранзакцийExcelOzon.Очистить();
	
	//+ ИнфоСофт Заварин К.В. 27.11.24 УА #74680
	Элементы.OzonСписокТранзакцийВыкупленныхТоваров.Видимость = Ложь;
	OzonСписокТранзакцийВыкупленныхТоваров.Очистить();
	ОбработатьВыкупленныеТовары = Ложь;
	//- ИнфоСофт Заварин К.В. 27.11.24 УА #74680
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 01.09.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 13.10.2023 УА #63924 
&НаСервере
Процедура ПрочитатьДанныеПродажЮрЛицОзон()	 
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресПродажЮрЛицВоВременномХранилищеОзон);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(Имя);
	
	Если СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R2C2").ТекущаяОбласть.Текст) <> "Реестр продаж юридическим лицам" Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбран неверный файл. Необходимо выбрать файл: ""Реестр продаж юридическим лицам"".");
		Возврат;
	КонецЕсли;	
	
	ПродажиЮрЛицамТЗ = ПолучитьДанныеПродажЮрЛицОзон(ТабличныйДокумент); 
	
	ЗаписатьДанныеПродажЮрЛиц(ПродажиЮрЛицамТЗ);
	
	ОбщегоНазначения.СообщитьПользователю("Файл обработан.");
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 13.10.2023 УА #63924

//+ ИнфоСофт Мурсалимов Д.Р. 26.06.24 УА #78167
&НаСервере
Функция ПолучитьДанныеПродажЮрЛицОзон(ТабличныйДокумент)  
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(50);
	
	//+ ИнфоСофт Мурсалимов Д.Р. 08.07.24 УА #79202
	КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	//- ИнфоСофт Мурсалимов Д.Р. 08.07.24 УА #79202
	
	ПродажиЮрЛицамТЗ = Новый ТаблицаЗначений;
	ПродажиЮрЛицамТЗ.Колонки.Добавить("ИНН", 				Новый ОписаниеТипов("Строка",,,,КвалификаторСтроки));
	ПродажиЮрЛицамТЗ.Колонки.Добавить("КПП", 				Новый ОписаниеТипов("Строка",,,,КвалификаторСтроки));
	ПродажиЮрЛицамТЗ.Колонки.Добавить("НомерОтправления", 	Новый ОписаниеТипов("Строка",,,,КвалификаторСтроки));
	ПродажиЮрЛицамТЗ.Колонки.Добавить("ЮрАдрес", 			Новый ОписаниеТипов("Строка"));
	ПродажиЮрЛицамТЗ.Колонки.Добавить("НаименованиеЮрЛица", Новый ОписаниеТипов("Строка"));
	ПродажиЮрЛицамТЗ.Колонки.Добавить("НомерСчетФактуры", 	Новый ОписаниеТипов("Строка"));
	//+ ИнфоСофт Мурсалимов Д.Р. 08.07.24 УА #79202
	ПродажиЮрЛицамТЗ.Колонки.Добавить("ДатаСчетФактуры", 	Новый ОписаниеТипов("Дата",,,,КвалификаторДаты));
	//- ИнфоСофт Мурсалимов Д.Р. 08.07.24 УА #79202
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	Для сч = 11 По КоличествоСтрок Цикл
		
		Попытка
			
			ЧислоСтроки = Формат(сч, "ЧГ=0;");
			ИНН  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 8).ТекущаяОбласть.Текст);
			Если ИНН = "" Тогда Прервать; КонецЕсли;
			
			НоваяСтрока = ПродажиЮрЛицамТЗ.Добавить(); 
			
			НоваяСтрока.ИНН 				= ИНН;
			НоваяСтрока.КПП 				= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 9).ТекущаяОбласть.Текст); 
			НоваяСтрока.ЮрАдрес 			= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 10).ТекущаяОбласть.Текст);
			НоваяСтрока.НомерОтправления 	= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 12).ТекущаяОбласть.Текст);
			НоваяСтрока.НаименованиеЮрЛица 	= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 6).ТекущаяОбласть.Текст);
			//+ ИнфоСофт Мурсалимов Д.Р. 08.07.24 УА #79202
			НоваяСтрока.НомерСчетФактуры	= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 4).ТекущаяОбласть.Текст);
			ДатаСчетФактуры	                = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 5).ТекущаяОбласть.Текст);

			Если ЗначениеЗаполнено(ДатаСчетФактуры) Тогда
				НоваяСтрока.ДатаСчетФактуры = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаСчетФактуры);
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 08.07.24 УА #79202
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю("не удалось загрузить строку " + сч + ".");	
		КонецПопытки; 
		
	КонецЦикла;
	
	//Найдем данные по продажам
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПродажиЮрЛиц.ИНН КАК ИНН,
	|	ПродажиЮрЛиц.КПП КАК КПП,
	|	ПродажиЮрЛиц.НомерОтправления КАК НомерОтправления,
	|	ПродажиЮрЛиц.НаименованиеЮрЛица КАК НаименованиеЮрЛица,
	|	ПродажиЮрЛиц.ЮрАдрес КАК ЮрАдрес, 
	//+ ИнфоСофт Мурсалимов Д.Р. 08.07.24 УА #79202
	|	ПродажиЮрЛиц.НомерСчетФактуры КАК НомерСчетФактуры,
	|	ПродажиЮрЛиц.ДатаСчетФактуры КАК ДатаСчетФактуры
	//- ИнфоСофт Мурсалимов Д.Р. 08.07.24 УА #79202
	|ПОМЕСТИТЬ ВТ_ПродажиЮрЛиц
	|ИЗ
	|	&ПродажиЮрЛиц КАК ПродажиЮрЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПродажиЮрЛиц.ИНН КАК ИНН,
	|	ВТ_ПродажиЮрЛиц.КПП КАК КПП,
	|	ВТ_ПродажиЮрЛиц.ЮрАдрес КАК ЮрАдрес,
	|	ВТ_ПродажиЮрЛиц.НомерОтправления КАК НомерОтправления,
	//+ ИнфоСофт Мурсалимов Д.Р. 08.07.24 УА #79202
	|	ВТ_ПродажиЮрЛиц.НомерСчетФактуры КАК НомерСчетФактуры,
	|	ВТ_ПродажиЮрЛиц.ДатаСчетФактуры КАК ДатаСчетФактуры,
	//- ИнфоСофт Мурсалимов Д.Р. 08.07.24 УА #79202
	|	ИС_Ozon_Продажи.Профиль КАК Профиль,
	|	ИС_Ozon_Продажи.offer_id КАК offer_id,
	|	ИС_Ozon_Продажи.SKU КАК SKU,
	|	ИС_Ozon_Продажи.ШтрихКодТовара КАК ШтрихКодТовара,
	|	ИС_Ozon_Продажи.ДатаНачала КАК ДатаНачала,
	|	ИС_Ozon_Продажи.ДатаОкончания КАК ДатаОкончания,
	|	ИС_Ozon_Продажи.ВозвратДоплатаЗаСчетOzon КАК ВозвратДоплатаЗаСчетOzon,
	|	ИС_Ozon_Продажи.ВозвратИтогиКомиссияСУчетомСкидокИНаценок КАК ВозвратИтогиКомиссияСУчетомСкидокИНаценок,
	|	ИС_Ozon_Продажи.ВозвратКоличество КАК ВозвратКоличество,
	|	ИС_Ozon_Продажи.ВозвратЦенаРеализации КАК ВозвратЦенаРеализации,
	//+ ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566
	|	ИС_Ozon_Продажи.СуммаЛояльностиВозврата КАК СуммаЛояльностиВозврата,
	//- ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566
	|	ИС_Ozon_Продажи.ВозвращеноНаСумму КАК ВозвращеноНаСумму,
	|	ИС_Ozon_Продажи.ДоплатаЗаСчетOzon КАК ДоплатаЗаСчетOzon,
	|	ИС_Ozon_Продажи.ИтогиКНачислению КАК ИтогиКНачислению,
	|	ИС_Ozon_Продажи.ИтогиКомиссияСУчетомСкидокИНаценок КАК ИтогиКомиссияСУчетомСкидокИНаценок,
	|	ИС_Ozon_Продажи.ИтогоВозвращено КАК ИтогоВозвращено,
	|	ИС_Ozon_Продажи.Количество КАК Количество,
	|	ИС_Ozon_Продажи.КомиссияЗаПродажуПоКатегорииПроцент КАК КомиссияЗаПродажуПоКатегорииПроцент,
	|	ИС_Ozon_Продажи.РеализованоНаСумму КАК РеализованоНаСумму,
	|	ИС_Ozon_Продажи.ЦенаПродовцаСУчетомСкидки КАК ЦенаПродовцаСУчетомСкидки,
	|	ИС_Ozon_Продажи.ЦенаРеализация КАК ЦенаРеализация,        
	//+ ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566
	|	ИС_Ozon_Продажи.СуммаЛояльностиРеализации КАК СуммаЛояльностиРеализации,
	//- ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566
	|	ИС_Ozon_Продажи.НаименованиеТовара КАК НаименованиеТовара,
	|	ВТ_ПродажиЮрЛиц.НаименованиеЮрЛица КАК НаименованиеЮрЛица,
	|	ИС_Ozon_Продажи.ДатаОтправления КАК ДатаОтправления
	|ИЗ
	|	ВТ_ПродажиЮрЛиц КАК ВТ_ПродажиЮрЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_Продажи КАК ИС_Ozon_Продажи
	|		ПО ВТ_ПродажиЮрЛиц.НомерОтправления = ИС_Ozon_Продажи.НомерОтправления";
	
	Запрос.УстановитьПараметр("ПродажиЮрЛиц",ПродажиЮрЛицамТЗ);	
	Запрос.Выполнить();
	
	ПродажиЮрЛицамТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ПродажиЮрЛицамТЗ;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 26.06.24 УА #78167

//+ ИнфоСофт Мурсалимов Д.Р. 25.10.24 УА #85566
&НаСервере
Процедура ЗаписатьДанныеПродажЮрЛиц(ПродажиЮрЛицамТЗ)
	
	НачатьТранзакцию();	
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ИС_Ozon_Продажи");
		ЭлементБлокировкиДанных.УстановитьЗначение("Профиль", Профиль);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Для Каждого Элемент Из ПродажиЮрЛицамТЗ Цикл
			
			МенеджерЗаписи = РегистрыСведений.ИС_Ozon_Продажи.СоздатьМенеджерЗаписи(); 			
			
			//+ ИнфоСофт Заварин К.В. 28.01.25 УА #91934
			Элемент.ИНН = СокрЛП(Элемент.ИНН);
			//- ИнфоСофт Заварин К.В. 28.01.25 УА #91934
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Элемент);
			
			МенеджерЗаписи.Профиль = Профиль;
			
			МенеджерЗаписи.Прочитать();  
			
			Если МенеджерЗаписи.Выбран() Тогда  
				
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Элемент);
				
				МенеджерЗаписи.Записать(); 
				
			КонецЕсли;
			
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Заметки'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;	
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 25.10.24 УА #85566

//+ ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924
&НаКлиенте
Процедура РеализацияЧерезКомиссионераОзонПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ПериодOzon) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран период.", , , "Период");
		РеализацияЧерезКомиссионераОзон = Ложь;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		РеализацияЧерезКомиссионераОзон = Ложь;
		Возврат;
	КонецЕсли;
	
	Если РеализацияЧерезКомиссионераОзон Тогда 
		
		Попытка
			
			ОтчетКомиссионераОзон = Ложь; 
			
			OzonКонтрагенты.Очистить(); 
			
			Если СписокТранзакцийExcelOzon.Количество() = 0 Тогда
				
				ПолучитьСписокТранзакцийПродажОзон();
				
				Если СписокТранзакцийExcelOzon.Количество() = 0 Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю("В данном периоде не найдены продажи для выбранного профиля. Выполните загрузку файла о продажах.");
					РеализацияЧерезКомиссионераОзон = Ложь;
					Возврат;	
				КонецЕсли;
				
			КонецЕсли;
			
			ОшибкаСопоставления = ПолучитьРезультатПроверкиСопоставленияОзон();
			
			Если ОшибкаСопоставления Тогда	
				РеализацияЧерезКомиссионераОзон = Ложь;
				Элементы.СписокТранзакцийExcelOzon.Видимость = Истина;
				СписокТранзакцийExcelOzon.Сортировать("Номенклатура", "");
				Возврат;	
			КонецЕсли;
			
			РезультатПроверки = ПолучитьРезультатПроверкиПродажЮрЛицамОзон();
			
			//+ ИнфоСофт Сумин Д.В. 15.05.2024 УА #75889
			Если АвтоматическиСоздатьКонтрагентовОзон Тогда
				
				//+ ИнфоСофт Власова И.С. 05.08.24 УА #81190
				//ВыполнитьАлгоритмСозданияКонтрагентов();
				Если Не ВыполнитьАлгоритмСозданияКонтрагентов() Тогда
					РеализацияЧерезКомиссионераОзон = Ложь;
					Возврат;
				КонецЕсли;
				//- ИнфоСофт Власова И.С. 05.08.24 УА #81190
				
			КонецЕсли;	
			//- ИнфоСофт Сумин Д.В. 15.05.2024 УА #75889
			
			КонтрагентыСопоставлены = ПолучитьРезультатСопоставленияКонтрагентовОзон();
			
			Если РезультатПроверки.РеализацияЧерезКомиссионера Тогда  				
				ЗаполнитьКонтрагентыОтображениеНаСервере("Ozon");	
				Элементы.OzonКонтрагентыОтображение.Видимость = Истина;
			Иначе 
				РеализацияЧерезКомиссионераОзон = Ложь;
				ОтчетКомиссионераОзон = Истина;
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(РезультатПроверки.СообщениеПользователю) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПроверки.СообщениеПользователю);
			КонецЕсли; 
			
			Если КонтрагентыСопоставлены Тогда
				Элементы.ГруппаЭтапТриОзон.Видимость = Истина;
			Иначе
				Элементы.СоздатьКонтрагентаОзон.Видимость = Истина;
				//Элементы.ГруппаЭтапДваОзон.Видимость = Истина;
				Элементы.ГруппаЭтапТриОзон.Видимость = Ложь;
				РеализацияЧерезКомиссионераОзон = Ложь;
				ОбщегоНазначенияКлиент.СообщитьПользователю("По ИНН не найдены партнеры. Необходимо выполнить создание.");
			КонецЕсли;
			
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры //+ ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924

//+ ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924
&НаСервере
Функция ПолучитьРезультатПроверкиПродажЮрЛицамОзон() 
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("РеализацияЧерезКомиссионера", Истина);
	РезультатПроверки.Вставить("СообщениеПользователю", "");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИС_Ozon_Продажи.НомерОтправления КАК НомерЗаказа,
	|	ИС_Ozon_Продажи.НаименованиеЮрЛица КАК НаименованиеКлиента,
	|	ИС_Ozon_Продажи.ЮрАдресПокупателя КАК АдресКлиента,
	|	ИС_Ozon_Продажи.ИНН КАК ИНН
	|ИЗ
	|	РегистрСведений.ИС_Ozon_Продажи КАК ИС_Ozon_Продажи
	|ГДЕ
	|	ИС_Ozon_Продажи.Профиль = &Профиль
	|	И ИС_Ozon_Продажи.ИНН <> """"
	//+ ИнфоСофт Власова И.С. 02.08.24 УА #80469
	//|	И ИС_Ozon_Продажи.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания");
	|	И ИС_Ozon_Продажи.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_Ozon_Продажи.НомерОтправления,
	|	ИС_Ozon_Продажи.НаименованиеЮрЛица,
	|	ИС_Ozon_Продажи.ИНН,
	|	ИС_Ozon_Продажи.ЮрАдресПокупателя");
	//- ИнфоСофт Власова И.С. 02.08.24 УА #80469
	
	Запрос.УстановитьПараметр("Профиль", 		Профиль);
	Запрос.УстановитьПараметр("ДатаНачала", 	НачалоДня(ПериодOzon.ДатаНачала)); 
	Запрос.УстановитьПараметр("ДатаОкончания", 	КонецДня(ПериодOzon.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		РезультатПроверки.Вставить("РеализацияЧерезКомиссионера", Ложь);
		РезультатПроверки.Вставить("СообщениеПользователю", "В данном периоде не найдены продажи юр. лицам. Реализация через комиссионера не требуется. Перейдите к пункту 3.");	
		Возврат РезультатПроверки;	
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		НоваяСтрокаКонтрагент 						= OzonКонтрагенты.Добавить();
		НоваяСтрокаКонтрагент.ИНН 					= Выборка.ИНН; 
		НоваяСтрокаКонтрагент.НомерЗаказа 			= Выборка.НомерЗаказа;
		НоваяСтрокаКонтрагент.НаименованиеКлиента 	= Выборка.НаименованиеКлиента;
		НоваяСтрокаКонтрагент.АдресКлиента 			= Выборка.АдресКлиента;
	КонецЦикла; 
	
	Возврат РезультатПроверки; 
	
КонецФункции //- ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924

//+ ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924
&НаСервере
Процедура ПолучитьСписокТранзакцийПродажОзон() 
	СписокТранзакцийExcelOzon.Загрузить(ПолучитьСписокПродажОзон());	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924

//+ ИнфоСофт Заварин К.В. 27.11.24 УА #74680
&НаСервере
Процедура ПолучитьСписокТранзакцийВыкупленныхТоваровОзон() 
	OzonСписокТранзакцийВыкупленныхТоваров.Загрузить(ПолучитьСписокВыкупленныхТоваровОзон());	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 27.11.24 УА #74680

//+ ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924
&НаКлиенте
Процедура ЗаполнитьДоговорыСоглашенияОзон()	
	
	Для Каждого Строка Из OzonКонтрагенты Цикл
		
		ПарметрыОтбора  	= Новый Структура("ИНН", Строка.ИНН); 
		НайденныеСтроки 	= OzonКонтрагентыОтображение.НайтиСтроки(ПарметрыОтбора);
		Строка.Договор  	= НайденныеСтроки[0].Договор;
		Строка.Соглашение  	= НайденныеСтроки[0].Соглашение;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924

//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
&НаСервере
Функция СформироватьРеализациюЧерезКомиссионераНаСервереОзон()
	
	МассивНаименованийПараметров = Новый Массив;
	
	МассивНаименованийПараметров.Добавить("СоглашениеOzon");
	МассивНаименованийПараметров.Добавить("ДоговорOzon");
	//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
	МассивНаименованийПараметров.Добавить("КонтрагентOzon");
	//- ИнфоСофт Власова И.С. 06.08.24 УА #67453
	
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);
	
	//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
	//КомиссионныеПродажи25 = ПолучитьВерсиюКомиссииОзон(Настройки);
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон;
	
	КомиссионныеПродажи25 = ИС_MP_Сервер.ПолучитьВерсиюКомиссионныхПродаж(Профиль, Маркетплейс);
	
	ПараметрыОтбора = Новый Структура("ПродажаЮрЛицу", Ложь);
		
	ЕстьРозничныеПродажи = ?(СписокТранзакцийExcelOzon.Выгрузить(ПараметрыОтбора).Количество() > 0, Истина, Ложь);
	
	Если ((КомиссионныеПродажи25 Или ЕстьРозничныеПродажи) И Не ВыполнитьПроверкуЗаполненияНастроекПрофиля(Профиль, Маркетплейс, Настройки)) 
		Или (OzonКонтрагенты.Количество() > 0 И Не ВыполнитьПроверкуЗаполненияДанныхПоКлиентам("Ozon", КомиссионныеПродажи25)) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 06.08.24 УА #67453	
	
	СформироватьРеализацииЧерезКомиссионераОзон(КомиссионныеПродажи25, Настройки);
	Элементы.СозданныеДокументыОзон.Видимость = Истина;
	
	//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
	Возврат Истина;
	//- ИнфоСофт Власова И.С. 06.08.24 УА #67453

КонецФункции //- ИнфоСофт Власова И.С. 06.08.24 УА #67453

//+ ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566
&НаСервере
Процедура СформироватьРеализацииЧерезКомиссионераОзон(КомиссионныеПродажи25, Настройки) 

	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокТранзакций.Номенклатура КАК Номенклатура,
	|	СписокТранзакций.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СписокТранзакций.ЦенаРеализация КАК ЦенаРеализация,
	|	СписокТранзакций.Количество КАК Количество,
	|	СписокТранзакций.РеализованоНаСумму КАК РеализованоНаСумму,
	|	СписокТранзакций.СуммаЛояльностиРеализации КАК СуммаЛояльностиРеализации,
	|	СписокТранзакций.ЭтоНабор КАК ЭтоНабор,
	|	СписокТранзакций.НомерОтправления КАК НомерОтправления,
	|	СписокТранзакций.НомерСчетФактуры КАК НомерСчетФактуры,
	|	СписокТранзакций.ДатаСчетФактуры КАК ДатаСчетФактуры,
	|	СписокТранзакций.ПродажаЮрЛицу КАК ПродажаЮрЛицу
	|ПОМЕСТИТЬ ВТ_СписокТранзакций
	|ИЗ
	|	&СписокТранзакций КАК СписокТранзакций
	|ГДЕ
	|	СписокТранзакций.ПродажаЮрЛицу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Контрагент КАК Контрагент,
	|	Контрагенты.Договор КАК Договор,
	|	Контрагенты.Соглашение КАК Соглашение,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Контрагенты.Партнер КАК Справочник.Партнеры), ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)) КАК Партнер,
	|	Контрагенты.НомерЗаказа КАК НомерОтправления
	|ПОМЕСТИТЬ ВТ_Контрагенты
	|ИЗ
	|	&Контрагенты КАК Контрагенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Ozon_Продажи.НомерОтправления КАК НомерОтправления,
	|	МАКСИМУМ(ИС_Ozon_Продажи.НомерСчетФактуры) КАК НомерСчетФактуры,
	|	МАКСИМУМ(ИС_Ozon_Продажи.ДатаСчетФактуры) КАК ДатаСчетФактуры
	|ПОМЕСТИТЬ ВТ_НомераСчетФактур
	|ИЗ
	|	ВТ_СписокТранзакций КАК ВТ_СписокТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_Продажи КАК ИС_Ozon_Продажи
	|		ПО ВТ_СписокТранзакций.НомерОтправления = ИС_Ozon_Продажи.НомерОтправления
	|ГДЕ
	|	ИС_Ozon_Продажи.Профиль = &Профиль
	|	И ИС_Ozon_Продажи.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ИС_Ozon_Продажи.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_Ozon_Продажи.НомерОтправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписокТранзакций.Количество КАК Количество,
	|	ВТ_СписокТранзакций.Номенклатура КАК Номенклатура,
	|	ВТ_СписокТранзакций.РеализованоНаСумму КАК РеализованоНаСумму,
	|	ВТ_СписокТранзакций.СуммаЛояльностиРеализации КАК СуммаЛояльностиРеализации,
	|	ВТ_СписокТранзакций.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_СписокТранзакций.ЦенаРеализация КАК ЦенаРеализация,
	|	ВТ_СписокТранзакций.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_НомераСчетФактур.НомерСчетФактуры КАК НомерСчетФактуры,
	|	ВТ_НомераСчетФактур.ДатаСчетФактуры КАК ДатаСчетФактуры,
	|	ВТ_Контрагенты.Договор КАК Договор,
	|	ВТ_Контрагенты.Контрагент КАК Контрагент,
	|	ВТ_Контрагенты.Партнер КАК Партнер,
	|	ВТ_Контрагенты.Соглашение КАК Соглашение
	|ИЗ
	|	ВТ_СписокТранзакций КАК ВТ_СписокТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераСчетФактур КАК ВТ_НомераСчетФактур
	|		ПО ВТ_СписокТранзакций.НомерОтправления = ВТ_НомераСчетФактур.НомерОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Контрагенты КАК ВТ_Контрагенты
	|		ПО ВТ_СписокТранзакций.НомерОтправления = ВТ_Контрагенты.НомерОтправления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Партнер
	|ИТОГИ ПО
	|	НомерСчетФактуры";
 	
	Запрос.УстановитьПараметр("СписокТранзакций", 	СписокТранзакцийExcelOzon.Выгрузить());
	Запрос.УстановитьПараметр("Контрагенты", 		OzonКонтрагенты.Выгрузить());
	Запрос.УстановитьПараметр("Профиль", 			Профиль);
	Запрос.УстановитьПараметр("ДатаНачала", 		ПериодOzon.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 		ПериодOzon.ДатаОкончания);
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(10,2);
	
	ТаблицаПродажРеализацииЧерезКомиссионера = Новый ТаблицаЗначений;
		
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("Партнер", 					Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("Контрагент", 				Новый ОписаниеТипов("СправочникСсылка.Контрагенты")); 
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("Договор", 					Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("Соглашение", 				Новый ОписаниеТипов("СправочникСсылка.СоглашенияСКлиентами"));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("Номенклатура", 				Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("Количество", 				Новый ОписаниеТипов("Число",,,КвалификаторЧисла));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("РеализованоНаСумму", 		Новый ОписаниеТипов("Число",,,КвалификаторЧисла));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("СуммаЛояльностиРеализации", 	Новый ОписаниеТипов("Число",,,КвалификаторЧисла));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("ЦенаРеализация", 			Новый ОписаниеТипов("Число",,,КвалификаторЧисла));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("ЭтоНабор", 					Новый ОписаниеТипов("Булево"));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("НомерСчетФактуры",	 		Новый ОписаниеТипов("Строка"));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("ДатаСчетФактуры", 			Новый ОписаниеТипов("Дата"));
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Профиль", Профиль);
	СтруктураДанных.Вставить("Период", 	ПериодOzon);	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
	
	МассивВзаимозачет = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();  
		
		ТаблицаПродажРеализацииЧерезКомиссионера.Очистить();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = ТаблицаПродажРеализацииЧерезКомиссионера.Добавить(); 
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
			
		КонецЦикла;	
		
		СтруктураДанных.Вставить("ТаблицаПродаж", 				ТаблицаПродажРеализацииЧерезКомиссионера);
		СтруктураДанных.Вставить("РеализацияЧерезКомиссионера", КомиссионныеПродажи25);
		СтруктураДанных.Вставить("ЗаказКлиента", 				Неопределено);	
		
		Если Не КомиссионныеПродажи25 Тогда 
			
			ДокументВозврат = ИС_Ozon_Сервер.СоздатьДокументВозвратТоваров(СтруктураДанных);
			
			ДобавитьНовыйДокумент(ДокументВозврат);  		
			
			ПорядокРасчетов = ПолучитьПорядокРасчетов(СтруктураДанных.ТаблицаПродаж[0]); 
			
			СтруктураВзаимозачет = Новый Структура();		
			
			Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам Тогда
				
				ДокументЗаказ = ИС_Ozon_Сервер.СоздатьЗаказКлиента(СтруктураДанных);
				
				ДобавитьНовыйДокумент(ДокументЗаказ);
				
				СтруктураДанных.Вставить("ЗаказКлиента", 		ДокументЗаказ.Ссылка);	
				СтруктураВзаимозачет.Вставить("ОбъектРасчетов", ДокументЗаказ.Ссылка);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДокументРеализация = ИС_Ozon_Сервер.СоздатьРеализациюТоваровЧерезКомиссионера(СтруктураДанных);
		
		Если ДокументРеализация <> Неопределено Тогда
			
			Если Не КомиссионныеПродажи25 Тогда
				
				Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда 
					СтруктураВзаимозачет.Вставить("ОбъектРасчетов", ДокументРеализация.Ссылка);
				КонецЕсли;
				
				Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
					СтруктураВзаимозачет.Вставить("ОбъектРасчетов", ДокументВозврат.Договор)
				КонецЕсли;
				
				СтруктураВзаимозачет.Вставить("ДокументРеализация", ДокументРеализация.Ссылка);
				
				МассивВзаимозачет.Добавить(СтруктураВзаимозачет);
				
			КонецЕсли;
			
			ДобавитьНовыйДокумент(ДокументРеализация.Ссылка); 
			
			//+ ИнфоСофт Мурсалимов Д.Р. 25.03.25 УА #96800
			СуммаЛояльностиРеализации = ТаблицаПродажРеализацииЧерезКомиссионера[0].СуммаЛояльностиРеализации;
			
			Если СуммаЛояльностиРеализации = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Номенклатура", 	ОзонУслугаЮрЛиц);
			СтруктураДанных.Вставить("Соглашение", 		ОзонСоглашениеЮрЛиц);
			СтруктураДанных.Вставить("Договор", 		ОзонДоговорЮрЛиц);
			
			ДокументРеализацияУслуг = ИС_Ozon_Сервер.СоздатьРеализациюУслугПоЮрЛицам(СтруктураДанных);
			
			Если ДокументРеализацияУслуг = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавитьНовыйДокумент(ДокументРеализацияУслуг.Ссылка);
			
			Если КомиссионныеПродажи25 Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураВзаимозачет = Новый Структура();
			
			СтруктураВзаимозачет.Вставить("ОбъектРасчетов", 	ДокументРеализацияУслуг.Ссылка);				
			СтруктураВзаимозачет.Вставить("ДокументРеализация", ДокументРеализацияУслуг.Ссылка);
			
			МассивВзаимозачет.Добавить(СтруктураВзаимозачет);
			//- ИнфоСофт Мурсалимов Д.Р. 25.03.25 УА #96800
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыОтбора 			= Новый Структура("ПродажаЮрЛицу", Ложь);
		
	СписокПродажОК 				= СписокТранзакцийExcelOzon.Выгрузить(ПараметрыОтбора);

	ВсегоВыплатыОтПартнеров 	= СписокТранзакцийExcelOzon.Итог("ВыплатыОтПартнеров") 					- СписокТранзакцийExcelOzon.Итог("ВозвратВыплатыОтПартнеров");
	ВсегоКНачислению 			= СписокТранзакцийExcelOzon.Итог("ИтогиКНачислению")					- СписокТранзакцийExcelOzon.Итог("ИтогоВозвращено");
	ВсегоНачисленоБаллов 		= СписокТранзакцийExcelOzon.Итог("ДоплатаЗаСчетOzon") 					- СписокТранзакцийExcelOzon.Итог("ВозвратДоплатаЗаСчетOzon");
	ВсегоБазоваяКомиссия 		= СписокТранзакцийExcelOzon.Итог("ИтогиКомиссияСУчетомСкидокИНаценок") 	- СписокТранзакцийExcelOzon.Итог("ВозвратИтогиКомиссияСУчетомСкидокИНаценок");
	ВсегоКомиссияПослеСкидок 	= ВсегоБазоваяКомиссия - ВсегоНачисленоБаллов;
	
	Если ВсегоКомиссияПослеСкидок < ВсегоБазоваяКомиссия / 100 Тогда
		ВсегоКомиссияПослеСкидок = ВсегоБазоваяКомиссия / 100;
	КонецЕсли;
		
	Если СписокПродажОК.Количество() > 0 Тогда
		
		Комментарий = "Отчет комиссионера за период с " + ПериодOzon.ДатаНачала + " по " + ПериодOzon.ДатаОкончания;	
		
		//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗаполнитьКолонкуПокупательОзон", ЗаполнитьКолонкуПокупательОзон);
		//+ ИнфоСофт Власова И.С. 10.12.24 УА #87450
		СтруктураПараметров.Вставить("РозничныйПокупательОзон",        РозничныйПокупательОзон);
		//- ИнфоСофт Власова И.С. 10.12.24 УА #87450
		//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
		//+ ИнфоСофт Стояк Ю.К. 18.02.2025 УА #92095		
		СтруктураПараметров.Вставить("Профиль", 					   Профиль);
		//- ИнфоСофт Стояк Ю.К. 18.02.2025 УА #92095
		
		Отчет = ИС_Ozon_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, ПериодOzon, СписокПродажОК, Комментарий, ВсегоКомиссияПослеСкидок, СтруктураПараметров);	
		
		Если Отчет <> Неопределено Тогда
			ДобавитьНовыйДокумент(Отчет);
		КонецЕсли;
		
		Для Каждого Элемент Из МассивВзаимозачет Цикл
			
			Взаимозачет = ИС_МП_УправлениеЗаказами.СоздатьДокументВзаимозачетЗадолженности(Элемент.ОбъектРасчетов, Элемент.ДокументРеализация, Отчет);	
			ДобавитьНовыйДокумент(Взаимозачет);
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566

//+ ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924
&НаСервере
Функция ПолучитьРезультатСопоставленияКонтрагентовОзон() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.НомерЗаказа КАК НомерЗаказа,
	|	Контрагенты.НаименованиеКлиента КАК НаименованиеКлиента,
	|	Контрагенты.АдресКлиента КАК Адрес
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&Контрагенты КАК Контрагенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.ИНН КАК ИНН,
	|	ВТ_Данные.НомерЗаказа КАК НомерЗаказа,
	|	ВТ_Данные.Адрес КАК Адрес,
	|	ВТ_Данные.НаименованиеКлиента КАК НаименованиеКлиента,
	|	Партнеры.Ссылка КАК Партнер,
	|	Контрагенты.Ссылка КАК Контрагент
	|ПОМЕСТИТЬ ВТ_Контрагенты
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|			ПО Контрагенты.Партнер = Партнеры.Ссылка
	|		ПО ВТ_Данные.ИНН = Контрагенты.ИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Контрагенты.ИНН КАК ИНН,
	|	МАКСИМУМ(ДоговорыКонтрагентов.Ссылка) КАК Договор,
	|	МАКСИМУМ(ВТ_Контрагенты.НаименованиеКлиента) КАК НаименованиеКлиента,
	|	МАКСИМУМ(ВТ_Контрагенты.Адрес) КАК Адрес,
	|	МАКСИМУМ(СоглашенияСКлиентами.Ссылка) КАК Соглашение
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	ВТ_Контрагенты КАК ВТ_Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (ВТ_Контрагенты.Контрагент = ДоговорыКонтрагентов.Контрагент
	|				И ВТ_Контрагенты.Партнер = ДоговорыКонтрагентов.Партнер
	|				И ВЫБОР
	|					КОГДА &КомиссионныеПродажи25
	|						ТОГДА ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.РеализацияЧерезКомиссионера)
	|					ИНАЧЕ ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|				КОНЕЦ
	|				И ДоговорыКонтрагентов.Организация = &Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|		ПО (ВТ_Контрагенты.Контрагент = СоглашенияСКлиентами.Контрагент
	|				И ВЫБОР
	|					КОГДА &КомиссионныеПродажи25
	|						ТОГДА СоглашенияСКлиентами.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКОмиссию)
	|					ИНАЧЕ СоглашенияСКлиентами.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|				КОНЕЦ
	|				И СоглашенияСКлиентами.Организация = &Организация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Контрагенты.ИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Контрагенты.ИНН КАК ИНН,
	|	ВТ_Контрагенты.НомерЗаказа КАК НомерЗаказа,
//+ ИнфоСофт Сумин Д.В. 03.05.2024 УА #67144
	|	ВТ_Контрагенты.Адрес КАК АдресКлиента,
	//|	ВТ_Контрагенты.Адрес КАК Адрес,
//- ИнфоСофт Сумин Д.В. 03.05.2024 УА #67144
	|	ВТ_Контрагенты.НаименованиеКлиента КАК НаименованиеКлиента,
	|	ВТ_Контрагенты.Партнер КАК Партнер,
	|	ВТ_Контрагенты.Контрагент КАК Контрагент,
	|	ВТ_Договоры.Договор КАК Договор,
	|	ВТ_Договоры.Соглашение КАК Соглашение
	|ИЗ
	|	ВТ_Контрагенты КАК ВТ_Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Договоры КАК ВТ_Договоры
	|		ПО ВТ_Контрагенты.ИНН = ВТ_Договоры.ИНН");
	
	Запрос.УстановитьПараметр("Контрагенты", 			OzonКонтрагенты.Выгрузить()); 
	Запрос.УстановитьПараметр("Организация", 			Профиль.Организация);
	Запрос.УстановитьПараметр("КомиссионныеПродажи25", 	ПолучитьВерсиюКомиссииОзон());
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	OzonКонтрагенты.Очистить();
	
	РезультатПроверки = Истина;
	
	Пока Выборка.Следующий() Цикл 
		
		НоваяСтрока = OzonКонтрагенты.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если Не ЗначениеЗаполнено(Выборка.Контрагент) Тогда
			РезультатПроверки = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924	

//+ ИнфоСофт Сумин Д.В. 03.11.2023 УА #63924
Процедура ЗавершениеСозданияКонтрагента(Результат, Параметры) Экспорт
	Результат = ПолучитьРезультатСопоставленияКонтрагентовОзон();
	ЗаполнитьКонтрагентыОтображениеНаСервере("Ozon");
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 03.11.2023 УА #63924

//+ ИнфоСофт Сумин Д.В. 08.11.2023 УА #63924
&НаСервере
//+ ИнфоСофт Власова И.С. 06.08.24 УА #81190
//Процедура СформироватьОтчетаКомиссионераНаСервереОзон()
Процедура СформироватьОтчетКомиссионераНаСервереОзон()
//- ИнфоСофт Власова И.С. 06.08.24 УА #81190
	
	//+ ИнфоСофт Заварин К.В. 04.04.24 УА #66208
	//Комментарий = "Отчет комисисонера за период с " + ПериодOzon.ДатаНачала + " по " + ПериодOzon.ДатаОкончания;
	Комментарий = Строка(Профиль) + " Отчет комисисонера за период с " + ПериодOzon.ДатаНачала + " по " + ПериодOzon.ДатаОкончания;
	//- ИнфоСофт Заварин К.В. 04.04.24 УА #66208
	
	СписокПродажОК = СписокТранзакцийExcelOzon.Выгрузить();  
	
	//+ ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897	
	Если ВариантФормированияЦеныВозврата = 1 И Не ЗначениеЗаполнено(ВидЦеныВозврата) Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Не выбран вид цены");
		Возврат;
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СпособРасчетаЦеныВозврата", Новый Структура("СпособРасчета, ВидЦены", ВариантФормированияЦеныВозврата, ВидЦеныВозврата));
	
	//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
	СтруктураПараметров.Вставить("ЗаполнитьКолонкуПокупательОзон", ЗаполнитьКолонкуПокупательОзон);
	//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
	//+ ИнфоСофт Власова И.С. 10.12.24 УА #87450
	СтруктураПараметров.Вставить("РозничныйПокупательОзон",        РозничныйПокупательОзон);
	//- ИнфоСофт Власова И.С. 10.12.24 УА #87450                                            
	//+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133	
	СтруктураПараметров.Вставить("Профиль", 					   Профиль);
	//- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133
	
	//Отчет = ИС_Ozon_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, ПериодOzon, СписокПродажОК, Комментарий, ВсегоКомиссияПослеСкидок);
	Отчет = ИС_Ozon_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, ПериодOzon, СписокПродажОК, Комментарий, ВсегоКомиссияПослеСкидок, СтруктураПараметров); 	
	//- ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
		
	Элементы.СозданныеДокументы.Видимость = Истина;
	
	ДобавитьНовыйДокумент(Отчет);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 08.11.2023 УА #63924


//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
&НаКлиенте 
Процедура ПодключитьРасширениеДляРаботыСФайлами(УстановитьЕслиНеПодключено) Экспорт  
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьРасширениеДляРаботыСФайламиЗавершение", ЭтотОбъект, УстановитьЕслиНеПодключено); 
	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127 

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
&НаКлиенте
Процедура ПодключитьРасширениеДляРаботыСФайламиЗавершение(Подключено, УстановитьЕслиНеПодключено) Экспорт
	
	Если Подключено Тогда
		Возврат;
	ИначеЕсли УстановитьЕслиНеПодключено Тогда  	
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьРасширениеДляРаботыСФайлами", ЭтотОбъект, Ложь);     
		НачатьУстановкуРасширенияРаботыСФайлами(ОписаниеОповещения);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось подключить расширение для работы с файлами!");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127

//+ ИнфоСофт Мурсалимов Д.Р. 26.09.24 УА #65981
&НаСервере
Функция ПолучитьТекстОбласти(ТабличныйДокумент, Ячейка, НомерЯчейки)
	Возврат ТабличныйДокумент.ПолучитьОбласть(Ячейка + Формат(НомерЯчейки, "ЧГ=")).ТекущаяОбласть.Текст;
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 26.09.24 УА #65981

//+ ИнфоСофт Мурсалимов Д.Р. 26.09.24 УА #65981
&НаСервере
Процедура ПолучитьТаблицуЗначенийПродажИзФайлаOzonПосле30032024() 
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(Имя, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		
	ПериодРеализации = ПолучитьПериодРеализации(ТабличныйДокумент.ПолучитьОбласть("R4"  + "C5").ТекущаяОбласть.Текст);
	
	Если ПериодРеализации = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбран неверный файл. Необходим файл ""Позаказный отчет о реализации.""");	
		Возврат;
	КонецЕсли;
	
	НомерВходящегоДокумента = ПолучитьНомерВходящегоДокумента(ТабличныйДокумент.ПолучитьОбласть("R3"  + "C5").ТекущаяОбласть.Текст);
	ПериодРеализации.Вставить("НомерРеализации", НомерВходящегоДокумента);  
	
	СписокТранзакцийExcelOzon.Очистить();
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	Для сч = 16 По КоличествоСтрок Цикл
		
		Попытка
			
			ТабДок 													= ТабличныйДокумент;
			
			РассчитаннаяСтрока 										= "R" + Формат(сч, "ЧГ=0;") + "C";
			
			НомерСтроки  											= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 1));
			
			//+ ИнфоСофт Заварин К.В. 14.02.25 УА #93838
			//Если НомерСтроки = "" Тогда Прервать; КонецЕсли;
			Если НомерСтроки = "" Или НомерСтроки = "0" Тогда Прервать; КонецЕсли;
			//- ИнфоСофт Заварин К.В. 14.02.25 УА #93838
			
			НоваяСтрока 											= СписокТранзакцийExcelOzon.Добавить();

			НоваяСтрока.НаименованиеТовара							= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 2));
			НоваяСтрока.offer_id									= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 3));
			НоваяСтрока.SKU											= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 4)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 4), Символы.НПП, "")));
			НоваяСтрока.ШтрихКодТовара								= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 5));			
			
			НоваяСтрока.РеализованоНаСумму							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6), Символы.НПП, "")));

			//+ ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566
			СуммаЛояльностиРеализации								= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7), Символы.НПП, "")));
			
			НоваяСтрока.СуммаЛояльностиРеализации					= СуммаЛояльностиРеализации;
				
			НоваяСтрока.РеализованоНаСумму 							= НоваяСтрока.РеализованоНаСумму + СуммаЛояльностиРеализации;
			//- ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566
			
			НоваяСтрока.ВыплатыОтПартнеров							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7), Символы.НПП, "")));
			НоваяСтрока.ДоплатаЗаСчетOzon							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8), Символы.НПП, "")));
			НоваяСтрока.Количество									= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9), Символы.НПП, "")));
			НоваяСтрока.ЦенаРеализация								= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10), Символы.НПП, "")));
			НоваяСтрока.КомиссияЗаПродажуПоКатегорииПроцент			= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11));
			НоваяСтрока.ЦенаПродовцаСУчетомСкидки					= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 12)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 12), Символы.НПП, "")));
			НоваяСтрока.ИтогиКомиссияСУчетомСкидокИНаценок			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 13)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 13), Символы.НПП, "")));
			НоваяСтрока.ИтогиКНачислению							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14), Символы.НПП, "")));	
			НоваяСтрока.ВозвращеноНаСумму							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 15)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 15), Символы.НПП, "")));
			
			//+ ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566
			СуммаЛояльностиВозврата									= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 16)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 16), Символы.НПП, "")));
			
			НоваяСтрока.СуммаЛояльностиВозврата						= СуммаЛояльностиВозврата;
				
			НоваяСтрока.ВозвращеноНаСумму 							= НоваяСтрока.ВозвращеноНаСумму + СуммаЛояльностиВозврата;
			//- ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566
			
			НоваяСтрока.ВозвратВыплатыОтПартнеров					= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 16)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 16), Символы.НПП, "")));
			НоваяСтрока.ВозвратДоплатаЗаСчетOzon					= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 17)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 17), Символы.НПП, "")));
			НоваяСтрока.ВозвратКоличество							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 18)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 18), Символы.НПП, "")));
			НоваяСтрока.ВозвратЦенаРеализации						= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 19)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 19), Символы.НПП, "")));
			НоваяСтрока.ВозвратИтогиКомиссияСУчетомСкидокИНаценок	= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 20)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 20), Символы.НПП, "")));
			НоваяСтрока.ИтогоВозвращено								= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 21)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 21), Символы.НПП, "")));
			НоваяСтрока.НомерОтправления							= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 22));
			НоваяСтрока.ДатаОтправления								= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 23));
			НоваяСтрока.НомерСчетФактуры							= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 24));

			ДатаСФ													= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 25));
			Если ЗначениеЗаполнено(ДатаСФ) Тогда
				НоваяСтрока.ДатаСчетФактуры 						= СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаСФ);
			КонецЕсли;
						
		Исключение
			Сообщение		= Новый СообщениеПользователю;
			Сообщение.Текст	= "Не удалось загрузить строку " + Строка(сч);
			Сообщение.Сообщить();
		КонецПопытки; 
		
	КонецЦикла;	
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ОтменитьТранзакцию();
	КонецПопытки; 
	
	СписокТранзакций = ИС_Ozon_Сервер.ДобавитьСопоставление(СписокТранзакцийExcelOzon.Выгрузить(), Профиль);
	СписокТранзакцийExcelOzon.Загрузить(СписокТранзакций);
	
	ЗаписатьДанныеПродажOzon(ПериодРеализации);
	
	СписокТранзакцийExcelOzon.Очистить();
			
	ОбщегоНазначения.СообщитьПользователю("Файл обработан, перейдите к пункту два.");
	
	//Элементы.ГруппаЭтапДваОзон.Видимость = Истина; 
	//Элементы.ПоказатьПунктДваОзон.Видимость = Ложь;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 26.09.24 УА #65981

//+ ИнфоСофт Заварин К.В. 26.11.24 УА #74680
&НаСервере
Процедура ПолучитьТаблицуЗначенийВыкупленныхТоваровИзФайлаOzon() 
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(Имя, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		
	ПериодРеализации = ПолучитьПериодРеализации(ТабличныйДокумент.ПолучитьОбласть("R3"  + "C2").ТекущаяОбласть.Текст);
	
	НомерВходящегоДокумента = ПолучитьНомерВходящегоДокумента(ТабличныйДокумент.ПолучитьОбласть("R2"  + "C2").ТекущаяОбласть.Текст);
	ПериодРеализации.Вставить("НомерРеализации", НомерВходящегоДокумента);
	
	Если ПериодРеализации = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбран неверный файл. Необходим файл по выкупленным товарам");	
		Возврат;
	КонецЕсли;  
	
	//+ ИнфоСофт Заварин К.В. 10.01.25 УА #90580
	Если Не ТабличныйДокумент.ПолучитьОбласть("R12"  + "C6").ТекущаяОбласть.Текст = "Исходные стоимостные данные" Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбран неверный формат файла.");	
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 10.01.25 УА #90580
	
	OzonСписокТранзакцийВыкупленныхТоваров.Очистить();
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы - 1;
	
	Для сч = 14 По КоличествоСтрок Цикл
		
		Попытка
			
			ТабДок 													= ТабличныйДокумент;
			
			РассчитаннаяСтрока 										= "R" + Формат(сч, "ЧГ=0;") + "C";
			
			НомерСтроки  											= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 2));
			
			Если НомерСтроки = "" Тогда Прервать; КонецЕсли;
			
			НоваяСтрока 											= OzonСписокТранзакцийВыкупленныхТоваров.Добавить();
			
			НоваяСтрока.СтрокаНомер									= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 2)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 2), Символы.НПП, "")));
			
			НоваяСтрока.НаименованиеТовара							= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 3));
			НоваяСтрока.offer_id									= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 4));
			НоваяСтрока.SKU											= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 5)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 5), Символы.НПП, "")));
			
			НоваяСтрока.ИсходныеСтоимостныеДанные					= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6), Символы.НПП, "")));
		
			НоваяСтрока.ДисконтПоКатегорииПроцент 					= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7), Символы.НПП, "")));
			
			НоваяСтрока.ЦенаРеализация							    = ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8), Символы.НПП, "")));
			
			//+ ИнфоСофт Мурсалимов Д.Р. 21.01.25 УА #91462
			СтавкаНДСПроцент = Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9));
			
			Если Нрег(СтавкаНДСПроцент) = "без ндс" Тогда
				СтавкаНДСПроцент = 0;
			Иначе
			    СтавкаНДСПроцент = ?(СтавкаНДСПроцент = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9), Символы.НПП, "")));
			КонецЕсли;
				
			НоваяСтрока.СтавкаНДСПроцент							= СтавкаНДСПроцент;
			//НоваяСтрока.СтавкаНДСПроцент							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9), Символы.НПП, "")));
			//- ИнфоСофт Мурсалимов Д.Р. 21.01.25 УА #91462
			
			НоваяСтрока.Количество									= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10), Символы.НПП, "")));
			
			НоваяСтрока.ИтогиКНачислению							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11), Символы.НПП, "")));
						
		Исключение
			Сообщение		= Новый СообщениеПользователю;
			Сообщение.Текст	= "Не удалось загрузить строку " + Строка(сч);
			Сообщение.Сообщить();
		КонецПопытки; 
		
	КонецЦикла;	
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ОтменитьТранзакцию();
	КонецПопытки; 
	
	СписокТранзакций = ИС_Ozon_Сервер.ДобавитьСопоставлениеВыкупленныхТоваров(OzonСписокТранзакцийВыкупленныхТоваров.Выгрузить(), Профиль);
	OzonСписокТранзакцийВыкупленныхТоваров.Загрузить(СписокТранзакций);
	
	ЗаписатьДанныеВыкупленныхТоваровOzon(ПериодРеализации);
	
	OzonСписокТранзакцийВыкупленныхТоваров.Очистить();
			
	ОбщегоНазначения.СообщитьПользователю("Файл обработан, перейдите к пункту два.");
	
	//Элементы.ГруппаЭтапДваОзон.Видимость = Истина; 
	//Элементы.ПоказатьПунктДваОзон.Видимость = Ложь;

КонецПроцедуры //- ИнфоСофт Заварин К.В. 26.11.24 УА #74680 

//+ ИнфоСофт Заварин К.В. 10.01.25 УА #90580
&НаСервере
Процедура ПолучитьТаблицуЗначенийВыкупленныхТоваровИзФайлаOzonПосле30112024() 
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(Имя, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		
	ПериодРеализации = ПолучитьПериодРеализации(ТабличныйДокумент.ПолучитьОбласть("R3"  + "C2").ТекущаяОбласть.Текст);
	
	НомерВходящегоДокумента = ПолучитьНомерВходящегоДокумента(ТабличныйДокумент.ПолучитьОбласть("R2"  + "C2").ТекущаяОбласть.Текст);
	ПериодРеализации.Вставить("НомерРеализации", НомерВходящегоДокумента);
	
	Если ПериодРеализации = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбран неверный файл. Необходим файл по выкупленным товарам");	
		Возврат;
	КонецЕсли;  
	
	Если Не ТабличныйДокумент.ПолучитьОбласть("R11"  + "C6").ТекущаяОбласть.Текст = "Номер отправления" Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбран неверный формат файла.");	
		Возврат;
	КонецЕсли;
	
	OzonСписокТранзакцийВыкупленныхТоваров.Очистить();
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы - 1;
	
	Для сч = 14 По КоличествоСтрок Цикл
		
		Попытка
			
			ТабДок 													= ТабличныйДокумент;
			
			РассчитаннаяСтрока 										= "R" + Формат(сч, "ЧГ=0;") + "C";
			
			НомерСтроки  											= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 2));
			
			Если НомерСтроки = "" Тогда Прервать; КонецЕсли;
			
			НоваяСтрока 											= OzonСписокТранзакцийВыкупленныхТоваров.Добавить();
			
			НоваяСтрока.СтрокаНомер									= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 2)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 2), Символы.НПП, "")));
			
			НоваяСтрока.НаименованиеТовара							= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 3));
			НоваяСтрока.offer_id									= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 4));
			НоваяСтрока.SKU											= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 5)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 5), Символы.НПП, "")));
			
			НоваяСтрока.НомерОтправления							= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6));
			
			НоваяСтрока.ИсходныеСтоимостныеДанные					= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7), Символы.НПП, "")));
		
			НоваяСтрока.ДисконтПоКатегорииПроцент 					= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8), Символы.НПП, "")));
			
			НоваяСтрока.ЦенаРеализация							    = ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9), Символы.НПП, "")));
			
			//+ ИнфоСофт Мурсалимов Д.Р. 21.01.25 УА #91462
			СтавкаНДСПроцент = Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10));
			
			Если Нрег(СтавкаНДСПроцент) = "без ндс" Тогда
				СтавкаНДСПроцент = 0;
			Иначе
			    СтавкаНДСПроцент = ?(СтавкаНДСПроцент = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10), Символы.НПП, "")));
			КонецЕсли;
				
			НоваяСтрока.СтавкаНДСПроцент							= СтавкаНДСПроцент;
			//НоваяСтрока.СтавкаНДСПроцент							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10), Символы.НПП, "")));
			//- ИнфоСофт Мурсалимов Д.Р. 21.01.25 УА #91462
			
			НоваяСтрока.Количество									= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11), Символы.НПП, "")));
			
			НоваяСтрока.ИтогиКНачислению							= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 12)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 12), Символы.НПП, "")));
						
		Исключение
			Сообщение		= Новый СообщениеПользователю;
			Сообщение.Текст	= "Не удалось загрузить строку " + Строка(сч);
			Сообщение.Сообщить();
		КонецПопытки; 
		
	КонецЦикла;	
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ОтменитьТранзакцию();
	КонецПопытки; 
	
	СписокТранзакций = ИС_Ozon_Сервер.ДобавитьСопоставлениеВыкупленныхТоваров(OzonСписокТранзакцийВыкупленныхТоваров.Выгрузить(), Профиль);
	OzonСписокТранзакцийВыкупленныхТоваров.Загрузить(СписокТранзакций);
	
	ЗаписатьДанныеВыкупленныхТоваровOzon(ПериодРеализации);
	
	OzonСписокТранзакцийВыкупленныхТоваров.Очистить();
			
	ОбщегоНазначения.СообщитьПользователю("Файл обработан, перейдите к пункту два.");
	
	//Элементы.ГруппаЭтапДваОзон.Видимость = Истина; 
	//Элементы.ПоказатьПунктДваОзон.Видимость = Ложь;

КонецПроцедуры //- ИнфоСофт Заварин К.В. 10.01.25 УА #90580

//+ ИнфоСофт Заварин К.В. 27.11.24 УА #74680
&НаСервере
Процедура ВыполнитьСозданиеДокументовВыкупленныхТоваровОзон()
	
	ЗаголовокСтруктура = Новый Структура;
	
	ЗаголовокСтруктура.Вставить("ПериодOzon", 	ПериодOzon);
	ЗаголовокСтруктура.Вставить("Комментарий", 	"Создан на основании отчета о выкупленных товарах № " + OzonСписокТранзакцийВыкупленныхТоваров[0].НомерДокумента);
				
	КомиссионныеПродажи25 = ИС_MP_Сервер.ПолучитьВерсиюКомиссионныхПродаж(Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон);
	
	СписокВыкупленныхТоваров = OzonСписокТранзакцийВыкупленныхТоваров.Выгрузить();
	
	Элементы.СозданныеДокументы.Видимость = Истина;

	Если Не КомиссионныеПродажи25 Тогда 
		
		//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96620
		//ДокументВозвратКомиссия = ИС_Ozon_Сервер.СоздатьДокументВозвратТоваровВыкупленныхТоваров(Профиль, СписокВыкупленныхТоваров, ЗаголовокСтруктура, Истина);
		ДокументВозвратКомиссия = ИС_Ozon_Сервер.СоздатьДокументВозвратТоваровВыкупленныхТоваров(Профиль, СписокВыкупленныхТоваров, ЗаголовокСтруктура, Ложь);
		//- ИнфоСофт Заварин К.В. 19.03.25 УА #96620
		
		ДобавитьНовыйДокумент(ДокументВозвратКомиссия.Ссылка);
		
		ДокументРТУ = ИС_Ozon_Сервер.СоздатьДокументРТУ(Профиль, СписокВыкупленныхТоваров, ЗаголовокСтруктура, Ложь);
		ДобавитьНовыйДокумент(ДокументРТУ.Ссылка);	
		
	Иначе
		
		ДокументЗаявкаНаВозвратКомиссия = ИС_Ozon_Сервер.СоздатьДокументЗаявкаНаВозврат(Профиль, СписокВыкупленныхТоваров, ЗаголовокСтруктура); 
		ДобавитьНовыйДокумент(ДокументЗаявкаНаВозвратКомиссия.Ссылка);
		
		ДокументВозвратКомиссия = ИС_Ozon_Сервер.СоздатьДокументПоступлениеТоваровОтХранителя(ДокументЗаявкаНаВозвратКомиссия, Профиль, СписокВыкупленныхТоваров, ЗаголовокСтруктура);
		ДобавитьНовыйДокумент(ДокументВозвратКомиссия.Ссылка);
		
		ДокументРТУ = ИС_Ozon_Сервер.СоздатьДокументРТУ(Профиль, СписокВыкупленныхТоваров, ЗаголовокСтруктура, Ложь);
		ДобавитьНовыйДокумент(ДокументРТУ.Ссылка);
		
	КонецЕсли;
		
		
КонецПроцедуры //- ИнфоСофт Заварин К.В. 27.11.24 УА #74680

//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
&НаСервере
Функция ВыполнитьПроверкуЗаполненияДанныхПоКлиентам(Маркетплейс, КомиссионныеПродажи25)
	
	РезультатПроверки = Истина;
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ИспользоватьДоговорыСКлиентами   = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	Если КомиссионныеПродажи25 Тогда
		ХозОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионера");
	Иначе
		ХозОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту");	
	КонецЕсли; 
	
	Контрагенты = ЭтотОбъект[Маркетплейс + "Контрагенты"];
	
	Для Каждого Контрагент Из Контрагенты Цикл
		
		Если ИспользоватьСоглашенияСКлиентами И Не КомиссионныеПродажи25 Тогда
			
			Если ЗначениеЗаполнено(Контрагент.Соглашение) Тогда	
				
				Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(Контрагент.Соглашение, "ХозяйственнаяОперация") = ХозОперация Тогда
					
					ТекстСообщения = СтрШаблон(
						"соглашение с контрагентом: %1 имеет хозяйственную операцию, отличающуюся от ""%2"".",
						Контрагент.Контрагент, ХозОперация);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					
					РезультатПроверки = Ложь;
					
				КонецЕсли;
				
			Иначе	
				
				ТекстСообщения = СтрШаблон(
					"Не заполнено соглашение с контрагентом: %1.", Контрагент.Контрагент);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				РезультатПроверки = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если КомиссионныеПродажи25
			Или (ИспользоватьДоговорыСКлиентами И Не ИспользоватьСоглашенияСКлиентами)
			Или (ИспользоватьСоглашенияСКлиентами И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент.Соглашение, "ИспользуютсяДоговорыКонтрагентов")) Тогда
			
			Если ЗначениеЗаполнено(Контрагент.Договор) Тогда	
				
				Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(Контрагент.Договор, "ХозяйственнаяОперация") = ХозОперация Тогда
					
					ТекстСообщения = СтрШаблон(
						"договор контрагента: %1 имеет хозяйственную операцию, отличающуюся от ""%2"".",
					Контрагент.Контрагент, ХозОперация);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					
					РезультатПроверки = Ложь;
					
				КонецЕсли;
				
			Иначе
				
				ТекстСообщения = СтрШаблон(
					"Не заполнен договор контрагента: %1.", Контрагент.Контрагент);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				РезультатПроверки = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции //- ИнфоСофт Власова И.С. 06.08.24 УА #67453

//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
&НаСервере
Функция ВыполнитьПроверкуЗаполненияНастроекПрофиля(Профиль, Маркетплейс, Настройки)
	
	РезультатПроверки = Истина;
	
	ПрефиксНастроек          = ИС_MP_Сервер.ПолучитьПрефиксНастроек(Маркетплейс);
	НаименованиеМаркетплейса = ИС_MP_Сервер.ПолучитьНаименованиеМаркетплейса(Маркетплейс);
	
	Настройка = Настройки.Получить("Контрагент" + ПрефиксНастроек);
	
	Если Настройка = Неопределено Или Настройка.Пустая() Тогда
		
		ТекстСообщения = СтрШаблон("Не заполнен контрагент в настройках профиля %1 для маркетплейса %2.", Профиль, НаименованиеМаркетплейса);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		РезультатПроверки = Ложь;
		
	КонецЕсли;
	
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	Если ИспользоватьДоговорыСКлиентами Тогда
		
		Настройка = Настройки.Получить("Договор" + ПрефиксНастроек);
		
		Если Настройка = Неопределено Или Настройка.Пустая() Тогда
			
			ТекстСообщения = СтрШаблон("Не заполнен договор в настройках профиля %1 для маркетплейса %2.", Профиль, НаименованиеМаркетплейса);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			РезультатПроверки = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции //- ИнфоСофт Власова И.С. 06.08.24 УА #67453	

//+ ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252
&НаСервере
Процедура СохранитьСопоставлениеOzonНаСервере()  
	
	Попытка
		НачатьТранзакцию();		
					
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ИС_Ozon_СоответствиеХарактеристик");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Для Каждого Строка Из СопоставлениеOzon Цикл 
			
			Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				Сообщение = "Необходимо выполнить сопоставление.";
				ВызватьИсключение(Сообщение);
			КонецЕсли;
			
			МенеджерЗаписи = РегистрыСведений.ИС_Ozon_СоответствиеХарактеристик.СоздатьМенеджерЗаписи(); 
			
			МенеджерЗаписи.НоменклатураOzon = Строка.НоменклатураOzon;
			МенеджерЗаписи.Номенклатура		= Строка.Номенклатура;
			МенеджерЗаписи.Характеристика 	= Строка.ХарактеристикаНоменклатуры;
			
			МенеджерЗаписи.Записать();
			
		КонецЦикла;	

		ЗафиксироватьТранзакцию();
		Сообщение = "Данные сохранены. Перейдите к пункту два.";
		ОбщегоНазначения.СообщитьПользователю(Сообщение); 
		
		//Элементы.ГруппаЭтапДваОзон.Видимость = Истина;
		Элементы.СопоставлениеOzon.Видимость = Ложь;
		Элементы.СохранитьСопоставлениеOzon.Видимость = Ложь;
	Исключение
		ОтменитьТранзакцию();  
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252
&НаСервере
Процедура ВыполнитьСозданиеДокументовОзонНаСервере()

//	Если СписокТранзакцийExcelOzon.Количество() = 0 Тогда
//		СписокТранзакций = ПолучитьСписокПродажОзон();
//		Если СписокТранзакций.Количество() = 0 Тогда
//			ОбщегоНазначения.СообщитьПользователю("В данном периоде не найдены продажи для выбранного профиля. Выполните загрузку файла о продажах.");
//			Возврат;	
//		КонецЕсли;
//		СписокТранзакцийExcelOzon.Загрузить(СписокТранзакций);
//	КонецЕсли; 
//	
//	ОшибкаСопостовления = ПолучитьРезультатПроверкиСопоставленияОзон();
//	
//	Если ОшибкаСопостовления Тогда
//		Элементы.ГруппаЭтапДваОзон.Видимость = Истина;
//		Возврат;
//	КонецЕсли;	
//	
//	Если СписокТранзакцийExcelOzon.Количество() = 0 Тогда
//		ОбщегоНазначения.СообщитьПользователю("В данном периоде не найдены данные продаж. Необходимо выполнить загрузку файла продаж.");
//		Возврат;
//	КонецЕсли;	
//	
//	Отчет = ИС_Ozon_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, ПериодOzon, СписокТранзакцийExcelOzon.Выгрузить(), "");
//	
//	Если ЗначениеЗаполнено(Отчет) Тогда
//		СозданныеДокументы.Добавить().Документ = Отчет;
//	КонецЕсли;
//	
//	Элементы.СписокТранзакцийExcelOzon.Видимость = Ложь; 
//	
//	УстановитьНачальноеОформлениеОзон();
//	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 28.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 29.08.2023 УА #61252
&НаСервере
Функция ПолучитьНоменклатуруОзон(ТаблицаСопоставления)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СопоставлениеOzon.НаименованиеТовара КАК НаименованиеТовара,
	|	СопоставлениеOzon.offer_id КАК offer_id,
	|	СопоставлениеOzon.SKU КАК SKU,
	|	СопоставлениеOzon.ШтрихКодТовара КАК ШтрихКодТовара
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&СопоставлениеOzon КАК СопоставлениеOzon
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НаименованиеТовара КАК НаименованиеТовара,
	|	ВТ_Данные.offer_id КАК offer_id,
	|	ВТ_Данные.SKU КАК SKU,
	|	ВТ_Данные.ШтрихКодТовара КАК ШтрихКодТовара,
	|	ЕСТЬNULL(ИС_Ozon_Номенклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.ИС_Ozon_Номенклатура.ПустаяСсылка)) КАК НоменклатураOzon
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|		ПО (ВТ_Данные.offer_id = ИС_Ozon_Номенклатура.offer_id
	|				И ИС_Ozon_Номенклатура.Профиль = &Профиль)");
	
	Запрос.УстановитьПараметр("СопоставлениеOzon", ТаблицаСопоставления);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СопоставлениеТЗ = Новый ТаблицаЗначений();
	
	СопоставлениеТЗ.Колонки.Добавить("НаименованиеТовара", Новый ОписаниеТипов("Строка")); 
	СопоставлениеТЗ.Колонки.Добавить("offer_id", Новый ОписаниеТипов("Строка"));
	СопоставлениеТЗ.Колонки.Добавить("SKU", Новый ОписаниеТипов("Строка"));
	СопоставлениеТЗ.Колонки.Добавить("ШтрихКодТовара", Новый ОписаниеТипов("Строка"));
	СопоставлениеТЗ.Колонки.Добавить("НоменклатураOzon", Новый ОписаниеТипов("СправочникСсылка.ИС_Ozon_Номенклатура"));
	
	КрточкиОзонЗагружены = Истина;
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока 							= СопоставлениеТЗ.Добавить();
		НоваяСтрока.НаименованиеТовара 			= Выборка.НаименованиеТовара;
		НоваяСтрока.offer_id 					= Выборка.offer_id;
		НоваяСтрока.SKU 						= Выборка.SKU;
		НоваяСтрока.ШтрихКодТовара 				= Выборка.ШтрихКодТовара;
		НоваяСтрока.НоменклатураOzon 			= Выборка.НоменклатураOzon; 
		
		Если Не ЗначениеЗаполнено(Выборка.НоменклатураOzon) Тогда
			КрточкиОзонЗагружены = Ложь;	
		КонецЕсли;	 
		
	КонецЦикла;
	
	Результат = Новый Структура;
	
	Результат.Вставить("КрточкиОзонЗагружены", КрточкиОзонЗагружены);
	Результат.Вставить("Сопоставление", СопоставлениеТЗ);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 29.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924
&НаСервере
Функция ПолучитьВерсиюКомиссииОзон(Настройки = Неопределено) 
	
	Если Настройки = Неопределено Тогда
		МассивНаименованийПараметров = Новый Массив;	
		МассивНаименованийПараметров.Добавить("СоглашениеOzon");
		МассивНаименованийПараметров.Добавить("ДоговорOzon");
		Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);	
	КонецЕсли;
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"); 
	
	Если ИспользоватьСоглашенияСКлиентами И Настройки["СоглашениеOzon"] <> Неопределено И ЗначениеЗаполнено(Настройки["СоглашениеOzon"]) Тогда 
		КомиссионныеПродажи25 = Настройки["СоглашениеOzon"].КомиссионныеПродажи25		
	Иначе
		КомиссионныеПродажи25 = Настройки["ДоговорOzon"].КомиссионныеПродажи25;	
	КонецЕсли;
	
	Если КомиссионныеПродажи25 = Неопределено Тогда
		ВызватьИсключение("Проверьте настройки заполнения профиля по схеме комиссии.");	
	КонецЕсли;	
	
	Возврат КомиссионныеПродажи25;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924

//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
&НаСервере
Процедура РассчитатьИтоги() 
	
	ВсегоВыплатыОтПартнеров = СписокТранзакцийExcelOzon.Итог("ВыплатыОтПартнеров") - СписокТранзакцийExcelOzon.Итог("ВозвратВыплатыОтПартнеров");
	ВсегоКНачислению = СписокТранзакцийExcelOzon.Итог("ИтогиКНачислению") - СписокТранзакцийExcelOzon.Итог("ИтогоВозвращено");
	ВсегоНачисленоБаллов = СписокТранзакцийExcelOzon.Итог("ДоплатаЗаСчетOzon") - СписокТранзакцийExcelOzon.Итог("ВозвратДоплатаЗаСчетOzon");
	ВсегоБазоваяКомиссия = СписокТранзакцийExcelOzon.Итог("ИтогиКомиссияСУчетомСкидокИНаценок") - СписокТранзакцийExcelOzon.Итог("ВозвратИтогиКомиссияСУчетомСкидокИНаценок");
	ВсегоКомиссияПослеСкидок = ВсегоБазоваяКомиссия - ВсегоНачисленоБаллов;
	
	Если ВсегоКомиссияПослеСкидок < ВсегоБазоваяКомиссия / 100 Тогда
		ВсегоКомиссияПослеСкидок = ВсегоБазоваяКомиссия / 100;
	КонецЕсли;
	
КонецПроцедуры 	//- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииСбер

//+ ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567
&НаСервере
Процедура ПрогрузитьТаблицуЗначенийПродажИзФайлаСбер()
	
	СписокТранзакцийСбер.Очистить();
	
	Если РасширениеФайлаZip Тогда  
		
		ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище); 
		Имя = ПолучитьИмяВременногоФайла("zip");
		ФайлВременногоХранилища.Записать(Имя);
		
		ВызватьОшибку = Истина;
		ТаблицаСтрок = ПрочитатьТабЗначИзZIP(Имя, ВызватьОшибку);
		
		Если ВызватьОшибку Тогда
			ОбщегоНазначения.СообщитьПользователю("Был выбран некорректный файл для загрузки отчета комиссионера СберМегаМаркет, проверьте выбранный файл",,, "ПутьКФайлу");
		КонецЕсли;
		
	Иначе
		
		ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
		Имя = ПолучитьИмяВременногоФайла("csv");
		ФайлВременногоХранилища.Записать(Имя);                                                         
		
		ТаблицаСтрок = ПрочитатьCSVвТЗ(Имя);		
		
	КонецЕсли; 
	
	Если ТаблицаСтрок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Был выбран некорректный файл для загрузки отчета комиссионера СберМегаМаркет, проверьте выбранный файл",,, "ПутьКФайлу");	
	КонецЕсли;
	
	Отчет = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Сбер_ОтчетыОПродажах.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_Сбер_ОтчетыОПродажах КАК ИС_Сбер_ОтчетыОПродажах
		|ГДЕ
		|	ИС_Сбер_ОтчетыОПродажах.Профиль = &Профиль
		|	И ИС_Сбер_ОтчетыОПродажах.ДатаНачала = &ДатаНачала
		|	И ИС_Сбер_ОтчетыОПродажах.ДатаОкончания = &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДатаОтчета));
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОтчета);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отчет = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Отчет) Тогда
		ОтчетСбера = Отчет;
	Иначе     
		Отчет = Справочники.ИС_Сбер_ОтчетыОПродажах.СоздатьЭлемент();
		Отчет.Наименование = "Отчет о продажах от " + Строка(ДатаОтчета) + " по профилю " + Профиль.Наименование;
		Отчет.ДатаНачала = НачалоМесяца(ДатаОтчета); 
		Отчет.ДатаОкончания = ДатаОтчета;
		Отчет.Профиль = Профиль;
		Отчет.Записать();
		
		ОтчетСбера = Отчет.Ссылка;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 05.12.2024 УА #88168	
	//УдаляемыхСтрок = 3;
	//Номер = 0;
	//Пока Номер < УдаляемыхСтрок Цикл 
	//	ТаблицаСтрок.Удалить(0); 
	//	Номер = Номер + 1;
	//КонецЦикла;
	//- ИнфоСофт Стояк Ю.К. 05.12.2024 УА #88168
	
	ОтборНулевыхСтрок = Новый Структура("Колонка4", "");
	
	НулевыеСтроки = ТаблицаСтрок.НайтиСтроки(ОтборНулевыхСтрок);
	
	Для Каждого НулеваяСтрока Из НулевыеСтроки Цикл
		ТаблицаСтрок.Удалить(НулеваяСтрока);	
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаСтрок Цикл
		
		НСтр = СписокТранзакцийСбер.Добавить();
		НСтр.Артикул = Строка.Колонка3;
		НСтр.СтрокаНомер = ?(Строка.Колонка0 = "", 0, Число(Строка.Колонка0));
		Если Строка.Колонка6 = "Возврат" Тогда
			НСтр.Количество = ?(Строка.Колонка4 = "", 0, -1 * Число(Строка.Колонка4));
		Иначе
			НСтр.Количество = ?(Строка.Колонка4 = "", 0, Число(Строка.Колонка4));	
		КонецЕсли;
		НСтр.СтоимостьТовара = ?(Строка.Колонка9 = "", 0, Число(Строка.Колонка9));
		НСтр.Бонусы = ?(Строка.Колонка10 = "", 0, Число(Строка.Колонка10));
		НСтр.СберСпасибо = ?(Строка.Колонка11 = "", 0, Число(Строка.Колонка11));
		НСтр.ЦенаПродажи = ?(Строка.Колонка12 = "", 0, Число(Строка.Колонка12));
		НСтр.СуммаТоварныхУслуг = ?(Строка.Колонка16 = "", 0, Число(Строка.Колонка16));		
		НСтр.НомерОтправленияМП = Строка.Колонка1;
		НСтр.НомерОтправления = Строка.Колонка2;
		НСтр.СтатусЗаказа = Строка.Колонка6;
		НСтр.ДатаОтправления = ?(Строка.Колонка7 = "", 0, Дата(Строка.Колонка7));		
		
	КонецЦикла; 
	
	СписокТранзакций = ДобавитьСопоставление(СписокТранзакцийСбер.Выгрузить(), Профиль);
	СписокТранзакцийСбер.Загрузить(СписокТранзакций);
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567
&НаСервереБезКонтекста
Функция ПрочитатьCSVвТЗ(ИмяФайла, Разделитель=";", ЗаголовкиИзПервойСтроки = Ложь) Экспорт  
	
	Текст = Новый ЧтениеТекста(ИмяФайла);
	
	Результат = Новый ТаблицаЗначений;
	ТекСтрока = Текст.ПрочитатьСтроку();
	
	Если ТекСтрока <> Неопределено Тогда
		МассивЗначений = СтрРазделить(ТекСтрока, Разделитель);
		ИндексКолонки = 0;
		Для Каждого ИмяКолонки Из МассивЗначений Цикл
			ИмяКолонки = ?(ЗаголовкиИзПервойСтроки, "Кол"+ИндексКолонки, ИмяКолонки);
			Результат.Колонки.Добавить("Колонка" + ИндексКолонки, , ИмяКолонки);
			ИндексКолонки = ИндексКолонки + 1;
		КонецЦикла;
		Если ЗаголовкиИзПервойСтроки Тогда
			ТекСтрока = Текст.ПрочитатьСтроку();
		КонецЕсли;
	КонецЕсли;

	Пока ТекСтрока <> Неопределено Цикл 
		НоваяСтрока = Результат.Добавить();
		
		МассивЗначений = СтрРазделить(ТекСтрока, Разделитель);
		КоличествоКолонок = Мин(Результат.Колонки.Количество(), МассивЗначений.Количество());
		Для ИндексКолонки = 0 По КоличествоКолонок - 1 Цикл
			НоваяСтрока[ИндексКолонки] = МассивЗначений[ИндексКолонки];
		КонецЦикла;

		ТекСтрока = Текст.ПрочитатьСтроку();
	КонецЦикла; 
	
	//+ ИнфоСофт Стояк Ю.К. 05.12.2024 УА #88168	
	УдаляемыхСтрок = 3;
	Номер = 0;
	Пока Номер < УдаляемыхСтрок Цикл 
		Результат.Удалить(0); 
		Номер = Номер + 1;
	КонецЦикла;
	//- ИнфоСофт Стояк Ю.К. 05.12.2024 УА #88168	
	Возврат Результат;
КонецФункции //- ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62657

//+ ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567
&НаСервере
Функция ПрочитатьТабЗначИзZIP(ИмяФайла, Отказ)
		
	ТаблицаСтрок = Новый ТаблицаЗначений;
	
	ЧтениеZip = Новый ЧтениеZipФайла(ИмяФайла, "");
	
	Отказ = Истина;
	
	Для Каждого Элемент Из ЧтениеZip.Элементы Цикл
		
		Если НРег(Элемент.Расширение) = "csv" И СтрНайти(Элемент.ИмяБезРасширения, "Приложение1") <> 0 Тогда
			Отказ = Ложь; 
			//+ ИнфоСофт Стояк Ю.К. 10.06.2024 УА #77384			
			Попытка
				ДатаОтчета = Дата(Сред(Элемент.ИмяБезРасширения, СтрДлина(Элемент.ИмяБезРасширения) - 9, 10) + " 00:00:00");
			Исключение
				ОбщегоНазначения.СообщитьПользователю("Не удалось получить дату отчета из названия файла. Укажите дату на форме!");
				Элементы.ДатаОтчета.Видимость = Истина;
			КонецПопытки;
			//ДатаОтчета = Дата(Сред(Элемент.ИмяБезРасширения, СтрДлина(Элемент.ИмяБезРасширения) - 9, 10) + " 00:00:00");
			//- ИнфоСофт Стояк Ю.К. 10.06.2024 УА #77384
			ПутьКФайлуВоВременномХранилище = КаталогВременныхФайлов();
			ЧтениеZip.Извлечь(Элемент, ПутьКФайлуВоВременномХранилище, , "");					
			ПутьКФайлуВоВременномХранилище = ПутьКФайлуВоВременномХранилище + Элемент.Имя;
			//+ ИнфоСофт Стояк Ю.К. 05.12.2024 УА #88168			
			Если ТаблицаСтрок.Количество() = 0 Тогда
				ТаблицаСтрок = ПрочитатьCSVвТЗ(ПутьКФайлуВоВременномХранилище);
			Иначе
				ТаблицаБуфер = ПрочитатьCSVвТЗ(ПутьКФайлуВоВременномХранилище);
				
				Для Каждого Строка Из ТаблицаБуфер Цикл			                               
					НСтр = ТаблицаСтрок.Добавить();
					ЗаполнитьЗначенияСвойств(НСтр, Строка);
				КонецЦикла;
				
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 05.12.2024 УА #88168
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #76802
			//+ ИнфоСофт Стояк Ю.К. 05.12.2024 УА #88168			
			//Прервать;
		//ИначеЕсли НРег(Элемент.Расширение) = "csv" И СтрНайти(Элемент.ИмяБезРасширения, "Приложение5") <> 0 Тогда
		ИначеЕсли НРег(Элемент.Расширение) = "csv" И СтрНайти(Элемент.ИмяБезРасширения, "Приложение5") <> 0  И ТаблицаСтрок.Количество() = 0 Тогда
			//- ИнфоСофт Стояк Ю.К. 05.12.2024 УА #88168
			Отказ = Ложь; 			
			Попытка
				ДатаОтчета = Дата(Сред(Элемент.ИмяБезРасширения, СтрДлина(Элемент.ИмяБезРасширения) - 9, 10) + " 00:00:00");
			Исключение
				ОбщегоНазначения.СообщитьПользователю("Не удалось получить дату отчета из названия файла. Укажите дату на форме!");
				Элементы.ДатаОтчета.Видимость = Истина;
			КонецПопытки;
			ПутьКФайлуВоВременномХранилище = КаталогВременныхФайлов();
			ЧтениеZip.Извлечь(Элемент, ПутьКФайлуВоВременномХранилище, , "");					
			ПутьКФайлуВоВременномХранилище = ПутьКФайлуВоВременномХранилище + Элемент.Имя; 
			ТаблицаСтрок = ПрочитатьCSVвТЗ(ПутьКФайлуВоВременномХранилище);
		//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #76802
		КонецЕсли;
		
	КонецЦикла; 
	
	ЧтениеZip.Закрыть();
	
	Возврат ТаблицаСтрок;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62657

//+ ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567
&НаСервере
Процедура ЗаписатьДанныеПродажСбер()  
	
	НачатьТранзакцию();	
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ИС_Сбер_Продажи");
		ЭлементБлокировкиДанных.УстановитьЗначение("Профиль", Профиль);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Для Каждого Элемент Из СписокТранзакцийСбер Цикл
			МенеджерЗаписи = РегистрыСведений.ИС_Сбер_Продажи.СоздатьМенеджерЗаписи(); 
			
			МенеджерЗаписи.Профиль 						= Профиль;
			МенеджерЗаписи.НомерОтчета					= ОтчетСбера;
			МенеджерЗаписи.СтрокаНомер					= Элемент.СтрокаНомер;
			МенеджерЗаписи.Артикул						= Элемент.Артикул; 
			
			МенеджерЗаписи.Количество					= Элемент.Количество;
			МенеджерЗаписи.СтоимостьТовара				= Элемент.СтоимостьТовара;
			МенеджерЗаписи.Бонусы						= Элемент.Бонусы;
			МенеджерЗаписи.СберСпасибо					= Элемент.СберСпасибо;
			МенеджерЗаписи.ЦенаПродажи					= Элемент.ЦенаПродажи;
			МенеджерЗаписи.СуммаТоварныхУслуг			= Элемент.СуммаТоварныхУслуг;
			МенеджерЗаписи.УслугиКРаспределению			= Элемент.УслугиКРаспределению;
			
			МенеджерЗаписи.НомерОтправленияМП			= Элемент.НомерОтправленияМП;
			МенеджерЗаписи.НомерОтправления				= Элемент.НомерОтправления;
			МенеджерЗаписи.СтатусЗаказа					= Элемент.СтатусЗаказа;
			МенеджерЗаписи.ДатаОтправления				= Элемент.ДатаОтправления;
			
			МенеджерЗаписи.Записать();

		КонецЦикла;	
				
	ЗафиксироватьТранзакцию();
	
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Заметки'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567
&НаСервере
Процедура ПрогрузитьДопФайлСбер()

	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресПродажЮрЛицВоВременномХранилищеОзон);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(Имя);
	
	//+ ИнфоСофт Стояк Ю.К. 21.11.2024 УА #76394
	Если СтрНачинаетсяС(СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R1C1").ТекущаяОбласть.Текст), "Отчет по легким возвратам") Тогда  
		
		КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы; 	
		НомерСтроки = СписокТранзакцийСбер.Количество();
			
		Для сч = 4 По КоличествоСтрок Цикл
			
			Попытка
				
				ТабДок 													= ТабличныйДокумент;				
				РассчитаннаяСтрока 										= "R" + Формат(сч, "ЧГ=0;") + "C";				
				СтатусСтроки  											= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11));
				АртикулММ = Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)); 
				
				Если СтатусСтроки = "Отказ" Тогда Продолжить; КонецЕсли;
				
				Если АртикулММ = "" Тогда Прервать; КонецЕсли;
												
				НСтр = СписокТранзакцийСбер.Добавить();
				НСтр.Артикул = Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10));
				НСтр.СтрокаНомер = НомерСтроки;
				НомерСтроки = НомерСтроки + 1;  
				НСтр.Количество = -1;				
				НСтр.Бонусы = ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14), Символы.НПП, "")));
				НСтр.СберСпасибо = 0;
				НСтр.ЦенаПродажи = ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 13)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 13), Символы.НПП, "")));
				НСтр.СтоимостьТовара = НСтр.ЦенаПродажи + НСтр.Бонусы;
				НСтр.СуммаТоварныхУслуг = 0;		
				НСтр.НомерОтправленияМП = Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 4));
				НСтр.НомерОтправления = Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6));
				НСтр.СтатусЗаказа = Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11));
				
				ДатаОтправления = Дата(СтрЗаменить(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 1)), "-", ".") + " 00:00:00");
				НСтр.ДатаОтправления = ДатаОтправления;
				
			Исключение
				Сообщение		= Новый СообщениеПользователю;
				Сообщение.Текст	= "Не удалось загрузить строку " + Строка(сч);
				Сообщение.Сообщить();
			КонецПопытки; 
			
		КонецЦикла;
		
		ОбщегоНазначения.СообщитьПользователю("Файл обработан.");	
		
		Попытка
			УдалитьФайлы(Имя);
		Исключение			
			ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		КонецПопытки; 
		
		Возврат;
 
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 21.11.2024 УА #76394
	
	//+ ИнфоСофт Стояк Ю.К. 28.06.2024 УА #78526	
	Если ФорматФайлаДо30042024 Тогда
	//- ИнфоСофт Стояк Ю.К. 28.06.2024 УА #78526	
		Если СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R15C9").ТекущаяОбласть.Текст) = "Вознаграждение за предоставление поощрения" 
			Или СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R15C9").ТекущаяОбласть.Текст) = "Вознаграждение оператора ПЛ"  Тогда
			
			Сумма = Число(СтрЗаменить(ТабличныйДокумент.ПолучитьОбласть("R9C3").ТекущаяОбласть.Текст, " ", ""));
			ДатаКомпенсации = Дата(ТабличныйДокумент.ПолучитьОбласть("R7C3").ТекущаяОбласть.Текст + " 00:00:00");
			
			Отчет = ОтчетСбера.ПолучитьОбъект();
			
			Отбор = Новый Структура("Компенсация, ДатаКомпенсации", Сумма, ДатаКомпенсации);
			
			НайденноеЗначение = Отчет.Компенсации.НайтиСтроки(Отбор);		
			
			Если НайденноеЗначение.Количество() = 0 Тогда
				
				НСтр = Отчет.Компенсации.Добавить();
				НСтр.Компенсация = Сумма;
				НСтр.ДатаКомпенсации = ДатаКомпенсации;
				
			КонецЕсли;
			
			Отчет.Записать();
			
			//+ ИнфоСофт Стояк Ю.К. 28.06.2024 УА #78526			
			//ОбщегоНазначения.СообщитьПользователю("Файл обработан.");
			//- ИнфоСофт Стояк Ю.К. 28.06.2024 УА #78526
			
		Иначе
			КвалификаторыЧисла = Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный);
			КвалификаторыСтроки = Новый КвалификаторыСтроки(80);
			
			ТаблицаДопФайла = Новый ТаблицаЗначений;
			ТаблицаДопФайла.Колонки.Добавить("НомерЗаказаМП", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
			ТаблицаДопФайла.Колонки.Добавить("Операция", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
			ТаблицаДопФайла.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", КвалификаторыЧисла)); 
			
			КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
			
			Для сч = 13 По КоличествоСтрок Цикл
				Попытка
					
					ЧислоСтроки = Формат(сч, "ЧГ=0");
					
					Если Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C9").ТекущаяОбласть.Текст) <> "Итого" И
						Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C9").ТекущаяОбласть.Текст) <> "" Тогда
						
						
						Если Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C9").ТекущаяОбласть.Текст) <> "Товары продавцов" Тогда
							
							НоваяСтрока = ТаблицаДопФайла.Добавить(); 
							
							НоваяСтрока.НомерЗаказаМП		= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C1").ТекущаяОбласть.Текст);				
							НоваяСтрока.Операция			= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C9").ТекущаяОбласть.Текст);
							НоваяСтрока.Сумма				= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C12").ТекущаяОбласть.Текст) = "", Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C13").ТекущаяОбласть.Текст), -1 * Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C12").ТекущаяОбласть.Текст));
						КонецЕсли;
						
					КонецЕсли;
					
				Исключение
					Сообщение		= Новый СообщениеПользователю;
					Сообщение.Текст	= "Не удалось загрузить строку " + Строка(сч);
					Сообщение.Сообщить();
				КонецПопытки;
			КонецЦикла;						
			
		КонецЕсли;
	//+ ИнфоСофт Стояк Ю.К. 28.06.2024 УА #78526	
	Иначе
		
		КвалификаторыЧисла = Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный);
		КвалификаторыСтроки = Новый КвалификаторыСтроки(80);
		
		ТаблицаДопФайла = Новый ТаблицаЗначений;
		ТаблицаДопФайла.Колонки.Добавить("НомерЗаказаМП", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
		ТаблицаДопФайла.Колонки.Добавить("Операция", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
		ТаблицаДопФайла.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", КвалификаторыЧисла)); 
		
		КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
		
		Сумма = 0;
		
		Для сч = 13 По КоличествоСтрок Цикл
			Попытка
				
				ЧислоСтроки = Формат(сч, "ЧГ=0");
				
				//+ ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81299				
				Если СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C8").ТекущаяОбласть.Текст) = "Вознаграждение за предоставление поощрения" Тогда					
					Если СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C12").ТекущаяОбласть.Текст) <> "" Тогда
						Сумма = Сумма + Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C12").ТекущаяОбласть.Текст)
					ИначеЕсли СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C13").ТекущаяОбласть.Текст) <> "" Тогда
						Сумма = Сумма - Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C13").ТекущаяОбласть.Текст)				
					КонецЕсли;
				ИначеЕсли СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C8").ТекущаяОбласть.Текст) = "Вознаграждение оператора ПЛ" Тогда
					Если СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C13").ТекущаяОбласть.Текст) <> "" Тогда
						Сумма = Сумма - Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C13").ТекущаяОбласть.Текст)
					ИначеЕсли СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C12").ТекущаяОбласть.Текст) <> "" Тогда
						Сумма = Сумма + Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C12").ТекущаяОбласть.Текст)				
					КонецЕсли;					
				ИначеЕсли Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C8").ТекущаяОбласть.Текст) <> "Итого" И
					Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C8").ТекущаяОбласть.Текст) <> "" Тогда
				//Если СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C6").ТекущаяОбласть.Текст) = "Вознаграждение за предоставление поощрения" Тогда					
				//	Сумма = Сумма + Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C11").ТекущаяОбласть.Текст)
				//ИначеЕсли СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C6").ТекущаяОбласть.Текст) = "Вознаграждение оператора ПЛ" Или СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C6").ТекущаяОбласть.Текст) = "1" Тогда
				//	Сумма = Сумма - Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C12").ТекущаяОбласть.Текст)								
				//ИначеЕсли Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C6").ТекущаяОбласть.Текст) <> "Итого" И
				//	Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C6").ТекущаяОбласть.Текст) <> "" Тогда    									
				
				Если Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C8").ТекущаяОбласть.Текст) <> "Товары продавцов" Тогда
				//Если Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C6").ТекущаяОбласть.Текст) <> "Товары продавцов" Тогда
				//- ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81299
						
						НоваяСтрока = ТаблицаДопФайла.Добавить(); 
						
						НоваяСтрока.НомерЗаказаМП		= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C1").ТекущаяОбласть.Текст);				
						//+ ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81299
						НоваяСтрока.Операция			= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C8").ТекущаяОбласть.Текст);
						//НоваяСтрока.Операция			= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C6").ТекущаяОбласть.Текст);
						//- ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81299
						НоваяСтрока.Сумма				= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C12").ТекущаяОбласть.Текст) = "", Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C13").ТекущаяОбласть.Текст), -1 * Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C12").ТекущаяОбласть.Текст));
					КонецЕсли;
					
				КонецЕсли;
				
			Исключение
				Сообщение		= Новый СообщениеПользователю;
				Сообщение.Текст	= "Не удалось загрузить строку " + Строка(сч);
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЦикла; 			
		
		Отчет = ОтчетСбера.ПолучитьОбъект();
		
		Отбор = Новый Структура("Компенсация, ДатаКомпенсации", Сумма, ДатаДопФайла);
		
		НайденноеЗначение = Отчет.Компенсации.НайтиСтроки(Отбор);		
		
		Если НайденноеЗначение.Количество() = 0 Тогда
			
			НСтр = Отчет.Компенсации.Добавить();
			НСтр.Компенсация = Сумма;
			НСтр.ДатаКомпенсации = ДатаДопФайла;
			
		КонецЕсли;
		
		Отчет.Записать();
		
	КонецЕсли; 
	//- ИнфоСофт Стояк Ю.К. 28.06.2024 УА #78526
	ТаблицаДопФайла.Свернуть("НомерЗаказаМП", "Сумма");
	
	СуммаКРаспределению = 0;
	
	Для Каждого Элемент Из ТаблицаДопФайла Цикл 
		
		Отбор = Новый Структура("НомерОтправленияМП", Элемент.НомерЗаказаМП);
		
		НайденныеСтроки = СписокТранзакцийСбер.НайтиСтроки(Отбор);		
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			СуммаКРаспределению = СуммаКРаспределению + Элемент.Сумма;
		ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
			
			МассивКоэфф = Новый Массив;
			
			Для Счетчик = 1 По НайденныеСтроки.Количество() Цикл
				МассивКоэфф.Добавить(1); 		
			КонецЦикла;				
			
			СуммыУслуг = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Элемент.Сумма, МассивКоэфф); 
			
			Для Каждого Строка Из НайденныеСтроки Цикл				
				Строка.УслугиКРаспределению = Строка.УслугиКРаспределению + СуммыУслуг[0];
				СуммыУслуг.Удалить(0);
			КонецЦикла;   
			
		Иначе
			НайденныеСтроки[0].УслугиКРаспределению = НайденныеСтроки[0].УслугиКРаспределению + Элемент.Сумма;		
		КонецЕсли;
		
	КонецЦикла;
	
	Если СуммаКРаспределению > 0 Тогда
		
		МассивКоэфф = Новый Массив;
		
		Отбор = Новый Структура("СтатусЗаказа", "Возврат");
		Возвраты = СписокТранзакцийСбер.НайтиСтроки(Отбор);
		
		Для Счетчик = 1 По СписокТранзакцийСбер.Количество() - Возвраты.Количество() Цикл
			МассивКоэфф.Добавить(1); 		
		КонецЦикла;	
		
		СуммыУслуг = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаКРаспределению, МассивКоэфф);	
		
		Для Каждого Элемент Из СписокТранзакцийСбер Цикл 
			Если Элемент.СтатусЗаказа <> "Возврат" Тогда
				Элемент.УслугиКРаспределению = Элемент.УслугиКРаспределению + СуммыУслуг[0];	
				СуммыУслуг.Удалить(0);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 28.06.2024 УА #78526
	ОбщегоНазначения.СообщитьПользователю("Файл обработан.");
	//- ИнфоСофт Стояк Ю.К. 28.06.2024 УА #78526
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 31.03.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
&НаСервере
Процедура ОтчетСбераПриИзмененииНаСервере() 
	
	Для Каждого Документ Из ОтчетСбера.Документы Цикл
		ДобавитьНовыйДокумент(Документ.Документ);
	КонецЦикла;
	
	СписокТранзакцийСбер.Очистить();
	
	НаборЗаписей = РегистрыСведений.ИС_Сбер_Продажи.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Профиль.Установить(Профиль); 
	НаборЗаписей.Отбор.НомерОтчета.Установить(ОтчетСбера);
	
	НаборЗаписей.Прочитать();
	
	Для Каждого Элемент Из НаборЗаписей Цикл
		
		НСтр = СписокТранзакцийСбер.Добавить();
				
		НСтр.СтрокаНомер					= Элемент.СтрокаНомер;
		НСтр.Артикул						= Элемент.Артикул; 
		
		НСтр.Количество						= Элемент.Количество;
		НСтр.СтоимостьТовара				= Элемент.СтоимостьТовара;
		НСтр.Бонусы							= Элемент.Бонусы;
		НСтр.СберСпасибо					= Элемент.СберСпасибо;
		НСтр.ЦенаПродажи					= Элемент.ЦенаПродажи;
		НСтр.СуммаТоварныхУслуг				= Элемент.СуммаТоварныхУслуг;
		НСтр.УслугиКРаспределению			= Элемент.УслугиКРаспределению;
		
		НСтр.НомерОтправленияМП				= Элемент.НомерОтправленияМП;
		НСтр.НомерОтправления				= Элемент.НомерОтправления;
		НСтр.СтатусЗаказа					= Элемент.СтатусЗаказа;
		НСтр.ДатаОтправления				= Элемент.ДатаОтправления;
				
	КонецЦикла;
		
	СписокТранзакций = ДобавитьСопоставление(СписокТранзакцийСбер.Выгрузить(), Профиль);
	СписокТранзакцийСбер.Загрузить(СписокТранзакций);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
&НаСервере   
Функция ПолучитьРезультатПроверкиСопоставленияСбер() 
			
	ОшибкаСопоставления = Ложь;
	
	Для Каждого Строка Из СписокТранзакцийСбер Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			ОшибкаСопоставления = Истина;			
		КонецЕсли;
	КонецЦикла;

	Если ОшибкаСопоставления Тогда
		СписокТранзакцийСбер.Сортировать("Номенклатура Возр");
		Сообщение = "Есть позиции, по которым не удалось найти сопоставление. Заполните пустые строки."; 
		Элементы.СписокТранзакцийСбер.Видимость = Истина; 
		ОбщегоНазначения.СообщитьПользователю(Сообщение);

	КонецЕсли; 
	
	Возврат ОшибкаСопоставления;
		
КонецФункции //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567

//+ ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567
&НаСервере
Процедура СформироватьОтчетаКомиссионераНаСервереСбер()  
	
	Комментарий = "Отчет комисисонера за период с " + ОтчетСбера.ДатаНачала + " по " + ОтчетСбера.ДатаОкончания;
	
	СписокПродажОК = СписокТранзакцийСбер.Выгрузить(); 
	
	Период = Новый СтандартныйПериод(ОтчетСбера.ДатаНачала, ОтчетСбера.ДатаОкончания); 
	
	//+ ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295	
	СтруктураДопПараметров = Новый Структура;
	СтруктураДопПараметров.Вставить("АльтернативныйСпособЗагрузки", АльтернативныйСпособЗагрузкиСбер);
	
	Отчет = ИС_Сбер_Сервер.СоздатьОтчетКомиссионера(Профиль, Период, СписокПродажОК, Комментарий, СтруктураДопПараметров); 
	//Отчет = ИС_Сбер_Сервер.СоздатьОтчетКомиссионера(Профиль, Период, СписокПродажОК, Комментарий);
	//- ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
	
	Если ЗначениеЗаполнено(Отчет) Тогда
		
		ДобавитьНовыйДокумент(Отчет);
		
		ОбъектОтчета = ОтчетСбера.ПолучитьОбъект();
		
		НСтр = ОбъектОтчета.Документы.Добавить();
		НСтр.Документ = Отчет;
		
		ОбъектОтчета.Записать();
		
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295	
	Если Не АльтернативныйСпособЗагрузкиСбер Тогда  
	//- ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
		
		СуммаКомпенсации = ОтчетСбера.Компенсации.Итог("Компенсация");
		
		Если СуммаКомпенсации <> 0 Тогда
			Взаимозачет = ИС_Сбер_Сервер.ПолучитьДокументКорректировкиЗадолженности(Отчет, СуммаКомпенсации);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Взаимозачет) Тогда
			
			ДобавитьНовыйДокумент(Взаимозачет);
			
			ОбъектОтчета = ОтчетСбера.ПолучитьОбъект();
			
			НСтр = ОбъектОтчета.Документы.Добавить();
			НСтр.Документ = Взаимозачет;
			
			ОбъектОтчета.Записать();
			
		КонецЕсли;   
		
	//+ ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 01.10.2024 УА #74295
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.04.2024 УА #62567    

//+ ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
&НаСервере   
Функция ДобавитьСопоставление(ТаблицаТранзакций, Профиль)
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	втТаблицаТранзакций.СтрокаНомер КАК СтрокаНомер,
	|	втТаблицаТранзакций.Артикул КАК Артикул,
	|	втТаблицаТранзакций.СтоимостьТовара КАК СтоимостьТовара,
	|	втТаблицаТранзакций.Количество КАК Количество,
	|	втТаблицаТранзакций.Бонусы КАК Бонусы,
	|	втТаблицаТранзакций.СберСпасибо КАК СберСпасибо,
	|	втТаблицаТранзакций.ЦенаПродажи КАК ЦенаПродажи,
	|	втТаблицаТранзакций.СуммаТоварныхУслуг КАК СуммаТоварныхУслуг,
	|	втТаблицаТранзакций.УслугиКРаспределению КАК УслугиКРаспределению,
	|	втТаблицаТранзакций.НомерОтправленияМП КАК НомерОтправленияМП,
	|	втТаблицаТранзакций.НомерОтправления КАК НомерОтправления,
	|	втТаблицаТранзакций.СтатусЗаказа КАК СтатусЗаказа,
	|	втТаблицаТранзакций.ДатаОтправления КАК ДатаОтправления
	|ПОМЕСТИТЬ втТаблицаТранзакций
	|ИЗ
	|	&ТаблицаТранзакций КАК втТаблицаТранзакций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ИС_Сбер_Товары.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ИС_Сбер_Товары.Характеристика) КАК Характеристика,
	|	втТаблицаТранзакций.Артикул КАК Артикул,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИС_Сбер_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЭтоНабор,
	|	МАКСИМУМ(ИС_Сбер_Товары.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ИС_Сбер_Товары.Упаковка ЕСТЬ NULL ИЛИ ИС_Сбер_Товары.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_Сбер_Товары.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_Сбер_Товары.Упаковка ЕСТЬ NULL ИЛИ ИС_Сбер_Товары.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_Сбер_Товары.Упаковка.Знаменатель
	|	КОНЕЦ) КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	втТаблицаТранзакций КАК втТаблицаТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
	|		ПО (ИС_Сбер_Товары.offerID = втТаблицаТранзакций.Артикул)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблицаТранзакций.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблицаТранзакций.СтрокаНомер КАК СтрокаНомер,
	|	втТаблицаТранзакций.Артикул КАК Артикул,
	|	втТаблицаТранзакций.СтоимостьТовара КАК СтоимостьТовара,
	|	втТаблицаТранзакций.Количество КАК Количество,
	|	втТаблицаТранзакций.Бонусы КАК Бонусы,
	|	втТаблицаТранзакций.СберСпасибо КАК СберСпасибо,
	|	втТаблицаТранзакций.ЦенаПродажи КАК ЦенаПродажи,
	|	втТаблицаТранзакций.СуммаТоварныхУслуг КАК СуммаТоварныхУслуг,
	|	втТаблицаТранзакций.УслугиКРаспределению КАК УслугиКРаспределению,
	|	втТаблицаТранзакций.НомерОтправленияМП КАК НомерОтправленияМП,
	|	втТаблицаТранзакций.НомерОтправления КАК НомерОтправления,
	|	втТаблицаТранзакций.СтатусЗаказа КАК СтатусЗаказа,
	|	втТаблицаТранзакций.ДатаОтправления КАК ДатаОтправления,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ВТ_Номенклатура.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ВТ_Номенклатура.КоэффициентУпаковки КАК КоэффициентУпаковки
	|ИЗ
	|	втТаблицаТранзакций КАК втТаблицаТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО втТаблицаТранзакций.Артикул = ВТ_Номенклатура.Артикул"; 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Профиль", 			Профиль);
	Запрос.УстановитьПараметр("ТаблицаТранзакций", 	ТаблицаТранзакций);	
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат РезультатЗапроса;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005

//+ ИнфоСофт Сумин Д.В. 15.05.2024 УА #75889
//+ ИнфоСофт Власова И.С. 05.08.24 УА #81190
//Процедура ВыполнитьАлгоритмСозданияКонтрагентов()
&НаСервере
Функция ВыполнитьАлгоритмСозданияКонтрагентов()
//- ИнфоСофт Власова И.С. 05.08.24 УА #81190
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИС_Ozon_Продажи.ИНН КАК ИНН,
	|	МАКСИМУМ(ИС_Ozon_Продажи.НаименованиеЮрЛица) КАК НаименованиеКлиента
	|ПОМЕСТИТЬ ВТ_ИНН
	|ИЗ
	|	РегистрСведений.ИС_Ozon_Продажи КАК ИС_Ozon_Продажи
	|ГДЕ
	|	ИС_Ozon_Продажи.Профиль = &Профиль
	|	И ИС_Ozon_Продажи.ИНН <> """"
	|	И ИС_Ozon_Продажи.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_Ozon_Продажи.ИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ВТ_ИНН.ИНН КАК ИНН,
	|	ВТ_ИНН.НаименованиеКлиента КАК НаименованиеКлиента
	|ИЗ
	|	ВТ_ИНН КАК ВТ_ИНН
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_ИНН.ИНН = Контрагенты.ИНН
	|ГДЕ
	|	Контрагенты.Ссылка ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("Профиль", 		Профиль);
	Запрос.УстановитьПараметр("ДатаНачала", 	НачалоДня(ПериодOzon.ДатаНачала)); 
	Запрос.УстановитьПараметр("ДатаОкончания", 	КонецДня(ПериодOzon.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		МассивНаименованийПараметров = Новый Массив;	
		
		МассивНаименованийПараметров.Добавить("ДоговорOzon");
		МассивНаименованийПараметров.Добавить("ПартнерOzon");
		МассивНаименованийПараметров.Добавить("КонтрагентOzon");
		
		Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);
		
		//+ ИнфоСофт Власова И.С. 02.08.24 УА #80469
		СтруктураДанных = ИС_MP_Сервер.ПолучитьСтруктуруДляСозданияКонтрагента();
		СтруктураДанных.Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон;
		//- ИнфоСофт Власова И.С. 02.08.24 УА #80469
		
		//+ ИнфоСофт Власова И.С. 05.08.24 УА #81190
		СтруктураДанных.КомиссионныеПродажи25 = ИС_MP_Сервер.ПолучитьВерсиюКомиссионныхПродаж(Профиль, СтруктураДанных.Маркетплейс);
		
		Если СтруктураДанных.КомиссионныеПродажи25 = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;	
		//- ИнфоСофт Власова И.С. 05.08.24 УА #81190
		
		Пока Выборка.Следующий() Цикл
			
			//+ ИнфоСофт Власова И.С. 02.08.24 УА #80469
			//СтруктураДанных = Новый Структура; 
			//
			//СтруктураДанных.Вставить("НаименованиеКлиента", Выборка.НаименованиеКлиента);
			//СтруктураДанных.Вставить("Инн", Выборка.Инн);
			
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);	
			//- ИнфоСофт Власова И.С. 02.08.24 УА #80469
			
			ДанныеКонтрагента = ИС_MP_Сервер.СоздатьКонтрагента(Профиль.Организация, Настройки, СтруктураДанных);
			
		КонецЦикла;
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 05.08.24 УА #81190
	Возврат Истина;	
	//- ИнфоСофт Власова И.С. 05.08.24 УА #81190

//+ ИнфоСофт Власова И.С. 05.08.24 УА #81190	
//КонецПроцедуры //- ИнфоСофт Сумин Д.В. 15.05.2024 УА #75889
КонецФункции
//- ИнфоСофт Власова И.С. 05.08.24 УА #81190

#КонецОбласти


#Область СлужебныеПроцедурыИФункцииЯМ  

//+ ИнфоСофт Заварин К.В. 11.11.24 УА #87034
&НаСервере
Функция ПолучитьСписокПродаж(Период)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИС_ЯМ_Продажи.Sku КАК Sku,
	|	ИС_ЯМ_Продажи.НомерЗаказа КАК НомерЗаказа,
	//+ ИнфоСофт Власова И.С. 22.04.25 УА #99750
	|	ИС_ЯМ_Продажи.НаименованиеТовара КАК НаименованиеТовара,
	//- ИнфоСофт Власова И.С. 22.04.25 УА #99750
	|	ИС_ЯМ_Продажи.ПродажаЮрЛицу КАК ПродажаЮрЛицу,
	|	ИС_ЯМ_Продажи.ИннПокупателя КАК ИннПокупателя,
	|	ИС_ЯМ_Продажи.ДатаОформленияЗаказа КАК ДатаОформленияЗаказа,
	|	ИС_ЯМ_Продажи.ДатаПередачиТовараВДоставку КАК ДатаПередачиТовараВДоставку,
	|	ИС_ЯМ_Продажи.ДатаДоставкиТовара КАК ДатаДоставкиТовара,
	|	ИС_ЯМ_Продажи.ДатаПриёмаВозврата КАК ДатаПриёмаВозврата,
	|	ИС_ЯМ_Продажи.СпособОплаты КАК СпособОплаты,
	|	ИС_ЯМ_Продажи.ВозвратКоличество КАК ВозвратКоличество,
	|	ИС_ЯМ_Продажи.ВозвратЦенаРеализации КАК ВозвратЦенаРеализации,
	|	ИС_ЯМ_Продажи.ВозвращеноНаСумму КАК ВозвращеноНаСумму,
	|	ИС_ЯМ_Продажи.Количество КАК Количество,
	|	ИС_ЯМ_Продажи.РеализованоНаСумму КАК РеализованоНаСумму,
	|	ИС_ЯМ_Продажи.ЦенаПродавца КАК ЦенаПродавца,
	|	ИС_ЯМ_Продажи.ЦенаРеализация КАК ЦенаРеализация
	|ПОМЕСТИТЬ ВТ_Продажи
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_Продажи КАК ИС_ЯМ_Продажи
	|ГДЕ
	|	ИС_ЯМ_Продажи.Профиль = &Профиль
	|	И ИС_ЯМ_Продажи.ДатаДоставкиТовара МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_ЯМ_Продажи.Sku,
	|	ИС_ЯМ_Продажи.НомерЗаказа,
	//+ ИнфоСофт Власова И.С. 22.04.25 УА #99750
	|	ИС_ЯМ_Продажи.НаименованиеТовара,
	//- ИнфоСофт Власова И.С. 22.04.25 УА #99750
	|	ИС_ЯМ_Продажи.ПродажаЮрЛицу,
	|	ИС_ЯМ_Продажи.ИннПокупателя,
	|	ИС_ЯМ_Продажи.ДатаОформленияЗаказа,
	|	ИС_ЯМ_Продажи.ДатаПередачиТовараВДоставку,
	|	ИС_ЯМ_Продажи.ДатаДоставкиТовара,
	|	ИС_ЯМ_Продажи.ДатаПриёмаВозврата,
	|	ИС_ЯМ_Продажи.СпособОплаты,
	|	ИС_ЯМ_Продажи.ВозвратКоличество,
	|	ИС_ЯМ_Продажи.ВозвратЦенаРеализации,
	|	ИС_ЯМ_Продажи.ВозвращеноНаСумму,
	|	ИС_ЯМ_Продажи.Количество,
	|	ИС_ЯМ_Продажи.РеализованоНаСумму,
	|	ИС_ЯМ_Продажи.ЦенаПродавца,
	|	ИС_ЯМ_Продажи.ЦенаРеализация
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_Продажи КАК ИС_ЯМ_Продажи
	|ГДЕ
	|	ИС_ЯМ_Продажи.Профиль = &Профиль
	|	И ИС_ЯМ_Продажи.ДатаПриёмаВозврата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ИС_ЯМ_Продажи.ДатаДоставкиТовара НЕ МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Sku КАК Sku,
	|	МАКСИМУМ(ИС_ЯМ_СоответствиеХарактеристик.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ИС_ЯМ_СоответствиеХарактеристик.Характеристика) КАК Характеристика,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЭтоНабор,
	|	МАКСИМУМ(ИС_ЯМ_СоответствиеХарактеристик.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Знаменатель
	|	КОНЕЦ) КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ПО (ВТ_Продажи.Sku = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku
	|				И ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Продажи.Sku 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Sku КАК Sku,
	|	ВТ_Продажи.НомерЗаказа КАК НомерЗаказа,
	//+ ИнфоСофт Власова И.С. 22.04.25 УА #99750
	|	ВТ_Продажи.НаименованиеТовара КАК НаименованиеТовара,
	//- ИнфоСофт Власова И.С. 22.04.25 УА #99750
	|	ВТ_Продажи.ПродажаЮрЛицу КАК ПродажаЮрЛицу,
	|	ВТ_Продажи.ИннПокупателя КАК ИннПокупателя,
	|	ВТ_Продажи.ДатаОформленияЗаказа КАК ДатаОформленияЗаказа,
	|	ВТ_Продажи.ДатаПередачиТовараВДоставку КАК ДатаПередачиТовараВДоставку,
	|	ВТ_Продажи.ДатаДоставкиТовара КАК ДатаДоставкиТовара,
	|	ВТ_Продажи.ДатаПриёмаВозврата КАК ДатаПриёмаВозврата,
	|	ВТ_Продажи.СпособОплаты КАК СпособОплаты,
	|	ВТ_Продажи.ВозвратКоличество КАК ВозвратКоличество,
	|	ВТ_Продажи.ВозвратЦенаРеализации КАК ВозвратЦенаРеализации,
	|	ВТ_Продажи.ВозвращеноНаСумму КАК ВозвращеноНаСумму,
	|	ВТ_Продажи.Количество КАК Количество,
	|	ВТ_Продажи.РеализованоНаСумму КАК РеализованоНаСумму,
	|	ВТ_Продажи.ЦенаПродавца КАК ЦенаПродавца,
	|	ВТ_Продажи.ЦенаРеализация КАК ЦенаРеализация,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ВТ_Номенклатура.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ВТ_Номенклатура.КоэффициентУпаковки КАК КоэффициентУпаковки
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО ВТ_Продажи.Sku = ВТ_Номенклатура.Sku");
	
	Запрос.УстановитьПараметр("Профиль", 		Профиль);
	Запрос.УстановитьПараметр("ДатаНачала", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	Период.ДатаОкончания);	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции //- ИнфоСофт Заварин К.В. 11.11.24 УА #87034

//+ ИнфоСофт Мурсалимов Д.Р. 26.09.24 УА #65981 
&НаСервере
Процедура ЗаполнитьТаблицуЗаписи(Таблица, Продажа = Истина)
	
	КоличествоСтрок = Таблица.ВысотаТаблицы - 1;
	
	Для сч = 15 По КоличествоСтрок Цикл 
		
		Попытка
			
			ТабДок 									= Таблица;
			
			РассчитаннаяСтрока 						= "R" + Формат(сч, "ЧГ=0;") + "C";
			
			НоваяСтрока								= СписокТранзакцийExcelЯМ.Добавить();
			
			НоваяСтрока.НаименованиеТовара			= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 3));			
			НоваяСтрока.SKU							= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 4));			
			НоваяСтрока.Профиль 					= Профиль;
			НоваяСтрока.НомерЗаказа					= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 1));
			НоваяСтрока.ИННПокупателя		    	= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 22));
			НоваяСтрока.ПродажаЮрЛицу		    	= ?(ЗначениеЗаполнено(НоваяСтрока.ИННПокупателя), Истина, Ложь);
			НоваяСтрока.ДатаОформленияЗаказа		= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8)));
			НоваяСтрока.ДатаПередачиТовараВДоставку	= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)));
			НоваяСтрока.ДатаДоставкиТовара			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)));
			
			Если Продажа Тогда			                                                                                                   
				
				НоваяСтрока.ЦенаПродавца			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 13)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 13), Символы.НПП, "")));
				НоваяСтрока.ЦенаРеализация			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 17)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 17), Символы.НПП, "")));
				НоваяСтрока.Количество				= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6), Символы.НПП, "")));
				НоваяСтрока.РеализованоНаСумму		= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 20)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 20), Символы.НПП, "")));			
				НоваяСтрока.СпособОплаты			= ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11);
				НоваяСтрока.НаименованиеКлиента		= ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 21);
				НоваяСтрока.АдресКлиента			= ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 24);
				
			Иначе
				
				НоваяСтрока.ЦенаПродавца			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14), Символы.НПП, "")));
				НоваяСтрока.ВозвратЦенаРеализации	= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 18)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 18), Символы.НПП, "")));
				НоваяСтрока.ВозвратКоличество		= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6), Символы.НПП, "")));
				НоваяСтрока.ВозвращеноНаСумму		= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 21)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 21), Символы.НПП, "")));
				
			КонецЕсли;
					
		Исключение
			Сообщение		= Новый СообщениеПользователю;
			Сообщение.Текст	= "Не удалось загрузить строку " + Строка(сч);
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 26.09.24 УА #65981 

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаКлиенте
Процедура ПоместитьФайлНаСерверЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.ПомещениеФайлаОтменено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось поместить файл на сервер, попробуйте ещё раз...", , , "ПутьКФайлу");
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[Параметры.Адрес] = Результат.Адрес;          
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252 

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаСервере
Процедура ВыполнитьГруппировкуТаблицыЗаписей()   
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВТ_Продажи.Профиль КАК Профиль,
	|	ВТ_Продажи.Sku КАК Sku,
	|	ВТ_Продажи.НомерЗаказа КАК НомерЗаказа,
	|	ВТ_Продажи.ПродажаЮрЛицу КАК ПродажаЮрЛицу,
	|	ВТ_Продажи.ИннПокупателя КАК ИннПокупателя,
	|	ВТ_Продажи.ДатаОформленияЗаказа КАК ДатаОформленияЗаказа,
	|	ВТ_Продажи.ДатаПередачиТовараВДоставку КАК ДатаПередачиТовараВДоставку,
	|	ВТ_Продажи.ДатаДоставкиТовара КАК ДатаДоставкиТовара,
	|	ВТ_Продажи.СпособОплаты КАК СпособОплаты,
	|	ВТ_Продажи.НаименованиеКлиента КАК НаименованиеКлиента,
	|	ВТ_Продажи.АдресКлиента КАК АдресКлиента,
	|	ВТ_Продажи.ЦенаПродавца КАК ЦенаПродавца,
	|	ВТ_Продажи.ЦенаРеализация КАК ЦенаРеализация,
	|	ВТ_Продажи.Количество КАК Количество,
	|	ВТ_Продажи.ВозвратКоличество КАК ВозвратКоличество,
	|	ВТ_Продажи.ВозвратЦенаРеализации КАК ВозвратЦенаРеализации,
	|	ВТ_Продажи.ВозвращеноНаСумму КАК ВозвращеноНаСумму,
	|	ВТ_Продажи.РеализованоНаСумму КАК РеализованоНаСумму
	|ПОМЕСТИТЬ ВТ_ДанныеПродаж
	|ИЗ
	|	&ВТ_Продажи КАК ВТ_Продажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПродаж.Профиль КАК Профиль,
	|	ВТ_ДанныеПродаж.Sku КАК Sku,
	|	ВТ_ДанныеПродаж.НомерЗаказа КАК НомерЗаказа,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.ПродажаЮрЛицу) КАК ПродажаЮрЛицу,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.ИннПокупателя) КАК ИннПокупателя,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.ДатаОформленияЗаказа) КАК ДатаОформленияЗаказа,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.ДатаПередачиТовараВДоставку) КАК ДатаПередачиТовараВДоставку,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.ДатаДоставкиТовара) КАК ДатаДоставкиТовара,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.НаименованиеКлиента) КАК НаименованиеКлиента,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.АдресКлиента) КАК АдресКлиента,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.СпособОплаты) КАК СпособОплаты,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.ЦенаПродавца) КАК ЦенаПродавца,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.ЦенаРеализация) КАК ЦенаРеализация,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.Количество) КАК Количество,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.ВозвратКоличество) КАК ВозвратКоличество,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.ВозвратЦенаРеализации) КАК ВозвратЦенаРеализации,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.ВозвращеноНаСумму) КАК ВозвращеноНаСумму,
	|	МАКСИМУМ(ВТ_ДанныеПродаж.РеализованоНаСумму) КАК РеализованоНаСумму
	|ИЗ
	|	ВТ_ДанныеПродаж КАК ВТ_ДанныеПродаж
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПродаж.Профиль,
	|	ВТ_ДанныеПродаж.НомерЗаказа,
	|	ВТ_ДанныеПродаж.Sku");
	
	Запрос.УстановитьПараметр("ВТ_Продажи", СписокТранзакцийExcelЯМ.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СписокТранзакцийExcelЯМ.Очистить();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЗ 								= СписокТранзакцийExcelЯМ.Добавить();
		СтрокаТЗ.Профиль 						= Выборка.Профиль;
		СтрокаТЗ.Sku 							= Выборка.Sku;
		СтрокаТЗ.НомерЗаказа 					= Выборка.НомерЗаказа;
		СтрокаТЗ.ПродажаЮрЛицу 					= Выборка.ПродажаЮрЛицу;
		СтрокаТЗ.ИннПокупателя 				 	= Выборка.ИннПокупателя;
		СтрокаТЗ.НаименованиеКлиента 				 	= Выборка.НаименованиеКлиента;
		СтрокаТЗ.АдресКлиента 				 	= Выборка.АдресКлиента;
		СтрокаТЗ.ДатаОформленияЗаказа 		 	= Выборка.ДатаОформленияЗаказа;
		СтрокаТЗ.ДатаПередачиТовараВДоставку 	= Выборка.ДатаПередачиТовараВДоставку;
		СтрокаТЗ.ДатаДоставкиТовара 			= Выборка.ДатаДоставкиТовара;
		СтрокаТЗ.СпособОплаты 					= Выборка.СпособОплаты;
		СтрокаТЗ.ЦенаПродавца 					= Выборка.ЦенаПродавца;
		СтрокаТЗ.ЦенаРеализация 				= Выборка.ЦенаРеализация;
		СтрокаТЗ.Количество 					= Выборка.Количество; 	
		СтрокаТЗ.ВозвратКоличество	 			= Выборка.ВозвратКоличество;
		СтрокаТЗ.ВозвратЦенаРеализации 			= Выборка.ВозвратЦенаРеализации;
		СтрокаТЗ.ВозвращеноНаСумму 				= Выборка.ВозвращеноНаСумму;		
		СтрокаТЗ.РеализованоНаСумму 			= Выборка.РеализованоНаСумму;
	КонецЦикла;	
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252	

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаСервере
Процедура СохранитьСопоставлениеНаСервере() 
	Попытка
		Сообщение = "Данные сохранены, перейдите к пункту ""2"".";
		НачатьТранзакцию();		
			
		НоменклатураЯмТЗ = ПолучитьНоменклатуруЯМ();
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Для Каждого Строка Из СписокТранзакцийExcelЯМ Цикл 
			
			Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				Сообщение = "Необходимо выполнить сопоставление.";
				ВызватьИсключение(Сообщение);
			КонецЕсли;
			
			СтрокаТЗ = НоменклатураЯмТЗ.Найти(Строка.SKU); 
			
			Если СтрокаТЗ = Неопределено Тогда
				Сообщение = "Не по всем SKU найдены данные. Необходимо выполнить загрузку товаров Яндекс Маркета.";
				ВызватьИсключение(Сообщение);	
			КонецЕсли;
			
			МенеджерЗаписи = РегистрыСведений.ИС_ЯМ_СоответствиеХарактеристик.СоздатьМенеджерЗаписи(); 
			
			МенеджерЗаписи.НоменклатураЯМ 	= СтрокаТЗ.Номенклатура;
			МенеджерЗаписи.Номенклатура		= Строка.Номенклатура;
			МенеджерЗаписи.Характеристика 	= Строка.ХарактеристикаНоменклатуры;
			
			МенеджерЗаписи.Записать();
			
		КонецЦикла;	

		ЗафиксироватьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
	Исключение
		ОтменитьТранзакцию();  
		Сообщение = "Не по всем SKU найдены данные. Необходимо выполнить загрузку товаров Яндекс Маркета.";
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&Насервере
Функция ПолучитьНоменклатуруЯМ()
	
	НоменклатураЯмТЗ = Новый ТаблицаЗначений;
	НоменклатураЯмТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.ИС_ЯМ_Номенклатура"));
	НоменклатураЯмТЗ.Колонки.Добавить("Sku", Новый ОписаниеТипов("Строка"));
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.Ссылка КАК НоменклатураЯМ,
	|	ИС_ЯМ_Номенклатура.shopSku КАК Sku
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|ГДЕ
	|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
	|	И ИС_ЯМ_Номенклатура.shopSku В(&МассивSku)");
	
	SkuТЗ = СписокТранзакцийExcelЯМ.Выгрузить(,"SKU");
	SkuТЗ.Свернуть("SKU");
	
	Запрос.УстановитьПараметр("Профиль", Профиль); 
	Запрос.УстановитьПараметр("МассивSku", SkuТЗ.ВыгрузитьКолонку("SKU")); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение("Не по всем SKU найдены данные. Необходимо выполнить загрузку товаров Яндекс Маркета.");	
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЗ = НоменклатураЯмТЗ.Добавить();
		СтрокаТЗ.Номенклатура = Выборка.НоменклатураЯМ;
		СтрокаТЗ.SKU = Выборка.Sku;
	КонецЦикла;
	
	Возврат НоменклатураЯмТЗ;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252
&НаСервере
Процедура СформироватьРеализацииЧерезКомиссионера(КомиссионныеПродажи25, Настройки) 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СписокТранзакцийЯМ.Номенклатура КАК Номенклатура,
	|	СписокТранзакцийЯМ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СписокТранзакцийЯМ.ЦенаРеализация КАК ЦенаРеализация,
	|	СписокТранзакцийЯМ.Количество КАК Количество,
	|	СписокТранзакцийЯМ.РеализованоНаСумму КАК РеализованоНаСумму,
	|	СписокТранзакцийЯМ.ЭтоНабор КАК ЭтоНабор,
	|	СписокТранзакцийЯМ.НомерЗаказа КАК НомерЗаказа,
	|	СписокТранзакцийЯМ.ПродажаЮрЛицу КАК ПродажаЮрЛицу,
	|	СписокТранзакцийЯМ.ДатаОформленияЗаказа КАК ДатаОформленияЗаказа
	//+ ИнфоСофт Власова И.С. 01.04.25 УА #97214
	|,
	|	СписокТранзакцийЯМ.НомерУПД КАК НомерУПД
	//- ИнфоСофт Власова И.С. 01.04.25 УА #97214
	|ПОМЕСТИТЬ ВТ_СписокТранзакций
	|ИЗ
	|	&СписокТранзакцийЯМ КАК СписокТранзакцийЯМ
	|ГДЕ
	|	СписокТранзакцийЯМ.ПродажаЮрЛицу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Контрагент КАК Контрагент,
	|	Контрагенты.Договор КАК Договор,
	|	Контрагенты.Соглашение КАК Соглашение,
	|	Контрагенты.Партнер КАК Партнер,
	|	Контрагенты.НомерЗаказа КАК НомерЗаказа
	|ПОМЕСТИТЬ ВТ_Контрагенты
	|ИЗ
	|	&Контрагенты КАК Контрагенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписокТранзакций.Количество КАК Количество,
	|	ВТ_СписокТранзакций.Номенклатура КАК Номенклатура,
	|	ВТ_СписокТранзакций.РеализованоНаСумму КАК РеализованоНаСумму,
	|	ВТ_СписокТранзакций.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_СписокТранзакций.ЦенаРеализация КАК ЦенаРеализация,
	|	ВТ_СписокТранзакций.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Контрагенты.Договор КАК Договор,
	|	ВТ_Контрагенты.Контрагент КАК Контрагент,
	|	ВТ_Контрагенты.Партнер КАК Партнер,
	|	ВТ_Контрагенты.Соглашение КАК Соглашение
	//+ ИнфоСофт Власова И.С. 01.04.25 УА #97214
	|,
	|	ВЫРАЗИТЬ(ВТ_СписокТранзакций.НомерУПД КАК СТРОКА(100)) КАК НомерУПД
	//- ИнфоСофт Власова И.С. 01.04.25 УА #97214
	|ИЗ
	|	ВТ_СписокТранзакций КАК ВТ_СписокТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Контрагенты КАК ВТ_Контрагенты
	|		ПО ВТ_СписокТранзакций.НомерЗаказа = ВТ_Контрагенты.НомерЗаказа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Партнер
	|ИТОГИ ПО
	//+ ИнфоСофт Власова И.С. 01.04.25 УА #97214
	//|	Партнер");
	|	Партнер,
	|	НомерУПД");
	//- ИнфоСофт Власова И.С. 01.04.25 УА #97214
	
	Запрос.УстановитьПараметр("СписокТранзакцийЯМ", СписокТранзакцийExcelЯМ.Выгрузить());
	Запрос.УстановитьПараметр("Контрагенты", 		ЯндексКонтрагенты.Выгрузить());
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(10,2);
	
	ТаблицаПродажРеализацииЧерезКомиссионера = Новый ТаблицаЗначений;
		
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("Партнер", 					Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("Контрагент", 				Новый ОписаниеТипов("СправочникСсылка.Контрагенты")); 
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("Договор", 					Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("Соглашение", 				Новый ОписаниеТипов("СправочникСсылка.СоглашенияСКлиентами"));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("Номенклатура", 				Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("Количество", 				Новый ОписаниеТипов("Число",,,КвалификаторЧисла));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("РеализованоНаСумму", 		Новый ОписаниеТипов("Число",,,КвалификаторЧисла));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("ЦенаРеализация", 			Новый ОписаниеТипов("Число",,,КвалификаторЧисла));
	ТаблицаПродажРеализацииЧерезКомиссионера.Колонки.Добавить("ЭтоНабор", 					Новый ОписаниеТипов("Булево"));
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Период", Период);
	СтруктураДанных.Вставить("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивВзаимозачет = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		
		//+ ИнфоСофт Власова И.С. 01.04.25 УА #97214
		//ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		
		ВыборкаУПД = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаУПД.Следующий() Цикл
		
		ВыборкаДетальныеЗаписи = ВыборкаУПД.Выбрать(); 
		//- ИнфоСофт Власова И.С. 01.04.25 УА #97214
		
		ТаблицаПродажРеализацииЧерезКомиссионера.Очистить();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = ТаблицаПродажРеализацииЧерезКомиссионера.Добавить(); 
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
			
		КонецЦикла;	
		
		СтруктураДанных.Вставить("ТаблицаПродаж", ТаблицаПродажРеализацииЧерезКомиссионера);
		СтруктураДанных.Вставить("РеализацияЧерезКомиссионера", КомиссионныеПродажи25);
		СтруктураДанных.Вставить("ЗаказКлиента", Неопределено);	
		
		//+ ИнфоСофт Власова И.С. 01.04.25 УА #97214
		СтруктураДанных.Вставить("НомерУПД", ВыборкаУПД.НомерУПД);
		//- ИнфоСофт Власова И.С. 01.04.25 УА #97214
		
		Если Не КомиссионныеПродажи25 Тогда 
			
			ДокументВозврат = ИС_ЯМ_Сервер.СоздатьДокументВозвратТоваров(СтруктураДанных);
			ДобавитьНовыйДокумент(ДокументВозврат);  		
			ПорядокРасчетов = ПолучитьПорядокРасчетов(СтруктураДанных.ТаблицаПродаж[0]); 
			
			СтруктураВзаимозачет = Новый Структура();
			
			Если ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
				ДокументЗаказ = ИС_ЯМ_Сервер.СоздатьЗаказКлиента(СтруктураДанных);
				ДобавитьНовыйДокумент(ДокументЗаказ);
				СтруктураДанных.Вставить("ЗаказКлиента", ДокументЗаказ.Ссылка);	
				СтруктураВзаимозачет.Вставить("ОбъектРасчетов", ДокументЗаказ.Ссылка);
			Иначе
				СтруктураВзаимозачет.Вставить("ОбъектРасчетов", ДокументВозврат.Договор);	
			КонецЕсли;
			
		КонецЕсли;
		
		ДокументРеализация = ИС_ЯМ_Сервер.СоздатьРеализациюТоваровЧерезКомиссионера(СтруктураДанных);
		
		//+ ИнфоСофт Власова И.С. 05.08.24 УА #81190
		Если ДокументРеализация <> Неопределено Тогда
		//- ИнфоСофт Власова И.С. 05.08.24 УА #81190
			
		Если Не КомиссионныеПродажи25 Тогда
			СтруктураВзаимозачет.Вставить("ДокументРеализация", ДокументРеализация.Ссылка);
			МассивВзаимозачет.Добавить(СтруктураВзаимозачет);
		КонецЕсли;
		
		ДобавитьНовыйДокумент(ДокументРеализация.Ссылка);
		
		//+ ИнфоСофт Власова И.С. 05.08.24 УА #81190
		КонецЕсли;	
		//- ИнфоСофт Власова И.С. 05.08.24 УА #81190
		
		//+ ИнфоСофт Власова И.С. 01.04.25 УА #97214
		КонецЦикла;
		//- ИнфоСофт Власова И.С. 01.04.25 УА #97214
		
	КонецЦикла;
	
	ПараметрыОтбора = Новый Структура("ПродажаЮрЛицу", Ложь);
	
	СписокПродажОК = СписокТранзакцийExcelЯМ.Выгрузить(ПараметрыОтбора);
	
	//+ ИнфоСофт Власова И.С. 05.08.24 УА #81190
	//Комментарий = "Отчет комисисонера за период с " + Период.ДатаНачала + " по " + Период.ДатаОкончания;
	//
	//Отчет = ИС_ЯМ_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокПродажОК, Комментарий); 
	//
	//ДобавитьНовыйДокумент(Отчет); 
	//
	//Для Каждого Элемент Из МассивВзаимозачет Цикл
	//	Взаимозачет = ИС_ЯМ_Сервер.СоздатьДокументВзаимозачетЗадолженности(Элемент.ОбъектРасчетов, Элемент.ДокументРеализация, Отчет);	
	//	ДобавитьНовыйДокумент(Взаимозачет); 
	//КонецЦикла;
	
	Если СписокПродажОК.Количество() > 0 Тогда
		
		Комментарий = "Отчет комиссионера за период с " + Период.ДатаНачала + " по " + Период.ДатаОкончания;
	
		//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗаполнитьКолонкуПокупательЯМ", ЗаполнитьКолонкуПокупательЯМ); 
		//+ ИнфоСофт Власова И.С. 10.12.24 УА #87450
		СтруктураПараметров.Вставить("РозничныйПокупательЯМ",        РозничныйПокупательЯМ);
		//- ИнфоСофт Власова И.С. 10.12.24 УА #87450
		
		//+ ИнфоСофт Заварин К.В. 10.03.25 УА #95036
		СтруктураПараметров.Вставить("Профиль",        			 	 Профиль);
		//- ИнфоСофт Заварин К.В. 10.03.25 УА #95036
		
		//Отчет = ИС_ЯМ_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокПродажОК, Комментарий); 
		Отчет = ИС_ЯМ_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокПродажОК, Комментарий, СтруктураПараметров);
		//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
		
		Если Отчет <> Неопределено Тогда
			ДобавитьНовыйДокумент(Отчет);
		КонецЕсли;
		
		Для Каждого Элемент Из МассивВзаимозачет Цикл
			
			//+ ИнфоСофт Мурсалимов Д.Р. 25.10.24 УА #85566
			Взаимозачет = ИС_МП_УправлениеЗаказами.СоздатьДокументВзаимозачетЗадолженности(Элемент.ОбъектРасчетов, Элемент.ДокументРеализация, Отчет);
			//- ИнфоСофт Мурсалимов Д.Р. 25.10.24 УА #85566
			
			ДобавитьНовыйДокумент(Взаимозачет);
			
		КонецЦикла;
		
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 05.08.24 УА #81190
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252	

//+ ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252
&НаСервере
Процедура ЗаполнитьКонтрагентыОтображениеНаСервере(Маркетплейс)
	
	Контрагенты 			= ЭтотОбъект[Маркетплейс + "Контрагенты"];
	КонтрагентыОтображение 	= ЭтотОбъект[Маркетплейс + "КонтрагентыОтображение"];
	
	КонтрагентыОтображение.Очистить();
	ТаблицаКонтрагенты = Контрагенты.Выгрузить(,"ИНН,Партнер,Контрагент,Договор,Соглашение");
	ТаблицаКонтрагенты.Свернуть("ИНН,Партнер,Контрагент,Договор,Соглашение");
	КонтрагентыОтображение.Загрузить(ТаблицаКонтрагенты);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 22.08.2023 УА #61252
&НаСервере
Процедура ДобавитьНовыйДокумент(НовыйДокумент)
	СозданныеДокументы.Добавить().Документ = НовыйДокумент.Ссылка; 	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 22.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 22.08.2023 УА #61252
&НаСервере
Функция ПолучитьПорядокРасчетов(СтрокаТЗ)
	Если Не ЗначениеЗаполнено(СтрокаТЗ.Соглашение) Или Не ЗначениеЗаполнено(СтрокаТЗ.Соглашение.ПорядокРасчетов) Тогда
		Возврат СтрокаТЗ.Договор.ПорядокРасчетов;
	Иначе
		Возврат СтрокаТЗ.Соглашение.ПорядокРасчетов;	
	КонецЕсли;	
КонецФункции //- ИнфоСофт Сумин Д.В. 22.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 24.08.2023 УА #61252
&НаКлиенте
Процедура ЗаполнитьДоговорыСоглашения()	
	Для Каждого Строка Из ЯндексКонтрагенты Цикл
		ПарметрыОтбора  = Новый Структура("ИНН", Строка.ИНН); 
		НайденныеСтроки = ЯндексКонтрагентыОтображение.НайтиСтроки(ПарметрыОтбора);
		Строка.Договор  = НайденныеСтроки[0].Договор;
		Строка.Соглашение  = НайденныеСтроки[0].Соглашение;
	КонецЦикла;		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 24.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 24.08.2023 УА #61252
&НаСервере
Функция ПолучитьВерсиюКомиссии(Настройки = Неопределено) 
	
	Если Настройки = Неопределено Тогда
		МассивНаименованийПараметров = Новый Массив;	
		МассивНаименованийПараметров.Добавить("СоглашениеЯМ");
		МассивНаименованийПараметров.Добавить("ДоговорЯМ");
		Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);	
	КонецЕсли;
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"); 
	
	Если ИспользоватьСоглашенияСКлиентами И Настройки["СоглашениеЯМ"] <> Неопределено Тогда 
		КомиссионныеПродажи25 = Настройки["СоглашениеЯМ"].КомиссионныеПродажи25		
	Иначе
		КомиссионныеПродажи25 = Настройки["ДоговорЯМ"].КомиссионныеПродажи25;	
	КонецЕсли;
	
	Если КомиссионныеПродажи25 = Неопределено Тогда
		ВызватьИсключение("Проверьте настройки заполнения профиля по схеме комиссии.");	
	КонецЕсли;	
	
	Возврат КомиссионныеПродажи25;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 24.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 01.09.2023 УА #61252
&НаКлиенте
Процедура УстановитьНачальноеОформлениеЯМ()
	
	Элементы.ПоказатьПунктДва.Видимость = Истина;
	Элементы.ГруппаНастройкиСозданиеДокументов.Видимость = Ложь;
	Элементы.ГруппаСозданиеДокументов.Видимость = Ложь;
	Элементы.СписокТранзакцийExcelЯМ.Видимость = Ложь;
	Элементы.ЯндексКонтрагентыОтображение.Видимость = Ложь;
	ОтчетКомиссионера = Ложь;
	РеализацияЧерезКомиссионера = Ложь;
	ПутьКФайлуОтчета = "";
	СписокТранзакцийExcelЯМ.Очистить();
	ЯндексКонтрагенты.Очистить();
	ЯндексКонтрагентыОтображение.Очистить();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 01.09.2023 УА #61252

//+ ИнфоСофт Власова И.С. 25.03.25 УА #96707
&НаСервере
Процедура ЯМЗаполнитьСтрокуФорматФайла2025(ТабДок, НоваяСтрока, РассчитаннаяСтрока, Продажа)
	
	НоваяСтрока.НаименованиеТовара = Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 4));			
	НоваяСтрока.SKU				   = Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 5));			
	НоваяСтрока.НомерЗаказа		   = Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 1));
			
	Если Продажа Тогда			                                                                                                   
		
		НоваяСтрока.ЦенаПродавца				= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14), Символы.НПП, "")));
		НоваяСтрока.ЦенаРеализация				= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 18)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 18), Символы.НПП, "")));
		НоваяСтрока.Количество					= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8), Символы.НПП, "")));
		НоваяСтрока.РеализованоНаСумму			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 21)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 21), Символы.НПП, "")));			
		НоваяСтрока.ИННПокупателя		    	= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 24));
		НоваяСтрока.ПродажаЮрЛицу		    	= ?(ЗначениеЗаполнено(НоваяСтрока.ИННПокупателя), Истина, Ложь);					
		НоваяСтрока.ДатаОформленияЗаказа		= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)));
		НоваяСтрока.ДатаПередачиТовараВДоставку	= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)));
		НоваяСтрока.ДатаДоставкиТовара			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11)));			
		НоваяСтрока.СпособОплаты				= ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 12);
		НоваяСтрока.НаименованиеКлиента			= ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 23);
		НоваяСтрока.АдресКлиента				= ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 26);
		
		//+ ИнфоСофт Власова И.С. 01.04.25 УА #97214
		НоваяСтрока.НомерУПД				    = ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 29);
		//- ИнфоСофт Власова И.С. 01.04.25 УА #97214
		
	Иначе
		
		НоваяСтрока.ЦенаПродавца				= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 15)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 15), Символы.НПП, "")));
		НоваяСтрока.ВозвратЦенаРеализации		= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 19)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 19), Символы.НПП, "")));
		НоваяСтрока.ВозвратКоличество			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8), Символы.НПП, "")));
		НоваяСтрока.ВозвращеноНаСумму			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 22)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 22), Символы.НПП, "")));	
		НоваяСтрока.ИННПокупателя		    	= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 25));
		НоваяСтрока.ПродажаЮрЛицу		    	= ?(ЗначениеЗаполнено(НоваяСтрока.ИННПокупателя), Истина, Ложь);					
		НоваяСтрока.ДатаОформленияЗаказа		= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)));
		НоваяСтрока.ДатаПередачиТовараВДоставку	= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)));
		НоваяСтрока.ДатаДоставкиТовара			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11)));			
		НоваяСтрока.ДатаПриёмаВозврата			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 12)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 12)));
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 25.03.25 УА #96707

#КонецОбласти 

#Область ПервыйЭтапЯМ

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаСервере
Процедура ПолучитьТаблицуЗначенийПродажИзФайлаЯндекс()
	
	СписокТранзакцийExcelЯМ.Очистить(); 
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.Прочитать(Имя);
	
	МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(Новый Структура("Таблица,Тип", "Доставленные_товары", Истина));
	МассивСтруктур.Добавить(Новый Структура("Таблица,Тип", "Невыкупленные_товары", Ложь));
	МассивСтруктур.Добавить(Новый Структура("Таблица,Тип", "Возвращённые_товары", Ложь));
	
	Для Каждого Элемент Из МассивСтруктур Цикл
		ЗаполнитьТаблицуЗаписи(ТабличныйДокумент.ПолучитьОбласть(Элемент.Таблица), Элемент.Тип);  
	КонецЦикла;     
	
	ВыполнитьГруппировкуТаблицыЗаписей();
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		Возврат;
	КонецПопытки; 
	
	ТаблицаТранзакций = СписокТранзакцийExcelЯМ.Выгрузить(); 
	ТаблицаТранзакций = ИС_ЯМ_Сервер.ДобавитьСопоставлениеNew(ТаблицаТранзакций, Профиль);
	СписокТранзакцийExcelЯМ.Загрузить(ТаблицаТранзакций); 
	
	РезултьтатПроверки = ПолучитьРезультатПроверкиСопоставленияЯМ();
	
	//+ ИнфоСофт Заварин К.В. 24.09.24 УА #83149
	Элементы.ГруппаНастройкиСозданиеДокументов.Видимость = Истина; 
	Элементы.ПоказатьПунктДва.Видимость = Ложь;
	//- ИнфоСофт Заварин К.В. 24.09.24 УА #83149
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 13.05.2024 УА #75692
&НаСервере
Процедура ПолучитьТаблицуЗначенийПродажИзФайлаЯндексПосле30032024()
	
	СписокТранзакцийExcelЯМ.Очистить(); 
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.Прочитать(Имя);
	
	МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(Новый Структура("Таблица,Тип", "Доставленные_товары", Истина));
	
	//+ ИнфоСофт Мурсалимов Д.Р. 17.07.24 УА #79747
	//МассивСтруктур.Добавить(Новый Структура("Таблица,Тип", "Невыкупленные_товары", Ложь));
	//- ИнфоСофт Мурсалимов Д.Р. 17.07.24 УА #79747
	
	МассивСтруктур.Добавить(Новый Структура("Таблица,Тип", "Возвращенные_товары", Ложь)); 
	
	Для Каждого Элемент Из МассивСтруктур Цикл
		ДобавитьСтрокиПосле30032024(ТабличныйДокумент.ПолучитьОбласть(Элемент.Таблица), Элемент.Тип);  
	КонецЦикла;     
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		Возврат;
	КонецПопытки; 
	
	ТаблицаТранзакций = СписокТранзакцийExcelЯМ.Выгрузить(); 
	ТаблицаТранзакций = ИС_ЯМ_Сервер.ДобавитьСопоставлениеNew(ТаблицаТранзакций, Профиль);
	СписокТранзакцийExcelЯМ.Загрузить(ТаблицаТранзакций);
	
	//+ ИнфоСофт Заварин К.В. 24.09.24 УА #83149
	Элементы.ГруппаНастройкиСозданиеДокументов.Видимость = Истина; 
	Элементы.ПоказатьПунктДва.Видимость = Ложь;
	//- ИнфоСофт Заварин К.В. 24.09.24 УА #83149
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 13.05.2024 УА #75692

//+ ИнфоСофт Мурсалимов Д.Р. 26.09.24 УА #65981
&НаСервере
Процедура ДобавитьСтрокиПосле30032024(Таблица, Продажа = Истина)
	
	КоличествоСтрок = Таблица.ВысотаТаблицы - 1;
	
	Попытка
		НачальнаяСтрока = Таблица.НайтиТекст("Номер заказа", , Таблица.Область("C1:C2")).Верх + 1;
	Исключение
		НачальнаяСтрока = 14;
	КонецПопытки;

	//+ ИнфоСофт Власова И.С. 25.03.25 УА #96707
	Попытка
		ФорматФайла2025 = ?(Таблица.НайтиТекст("Ваш номер заказа", , Таблица.Область("C2:C2")) = Неопределено, Ложь, Истина);
	Исключение
		ФорматФайла2025 = Ложь;
	КонецПопытки;
	//- ИнфоСофт Власова И.С. 25.03.25 УА #96707
	
	Для сч = НачальнаяСтрока По КоличествоСтрок Цикл	
		
		Попытка
			
			ТабДок 											= Таблица;
			
			РассчитаннаяСтрока 								= "R" + Формат(сч, "ЧГ=0;") + "C";
						
			НоваяСтрока 									= СписокТранзакцийExcelЯМ.Добавить();
			
			//+ ИнфоСофт Власова И.С. 25.03.25 УА #96707
			Если ФорматФайла2025 Тогда
				ЯМЗаполнитьСтрокуФорматФайла2025(ТабДок, НоваяСтрока, РассчитаннаяСтрока, Продажа);
				Продолжить;
			КонецЕсли;	
			//- ИнфоСофт Власова И.С. 25.03.25 УА #96707
			
			НоваяСтрока.НаименованиеТовара					= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 3));			
			НоваяСтрока.SKU									= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 4));			
			
			//+ ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419                            
			НоваяСтрока.НомерЗаказа							= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 1));
			
			Если ФорматФайлаДо31052024ЯМ Тогда
				
				//- ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419
				Если Продажа Тогда			                                                                                                   
					НоваяСтрока.ЦенаПродавца				= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14), Символы.НПП, "")));
					НоваяСтрока.ЦенаРеализация				= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 18)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 18), Символы.НПП, "")));
					НоваяСтрока.Количество					= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7), Символы.НПП, "")));
					НоваяСтрока.РеализованоНаСумму			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 21)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 21), Символы.НПП, "")));			
					
					//+ ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419										
					НоваяСтрока.ИННПокупателя		    	= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 24));
					НоваяСтрока.ПродажаЮрЛицу		    	= ?(ЗначениеЗаполнено(НоваяСтрока.ИННПокупателя), Истина, Ложь);					
					НоваяСтрока.ДатаОформленияЗаказа		= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)));
					НоваяСтрока.ДатаПередачиТовараВДоставку	= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)));
					НоваяСтрока.ДатаДоставкиТовара			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11)));
					
					НоваяСтрока.СпособОплаты				= ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 12);
					НоваяСтрока.НаименованиеКлиента			= ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 23);
					НоваяСтрока.АдресКлиента				= ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 26);
					//- ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419
					
					//+ ИнфоСофт Власова И.С. 01.04.25 УА #97214
					НоваяСтрока.НомерУПД				    = ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 29);
					//- ИнфоСофт Власова И.С. 01.04.25 УА #97214
					
				Иначе
					НоваяСтрока.ЦенаПродавца				= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 15)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 15), Символы.НПП, "")));
					НоваяСтрока.ВозвратЦенаРеализации		= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 19)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 19), Символы.НПП, "")));
					НоваяСтрока.ВозвратКоличество			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7), Символы.НПП, "")));
					НоваяСтрока.ВозвращеноНаСумму			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 22)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 22), Символы.НПП, "")));						
					
					//+ ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419										
					НоваяСтрока.ИННПокупателя		    	= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 25));
					НоваяСтрока.ПродажаЮрЛицу		    	= ?(ЗначениеЗаполнено(НоваяСтрока.ИННПокупателя), Истина, Ложь);					
					НоваяСтрока.ДатаОформленияЗаказа		= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)));
					НоваяСтрока.ДатаПередачиТовараВДоставку	= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)));
					НоваяСтрока.ДатаДоставкиТовара			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11)));
					//- ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419
					
				КонецЕсли;
				
				//+ ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419
			ИначеЕсли НовыйФорматФайлаЯМ Тогда
				
				Если Продажа Тогда			                                                                                                   
					НоваяСтрока.ЦенаПродавца				= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 13)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 13), Символы.НПП, "")));
					НоваяСтрока.ЦенаРеализация				= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 17)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 17), Символы.НПП, "")));
					
					//+ ИнфоСофт Заварин К.В. 11.10.24 УА #85482
					//НоваяСтрока.Количество					= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6), Символы.НПП, "")));
					НоваяСтрока.Количество					= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7), Символы.НПП, "")));
					//- ИнфоСофт Заварин К.В. 11.10.24 УА #85482 
					
					НоваяСтрока.РеализованоНаСумму			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 20)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 20), Символы.НПП, "")));			
					
					НоваяСтрока.ИННПокупателя		    	= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 23));
					НоваяСтрока.ПродажаЮрЛицу		    	= ?(ЗначениеЗаполнено(НоваяСтрока.ИННПокупателя), Истина, Ложь);					
					НоваяСтрока.ДатаОформленияЗаказа		= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8)));
					НоваяСтрока.ДатаПередачиТовараВДоставку	= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)));
					НоваяСтрока.ДатаДоставкиТовара			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)));			
					
					НоваяСтрока.СпособОплаты				= ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11);
					НоваяСтрока.НаименованиеКлиента			= ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 22);
					НоваяСтрока.АдресКлиента				= ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 25);
					
					//+ ИнфоСофт Власова И.С. 01.04.25 УА #97214
					НоваяСтрока.НомерУПД				    = ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 28);
					//- ИнфоСофт Власова И.С. 01.04.25 УА #97214
					
				Иначе
					НоваяСтрока.ЦенаПродавца				= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 14), Символы.НПП, "")));
					НоваяСтрока.ВозвратЦенаРеализации		= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 18)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 18), Символы.НПП, "")));
					
					//+ ИнфоСофт Заварин К.В. 11.10.24 УА #85482
					//НоваяСтрока.ВозвратКоличество			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 6), Символы.НПП, "")));
					НоваяСтрока.ВозвратКоличество			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 7), Символы.НПП, "")));
					//- ИнфоСофт Заварин К.В. 11.10.24 УА #85482
					
					НоваяСтрока.ВозвращеноНаСумму			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 21)) = "", 0, Число(СтрЗаменить(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 21), Символы.НПП, "")));	
					
					НоваяСтрока.ИННПокупателя		    	= Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 24));
					НоваяСтрока.ПродажаЮрЛицу		    	= ?(ЗначениеЗаполнено(НоваяСтрока.ИННПокупателя), Истина, Ложь);					
					НоваяСтрока.ДатаОформленияЗаказа		= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 8)));
					НоваяСтрока.ДатаПередачиТовараВДоставку	= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 9)));
					НоваяСтрока.ДатаДоставкиТовара			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 10)));			
					
					//+ ИнфоСофт Заварин К.В. 11.11.24 УА #87034
					НоваяСтрока.ДатаПриёмаВозврата			= ?(Строка(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11)) = "", '00010101', СтроковыеФункцииКлиентСервер.СтрокаВДату(ПолучитьТекстОбласти(ТабДок, РассчитаннаяСтрока, 11)));
					//- ИнфоСофт Заварин К.В. 11.11.24 УА #87034
					
				КонецЕсли;
				
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 23.07.2024 УА #79419
			
		Исключение
			Сообщение		= Новый СообщениеПользователю;
			Сообщение.Текст	= "Не удалось загрузить строку " + Строка(сч);
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 26.09.24 УА #65981

//+ ИнфоСофт Сумин Д.В. 01.09.2023 УА #61252
&НаСервере
Функция ПолучитьРезультатПроверкиСопоставленияЯМ() 
	
	ОшибкаСопоставления = Ложь;
	
	Для Каждого Строка Из СписокТранзакцийExcelЯМ Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			ОшибкаСопоставления = Истина;			
		КонецЕсли;
	КонецЦикла;

	Если ОшибкаСопоставления Тогда
		Сообщение = "Есть позиции, по которым не удалось найти сопоставление. Заполните пустые строки."; 
		Элементы.СписокТранзакцийExcelЯМ.Видимость = Истина; 
		ОбщегоНазначения.СообщитьПользователю(Сообщение);

	КонецЕсли; 
	
	Элементы.ПоказатьПунктДва.Видимость = Ложь;
	Элементы.ГруппаНастройкиСозданиеДокументов.Видимость = Истина;
	
	Возврат ОшибкаСопоставления;
		
КонецФункции //- ИнфоСофт Сумин Д.В. 01.09.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаСервере
Процедура ЗаписатьДанныеПродаж()  
	
	НачатьТранзакцию();	
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ИС_ЯМ_Продажи");
		ЭлементБлокировкиДанных.УстановитьЗначение("Профиль", Профиль);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Для Каждого Элемент Из СписокТранзакцийExcelЯМ Цикл
			МенеджерЗаписи = РегистрыСведений.ИС_ЯМ_Продажи.СоздатьМенеджерЗаписи(); 
			
			//+ ИнфоСофт Мурсалимов Д.Р. 19.08.24 УА #81931
			//МенеджерЗаписи.Профиль 						= Элемент.Профиль;
			МенеджерЗаписи.Профиль 						= Профиль;
			//- ИнфоСофт Мурсалимов Д.Р. 19.08.24 УА #81931
			
			МенеджерЗаписи.Sku 							= Элемент.Sku;
			МенеджерЗаписи.НомерЗаказа 					= Элемент.НомерЗаказа;
			МенеджерЗаписи.ПродажаЮрЛицу 				= Элемент.ПродажаЮрЛицу;
			МенеджерЗаписи.ИннПокупателя 				= Элемент.ИннПокупателя;
			МенеджерЗаписи.ДатаОформленияЗаказа 		= Элемент.ДатаОформленияЗаказа;
			МенеджерЗаписи.ДатаПередачиТовараВДоставку  = Элемент.ДатаПередачиТовараВДоставку;
			МенеджерЗаписи.ДатаДоставкиТовара 			= Элемент.ДатаДоставкиТовара;
			//+ ИнфоСофт Заварин К.В. 11.11.24 УА #87034
			МенеджерЗаписи.ДатаПриёмаВозврата 			= Элемент.ДатаПриёмаВозврата;
			//- ИнфоСофт Заварин К.В. 11.11.24 УА #87034
			МенеджерЗаписи.СпособОплаты 				= Элемент.СпособОплаты;
			МенеджерЗаписи.АдресКлиента 				= Элемент.АдресКлиента;
			МенеджерЗаписи.НаименованиеКлиента 			= Элемент.НаименованиеКлиента;
			МенеджерЗаписи.ЦенаПродавца 				= Элемент.ЦенаПродавца;
			МенеджерЗаписи.ЦенаРеализация 				= Элемент.ЦенаРеализация;
			МенеджерЗаписи.Количество 					= Элемент.Количество; 	
			МенеджерЗаписи.ВозвратКоличество		 	= Элемент.ВозвратКоличество;
			МенеджерЗаписи.ВозвратЦенаРеализации 		= Элемент.ВозвратЦенаРеализации;
			МенеджерЗаписи.ВозвращеноНаСумму 			= Элемент.ВозвращеноНаСумму;
			МенеджерЗаписи.РеализованоНаСумму 			= Элемент.РеализованоНаСумму; 
			
			//+ ИнфоСофт Власова И.С. 22.04.25 УА #99750
			МенеджерЗаписи.НаименованиеТовара 			= Элемент.НаименованиеТовара;
			//- ИнфоСофт Власова И.С. 22.04.25 УА #99750
			
			МенеджерЗаписи.Записать();

		КонецЦикла;	
				
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Заметки'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252

#КонецОбласти

#Область ВторойЭтапЯМ 

//+ ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252
&НаСервере
Процедура ПолучитьСписокТранзакцийПродаж() 
	СписокТранзакцийExcelЯМ.Загрузить(ПолучитьСписокПродаж(Период));	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252 

//+ ИнфоСофт Сумин Д.В. 18.08.2023 УА #61252
&НаСервере
Функция ПолучитьРезультатПроверкиПродажЮрЛицам() 
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("РеализацияЧерезКомиссионера", Истина);
	РезультатПроверки.Вставить("СообщениеПользователю", "");

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИС_ЯМ_Продажи.НомерЗаказа КАК НомерЗаказа,
	|	ИС_ЯМ_Продажи.НаименованиеКлиента КАК НаименованиеКлиента,
	|	ИС_ЯМ_Продажи.АдресКлиента КАК АдресКлиента,
	|	ИС_ЯМ_Продажи.ИннПокупателя КАК ИНН
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_Продажи КАК ИС_ЯМ_Продажи
	|ГДЕ
	|	ИС_ЯМ_Продажи.Профиль = &Профиль
	|	И ИС_ЯМ_Продажи.ПродажаЮрЛицу
	//+ ИнфоСофт Заварин К.В. 12.11.24 УА #87034
	//|	И ИС_ЯМ_Продажи.ДатаОформленияЗаказа МЕЖДУ &ДатаНачала И &ДатаОкончания"); 
	|	И ИС_ЯМ_Продажи.ДатаДоставкиТовара МЕЖДУ &ДатаНачала И &ДатаОкончания");
	//- ИнфоСофт Заварин К.В. 12.11.24 УА #87034
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала); 
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		РезультатПроверки.Вставить("РеализацияЧерезКомиссионера", Ложь);
		РезультатПроверки.Вставить("СообщениеПользователю", "В данном периоде не найдены продажи юр. лицам. Реализация через комиссионера не требуется. Перейдите к пункту 3.");	
		Возврат РезультатПроверки;	
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		
		НоваяСтрокаКонтрагент = ЯндексКонтрагенты.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаКонтрагент, Выборка);

	КонецЦикла; 
	
	Возврат РезультатПроверки; 
	
КонецФункции //- ИнфоСофт Сумин Д.В. 18.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 18.08.2023 УА #61252
&НаСервере
Функция ПолучитьРезультатСопоставленияКонтрагентов() 
	
	//+ ИнфоСофт Заварин К.В. 04.03.25 УА #95036
	МассивНаименованийПараметров = Новый Массив;	
	
	МассивНаименованийПараметров.Добавить("ДоговорЯМ");
	МассивНаименованийПараметров.Добавить("ПартнерЯМ");
	МассивНаименованийПараметров.Добавить("КонтрагентЯМ");

	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);
	//- ИнфоСофт Заварин К.В. 04.03.25 УА #95036
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.НомерЗаказа КАК НомерЗаказа,
	|	Контрагенты.НаименованиеКлиента КАК НаименованиеКлиента,
	|	Контрагенты.АдресКлиента КАК Адрес
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&Контрагенты КАК Контрагенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.ИНН КАК ИНН,
	|	ВТ_Данные.НомерЗаказа КАК НомерЗаказа,
	|	ВТ_Данные.Адрес КАК Адрес,
	|	ВТ_Данные.НаименованиеКлиента КАК НаименованиеКлиента,
	|	Партнеры.Ссылка КАК Партнер,
	|	Контрагенты.Ссылка КАК Контрагент
	|ПОМЕСТИТЬ ВТ_Контрагенты
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|			ПО Контрагенты.Партнер = Партнеры.Ссылка
	|		ПО ВТ_Данные.ИНН = Контрагенты.ИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Контрагенты.ИНН КАК ИНН,
	|	МАКСИМУМ(ДоговорыКонтрагентов.Ссылка) КАК Договор,
	|	МАКСИМУМ(ВТ_Контрагенты.НаименованиеКлиента) КАК НаименованиеКлиента,
	|	МАКСИМУМ(ВТ_Контрагенты.Адрес) КАК Адрес,
	|	МАКСИМУМ(СоглашенияСКлиентами.Ссылка) КАК Соглашение
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	ВТ_Контрагенты КАК ВТ_Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (ВТ_Контрагенты.Контрагент = ДоговорыКонтрагентов.Контрагент
	|				И ВТ_Контрагенты.Партнер = ДоговорыКонтрагентов.Партнер
	|				И ВЫБОР
	|					КОГДА &КомиссионныеПродажи25
	|						ТОГДА ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.РеализацияЧерезКомиссионера)
	|					ИНАЧЕ ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|				КОНЕЦ
	|				И ДоговорыКонтрагентов.Организация = &Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|		ПО (ВТ_Контрагенты.Контрагент = СоглашенияСКлиентами.Контрагент
	|				И ВЫБОР
	|					КОГДА &КомиссионныеПродажи25
	|						ТОГДА СоглашенияСКлиентами.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКОмиссию)
	|					ИНАЧЕ СоглашенияСКлиентами.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|				КОНЕЦ
	|				И СоглашенияСКлиентами.Организация = &Организация)
	//+ ИнфоСофт Заварин К.В. 04.03.25 УА #95036
	|
	|ГДЕ
	|	ДоговорыКонтрагентов.КомиссионерКонтрагент = &КомиссионерКонтрагент
	|
	//- ИнфоСофт Заварин К.В. 04.03.25 УА #95036
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Контрагенты.ИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Контрагенты.ИНН КАК ИНН,
	|	ВТ_Контрагенты.НомерЗаказа КАК НомерЗаказа,
//+ ИнфоСофт Сумин Д.В. 03.05.2024 УА #67144
	|	ВТ_Контрагенты.Адрес КАК АдресКлиента,
	//|	ВТ_Контрагенты.Адрес КАК Адрес,
//- ИнфоСофт Сумин Д.В. 03.05.2024 УА #67144
	|	ВТ_Контрагенты.НаименованиеКлиента КАК НаименованиеКлиента,
	|	ВТ_Контрагенты.Партнер КАК Партнер,
	|	ВТ_Контрагенты.Контрагент КАК Контрагент,
	|	ВТ_Договоры.Договор КАК Договор,
	|	ВТ_Договоры.Соглашение КАК Соглашение
	|ИЗ
	|	ВТ_Контрагенты КАК ВТ_Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Договоры КАК ВТ_Договоры
	|		ПО ВТ_Контрагенты.ИНН = ВТ_Договоры.ИНН");
	
	Запрос.УстановитьПараметр("Контрагенты", 			ЯндексКонтрагенты.Выгрузить()); 
	Запрос.УстановитьПараметр("Организация", 			Профиль.Организация);
	Запрос.УстановитьПараметр("КомиссионныеПродажи25", 	ПолучитьВерсиюКомиссии());
	//+ ИнфоСофт Заварин К.В. 04.03.25 УА #95036
	Запрос.УстановитьПараметр("КомиссионерКонтрагент", 	Настройки["КонтрагентЯМ"]);
	//- ИнфоСофт Заварин К.В. 04.03.25 УА #95036
	
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ЯндексКонтрагенты.Очистить();
	
	//+ ИнфоСофт Заварин К.В. 04.03.25 УА #95036
	//+ ИнфоСофт Сумин Д.В. 02.05.2024 УА #67144
	//МассивНаименованийПараметров = Новый Массив;	
	//
	//МассивНаименованийПараметров.Добавить("ДоговорЯМ");
	//МассивНаименованийПараметров.Добавить("ПартнерЯМ");
	//МассивНаименованийПараметров.Добавить("КонтрагентЯМ");
		
	//Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);
	//- ИнфоСофт Заварин К.В. 04.03.25 УА #95036
	
	//+ ИнфоСофт Власова И.С. 02.08.24 УА #80469
	СтруктураДанных = ИС_MP_Сервер.ПолучитьСтруктуруДляСозданияКонтрагента();
	СтруктураДанных.Маркетплейс           = Перечисления.ИС_МП_Маркетплейсы.ЯМ;
	//- ИнфоСофт Власова И.С. 02.08.24 УА #80469
	
	//+ ИнфоСофт Власова И.С. 05.08.24 УА #81190
	СтруктураДанных.КомиссионныеПродажи25 = ИС_MP_Сервер.ПолучитьВерсиюКомиссионныхПродаж(Профиль, СтруктураДанных.Маркетплейс);
	
	Если СтруктураДанных.КомиссионныеПродажи25 = Неопределено Тогда
		Возврат "НеЗаполненыДанныеКомиссии";
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 05.08.24 УА #81190
	
	РезультатПроверки = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ЯндексКонтрагенты.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если Не ЗначениеЗаполнено(Выборка.Контрагент) Тогда
			
			Если АвтоматическиСоздатьКонтрагентовЯМ Тогда
				
				//+ ИнфоСофт Власова И.С. 01.04.25 УА #97214
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ИНН", Выборка.ИНН);
				
				СтрокиПоКонтрагенту = ЯндексКонтрагенты.НайтиСтроки(СтруктураОтбора);
				
				Для Каждого СтрокаКонтрагента Из СтрокиПоКонтрагенту Цикл
					
					Если ЗначениеЗаполнено(СтрокаКонтрагента.Контрагент) Тогда
						
						НоваяСтрока.Партнер    = СтрокаКонтрагента.Партнер;
						НоваяСтрока.Контрагент = СтрокаКонтрагента.Контрагент;
						НоваяСтрока.Договор    = СтрокаКонтрагента.Договор;
						НоваяСтрока.Соглашение = СтрокаКонтрагента.Соглашение;
						
						Прервать;
						
					КонецЕсли;	
					
				КонецЦикла;
				
				Если ЗначениеЗаполнено(НоваяСтрока.Контрагент) Тогда
					Продолжить;
				КонецЕсли;
				//- ИнфоСофт Власова И.С. 01.04.25 УА #97214
				
				//+ ИнфоСофт Власова И.С. 02.08.24 УА #80469
				//ДанныеКонтрагента = ИС_MP_Сервер.СоздатьКонтрагента(Профиль.Организация, Настройки, Выборка);
				
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
				ДанныеКонтрагента = ИС_MP_Сервер.СоздатьКонтрагента(Профиль.Организация, Настройки, СтруктураДанных);
				//- ИнфоСофт Власова И.С. 02.08.24 УА #80469
				
				НоваяСтрока.Партнер 			= ДанныеКонтрагента.Партнер;
				НоваяСтрока.Контрагент 			= ДанныеКонтрагента.Контрагент;
				НоваяСтрока.Договор 			= ДанныеКонтрагента.Договор;
				НоваяСтрока.Соглашение 			= ДанныеКонтрагента.Соглашение;
			Иначе	
				РезультатПроверки = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 18.08.2023 УА #61252

#КонецОбласти 

#Область ТретийЭтапЯМ

//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
&НаСервере
Функция СформироватьРеализациюЧерезКомиссионераНаСервере() 

	МассивНаименованийПараметров = Новый Массив;
	
	МассивНаименованийПараметров.Добавить("СоглашениеЯМ");
	МассивНаименованийПараметров.Добавить("ДоговорЯМ");
	//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
	МассивНаименованийПараметров.Добавить("КонтрагентЯМ");
	//- ИнфоСофт Власова И.С. 06.08.24 УА #67453
	
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);

	//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
	//КомиссионныеПродажи25 = ПолучитьВерсиюКомиссии(Настройки);
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ;
	
	КомиссионныеПродажи25 = ИС_MP_Сервер.ПолучитьВерсиюКомиссионныхПродаж(Профиль, Маркетплейс);
	
	ПараметрыОтбора = Новый Структура("ПродажаЮрЛицу", Ложь);
		
	ЕстьРозничныеПродажи = ?(СписокТранзакцийExcelЯМ.Выгрузить(ПараметрыОтбора).Количество() > 0, Истина, Ложь);
	
	Если ((КомиссионныеПродажи25 Или ЕстьРозничныеПродажи) И Не ВыполнитьПроверкуЗаполненияНастроекПрофиля(Профиль, Маркетплейс, Настройки)) 
		Или (ЯндексКонтрагенты.Количество() > 0 И Не ВыполнитьПроверкуЗаполненияДанныхПоКлиентам("Яндекс", КомиссионныеПродажи25)) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 06.08.24 УА #67453	
	
	СформироватьРеализацииЧерезКомиссионера(КомиссионныеПродажи25, Настройки);
	Элементы.СозданныеДокументы.Видимость = Истина;
	
	//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
	Возврат Истина;
	//- ИнфоСофт Власова И.С. 06.08.24 УА #67453

КонецФункции // ИнфоСофт Власова И.С. 06.08.24 УА #67453

//+ ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252
&НаСервере
//+ ИнфоСофт Власова И.С. 06.08.24 УА #81190
//Процедура СформироватьОтчетаКомиссионераНаСервере()
Процедура СформироватьОтчетКомиссионераНаСервере()
//- ИнфоСофт Власова И.С. 06.08.24 УА #81190  
	
	Комментарий = "Отчет комисисонера за период с " + Период.ДатаНачала + " по " + Период.ДатаОкончания;
	
	//+ ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897	
	Если ВариантФормированияЦеныВозврата = 1 И Не ЗначениеЗаполнено(ВидЦеныВозврата) Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Не выбран вид цены");
		Возврат;
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СпособРасчетаЦеныВозврата", Новый Структура("СпособРасчета, ВидЦены", ВариантФормированияЦеныВозврата, ВидЦеныВозврата));       
	
	//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
	СтруктураПараметров.Вставить("ЗаполнитьКолонкуПокупательЯМ", ЗаполнитьКолонкуПокупательЯМ);	 
	//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
	//+ ИнфоСофт Власова И.С. 10.12.24 УА #87450
	СтруктураПараметров.Вставить("РозничныйПокупательЯМ",        РозничныйПокупательЯМ);
	//- ИнфоСофт Власова И.С. 10.12.24 УА #87450
	//+ ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94609
	СтруктураПараметров.Вставить("Профиль", 					   Профиль);
	//- ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94609
	
	//Отчет = ИС_ЯМ_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокТранзакцийExcelЯМ, Комментарий); 
	Отчет = ИС_ЯМ_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокТранзакцийExcelЯМ, Комментарий, СтруктураПараметров); 
	//- ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
	
	Элементы.СозданныеДокументы.Видимость = Истина;
	
	ДобавитьНовыйДокумент(Отчет);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.08.2023 УА #61252

#КонецОбласти 
