
#Область ОбработчикиСобытий

//+ ИнфоСофт Власова И.С. 10.03.25 УА #90120
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;                                     
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ламода_Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_Ламода_Склады КАК ИС_Ламода_Склады
		|ГДЕ
		|	ИС_Ламода_Склады.Профиль = &Профиль
		|	И НЕ ИС_Ламода_Склады.ПометкаУдаления";
		
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() И Не ЗначениеЗаполнено(Ссылка) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Для каждого Профиля Маркетплейса можно создать только один склад Lamoda");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 10.03.25 УА #90120

#КонецОбласти
