
#Область ПрограммныйИнтерфейс

#Область Товары

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
Функция ПолучитьСписокТоваров(Профиль, ПараметрыЗапроса, СтруктураЗапроса) Экспорт

	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698	
	//ПараметрыЗапроса.АдресРесурса = "/v2/product/list";
	ПараметрыЗапроса.АдресРесурса = "/v3/product/list";
	//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(СтруктураЗапроса); 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
    //- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ, Истина);
			
			Если ТипЗнч(JSON) = Тип("Соответствие") Тогда				
				Возврат JSON["result"];	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
Функция ПолучитьСписокТоваровПоИдентификаторам(Профиль, ПараметрыЗапроса, МассивИдентификаторов) Экспорт

	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698	
	//ПараметрыЗапроса.АдресРесурса = "/v2/product/info/list";
	ПараметрыЗапроса.АдресРесурса = "/v3/product/info/list";
	//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	СтруктураЗапроса = Новый Структура("offer_id", МассивИдентификаторов);
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(СтруктураЗапроса); 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
    //- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ, Истина);
			
			Если ТипЗнч(JSON) = Тип("Соответствие") Тогда
				//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698				
				//Возврат JSON["result"];	                    
				Возврат JSON;	                    
				//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127

//+ ИнфоСофт Стояк Ю.К. 05.02.2023 УА #54628
Функция ИнформацияОбУценкеИОсновномТовареПоSKU(Профиль, ПараметрыЗапроса, СтруктураТела) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v1/product/info/discounted";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("discounted_skus", СтруктураТела);  
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса); 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
    //- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.items;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 05.02.2023 УА #546288

//+ ИнфоСофт Украинцева А.А. 16.11.2023 УА #61983 
// Лимиты на ассортимент, создание и обновление товаров. http метод POST /v4/product/info/limit
// Метод для получения информации о лимитах:
// На ассортимент - сколько всего товаров можно создать в вашем личном кабинете.
// На создание товаров - сколько товаров можно создать в сутки.
// На обновление товаров - сколько товаров можно отредактировать в сутки.
// Если у вас есть лимит на ассортимент и вы израсходуете его, вы не сможете создавать новые товары.
//
// Параметры:
// 	ПараметрыПодключения - Структура - Параметры подключения к API OzonSeller.
// 	
// Возвращаемое значение:
//  - Соответствие - Результат:
//		* daily_create - Соответствие - Суточный лимит на создание товаров:
//			** limit - Число - Сколько всего товаров можно создать в сутки.
//			** reset_at - Строка - Время в формате UTC, когда сбросится значение счётчика за текущие сутки.
//			** usage - Число - Сколько товаров создано за текущие сутки.
//		* daily_update - Соответствие - Суточный лимит на обновление товаров:
//			** limit - Число - Сколько всего товаров можно обновить в сутки.
//			** reset_at - Строка - Время в формате UTC, когда сбросится значение счётчика за текущие сутки.
//			** usage - Число - Сколько товаров обновлено за текущие сутки.
//		* total - Соответствие - Лимит на ассортимент:
//			** limit - Число - Сколько всего товаров можно создать в личном кабинете.
//			** usage - Число - Сколько товаров уже создано.
//
Функция ЛимитыНаАссортиментСозданиеИОбновлениеТоваров(ПараметрыЗапроса) Экспорт
	
	Результат = Новый Соответствие;     
	
		
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");  
	
	ПараметрыЗапроса.АдресРесурса = "/v4/product/info/limit";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ, Истина);
			
			Если ТипЗнч(JSON) = Тип("Соответствие") Тогда				
				Возврат JSON;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;			
	КонецЕсли;  	
КонецФункции //- ИнфоСофт Украинцева А.А. 16.11.2023 УА #61983

//+ ИнфоСофт Стояк Ю.К. 20.01.2024 УА #61983
Функция ПолучитьДеревоКатегорий(ПараметрыЗапроса, category_id = Неопределено, language = "RU") Экспорт
		
	//+ ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269
	//ПараметрыЗапроса.АдресРесурса = "/v2/category/tree";
	ПараметрыЗапроса.АдресРесурса = "/v1/description-category/tree";
	//- ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	Тело = Новый Структура;
	//+ ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269	
	//Если ЗначениеЗаполнено(category_id) Тогда
	//	Тело.Вставить("category_id", category_id);
	//КонецЕсли;                                
	//- ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269
	Тело.Вставить("language", language);
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Тело);  
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 20.01.2024 УА #61983
// Список сертификатов. http метод POST /v1/product/certification/list
//
// Параметры:
//  ПараметрыПодключения - Структура.
//  page		 - Число - Номер страницы, возвращаемой в запросе.
//  page_size	 - Число - Количество элементов на странице.
// 
// Возвращаемое значение:
//  Массив из Соответствие - Список сертификатов:
//		* category_name - Строка - Наименование категории товаров.
//		* is_required 	- Булево - Используется сертификат.
//        
Функция КатегорииСОбязатетльнымиСертификатами(ПараметрыЗапроса, page = 1, page_size = 250) Экспорт 
	
	ПараметрыЗапроса.АдресРесурса = "/v1/product/certification/list";
	ПараметрыЗапроса.ФорматОтвета = "Строка";	

	Результат = Новый Массив;

	Тело = Новый Структура;
	Тело.Вставить("page_size", page_size);

	НомерСтраницы = 1;
	ВыполнитьЗапрос = Истина;
	
	Пока ВыполнитьЗапрос Цикл

		Тело.Вставить("page", НомерСтраницы);
		
		ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Тело);  
		
		РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
		
		Если РезультатЗапроса.ЕстьОшибки Тогда
			Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
			ОбщегоНазначения.СообщитьПользователю(Текст);  
			result = Неопределено;	
		Иначе
			
			Если РезультатЗапроса.КодОтвета = 200 Тогда
				
				JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
				
				Если ТипЗнч(JSON) = Тип("Структура") Тогда				
					result = JSON.result.certification;	
				Иначе
					Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
					ОбщегоНазначения.СообщитьПользователю(Текст);
					result = Неопределено;
				КонецЕсли;
				
			Иначе
				
				РазобратьHTTPОтветПоКоду(РезультатЗапроса);
				result = Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;

		Если ЗначениеЗаполнено(result) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, result);
			Если result.Количество() < page_size Тогда
				Прервать;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;

		НомерСтраницы = НомерСтраницы + 1;

	КонецЦикла;  
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 20.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 20.01.2024 УА #61983
Функция ПолучитьАтрибутыДляКатегорииТоваров(ПараметрыЗапроса, category_id, attribute_type = "ALL", language = "RU") Экспорт
	
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	//+ ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269	
	//ПараметрыЗапроса.АдресРесурса = "/v3/category/attribute";
	ПараметрыЗапроса.АдресРесурса = "/v1/description-category/attribute"; 
	
	//Если ТипЗнч(category_id) = Тип("Число") Тогда
	//	СписокКатегорий = Новый Массив;
	//	СписокКатегорий.Добавить(category_id);
	//Иначе
	//	СписокКатегорий = category_id;
	//КонецЕсли;
	
	Тело = Новый Структура;
	//Тело.Вставить("attribute_type", attribute_type);
	Тело.Вставить("language", language);
	
	//- ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269

	Результат = Новый Массив;
	НомерЗапроса = 1; 
	
	Для Каждого Элемент Из category_id Цикл 
		
	//+ ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269	
	//Пока Истина Цикл

		//СрезЗначенийОтбора = ИС_Ozon_Сервер.СрезМассива(СписокКатегорий, НомерЗапроса, 20);
		//Если Не ЗначениеЗаполнено(СрезЗначенийОтбора) Тогда
		//	Прервать;
		//КонецЕсли;                            		
		
		Тело.Вставить("type_id", Элемент.type_id);
		Тело.Вставить("description_category_id", Элемент.Код);  
		//- ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269
		
		ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Тело);  
		
		РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
		
		Если РезультатЗапроса.ЕстьОшибки Тогда
			Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
			ОбщегоНазначения.СообщитьПользователю(Текст);  			
		Иначе
			
			Если РезультатЗапроса.КодОтвета = 200 Тогда
				
				JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
				
				Если ТипЗнч(JSON) = Тип("Структура") Тогда				
					attributes = JSON.result;					
					Если ЗначениеЗаполнено(attributes) Тогда
						Атрибуты = Новый Структура("type_id, attributes", Элемент.type_id, attributes);
						Буфер = Новый Массив;
						Буфер.Добавить(Атрибуты);
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, Буфер);
					КонецЕсли;
				Иначе
					Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
					ОбщегоНазначения.СообщитьПользователю(Текст);					
				КонецЕсли;
				
			Иначе
				
				РазобратьHTTPОтветПоКоду(РезультатЗапроса);				
				
			КонецЕсли;
			
		КонецЕсли;
	
		НомерЗапроса = НомерЗапроса + 1;

	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 20.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 20.01.2024 УА #61983
Функция ПолучитьЗначенияАтрибутаКатегории(ПараметрыЗапроса, type_id, attribute_id, description_category_id, last_value_id = 0,
	limit = 2500, language = "RU") Экспорт
	
	//+ ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269	
	//ПараметрыЗапроса.АдресРесурса = "/v2/category/attribute/values";
	ПараметрыЗапроса.АдресРесурса = "/v1/description-category/attribute/values";
	//- ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269
	ПараметрыЗапроса.ФорматОтвета = "Строка";

	ИмяПроцедуры = "ПолучитьЗначенияАтрибутаКатегории";	

	Результат = Новый Массив;

	Тело = Новый Структура;                                         
	//+ ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269	
	Тело.Вставить("type_id", type_id);
	Тело.Вставить("description_category_id", description_category_id);
	//- ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269
	Тело.Вставить("attribute_id", attribute_id);
	Тело.Вставить("language", language);
	Тело.Вставить("limit", limit);

	ВыполнитьЗапрос = Истина;
	Пока ВыполнитьЗапрос Цикл

		Тело.Вставить("last_value_id", last_value_id);		
		
		ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Тело);  
		
		РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса); 
				
		Если РезультатЗапроса.ЕстьОшибки Тогда
			Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
			ОбщегоНазначения.СообщитьПользователю(Текст);  			
		Иначе
			
			Если РезультатЗапроса.КодОтвета = 200 Тогда
				
				JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
				
				Если ТипЗнч(JSON) = Тип("Структура") Тогда				
					result = JSON.result;
					Если ЗначениеЗаполнено(result) Тогда
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, result); 
						last_value_id = result[result.ВГраница()].id;
					КонецЕсли;
					ВыполнитьЗапрос = JSON.has_next;
				Иначе
					Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
					ОбщегоНазначения.СообщитьПользователю(Текст);					
				КонецЕсли;
				
			Иначе
				
				РазобратьHTTPОтветПоКоду(РезультатЗапроса);				
				
			КонецЕсли;
			
		КонецЕсли;

		Если Не ЗначениеЗаполнено(ВыполнитьЗапрос) Тогда
			Прервать;
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 20.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
// Получить атрибуты товаров POST /v3/products/info/attributes
//
// Параметры:
//  ПараметрыПодключения - Структура.
//  offer_id	 - Массив из Строка	 - Идентификатор товара в системе продавца - артикул.
//  product_id	 - Массив из Число	 - Идентификатор товара.
//	visibility 	- Строка 			- Фильтр по видимости товара, возможные значения:
// 									ALL - все товары.
//									VISIBLE - товары, которые видны покупателям.
//									INVISIBLE - товары, которые по какой-то из причин не видны покупателям.
//									EMPTY_STOCK - товары, у которых не указано наличие.
//									NOT_MODERATED - товары, которые не прошли модерацию.
//									MODERATED - товары, которые прошли модерацию.
//									DISABLED - товары, которые видны покупателям, но недоступны к покупке.
//									STATE_FAILED - товары, создание которых завершилось ошибĸой.
//									READY_TO_SUPPLY - товары, готовые к поставке.
//									VALIDATION_STATE_PENDING - товары, которые проходят проверку на премодерации (валидатором).
//									VALIDATION_STATE_FAIL - товары, которые не прошли проверку на премодерации (валидатором).
//									VALIDATION_STATE_SUCCESS - товары, которые прошли проверку на премодерации (валидатором).
//									TO_SUPPLY - товары, готовые к продаже.
//									IN_SALE - товары в продаже.
//									REMOVED_FROM_SALE - товары, скрытые от покупателей.
//									BANNED - заблокированные товары.
//									OVERPRICED - товары с завышенной ценой.
//									CRITICALLY_OVERPRICED - товары со слишком завышенной ценой.
//									EMPTY_BARCODE - товары без штрихкода.
//									BARCODE_EXISTS - товары со штрихкодом.
//									QUARANTINE - товары на карантине после изменения цены более чем на 50%.
//									ARCHIVED - товары в архиве.
//									OVERPRICED_WITH_STOCK - товары в продаже со стоимостью выше, чем у конкурентов.
//									PARTIAL_APPROVED - товары в продаже с пустым или неполным описанием.
//									IMAGE_ABSENT - товары без изображений.
//									MODERATION_BLOCK - товары, для которых заблокирована модерация.
//  limit		- Число  - Количество значений на странице.
//  last_id	 	- Строка - Идентификатор последнего значения на странице. Оставьте это поле пустым при выполнении первого 
//  						запроса. Чтобы получить следующие значения, укажите last_id из ответа предыдущего запроса.
// 
// Возвращаемое значение:
//  Массив из Соответствие:
//		* attributes - Массив из Соответствие - Массив с характеристиками товара. Характеристики отличаются для разных категорий:
//			** attributeId  - Число - Идентификатор характеристики. 
//			** complex_id   - Число - Идентификатор характеристики, которая поддерживает вложенные свойства. Например, у характеристики Процессор есть вложенные характеристики Производитель, L2 Cache, и другие. У каждой из вложенных характеристик может быть несколько вариантов значений.
//			** value   		- Массив из Соответствие - Массив вложенных значений характеристики:
//				*** dictionaryValueId   - Число  - Идентификатор справочника.
//				*** value   			- Строка - Значение справочника.
//		* barcode 			- Строка - Штрихкод товара.
//		* category_id 		- Число  - Идентификатор категории.
//		* color_image		- Строка - Маркетинговый цвет.
//		* complex_attributes - Массив из Соответствие - Массив характеристик:
//			** attributes - Массив из Соответствие - Массив характеристик:
//				*** complex_id   - Число - Идентификатор характеристики, которая поддерживает вложенные свойства. Например, у характеристики Процессор есть вложенные характеристики Производитель, L2 Cache, и другие. У каждой из вложенных характеристик может быть несколько вариантов значений.
//				*** attributeId  - Число  - Идентификатор характеристики.
//				*** value - Массив из Соответствие - Массив вложенных значений характеристики:
//					**** dictionaryValueId   	- Число  - Идентификатор справочника.
//					**** value   				- Строка - Значение справочника.
//		* depth  			- Число  - Глубина упаковки.
//		* dimension_unit  	- Строка - Единица измерения габаритов. mm - миллиметры, cm - сантиметры, in - дюймы.
//		* height   			- Число  - Высота упаковки.
//		* id	   			- Число  - ?.
//		* image_group_id   	- Строка - Идентификатор для последующей пакетной загрузки изображений.
//		* images - Массив из Соответствие - Массив с изображениями:
//			** default  	- Булево - Изображение по умолчанию. 
//			** file_name   	- Строка - Наименование изображения.
//			** index   		- Число  - Идентификатор изображения.
//		* images360 - Массив из Соответствие - Массив с изображениями:
//			** file_name  	- Строка - Наименование изображения. 
//			** index   		- Число  - Идентификатор изображения.
//		* name   			- Строка - Название товара.
//		* offer_id   		- Строка - Идентификатор товара в системе продавца - артикул.
//		* pdf_list    		- Массив из Соответствие - Массив pdf-файлов:
//			** index   		- Число  - Индекс файла.
//			** file_name    - Строка - URL ссылка на файл.
//			** name  		- Строка - Наименование файла.
//		* weight     		- Число  - Вес товара в упаковке.
//		* weight_unit      	- Строка - Единицы измерения веса: g - граммы, kg - килограммы, lb - фунты.
//		* width       		- Число  - Ширина упаковки.
//
Функция ПолучитьАтрибутыТоваров(ПараметрыЗапроса, offer_id = Неопределено, product_id = Неопределено, visibility = "ALL") Экспорт

	limit = 1000; 
	last_id = "";
	
	//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698	
	//ПараметрыЗапроса.АдресРесурса = "/v3/products/info/attributes";
	ПараметрыЗапроса.АдресРесурса = "/v4/products/info/attributes";
	//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
	ПараметрыЗапроса.ФорматОтвета = "Строка";

	ИмяПроцедуры = "ПолучитьАтрибутыТоваров";	

	Результат = Новый Массив;

	filter = Новый Структура;
	filter.Вставить("visibility", visibility);

	Если ЗначениеЗаполнено(offer_id) Тогда
		filter.Вставить("offer_id", offer_id);
	КонецЕсли;
	Если ЗначениеЗаполнено(product_id) Тогда
		filter.Вставить("product_id", product_id);
	КонецЕсли;

	Тело = Новый Структура;
	Тело.Вставить("filter", filter);
	Тело.Вставить("limit", limit);

	ВыполнитьЗапрос = Истина;
	Пока ВыполнитьЗапрос Цикл

		Тело.Вставить("last_id", last_id);

		ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Тело);  
		
		РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
		
		Если РезультатЗапроса.ЕстьОшибки Тогда
			Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
			ОбщегоНазначения.СообщитьПользователю(Текст);  			
		Иначе
			
			Если РезультатЗапроса.КодОтвета = 200 Тогда
				
				JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
				
				Если ТипЗнч(JSON) = Тип("Структура") Тогда				
					result = JSON.result;
					last_id = JSON.last_id;
				Иначе
					Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
					ОбщегоНазначения.СообщитьПользователю(Текст);					
					result = Неопределено;
				КонецЕсли;
				
			Иначе
				
				РазобратьHTTPОтветПоКоду(РезультатЗапроса);				
				result = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		

		Если ЗначениеЗаполнено(result) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, result);
			Если result.Количество() < limit Тогда
				Прервать;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
// Загрузить товары на Ozon. http метод POST /v3/product/import
// Загрузите свои товары на Ozon. В одном запросе можно передать до 1000 товаров. 
// Каждый товар - это отдельный элемент в массиве items. Укажите всю информацию о товаре: 
// его характеристики, штрихкод, изображения, габариты и цену.
// Характеристики зависят от категории товара.
// После модерации товар появится в вашем личном кабинете, но не будет виден пользователям, пока вы не выставите его на продажу.
// Каждый товар в запросе - отдельный элемент массива items.
//
// Параметры:
//  ПараметрыПодключения - Структура.
//  items - Массив из Структура - Массив с товарами:
//		* name   			- Строка - Название товара. До 500 символов.
//		* barcode 			- Строка - Штрихкод товара.
//		* offer_id   		- Строка - Идентификатор товара в системе продавца - артикул.
//		* description_category_id - Число  - Идентификатор категории.
//		* color_image		- Строка - Маркетинговый цвет.
//		* old_price   		- Строка - Цена до скидок (будет зачеркнута на карточке товара). Указывается в рублях. Разделитель дробной части - точка, до двух знаков после точки.
//		* premium_price    	- Строка - Цена для клиентов с подпиской Ozon Premium.
//		* price    			- Строка - Цена товара с учетом скидок, отображается на карточке товара. Если на товар нет скидок - укажите значение old_price.
//		* vat    			- Строка - Ставка НДС для товара. 0 - не облагается НДС, 0.1 - 10%, 0.2 - 20%.
//		* depth  			- Число  - Глубина упаковки.
//		* width       		- Число  - Ширина упаковки.
//		* height   			- Число  - Высота упаковки.
//		* dimension_unit  	- Строка - Единица измерения габаритов. mm - миллиметры, cm - сантиметры, in - дюймы.
//		* weight     		- Число  - Вес товара в упаковке. Предельное значение - 1000 килограмм или конвертированная величина в других единицах измерения.
//		* weight_unit      	- Строка - Единицы измерения веса: g - граммы, kg - килограммы, lb - фунты.
//		* primary_image		- Строка - Ссылка на главное изображение товара.
//		* images   			- Массив из Строка - Массив с изображениями, не больше 10.
//		* pdf_list    		- Массив из Структура - Список pdf-файлов:
//			** index   	- Число  - Индекс элемента массива.
//			** name    	- Строка - Имя файла.
//			** src_url  - Строка - Ссылка на файл.
//		* complex_attributes - Массив из Структура - Массив характеристик, у которых есть вложенные аттрибуты:
//			** attributes - Массив из Структура - Массив с характеристиками товара:
//				*** complex_id   - Число - Идентификатор характеристики, которая поддерживает вложенные свойства. Например, 
//											у характеристики Процессор есть вложенные характеристики Производитель, L2 Cache, и другие. 
//											У каждой из вложенных характеристик может быть несколько вариантов значений.
//				*** id - Число  - Идентификатор характеристики.
//				*** value - Массив из Структура - Массив вложенных значений характеристики:
//					**** dictionary_value_id   	- Число  - Идентификатор справочника.
//					**** value   				- Строка - Значение справочника.
//		* attributes - Массив из Структура - Массив с характеристиками товара. Характеристики отличаются для разных категорий:
//			** complex_id   - Число - Идентификатор характеристики, которая поддерживает вложенные свойства. Например, 
//									  	у характеристики Процессор есть вложенные характеристики Производитель, L2 Cache, и другие. 
//									  	У каждой из вложенных характеристик может быть несколько вариантов значений.
//			** id    		- Число  - Идентификатор характеристики.
//			** value   		- Массив из Структура - Массив вложенных значений характеристики:
//				*** dictionary_value_id   	- Число  - Идентификатор справочника.
//				*** value   				- Строка - Значение справочника.
// Возвращаемое значение:
//  Число - Номер задания на загрузку товаров.
//
Функция ЗагрузитьТоварыНаOzon(ПараметрыЗапроса, items) Экспорт
	
	//+ ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269	
	//ПараметрыЗапроса.АдресРесурса = "/v2/product/import";
	ПараметрыЗапроса.АдресРесурса = "/v3/product/import";
	//- ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269
	ПараметрыЗапроса.ФорматОтвета = "Строка";

	ИмяПроцедуры = "ЗагрузитьТоварыНаOzon";	

	Результат = 0;

	Тело = Новый Структура;
	Тело.Вставить("items", items);     
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Тело);  
		
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  			
		Возврат Неопределено;
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result.task_id;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);					
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);				
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 20.02.2025 УА #93500
//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
//Функция ОтправитьФайлКартинкиНаPicabox(ПараметрыЗапроса, Знач ИмяФайлаОтправки, Знач ИмяФайлаОтвета, Знач Boundary) Экспорт
Функция ОтправитьФайлКартинкиНаPicabox(ПараметрыЗапроса) Экспорт
//- ИнфоСофт Стояк Ю.К. 20.02.2025 УА #93500
	
	ПараметрыЗапроса.ФорматОтвета = "Строка";

	//+ ИнфоСофт Стояк Ю.К. 20.02.2025 УА #93500	
	//ПараметрыЗапроса.ИмяФайлаТела = ИмяФайлаОтправки;
	//- ИнфоСофт Стояк Ю.К. 20.02.2025 УА #93500
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
		
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  			
		Возврат Неопределено;
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ, Истина);
			
			Если ТипЗнч(JSON) = Тип("Соответствие") Тогда 
				
				МассивЗагруженныхКартинок = JSON.Получить("loaded_pics");
				Если МассивЗагруженныхКартинок <> Неопределено И МассивЗагруженныхКартинок.Количество() > 0 Тогда
					ДанныеОКартинке = МассивЗагруженныхКартинок[0].Получить("texts");
					Если ДанныеОКартинке <> Неопределено Тогда
						Возврат ДанныеОКартинке.Получить("url_full");
					КонецЕсли;
					
				КонецЕсли;   
				
				Возврат Неопределено; 
				
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);					
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			ПредставлениеОшибки = "Сервис формирования ссылок 'picabox.ru' не доступен. 
			|	Попробуйте повторить позже
			|	Или перенастройте сопоставление для свойства 'Ссылка на главное фото' на текстовый реквизит, содержащий прямую ссылку на фотографию товара";
			ОбщегоНазначения.СообщитьПользователю(ПредставлениеОшибки);			
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

#КонецОбласти

#Область Цены

//+ ИнфоСофт Стояк Ю.К. 05.02.2023 УА #54628
Функция ВыгрузитьЦеныOzon(Профиль, ПараметрыЗапроса, СтруктураТела) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v1/product/import/prices";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("prices", СтруктураТела);  
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса); 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 05.02.2023 УА #546288 

//+ ИнфоСофт Ивонин К.А. 25.10.23 УА #52524
Функция ПолучитьИнформациюОЦенах(Профиль, ПараметрыЗапроса, СтруктураТела) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
	//ПараметрыЗапроса.АдресРесурса = "/v4/product/info/prices";
	ПараметрыЗапроса.АдресРесурса = "/v5/product/info/prices";
	//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698	
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(СтруктураТела); 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698			
			//Если ТипЗнч(JSON) = Тип("Структура") И JSON.Свойство("result") Тогда				
			Если ТипЗнч(JSON) = Тип("Структура") Тогда							
				//Возврат JSON.result;	                            
				Возврат JSON;	                            
				//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 25.10.23 УА #52524

#КонецОбласти

#Область Заказы

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Функция ПолучитьСписокОтправлений(Профиль, ПараметрыЗапроса) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v3/posting/fbs/list";
	ПараметрыЗапроса.ФорматОтвета = "Строка"; 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Соответствие") Тогда				
				Возврат ИС_MP_Сервер.ПолучитьСтруктуруИзСоответствия(JSON["result"]);
			ИначеЕсли ТипЗнч(JSON) = Тип("Структура") Тогда
				Возврат JSON.result;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Ивонин К.А. 08.08.23 УА #61542
Функция ПолучитьИнформциюПоОтправлению(Профиль, ПараметрыЗапроса, НомерОтправления) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v3/posting/fbs/get";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("posting_number", НомерОтправления);
	
	СтруктураWith = Новый Структура;
	СтруктураWith.Вставить("analytics_data", Ложь);
	СтруктураWith.Вставить("barcodes", Ложь);
	СтруктураWith.Вставить("financial_data", Ложь);
	СтруктураWith.Вставить("product_exemplars", Ложь);
	СтруктураWith.Вставить("translit", Ложь);
	
	ТелоЗапроса.Вставить(СтруктураWith);
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ, Истина);
			
			Если ТипЗнч(JSON) = Тип("Соответствие") Тогда				
				Возврат JSON;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 08.08.23 УА #61542

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Функция НапечататьЭтикетки(Профиль, ПараметрыЗапроса) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v2/posting/fbs/package-label";
	ПараметрыЗапроса.ФорматОтвета = "ДвоичныеДанные"; 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
						
			Если ЗначениеЗаполнено(РезультатЗапроса.Ответ) Тогда
				Возврат РезультатЗапроса.Ответ;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
			
			Ответ = ПолучитьСтрокуИзДвоичныхДанных(РезультатЗапроса.Ответ);
			Текст = СтрШаблон("Передан неверный параметр: %1", Ответ);
			ОбщегоНазначения.СообщитьПользователю(Текст);
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Заварин К.В. 10.08.24 УА #76631
Функция СоздатьЗаданиеНаФормированиеЭтикеток(Профиль, ПараметрыЗапроса) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v2/posting/fbs/package-label/create";
	ПараметрыЗапроса.ФорматОтвета = "Строка"; 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
						
			Если ЗначениеЗаполнено(РезультатЗапроса.Ответ) Тогда
				
				JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
				
				Если ТипЗнч(JSON) = Тип("Структура") Тогда				
					Возврат JSON.result.tasks;	
				Иначе
					Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
					ОбщегоНазначения.СообщитьПользователю(Текст);
					Возврат Неопределено;
				КонецЕсли;
				
				Возврат РезультатЗапроса.Ответ;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
			//+ ИнфоСофт Стояк Ю.К. 11.03.2025 УА #95884
			//Ответ = ПолучитьСтрокуИзДвоичныхДанных(РезультатЗапроса.Ответ);
			//Текст = СтрШаблон("Передан неверный параметр: %1", Ответ);			
			Текст = "Передан неверный параметр: " + РезультатЗапроса.Ответ;
			//- ИнфоСофт Стояк Ю.К. 11.03.2025 УА #95884
			ОбщегоНазначения.СообщитьПользователю(Текст);
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Заварин К.В. 10.08.24 УА #76631

//+ ИнфоСофт Заварин К.В. 10.08.24 УА #76631
Функция ПолучитьЭтикеткиПоЗаданию(Профиль, ПараметрыЗапроса) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v1/posting/fbs/package-label/get";
	ПараметрыЗапроса.ФорматОтвета = "Строка"; 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
						
			Если ЗначениеЗаполнено(РезультатЗапроса.Ответ) Тогда
				
				JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
				
				Если ТипЗнч(JSON) = Тип("Структура") Тогда				
					Возврат JSON.result;	
				Иначе
					Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
					ОбщегоНазначения.СообщитьПользователю(Текст);
					Возврат Неопределено;
				КонецЕсли;
				
				Возврат РезультатЗапроса.Ответ;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
			
			Ответ = ПолучитьСтрокуИзДвоичныхДанных(РезультатЗапроса.Ответ);
			Текст = СтрШаблон("Передан неверный параметр: %1", Ответ);
			ОбщегоНазначения.СообщитьПользователю(Текст);
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Заварин К.В. 10.08.24 УА #76631

//+ ИнфоСофт Стояк Ю.К. 05.06.2023 УА #59330
Функция СобратьЗаказ(Профиль, ПараметрыЗапроса) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v4/posting/fbs/ship";
	ПараметрыЗапроса.ФорматОтвета = "Строка"; 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса); 
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Соответствие") Тогда				
				Возврат ИС_MP_Сервер.ПолучитьСтруктуруИзСоответствия(JSON["result"]);
			ИначеЕсли ТипЗнч(JSON) = Тип("Структура") Тогда
				Возврат JSON.result;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 05.06.2023 УА #59330

//+ ИнфоСофт Сумин Д.В. 29.01.2024 УА #62586
Функция ЗакрепитьКиЗыСборочногоЗадания(Профиль, ПараметрыЗапроса, ДанныеЗапроса) Экспорт  
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v5/fbs/posting/product/exemplar/set";
	//+ ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73296
	//ПараметрыЗапроса.АдресРесурса = "/v4/fbs/posting/product/exemplar/set";
	//- ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73296
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ДанныеЗапроса); 
		
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		//+ ИнфоСофт Стояк Ю.К. 21.02.2024 УА #71070
		//Если РезультатЗапроса.КодОтвета = 204 Тогда
		Если РезультатЗапроса.КодОтвета = 200 Тогда  
			
			Возврат Истина 
		//- ИнфоСофт Стояк Ю.К. 21.02.2024 УА #71070	
		ИначеЕсли РезультатЗапроса.КодОтвета = 204 Тогда
			
			Возврат Истина;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
	         
	
	        Текст = СтрШаблон("Запрос содержит некорректные данные: %1", РезультатЗапроса.Ответ); 
	  		ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	//Проверка прикрепления Киз	
	//ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	//ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	//ПараметрыЗапроса.АдресРесурса = "/v4/fbs/posting/product/exemplar/status";
	//ПараметрыЗапроса.ФорматОтвета = "Строка";
	//
	//ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Новый Структура("posting_number", ДанныеЗапроса.posting_number)); 
	//	
	//РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);

	
КонецФункции //- ИнфоСофт Сумин Д.В. 29.01.2024 УА #62586

//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
Функция СформироватьАктИНакладную(Профиль, ПараметрыЗапроса) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v2/posting/fbs/act/create";
	ПараметрыЗапроса.ФорматОтвета = "Строка"; 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса); 
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
						
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result.id;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
		//+ ИнфоСофт Стояк Ю.К. 11.10.2024 УА #85292			
		//ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
		//	
		//	Ответ = ПолучитьСтрокуИзДвоичныхДанных(РезультатЗапроса.Ответ);
		//	Текст = СтрШаблон("Передан неверный параметр: %1", Ответ);
		//	ОбщегоНазначения.СообщитьПользователю(Текст);
		//- ИнфоСофт Стояк Ю.К. 11.10.2024 УА #85292
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585 

//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
Функция СтатусФормированияАктовИНакладных(Профиль, ПараметрыЗапроса, ЭлектронныеДокументы = Ложь) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");                     
	ПараметрыЗапроса.АдресРесурса = "/v2/posting/fbs/act/check-status"; 
	
	Если ЭлектронныеДокументы Тогда
		ПараметрыЗапроса.АдресРесурса = "/v2/posting/fbs/digital/act/check-status";                       
	КонецЕсли;
	
	ПараметрыЗапроса.ФорматОтвета = "Строка"; 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);  
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
						
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
						
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585

//+ ИнфоСофт Стояк Ю.К. 12.03.2024 УА #62585
Функция ПолучитьАктыИНакладныеСOzon(Профиль, ПараметрыЗапроса, ЭлектронныеДокументы = Ложь) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v2/posting/fbs/act/get-pdf"; 
	Если ЭлектронныеДокументы Тогда
		ПараметрыЗапроса.АдресРесурса = "/v2/posting/fbs/digital/act/get-pdf"; 	
	КонецЕсли;
	ПараметрыЗапроса.ФорматОтвета = "ДвоичныеДанные"; 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);  
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
						
			Если ЗначениеЗаполнено(РезультатЗапроса.Ответ) Тогда
				Возврат РезультатЗапроса.Ответ;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
		//+ ИнфоСофт Стояк Ю.К. 15.05.2024 УА #75670		
		//ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
		//	
		//	Ответ = ПолучитьСтрокуИзДвоичныхДанных(РезультатЗапроса.Ответ);
		//	Текст = СтрШаблон("Передан неверный параметр: %1", Ответ);
		//	ОбщегоНазначения.СообщитьПользователю(Текст);
		//- ИнфоСофт Стояк Ю.К. 15.05.2024 УА #75670	
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.03.2024 УА #62585

//+ ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73296
Функция ПолучитьДанныеСозданныхЭкземпляров(Профиль, ПараметрыЗапроса, ДанныеЗапроса) Экспорт

	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v5/fbs/posting/product/exemplar/create-or-get";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ДанныеЗапроса); 
		
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса); 
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда  
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли; 
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;

КонецФункции

//- ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73296

//+ ИнфоСофт Конышев А.Е. 06.12.24 УА #77791
Функция ДобавитьТрекНомерКОтправлению(Профиль, ПараметрыЗапроса, МассивОтправлений) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v2/fbs/posting/tracking-number/set";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(МассивОтправлений);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда  
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли; 
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
		
КонецФункции //- ИнфоСофт Конышев А.Е. 06.12.24 УА #77791

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
Функция ПолучитьСписокОтправленийФБО(Профиль, ПараметрыЗапроса) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v2/posting/fbo/list";
	ПараметрыЗапроса.ФорматОтвета = "Строка"; 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);	
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ); 
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда
				Возврат JSON.result;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
Функция ПолучитьИнформциюПоОтправлениюФБО(Профиль, ПараметрыЗапроса, НомерОтправления) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v2/posting/fbo/get";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("posting_number", НомерОтправления);
	
	СтруктураWith = Новый Структура;
	СтруктураWith.Вставить("analytics_data", Ложь);	
	СтруктураWith.Вставить("financial_data", Ложь);		
	
	ТелоЗапроса.Вставить(СтруктураWith);
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
		
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);	
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

#КонецОбласти 

#Область Отчеты 

//+ ИнфоСофт Стояк Ю.К. 12.02.2024 УА #61968
Функция ПолучитьОтчетОПродажахПоРеализации(Профиль, ПараметрыЗапроса, Дата) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v1/finance/realization";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("date", Дата);  
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса); 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда
				Возврат JSON.result;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.02.2024 УА #61968

//+ ИнфоСофт Стояк Ю.К. 22.03.2024 УА #62623
Функция ПолучитьДанныеПоУслугам(Профиль, ПараметрыЗапроса, ТелоЗапроса) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v3/finance/transaction/list";
	ПараметрыЗапроса.ФорматОтвета = "Строка";  
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса); 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда
				Возврат JSON.result;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.03.2024 УА #62623

#КонецОбласти

#Область Склады   

//+ ИнфоСофт Стояк Ю.К. 03.02.2023 УА #54628
Функция ЗагрузитьСкладыOzon(Профиль, ПараметрыЗапроса) Экспорт  
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v1/warehouse/list";
	ПараметрыЗапроса.ФорматОтвета = "Строка";                                                
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса); 
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
		
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.02.2023 УА #54628
	
#КонецОбласти

#Область Остатки 

//+ ИнфоСофт Стояк Ю.К. 05.02.2023 УА #546288
Функция ВыгрузитьОстаткиOzon(Профиль, ПараметрыЗапроса, СтруктураТела) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v2/products/stocks";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("stocks", СтруктураТела);  
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса); 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса); 
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 05.02.2023 УА #546288

//+ ИнфоСофт Стояк Ю.К. 13.10.2023 УА #62194
Функция ПолучитьОстаткиFBS(Профиль, ПараметрыЗапроса, МассивSKU) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v1/product/info/stocks-by-warehouse/fbs";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("sku", МассивSKU);  
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса); 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 13.10.2023 УА #62194

//+ ИнфоСофт Ивонин К.А. 26.10.23 УА #52524
Функция ПолучитьИнформациюОбОстатках(Профиль, ПараметрыЗапроса, СтруктураТела) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698	
	//ПараметрыЗапроса.АдресРесурса = "/v3/product/info/stocks";
	ПараметрыЗапроса.АдресРесурса = "/v4/product/info/stocks";
	//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(СтруктураТела); 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698			
			//Если ТипЗнч(JSON) = Тип("Структура") И JSON.Свойство("result") Тогда				
			Если ТипЗнч(JSON) = Тип("Структура") Тогда							
				//Возврат JSON.result;	                            
				Возврат JSON;	                            
			//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 26.10.23 УА #52524

//+ ИнфоСофт Стояк Ю.К. 07.11.2024 УА #72455
Функция ПолучитьОстаткиFBO(Профиль, ПараметрыЗапроса, ТелоЗапроса) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v2/analytics/stock_on_warehouses";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	  
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса); 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 07.11.2024 УА #72455

#КонецОбласти

//+ ИнфоСофт Заварин К.В. 10.07.24 УА #70305
Функция ПолучитьОтчётПоОстаткамИТоварам(Профиль, ПараметрыЗапроса, СтруктураТела) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v2/analytics/stock_on_warehouses";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(СтруктураТела); 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") И JSON.Свойство("result") Тогда				
				Возврат JSON.result.rows;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Заварин К.В. 10.07.24 УА #70305
//+ ИнфоСофт Сумин Д.В. 15.12.2023 УА #65730
Функция	ПолучитьСписокТранзакций(Профиль, ПараметрыЗапроса, ТелоЗапроса) Экспорт 
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/v3/finance/transaction/list"; 
	ПараметрыЗапроса.ФорматОтвета = "Строка"; 
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса); 
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса); 
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 15.12.2023 УА #65730

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
Функция ПолучитьСтруктуруПараметровЗапросаСпискаТоваров(limit = 1, last_id = "") Экспорт
	
	Результат = Новый Структура;
	
	СтруктураFilter = Новый Структура("visibility", "ALL");
     
    Результат.Вставить("filter", СтруктураFilter);
	Результат.Вставить("limit", limit);
	Результат.Вставить("last_id", last_id);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 31.01.2023 УА #54628
Процедура РазобратьHTTPОтветПоКоду(СтруктураОтвета)

	Если СтруктураОтвета.КодОтвета = 400 Тогда
		
		Текст = СтрШаблон("Передан неверный параметр: %1", СтруктураОтвета.Ответ);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
	ИначеЕсли СтруктураОтвета.КодОтвета = 403 Тогда
		
		Текст = СтрШаблон("Произошла ошибка доступа (Доступ запрещен)
						  |Возможно используется пустой или отозванный токен. 
						  |Проверьте настройки авторизации : %1", СтруктураОтвета.Ответ);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		
	ИначеЕсли СтруктураОтвета.КодОтвета = 409 Тогда
		
		Текст = СтрШаблон("Произошёл конфликт запроса: %1", СтруктураОтвета.Ответ);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
	ИначеЕсли СтруктураОтвета.КодОтвета = 500 Тогда
		
		Текст = СтрШаблон("Произошла внутренняя ошибка сервера: %1", СтруктураОтвета.Ответ);
		ОбщегоНазначения.СообщитьПользователю(Текст);
						
	Иначе
		Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
			СтруктураОтвета.КодОтвета, СтруктураОтвета.Ответ);			
		ОбщегоНазначения.СообщитьПользователю(Текст);				
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 31.01.2023 УА #54628

//+ ИнфоСофт Ивонин К.А. 27.06.22 УА #46999
Процедура ЗаписатьДанныеОтладки(Профиль, Метод, ПараметрыЗапроса, РезультатЗапроса)
       
	Если Не Профиль.РежимОтладки Тогда
		Возврат;
	КонецЕсли;
		
	ИС_MP_Сервер.ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, Метод, ПараметрыЗапроса, РезультатЗапроса);	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.06.22 УА #46999

#КонецОбласти
