	
#Область ОбработчикиСобытийФормы 

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
&НаКлиенте
Процедура ПутьКФайлуПриИзменении(Элемент)
	
	Если ПутьКФайлуОтчетаOzon = "" Или ПутьКФайлуОтчетаЯндекс = "" Тогда
		АдресОтчетаВоВременномХранилище = "";
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008 

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОчиститьСообщения(); 
	  	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл отчета комиссионера";
	ДиалогВыбораФайла.МножественныйВыбор =  Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.Фильтр = "Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Реквизит", "ПутьКФайлуОтчета" + Строка(Элементы.Маркетплейсы.ТекущаяСтраница.Имя));
	ДополнительныеПараметры.Вставить("Адрес", "АдресОтчетаВоВременномХранилище");  
	ДополнительныеПараметры.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры));
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Ивонин К.А. 30.07.21 УА #36051
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеФайлы = ДиалогВыбораФайла.ВыбранныеФайлы;
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЭтотОбъект[ДополнительныеПараметры.Реквизит] = ВыбранныеФайлы[0];
		
		ВыбранныйФайл = Новый Файл(ВыбранныеФайлы[0]);
		ПутьКФайлуВоВременномКаталоге = ВыбранныеФайлы[0];
		ПоместитьФайлНаСервер(ДополнительныеПараметры.Адрес);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.07.21 УА #36051 

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
&НаКлиенте
Процедура ПоместитьФайлНаСервер(Адрес)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоместитьФайлНаСерверЗавершение", ЭтотОбъект, Новый Структура("Адрес", Адрес));
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , , , ПутьКФайлуВоВременномКаталоге, УникальныйИдентификатор);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008 

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
&НаКлиенте
Процедура ПоместитьФайлНаСерверЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.ПомещениеФайлаОтменено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось поместить файл на сервер, попробуйте ещё раз...", , , "ПутьКФайлу");
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[Параметры.Адрес] = Результат.Адрес;          
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
&НаКлиенте
Процедура ОтчетыПриСменеСтраницы(Элемент, ТекущаяСтраница)  
	
	АдресОтчетаВоВременномХранилище = "";
	ПутьКФайлуВоВременномКаталоге = "";
	ПутьКФайлуОтчетаOzon = ""; 	
	ПутьКФайлуОтчетаЯндекс = ""; 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008 

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если ВебКлиент Тогда                         
		ПодключитьРасширениеДляРаботыСФайлами(Истина);
	#КонецЕсли
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаКлиенте
Процедура СоздатьДокументОприходования(Команда)
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли; 
	СоздатьДокументОприходованияНаСервере();
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаКлиенте
Процедура СписокУслугНоменклатураПриИзменении(Элемент)
	Элементы.СписокУслуг.ТекущиеДанные.СтавкаНДС = ЗначениеРеквизитаОбъектаНаСервере(Элементы.СписокУслуг.ТекущиеДанные.Номенклатура, "СтавкаНДС");
	Если ЗначениеЗаполнено(Элементы.СписокУслуг.ТекущиеДанные.Сумма) Тогда
		ВыполнитьПересчетСуммыНДС(Элементы.СписокУслуг.ТекущиеДанные);
	КонецЕсли;	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаКлиенте
Процедура СписокУслугСуммаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Элементы.СписокУслуг.ТекущиеДанные.СтавкаНДС) Тогда
		ВыполнитьПересчетСуммыНДС(Элементы.СписокУслуг.ТекущиеДанные);
	КонецЕсли;																				
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаКлиенте
Процедура СписокУслугСтавкаНДСПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Элементы.СписокУслуг.ТекущиеДанные.Сумма) Тогда
		ВыполнитьПересчетСуммыНДС(Элементы.СписокУслуг.ТекущиеДанные);	
	КонецЕсли;	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730	
&НаКлиенте
Процедура СоздатьДокументВзаимозачетЗадолженности(Команда)
	Если Не ЗначениеЗаполнено(ДокументПриобретения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите документ приобретения.");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтчетКомиссионера) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите документ отчет комиссионера.");
		Возврат;
	КонецЕсли;
	
	СоздатьДокументВзаимозачетЗадолженностиНаСервере();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730 

//+ ИнфоСофт Сумин Д.В. 19.12.2023 УА #65730
&НаКлиенте
Процедура СоздатьДокументОприходованияЯМ(Команда)
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли; 
	СоздатьДокументОприходованияЯМНаСервере();
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаКлиенте
Процедура СписокУслугНоменклатураЯМПриИзменении(Элемент)
	Элементы.СписокУслугЯМ.ТекущиеДанные.СтавкаНДС = ЗначениеРеквизитаОбъектаНаСервере(Элементы.СписокУслугЯМ.ТекущиеДанные.Номенклатура, "СтавкаНДС");
	Если ЗначениеЗаполнено(Элементы.СписокУслугЯМ.ТекущиеДанные.Сумма) Тогда
		ВыполнитьПересчетСуммыНДС(Элементы.СписокУслугЯМ.ТекущиеДанные);
	КонецЕсли;	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаКлиенте
Процедура СписокУслугСуммаЯМПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Элементы.СписокУслугЯМ.ТекущиеДанные.СтавкаНДС) Тогда
		ВыполнитьПересчетСуммыНДС(Элементы.СписокУслугЯМ.ТекущиеДанные);
	КонецЕсли;																				
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730 

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаКлиенте
Процедура СписокУслугСтавкаНДСЯМПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Элементы.СписокУслугЯМ.ТекущиеДанные.Сумма) Тогда
		ВыполнитьПересчетСуммыНДС(Элементы.СписокУслугЯМ.ТекущиеДанные);	
	КонецЕсли;	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаКлиенте
Процедура СоздатьДокументВзаимозачетЗадолженностиЯМ(Команда)
	
		Если Не ЗначениеЗаполнено(ДокументПриобретения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите документ приобретения.");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтчетКомиссионера) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите документ отчет комиссионера.");
		Возврат;
	КонецЕсли;
	
	СоздатьДокументВзаимозачетЗадолженностиЯМНаСервере();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
&НаКлиенте
Процедура ФорматФайлаДо31032024ПриИзменении(Элемент)
	Если ФорматФайлаДо31032024 Тогда
		НовыйФорматФайла = Ложь;
	КонецЕсли;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879

//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
&НаКлиенте
Процедура НовыйФорматФайлаПриИзменении(Элемент)
	
	Если НовыйФорматФайла Тогда
		ФорматФайлаДо31032024 = Ложь;
	КонецЕсли;	

КонецПроцедуры //- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879

//+ ИнфоСофт Сумин Д.В. 14.05.2024 УА #74879
&НаКлиенте
Процедура ФорматФайлаДо31032024ЯМПриИзменении(Элемент)
	Если ФорматФайлаДо31032024ЯМ Тогда
		НовыйФорматФайлаЯМ = Ложь;
	КонецЕсли;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 14.05.2024 УА #74879

//+ ИнфоСофт Сумин Д.В. 14.05.2024 УА #74879
&НаКлиенте
Процедура НовыйФорматФайлаЯМПриИзменении(Элемент)
	Если НовыйФорматФайлаЯМ Тогда
		ФорматФайлаДо31032024ЯМ = Ложь;
	КонецЕсли;	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 14.05.2024 УА #74879

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
&НаКлиенте 
Процедура ПодключитьРасширениеДляРаботыСФайлами(УстановитьЕслиНеПодключено) Экспорт  
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьРасширениеДляРаботыСФайламиЗавершение", ЭтотОбъект, УстановитьЕслиНеПодключено); 
	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008 

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
&НаКлиенте
Процедура ПодключитьРасширениеДляРаботыСФайламиЗавершение(Подключено, УстановитьЕслиНеПодключено) Экспорт
	
	Если Подключено Тогда
		Возврат;
	ИначеЕсли УстановитьЕслиНеПодключено Тогда  	
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьРасширениеДляРаботыСФайлами", ЭтотОбъект, Ложь);     
		НачатьУстановкуРасширенияРаботыСФайлами(ОписаниеОповещения);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось подключить расширение для работы с файлами!");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаСервере
Процедура СоздатьДокументОприходованияНаСервере() 
	
	ЗаголовокСтруктура = ПолучитьДанныеЗаголовка();
	
	ДанныеДокумента = СписокУслуг.Выгрузить();
	
	ДокументПриобретения = ИС_Ozon_Сервер.СоздатьДокументПриобретения(ЗаголовокСтруктура, ДанныеДокумента);
		
	СформированныеДокументы.Добавить().Документ = ДокументПриобретения.Ссылка;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъектаНаСервере(Ссылка, ИмяРеквизита)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
КонецФункции //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730


//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаСервереБезКонтекста
Функция ПолучитьСуммуНдсНаСервере(Сумма, СтавкаНДС)
	Ставка = ЗначениеРеквизитаОбъектаНаСервере(СтавкаНДС, "Ставка"); 
	Возврат ИС_WB_Сервер.РассчитатьСуммуНДС(Сумма, Ставка, Истина);                 
КонецФункции //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаКлиенте
Процедура ВыполнитьПересчетСуммыНДС(ТекущиеДанные)
	ТекущиеДанные.НДС = ПолучитьСуммуНдсНаСервере(ТекущиеДанные.Сумма, ТекущиеДанные.СтавкаНДС);			
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаСервере
Функция ПолучитьДанныеЗаголовка() 
	
	Настройки = ИС_Ozon_Сервер.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	ЗаголовокСтруктура = Новый Структура; 
	
	ЗаголовокСтруктура.Вставить("ДатаДокумента", ТекущаяДатаСеанса());
	ЗаголовокСтруктура.Вставить("Организация", Профиль.Организация);
	ЗаголовокСтруктура.Вставить("ДоговорЗакупки", ДоговорЗакупкиОзон);
	ЗаголовокСтруктура.Вставить("СоглашениеЗакупки", СоглашениеЗакупкиОзон);
	ЗаголовокСтруктура.Вставить("Подразделение", Настройки.ПодразделениеOzon);
	ЗаголовокСтруктура.Вставить("Партнер", Настройки.ПартнерOzon);
	ЗаголовокСтруктура.Вставить("Контрагент", Настройки.КонтрагентOzon);
	
	Возврат ЗаголовокСтруктура;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаСервере
Процедура СоздатьДокументВзаимозачетЗадолженностиНаСервере()
	ДокументВзаимозачет = ИС_Ozon_Сервер.СоздатьДокументВзаимозачетЗадолженности(ДокументПриобретения, ОтчетКомиссионера);	
	СформированныеДокументы.Добавить().Документ = ДокументВзаимозачет.Ссылка;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 19.12.2023 УА #65730
&НаСервере
Процедура СоздатьДокументОприходованияЯМНаСервере() 
	
	ЗаголовокСтруктура = ПолучитьДанныеЗаголовкаЯМ();
	
	ДанныеДокумента = СписокУслугЯМ.Выгрузить();
	
	ДокументПриобретения = ИС_Ozon_Сервер.СоздатьДокументПриобретения(ЗаголовокСтруктура, ДанныеДокумента);
		
	СформированныеДокументыЯндекс.Добавить().Документ = ДокументПриобретения.Ссылка;

КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаСервере
Функция ПолучитьДанныеЗаголовкаЯМ() 
	
	Настройки = ИС_ЯМ_Сервер.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	ЗаголовокСтруктура = Новый Структура; 
	
	ЗаголовокСтруктура.Вставить("ДатаДокумента", ТекущаяДатаСеанса());
	ЗаголовокСтруктура.Вставить("Организация", Профиль.Организация);
	ЗаголовокСтруктура.Вставить("ДоговорЗакупки", ДоговорЗакупкиЯМ);
	ЗаголовокСтруктура.Вставить("СоглашениеЗакупки", СоглашениеЗакупкиЯМ);
	ЗаголовокСтруктура.Вставить("Подразделение", Настройки.ПодразделениеЯМ);
	ЗаголовокСтруктура.Вставить("Партнер", Настройки.ПартнерЯМ);
	ЗаголовокСтруктура.Вставить("Контрагент", Настройки.КонтрагентЯМ);
	
	Возврат ЗаголовокСтруктура;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
&НаСервере
Процедура СоздатьДокументВзаимозачетЗадолженностиЯМНаСервере()
	ДокументВзаимозачет = ИС_Ozon_Сервер.СоздатьДокументВзаимозачетЗадолженности(ДокументПриобретения, ОтчетКомиссионера);	
	СформированныеДокументыЯндекс.Добавить().Документ = ДокументВзаимозачет.Ссылка;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

#КонецОбласти

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
&НаКлиенте
Процедура Загрузить(Команда)
	
	//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879 
	ОчиститьСообщения();
	//- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879 
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьОтчетКомисисонераПоИзФайлаНаСервере();	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008  

//+ ИнфоСофт Сумин Д.В. 02.03.23 УА #55086
&НаСерверебезКонтекста
Функция ПолучитьТаблицуЗначенийДанныхпродаж(Номер, Таблица)
	Отбор = Новый Структура();
	Отбор.Вставить("НомерОтчета", Номер);
	ДанныеТЗ = Таблица.Скопировать(Отбор);
	
	Возврат ДанныеТЗ;
КонецФункции //- ИнфоСофт Сумин Д.В. 02.03.23 УА #55086 

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
&НаСервере
Процедура ЗагрузитьОтчетКомисисонераПоИзФайлаНаСервере() 
	
	Если Элементы.Маркетплейсы.ТекущаяСтраница.Имя = "Ozon" Тогда
		//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
		Если ФорматФайлаДо31032024 Тогда
			ПолучитьТаблицуЗначенийПродажИзФайлаOzon();
		ИначеЕсли НовыйФорматФайла Тогда
			ПолучитьТаблицуЗначенийПродажИзФайлаOzonПосле30032024();
		Иначе
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать формат файла.'"));
		КонецЕсли;	
		//ПолучитьТаблицуЗначенийПродажИзФайлаOzon();
		//- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879 
	ИначеЕсли Элементы.Маркетплейсы.ТекущаяСтраница.Имя = "Яндекс" Тогда
		//+ ИнфоСофт Сумин Д.В. 13.05.2024 УА #74879
		Если НовыйФорматФайлаЯМ Тогда
			ПолучитьТаблицуЗначенийПродажИзФайлаЯндексПосле30032024();
		ИначеЕсли ФорматФайлаДо31032024ЯМ Тогда	
			ПолучитьТаблицуЗначенийПродажИзФайлаЯндекс(); 
		Иначе
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать формат файла.'"));
		КонецЕсли;
		//- ИнфоСофт Сумин Д.В. 13.05.2024 УА #74879			
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008	      	

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
&НаСервере
Процедура ПолучитьТаблицуЗначенийПродажИзФайлаOzon()
	
	Элементы.ЗагрузитьПродолжить.Видимость = Ложь;
	Элементы.СписокТранзакцийExcel.Видимость = Ложь;
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//+ ИнфоСофт Сумин Д.В. 25.03.2024 УА #66622
	ТабличныйДокумент.Прочитать(Имя, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	//ТабличныйДокумент.Прочитать(Имя);
	//- ИнфоСофт Сумин Д.В. 25.03.2024 УА #66622
	СписокТранзакцийExcel.Очистить();
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879 
	Для сч = 16 По КоличествоСтрок Цикл
		Попытка	
			НомерСтроки  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 1).ТекущаяОбласть.Текст);
			Если НомерСтроки = "" Тогда Прервать; КонецЕсли;
			ЧислоСтроки = Формат(сч, "ЧГ=0");
			НоваяСтрока = СписокТранзакцийExcel.Добавить();
			НоваяСтрока.НаименованиеТовара		= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 2).ТекущаяОбласть.Текст);
			НоваяСтрока.offer_id				= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 3).ТекущаяОбласть.Текст);
			НоваяСтрока.SKU						= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 4).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 4).ТекущаяОбласть.Текст));
			НоваяСтрока.ШтрихКодТовара			= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 5).ТекущаяОбласть.Текст);
			НоваяСтрока.РеализованоНаСумму		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 6).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 6).ТекущаяОбласть.Текст));
			НоваяСтрока.ДоплатаЗаСчетOzon		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 7).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 7).ТекущаяОбласть.Текст));
			НоваяСтрока.Количество				= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 8).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 8).ТекущаяОбласть.Текст));
			НоваяСтрока.ЦенаРеализация			= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 9).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 9).ТекущаяОбласть.Текст));
			НоваяСтрока.КомиссияЗаПродажуПоКатегорииПроцент	= СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 10).ТекущаяОбласть.Текст);
			НоваяСтрока.ЦенаПродовцаСУчетомСкидки	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 11).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 11).ТекущаяОбласть.Текст));
			НоваяСтрока.ИтогиКомиссияСУчетомСкидокИНаценок	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 12).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 12).ТекущаяОбласть.Текст));
			НоваяСтрока.ИтогиКНачислению		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 13).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 13).ТекущаяОбласть.Текст));
			НоваяСтрока.ВозвращеноНаСумму		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 14).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 14).ТекущаяОбласть.Текст));
			НоваяСтрока.ВозвратДоплатаЗаСчетOzon	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 15).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 15).ТекущаяОбласть.Текст));
			НоваяСтрока.ВозвратКоличество		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 16).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 16).ТекущаяОбласть.Текст));
			НоваяСтрока.ВозвратЦенаРеализации	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 17).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 17).ТекущаяОбласть.Текст));
			НоваяСтрока.ВозвратИтогиКомиссияСУчетомСкидокИНаценок	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 18).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 18).ТекущаяОбласть.Текст));
			НоваяСтрока.ИтогоВозвращено			= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 19).ТекущаяОбласть.Текст) = "", 0, СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 19).ТекущаяОбласть.Текст));
			НоваяСтрока.НомерОтправления		= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 20).ТекущаяОбласть.Текст);
			НоваяСтрока.ДатаОтправления			= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 21).ТекущаяОбласть.Текст);
			НоваяСтрока.НомерСчетФактуры		= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 22).ТекущаяОбласть.Текст);
			ДатаСФ								= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 23).ТекущаяОбласть.Текст); 
			Если ЗначениеЗаполнено(ДатаСФ) Тогда
				НоваяСтрока.ДатаСчетФактуры = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаСФ);
			КонецЕсли;	
		Исключение
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не удалось загрузить строку %1'"), Строка(сч)));
		КонецПопытки;
	КонецЦикла;		
	
	//Если НовыйФорматФайла Тогда
	//	Для сч = 16 По КоличествоСтрок Цикл
	//		Попытка	
	//			НомерСтроки  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 1).ТекущаяОбласть.Текст);
	//			Если НомерСтроки = "" Тогда Прервать; КонецЕсли;
	//			ЧислоСтроки = Формат(сч, "ЧГ=0");
	//			НоваяСтрока = СписокТранзакцийExcel.Добавить();
	//			//+ ИнфоСофт Сумин Д.В. 07.11.2023 УА #65869
	//			НоваяСтрока.НаименованиеТовара		= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 2).ТекущаяОбласть.Текст);
	//			НоваяСтрока.offer_id				= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 3).ТекущаяОбласть.Текст);
	//			НоваяСтрока.SKU						= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 4).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 4).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ШтрихКодТовара			= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 5).ТекущаяОбласть.Текст);
	//			НоваяСтрока.РеализованоНаСумму		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 6).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 6).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ДоплатаЗаСчетOzon		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 7).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 7).ТекущаяОбласть.Текст));
	//			НоваяСтрока.Количество				= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 8).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 8).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ЦенаРеализация			= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 9).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 9).ТекущаяОбласть.Текст));
	//			//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
	//			НоваяСтрока.КомиссияЗаПродажуПоКатегорииПроцент	= ИС_MP_Сервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 10).ТекущаяОбласть.Текст);
	//			//НоваяСтрока.КомиссияЗаПродажуПоКатегорииПроцент	= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 10).ТекущаяОбласть.Текст);
	//			//- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
	//			//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
	//			НоваяСтрока.ЦенаПродовцаСУчетомСкидки	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 11).ТекущаяОбласть.Текст) = "", 0, ИС_MP_Сервер.СтрокаВЧисло(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 11).ТекущаяОбласть.Текст));
	//			//НоваяСтрока.ЦенаПродовцаСУчетомСкидки	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 11).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 11).ТекущаяОбласть.Текст));
	//			//- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
	//			НоваяСтрока.ИтогиКомиссияСУчетомСкидокИНаценок	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 12).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 12).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ИтогиКНачислению		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 13).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 13).ТекущаяОбласть.Текст));
	//			
	//			НоваяСтрока.ВозвращеноНаСумму		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 14).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 14).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ВозвратДоплатаЗаСчетOzon	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 15).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 15).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ВозвратКоличество		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 16).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 16).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ВозвратЦенаРеализации	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 17).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 17).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ВозвратИтогиКомиссияСУчетомСкидокИНаценок	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 18).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 18).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ИтогоВозвращено			= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 19).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 19).ТекущаяОбласть.Текст));
	//			НоваяСтрока.НомерОтправления		= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 20).ТекущаяОбласть.Текст);
	//			НоваяСтрока.ДатаОтправления			= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 21).ТекущаяОбласть.Текст);
	//			//- ИнфоСофт Сумин Д.В. 07.11.2023 УА #65869
	//			//+ ИнфоСофт Сумин Д.В. 25.03.2024 УА #66622
	//			НоваяСтрока.НомерСчетФактуры		= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 22).ТекущаяОбласть.Текст);
	//			ДатаСФ								= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 23).ТекущаяОбласть.Текст);
	//			Если ЗначениеЗаполнено(ДатаСФ) Тогда
	//				НоваяСтрока.ДатаСчетФактуры = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаСФ);
	//			КонецЕсли;
	//			//- ИнфоСофт Сумин Д.В. 25.03.2024 УА #66622	
	//		Исключение
	//			Сообщение		= Новый СообщениеПользователю;
	//			Сообщение.Текст	= "Не удалось загрузить строку " + Строка(сч);
	//			Сообщение.Сообщить();
	//		КонецПопытки;
	//		
	//	КонецЦикла;	
	//Иначе
	//	//+ ИнфоСофт Сумин Д.В. 09.10.2023 УА #62455
	//	СчДо = ТабличныйДокумент.НайтиТекст("Товар", , ТабличныйДокумент.Область("C4:C5")).Верх + 3;
	//	Для сч = СчДо По КоличествоСтрок Цикл
	//	//Для сч = 16 По КоличествоСтрок Цикл
	//	//- ИнфоСофт Сумин Д.В. 09.10.2023 УА #62455	
	//		Попытка	
	//			НомерСтроки  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 2).ТекущаяОбласть.Текст);
	//			Если НомерСтроки = "" Тогда Прервать; КонецЕсли;
	//			ЧислоСтроки = Формат(сч, "ЧГ=0");
	//			НоваяСтрока = СписокТранзакцийExcel.Добавить();
	//			НоваяСтрока.НаименованиеТовара		= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 4).ТекущаяОбласть.Текст);
	//			НоваяСтрока.offer_id				= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 6).ТекущаяОбласть.Текст);
	//			НоваяСтрока.SKU						= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 8).ТекущаяОбласть.Текст) = "", 0, Формат(Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 8).ТекущаяОбласть.Текст), "ЧГ=0"));
	//			НоваяСтрока.ШтрихКодТовара			= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 13).ТекущаяОбласть.Текст);
	//			НоваяСтрока.ЦенаПродовцаСУчетомСкидки	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 19).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 19).ТекущаяОбласть.Текст));
	//			НоваяСтрока.КомиссияЗаПродажуПоКатегорииПроцент	= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 18).ТекущаяОбласть.Текст);
	//			НоваяСтрока.ЦенаРеализация			= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 17).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 17).ТекущаяОбласть.Текст));
	//			НоваяСтрока.Количество				= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 16).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 16).ТекущаяОбласть.Текст));
	//			НоваяСтрока.РеализованоНаСумму		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 14).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 14).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ДоплатаЗаСчетOzon		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 15).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 15).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ИтогиКомиссияСУчетомСкидокИНаценок	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 21).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 21).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ИтогиКНачислению		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 23).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 23).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ВозвратЦенаРеализации	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 32).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 32).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ВозвратКоличество		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 30).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 30).ТекущаяОбласть.Текст));
	//			Если НоваяСтрока.ВозвратКоличество > 0 Тогда
	//				НоваяСтрока.Количество = 0;	
	//			КонецЕсли;	
	//			НоваяСтрока.ВозвращеноНаСумму		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 26).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 26).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ВозвратДоплатаЗаСчетOzon	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 28).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 28).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ВозвратИтогиКомиссияСУчетомСкидокИНаценок	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 33).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 33).ТекущаяОбласть.Текст));
	//			НоваяСтрока.ИтогоВозвращено			= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 34).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 34).ТекущаяОбласть.Текст));
	//			НоваяСтрока.НомерОтправления		= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 36).ТекущаяОбласть.Текст);
	//			НоваяСтрока.ДатаОтправления			= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + ЧислоСтроки + "C" + 37).ТекущаяОбласть.Текст);	
	//		Исключение
	//			Сообщение		= Новый СообщениеПользователю;
	//			Сообщение.Текст	= "Не удалось загрузить строку " + Строка(сч);
	//			Сообщение.Сообщить();
	//		КонецПопытки;
	//		
	//	КонецЦикла;
	//КонецЕсли;
	//- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ОтменитьТранзакцию();
	КонецПопытки; 
	
	ТаблицаТранзакций = СписокТранзакцийExcel.Выгрузить(); 
	ТаблицаТранзакций = ИС_Ozon_Сервер.ДобавитьСопоставление(ТаблицаТранзакций, Профиль);
	СписокТранзакцийExcel.Загрузить(ТаблицаТранзакций); 
	Комментарий = Имя;
	
	ОшибкаСопоставления = Ложь;
	
	Для Каждого Строка Из СписокТранзакцийExcel Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			ОшибкаСопоставления = Истина;			
		КонецЕсли;
	КонецЦикла;
	
	Если Не ОшибкаСопоставления Тогда    
		
		//+ ИнфоСофт Сумин Д.В. 12.02.2024 УА #70399
		РассчитатьИтоги();
		
		Отчет = ИС_Ozon_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокТранзакцийExcel, Комментарий, ВсегоКомиссияПослеСкидок);
		//Отчет = ИС_Ozon_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокТранзакцийExcel, Комментарий);
		//- ИнфоСофт Сумин Д.В. 12.02.2024 УА #70399
		
		Если ЗначениеЗаполнено(Отчет) Тогда
			СформированныеДокументы.Добавить().Документ = Отчет;
			//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
			ОтчетКомиссионера = Отчет.Ссылка;
			//- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
		КонецЕсли; 
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Есть позиции, по которым не удалось найти сопоставление. Заполните пустые строки и нажмите ""Загрузить"", либо исправьте сопоставление и повторите загрузку");
		Элементы.ЗагрузитьПродолжить.Видимость = Истина;
		Элементы.СписокТранзакцийExcel.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008	

//+ ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879
&НаСервере
Процедура ПолучитьТаблицуЗначенийПродажИзФайлаOzonПосле30032024()
	
	Элементы.ЗагрузитьПродолжить.Видимость = Ложь;
	Элементы.СписокТранзакцийExcel.Видимость = Ложь;
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(Имя, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	СписокТранзакцийExcel.Очистить();
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	Для сч = 16 По КоличествоСтрок Цикл
		Попытка	
			НомерСтроки  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 1).ТекущаяОбласть.Текст);
			Если НомерСтроки = "" Тогда Прервать; КонецЕсли;
			НоваяСтрока = СписокТранзакцийExcel.Добавить();
			НоваяСтрока.НаименованиеТовара		= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 2).ТекущаяОбласть.Текст);
			НоваяСтрока.offer_id				= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 3).ТекущаяОбласть.Текст);
			НоваяСтрока.SKU						= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 4).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 4).ТекущаяОбласть.Текст));
			НоваяСтрока.ШтрихКодТовара			= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 5).ТекущаяОбласть.Текст);
			НоваяСтрока.РеализованоНаСумму		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 6).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 6).ТекущаяОбласть.Текст));
			НоваяСтрока.ВыплатыОтПартнеров		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 7).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 7).ТекущаяОбласть.Текст));
			НоваяСтрока.ДоплатаЗаСчетOzon		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 8).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 8).ТекущаяОбласть.Текст));
			НоваяСтрока.Количество				= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 9).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 9).ТекущаяОбласть.Текст));
			НоваяСтрока.ЦенаРеализация			= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 10).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 10).ТекущаяОбласть.Текст));
			НоваяСтрока.КомиссияЗаПродажуПоКатегорииПроцент	= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 11).ТекущаяОбласть.Текст);
			НоваяСтрока.ЦенаПродовцаСУчетомСкидки	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 12).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 12).ТекущаяОбласть.Текст));
			НоваяСтрока.ИтогиКомиссияСУчетомСкидокИНаценок	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 13).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 13).ТекущаяОбласть.Текст));
			НоваяСтрока.ИтогиКНачислению		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 14).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 14).ТекущаяОбласть.Текст));
			
			НоваяСтрока.ВозвращеноНаСумму		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 15).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 15).ТекущаяОбласть.Текст));
			НоваяСтрока.ВозвратВыплатыОтПартнеров	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 16).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 16).ТекущаяОбласть.Текст));
			НоваяСтрока.ВозвратДоплатаЗаСчетOzon	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 17).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 17).ТекущаяОбласть.Текст));
			НоваяСтрока.ВозвратКоличество		= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 18).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 18).ТекущаяОбласть.Текст));
			НоваяСтрока.ВозвратЦенаРеализации	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 19).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 19).ТекущаяОбласть.Текст));
			НоваяСтрока.ВозвратИтогиКомиссияСУчетомСкидокИНаценок	= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 20).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 20).ТекущаяОбласть.Текст));
			НоваяСтрока.ИтогоВозвращено			= ?(Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 21).ТекущаяОбласть.Текст) = "", 0, Число(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 21).ТекущаяОбласть.Текст));
			НоваяСтрока.НомерОтправления		= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 22).ТекущаяОбласть.Текст);
			НоваяСтрока.ДатаОтправления			= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 23).ТекущаяОбласть.Текст);
			НоваяСтрока.НомерСчетФактуры		= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 24).ТекущаяОбласть.Текст);
			ДатаСФ								= Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 25).ТекущаяОбласть.Текст);
			Если ЗначениеЗаполнено(ДатаСФ) Тогда
				НоваяСтрока.ДатаСчетФактуры = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаСФ);
			КонецЕсли;	
		Исключение 
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не удалось загрузить строку %1'"), Строка(сч)));
		КонецПопытки;
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ОтменитьТранзакцию();
	КонецПопытки; 
	
	ТаблицаТранзакций = СписокТранзакцийExcel.Выгрузить(); 
	ТаблицаТранзакций = ИС_Ozon_Сервер.ДобавитьСопоставление(ТаблицаТранзакций, Профиль);
	СписокТранзакцийExcel.Загрузить(ТаблицаТранзакций); 
	
	РассчитатьИтоги();
	
	ОшибкаСопоставления = Ложь;
	
	Для Каждого Строка Из СписокТранзакцийExcel Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			ОшибкаСопоставления = Истина;			
		КонецЕсли;
	КонецЦикла;
	
	Если Не ОшибкаСопоставления Тогда
				
		Отчет = ИС_Ozon_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокТранзакцийExcel, Комментарий, ВсегоКомиссияПослеСкидок);
		
		Если ЗначениеЗаполнено(Отчет) Тогда
			СформированныеДокументы.Добавить().Документ = Отчет;
			ОтчетКомиссионера = Отчет.Ссылка;
		КонецЕсли; 
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Есть позиции, по которым не удалось найти сопоставление. Заполните пустые строки и нажмите ""Загрузить"", либо исправьте сопоставление и повторите загрузку");
		Элементы.ЗагрузитьПродолжить.Видимость = Истина;
		Элементы.СписокТранзакцийExcel.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры 	//- ИнфоСофт Сумин Д.В. 07.05.2024 УА #74879

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
&НаСервере
Процедура ПолучитьТаблицуЗначенийПродажИзФайлаЯндекс()
	
	//+ ИнфоСофт Сумин Д.В. 21.06.2023 УА #59766
	СписокТранзакцийExcelЯМ.Очистить(); 
	//- ИнфоСофт Сумин Д.В. 21.06.2023 УА #59766
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.Прочитать(Имя);
	
	МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(Новый Структура("Таблица,Тип", "Доставленные_товары", Истина));
	МассивСтруктур.Добавить(Новый Структура("Таблица,Тип", "Невыкупленные_товары", Ложь));
	МассивСтруктур.Добавить(Новый Структура("Таблица,Тип", "Возвращённые_товары", Ложь));
	
	Для Каждого Элемент Из МассивСтруктур Цикл
		ДобавитьСтроки(ТабличныйДокумент.ПолучитьОбласть(Элемент.Таблица), Элемент.Тип);  
	КонецЦикла;     
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ОтменитьТранзакцию();
	КонецПопытки; 
	
	ТаблицаТранзакций = СписокТранзакцийExcelЯМ.Выгрузить(); 
	ТаблицаТранзакций = ИС_ЯМ_Сервер.ДобавитьСопоставление(ТаблицаТранзакций, Профиль);
	СписокТранзакцийExcelЯМ.Загрузить(ТаблицаТранзакций); 
	Комментарий = Имя;
	
	ОшибкаСопоставления = Ложь;
	
	Для Каждого Строка Из СписокТранзакцийExcelЯМ Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			ОшибкаСопоставления = Истина;			
		КонецЕсли;
	КонецЦикла;
	
	Если Не ОшибкаСопоставления Тогда    
		
		//+ ИнфоСофт Сумин Д.В. 21.06.2023 УА #59766	
		Отчет = ИС_ЯМ_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокТранзакцийExcelЯМ, Комментарий);
		//Отчет = ИС_ЯМ_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокТранзакцийExcel, Комментарий);
		//- ИнфоСофт Сумин Д.В. 21.06.2023 УА #59766
		
		Если ЗначениеЗаполнено(Отчет) Тогда
			//+ ИнфоСофт Сумин Д.В. 21.06.2023 УА #59766
			СформированныеДокументыЯндекс.Добавить().Документ = Отчет;
			//СформированныеДокументы.Добавить().Документ = Отчет;
			//- ИнфоСофт Сумин Д.В. 21.06.2023 УА #59766		
		КонецЕсли; 
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Есть позиции, по которым не удалось найти сопоставление. Заполните пустые строки и нажмите ""Загрузить"", либо исправьте сопоставление и повторите загрузку");
		Элементы.ЗагрузитьПродолжитьЯМ.Видимость = Истина;
		Элементы.СписокТранзакцийExcelЯМ.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Сумин Д.В. 13.05.2024 УА #75692
&НаСервере
Процедура ПолучитьТаблицуЗначенийПродажИзФайлаЯндексПосле30032024()
	
	СписокТранзакцийExcelЯМ.Очистить(); 

	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.Прочитать(Имя);
	
	МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(Новый Структура("Таблица,Тип", "Доставленные_товары", Истина));
	МассивСтруктур.Добавить(Новый Структура("Таблица,Тип", "Невыкупленные_товары", Ложь));
	
	МассивСтруктур.Добавить(Новый Структура("Таблица,Тип", "Возвращенные_товары", Ложь)); 
	
	Для Каждого Элемент Из МассивСтруктур Цикл
		ДобавитьСтрокиПосле30032024(ТабличныйДокумент.ПолучитьОбласть(Элемент.Таблица), Элемент.Тип);  
	КонецЦикла;     

	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ОтменитьТранзакцию();
	КонецПопытки; 
	
	ТаблицаТранзакций = СписокТранзакцийExcelЯМ.Выгрузить(); 
	ТаблицаТранзакций = ИС_ЯМ_Сервер.ДобавитьСопоставление(ТаблицаТранзакций, Профиль);
	СписокТранзакцийExcelЯМ.Загрузить(ТаблицаТранзакций); 
	Комментарий = Имя;
	
	ОшибкаСопоставления = Ложь;
	
	Для Каждого Строка Из СписокТранзакцийExcelЯМ Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			ОшибкаСопоставления = Истина;			
		КонецЕсли;
	КонецЦикла;
	
	Если Не ОшибкаСопоставления Тогда    
			
		Отчет = ИС_ЯМ_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокТранзакцийExcelЯМ, Комментарий);
		
		Если ЗначениеЗаполнено(Отчет) Тогда
			СформированныеДокументыЯндекс.Добавить().Документ = Отчет;
		КонецЕсли; 
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Есть позиции, по которым не удалось найти сопоставление. Заполните пустые строки и нажмите ""Загрузить"", либо исправьте сопоставление и повторите загрузку");
		Элементы.ЗагрузитьПродолжитьЯМ.Видимость = Истина;
		Элементы.СписокТранзакцийExcelЯМ.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 13.05.2024 УА #75692

//+ ИнфоСофт Сумин Д.В. 13.05.2024 УА #75692
&НаСервере
Процедура ДобавитьСтрокиПосле30032024(Таблица, Продажа = Истина)
	
	КоличествоСтрок = Таблица.ВысотаТаблицы - 1;
	
	Попытка
		НачальнаяСтрока = Таблица.НайтиТекст("Номер заказа", , Таблица.Область("C1:C2")).Верх + 1;
	Исключение
		НачальнаяСтрока = 14;
	КонецПопытки;
	
	Для сч = НачальнаяСтрока По КоличествоСтрок Цикл	
		Попытка
			
			НоваяСтрока = СписокТранзакцийExcelЯМ.Добавить();
			НоваяСтрока.НаименованиеТовара		= Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 3).ТекущаяОбласть.Текст);			
			НоваяСтрока.SKU						= Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 4).ТекущаяОбласть.Текст);			
			Если Продажа Тогда			                                                                                                   
				НоваяСтрока.ЦенаПродавца			= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 14).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 14).ТекущаяОбласть.Текст));
				НоваяСтрока.ЦенаРеализация			= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 18).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 18).ТекущаяОбласть.Текст));
				НоваяСтрока.Количество				= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 7).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 7).ТекущаяОбласть.Текст));
				НоваяСтрока.РеализованоНаСумму		= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 21).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 21).ТекущаяОбласть.Текст));			
			Иначе
				НоваяСтрока.ЦенаПродавца			= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 15).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 15).ТекущаяОбласть.Текст));
				НоваяСтрока.ВозвратЦенаРеализации	= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 19).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 19).ТекущаяОбласть.Текст));
				НоваяСтрока.ВозвратКоличество		= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 7).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 7).ТекущаяОбласть.Текст));
				НоваяСтрока.ВозвращеноНаСумму		= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 22).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 22).ТекущаяОбласть.Текст));						
			КонецЕсли;
			
		Исключение
			Сообщение		= Новый СообщениеПользователю;
			Сообщение.Текст	= "Не удалось загрузить строку " + Строка(сч);
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 13.05.2024 УА #75692

//+ ИнфоСофт Стояк Ю.К. 19.05.2023 УА #58008
&НаСервере
Процедура ДобавитьСтроки(Таблица, Продажа = Истина)
	
	КоличествоСтрок = Таблица.ВысотаТаблицы - 1;
	
	//+ ИнфоСофт Сумин Д.В. 31.10.2023 УА #65226
	Попытка
		НачальнаяСтрока = Таблица.НайтиТекст("Номер заказа", , Таблица.Область("C1:C2")).Верх + 1;
	Исключение
		НачальнаяСтрока = 14;
	КонецПопытки;
	
	Для сч = НачальнаяСтрока По КоличествоСтрок Цикл
	//Для сч = 15 По КоличествоСтрок Цикл		
	//- ИнфоСофт Сумин Д.В. 31.10.2023 УА #65226 	
		Попытка
			
			НоваяСтрока = СписокТранзакцийExcelЯМ.Добавить();
			НоваяСтрока.НаименованиеТовара		= Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 3).ТекущаяОбласть.Текст);			
			НоваяСтрока.SKU						= Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 4).ТекущаяОбласть.Текст);			
			Если Продажа Тогда			                                                                                                   
				НоваяСтрока.ЦенаПродавца			= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 13).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 13).ТекущаяОбласть.Текст));
				НоваяСтрока.ЦенаРеализация			= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 17).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 17).ТекущаяОбласть.Текст));
				НоваяСтрока.Количество				= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 6).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 6).ТекущаяОбласть.Текст));
				НоваяСтрока.РеализованоНаСумму		= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 20).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 20).ТекущаяОбласть.Текст));			
			Иначе
				НоваяСтрока.ЦенаПродавца			= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 14).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 14).ТекущаяОбласть.Текст));
				НоваяСтрока.ВозвратЦенаРеализации	= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 18).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 18).ТекущаяОбласть.Текст));
				НоваяСтрока.ВозвратКоличество		= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 6).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 6).ТекущаяОбласть.Текст));
				НоваяСтрока.ВозвращеноНаСумму		= ?(Строка(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 21).ТекущаяОбласть.Текст) = "", 0, Число(Таблица.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 21).ТекущаяОбласть.Текст));						
			КонецЕсли;
			
		Исключение
			Сообщение		= Новый СообщениеПользователю;
			Сообщение.Текст	= "Не удалось загрузить строку " + Строка(сч);
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 19.05.2023 УА #58008

//+ ИнфоСофт Стояк Ю.К. 19.05.2023 УА #58008
&НаСервере
Процедура ЗагрузитьПродолжитьНаСервере()
	
	Если Элементы.Маркетплейсы.ТекущаяСтраница.Имя = "Ozon" Тогда  
		
		ОшибкаСопоставления = Ложь;
		
		Для Каждого Строка Из СписокТранзакцийExcel Цикл
			Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				ОшибкаСопоставления = Истина;			
			КонецЕсли;
		КонецЦикла;
		
		Если Не ОшибкаСопоставления Тогда    
			
			//+ ИнфоСофт Сумин Д.В. 12.02.2024 УА #70399
			РассчитатьИтоги();
			
			Отчет = ИС_Ozon_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокТранзакцийExcel, Комментарий, ВсегоКомиссияПослеСкидок);
			//Отчет = ИС_Ozon_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокТранзакцийExcel, Комментарий);
			//- ИнфоСофт Сумин Д.В. 12.02.2024 УА #70399
				
			Если ЗначениеЗаполнено(Отчет) Тогда
				СформированныеДокументы.Добавить().Документ = Отчет;
			КонецЕсли; 
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Есть позиции, по которым не удалось найти сопоставление. Заполните пустые строки и нажмите ""Загрузить"", либо исправьте сопоставление и повторите загрузку");
		КонецЕсли;
		
	ИначеЕсли Элементы.Маркетплейсы.ТекущаяСтраница.Имя = "Яндекс" Тогда 
		
		ОшибкаСопоставления = Ложь;
		
		Для Каждого Строка Из СписокТранзакцийExcelЯМ Цикл
			Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				ОшибкаСопоставления = Истина;			
			КонецЕсли;
		КонецЦикла;
		
		Если Не ОшибкаСопоставления Тогда    
			
			Отчет = ИС_ЯМ_Сервер.СоздатьДокументОтчетКомиссионера(Профиль, Период, СписокТранзакцийExcelЯМ, Комментарий);
			
			Если ЗначениеЗаполнено(Отчет) Тогда
				СформированныеДокументыЯндекс.Добавить().Документ = Отчет;
			КонецЕсли; 
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Есть позиции, по которым не удалось найти сопоставление. Заполните пустые строки и нажмите ""Загрузить"", либо исправьте сопоставление и повторите загрузку");
		КонецЕсли;
				
	КонецЕсли;
	
	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 19.05.2023 УА #58008

//+ ИнфоСофт Стояк Ю.К. 19.05.2023 УА #58008
&НаКлиенте
Процедура ЗагрузитьПродолжить(Команда)
	ЗагрузитьПродолжитьНаСервере();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 19.05.2023 УА #58008

//+ ИнфоСофт Сумин Д.В. 15.12.2023 УА #65730
&НаКлиенте
Процедура ПолучитьДанныеНачислений(Команда)
	Если Не ЗначениеЗаполнено(Период) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать период обрабатываемых данных.");
		Возврат;	
	КонецЕсли;	
	ПолучитьДанныеНачисленийНаСервере();
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 15.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 15.12.2023 УА #65730
&НаСервере
Процедура ПолучитьДанныеНачисленийНаСервере()
	Результат = ИС_Ozon_Сервер.ПолучитьСписокТранзакций(Профиль, Период);	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 15.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 12.02.2024 УА #70399
&НаСервере
Процедура РассчитатьИтоги()
	
	ВсегоКНачислению = СписокТранзакцийExcel.Итог("ИтогиКНачислению") - СписокТранзакцийExcel.Итог("ИтогоВозвращено");
	ВсегоНачисленоБаллов = СписокТранзакцийExcel.Итог("ДоплатаЗаСчетOzon") - СписокТранзакцийExcel.Итог("ВозвратДоплатаЗаСчетOzon");
	ВсегоБазоваяКомиссия = СписокТранзакцийExcel.Итог("ИтогиКомиссияСУчетомСкидокИНаценок") - СписокТранзакцийExcel.Итог("ВозвратИтогиКомиссияСУчетомСкидокИНаценок");
	ВсегоКомиссияПослеСкидок = ВсегоБазоваяКомиссия - ВсегоНачисленоБаллов;
	
	Если ВсегоКомиссияПослеСкидок < ВсегоБазоваяКомиссия / 100 Тогда
		ВсегоКомиссияПослеСкидок = ВсегоБазоваяКомиссия / 100;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 12.02.2024 УА #70399
