
#Область ОбработчикиСобытий

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	
	Профиль = ПараметрКоманды;
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Подсказка = "Введите имя поставки";
	ДопПараметры = Новый Структура("Профиль", Профиль);
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект, ДопПараметры);
	ПоказатьВводСтроки(Оповещение, "", Подсказка, 128);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

#КонецОбласти
                               
#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 24.01.23 УА #53535
&НаКлиенте
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт
    
    Если Строка = Неопределено Тогда
		Возврат;
    КонецЕсли;
	
	Результат = СоздатьПоставкуНаСервере(Параметры.Профиль, Строка);
	
	Если Результат <> Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поставка успешно создана");
		ОповеститьОбИзменении(Тип("СправочникСсылка.ИС_ВБ_ПоставкиFBS"));
	КонецЕсли;	
	        
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаСервере   
Функция СоздатьПоставкуНаСервере(Профиль, Имя)
	Возврат ИС_ВБ_Сервер.СоздатьНовуюПоставку(Профиль, Имя);	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

#КонецОбласти 
