
#Область ПрограммныйИнтерфейс

#Область Авторизация                        

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьТокенB2B(Профиль, ПараметрыЗапроса, СтруктураПараметров) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
	
	ТелоЗапроса = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(СтруктураПараметров);
	
	ПараметрыЗапроса.АдресРесурса = "/auth/token";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	ПараметрыЗапроса.ТелоСтрока   = ТелоЗапроса;
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьGETЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1", РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 200 Тогда
		
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если Не JSON = Неопределено Тогда				
			Возврат JSON;	
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьТокенSeller(Профиль, ПараметрыЗапроса, СтруктураПараметров) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
	
	ИмяМетода = "v1.tokens.create";
	
	СтруктураЗапроса = СформироватьСтруктуруJsonRPC(ИмяМетода, СтруктураПараметров);
	
	ТелоЗапроса = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(СтруктураЗапроса);
	
	ПараметрыЗапроса.АдресРесурса = "";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	ПараметрыЗапроса.ТелоСтрока   = ТелоЗапроса;
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьGETЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 200 Тогда
		
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если Не JSON = Неопределено Тогда				
			
			ЕстьОшибки = ПроверитьОтветСервиса(JSON);
			
			Если ЕстьОшибки Тогда
				Возврат Неопределено;
			Иначе
				Возврат JSON.result;
			КонецЕсли;
			
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьАтрибутыПользователя(Профиль, ПараметрыЗапроса, СтруктураПараметров) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
	
	ИмяМетода = "v1.dictionaries.get";
	
	СтруктураЗапроса = СформироватьСтруктуруJsonRPC(ИмяМетода, СтруктураПараметров);

	ТелоЗапроса = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(СтруктураЗапроса);
	
	ПараметрыЗапроса.АдресРесурса = "";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	ПараметрыЗапроса.ТелоСтрока   = ТелоЗапроса;
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 200 Тогда
		
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если Не JSON = Неопределено Тогда				
			
			ЕстьОшибки = ПроверитьОтветСервиса(JSON);
			
			Если ЕстьОшибки Тогда
				Возврат Неопределено;
			Иначе
				Возврат JSON.result;
			КонецЕсли;
			
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#Область Номенклатура

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьНоменклатуру(Профиль, ПараметрыЗапроса, СтруктураПараметров) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
	
	ИмяМетода = "v1.nomenclatures.list";
	
	СтруктураЗапроса = СформироватьСтруктуруJsonRPC(ИмяМетода, СтруктураПараметров);
	
	ТелоЗапроса = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(СтруктураЗапроса);
	
	ПараметрыЗапроса.АдресРесурса = "";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	ПараметрыЗапроса.ТелоСтрока   = ТелоЗапроса;
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;
	КонецЕсли;	
	
	Если РезультатЗапроса.КодОтвета = 200 Тогда
		
		СтруктураОтвета = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда				
			
			ЕстьОшибки = ПроверитьОтветСервиса(СтруктураОтвета);
			
			Если ЕстьОшибки Тогда
				Возврат Неопределено;
			Иначе
				Возврат СтруктураОтвета.result;
			КонецЕсли;
			
		КонецЕсли;
		
		Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
		
	КонецЕсли;
	
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#Область Цены

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция УстановитьЦены(Профиль, ПараметрыЗапроса, СтруктураПараметров) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
	
	ИмяМетода = "v1.nomenclature.set-price";
	
	СтруктураЗапроса = СформироватьСтруктуруJsonRPC(ИмяМетода, СтруктураПараметров);
	
	ТелоЗапроса = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(СтруктураЗапроса);
	
	ПараметрыЗапроса.АдресРесурса = "";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	ПараметрыЗапроса.ТелоСтрока   = ТелоЗапроса;
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 200 Тогда
		
		СтруктураОтвета = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда				
			
			ЕстьОшибки = ПроверитьОтветСервиса(СтруктураОтвета);
			
			Если ЕстьОшибки Тогда
				Возврат Неопределено;
			Иначе
				Возврат СтруктураОтвета.result;
			КонецЕсли;
			
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;	
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ОбновитьЦены(Профиль, ПараметрыЗапроса, СтруктураПараметров) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
	
	ИмяМетода = "v1.nomenclature.update-price";
	
	СтруктураЗапроса = СформироватьСтруктуруJsonRPC(ИмяМетода, СтруктураПараметров);
	
	ТелоЗапроса = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(СтруктураЗапроса);
	
	ПараметрыЗапроса.АдресРесурса = "";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	ПараметрыЗапроса.ТелоСтрока   = ТелоЗапроса;
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1", РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 200 Тогда
		
		СтруктураОтвета = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда				
			
			ЕстьОшибки = ПроверитьОтветСервиса(СтруктураОтвета);
			
			Если ЕстьОшибки Тогда
				Возврат Неопределено;
			Иначе
				Возврат СтруктураОтвета.result;
			КонецЕсли;
			
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;	
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьЦены(Профиль, ПараметрыЗапроса) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
	
	ПараметрыЗапроса.АдресРесурса = "/api/v1/nomenclature/sell-values";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 200 Тогда
		
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если Не JSON = Неопределено И Не JSON.Свойство("_embedded") = Неопределено Тогда				
			Возврат JSON._embedded;	
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;	
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#Область Остатки

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ВыгрузитьОстатки(Профиль, ПараметрыЗапроса, СтруктураПараметров) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
	
	ТелоЗапроса = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(СтруктураПараметров);
	
	ПараметрыЗапроса.АдресРесурса = "/api/v1/stock/goods";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	ПараметрыЗапроса.ТелоСтрока   = ТелоЗапроса;
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 201 Тогда
		
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если Не JSON = Неопределено Тогда				
			Возврат JSON;	
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;	
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьОстатки(Профиль, ПараметрыЗапроса, СтруктураПараметров) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
	
	ТелоЗапроса = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(СтруктураПараметров);
	
	ПараметрыЗапроса.АдресРесурса = "/api/v1/stock/goods";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	ПараметрыЗапроса.ТелоСтрока   = ТелоЗапроса;
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьGETЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 200 Тогда
		
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если Не JSON = Неопределено И Не JSON.Свойство("_embedded") = Неопределено Тогда				
			Возврат JSON._embedded;	
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;	
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#Область Заказы

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьСписокЗаказов(Профиль, ПараметрыЗапроса, СтруктураПараметров) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		              
	ТелоЗапроса = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(СтруктураПараметров);
	
	ПараметрыЗапроса.АдресРесурса = "/api/v1/orders";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	ПараметрыЗапроса.ТелоСтрока   = ТелоЗапроса;
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьGETЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 200 Тогда
		
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если Не JSON = Неопределено И Не JSON.Свойство("_embedded") = Неопределено Тогда				
			Возврат JSON._embedded;	
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;	
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ПолучитьДетальнуюИнформациюОЗаказе(Профиль, ПараметрыЗапроса, СтруктураПараметров) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
	
	ТелоЗапроса = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(СтруктураПараметров);
	
	ПараметрыЗапроса.АдресРесурса = СтрШаблон("/api/v1/orders/%1", СтруктураПараметров.orderNr);
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	ПараметрыЗапроса.ТелоСтрока   = ТелоЗапроса;
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьGETЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 200 Тогда
		
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если Не JSON = Неопределено Тогда				
			Возврат JSON;	
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120	

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ОбновитьСтатусЗаказа(Профиль, ПараметрыЗапроса, СтруктураПараметров) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
	
	ТелоЗапроса = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(СтруктураПараметров);
	
	ПараметрыЗапроса.АдресРесурса = СтрШаблон("/api/v1/orders/%1/change_status_request", СтруктураПараметров.orderNr);
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	ПараметрыЗапроса.ТелоСтрока   = ТелоЗапроса;
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 201 Тогда	
		Возврат Истина;	
	КонецЕсли;
		
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120	

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция ОбновитьСтатусТовара(Профиль, ПараметрыЗапроса, СтруктураПараметров) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
	
	ТелоЗапроса = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(СтруктураПараметров);
	
	ПараметрыЗапроса.АдресРесурса = СтрШаблон("api/v1/orders/%1/items/%2/change_status_request", СтруктураПараметров.orderNr, СтруктураПараметров.itemNr);
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	ПараметрыЗапроса.ТелоСтрока   = ТелоЗапроса;
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 201 Тогда
		Возврат Истина;	
	КонецЕсли;
	
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция СтруктураПараметровЗапросаСпискаНоменклатуры(limit = 1, page = 1) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("page",           page);
	Результат.Вставить("limit",          limit);
	Результат.Вставить("country",        "RU");
	Результат.Вставить("exclude_prices", Ложь);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция СтруктураПараметровЗапросаОбновленияЦен() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("country",    "RU"); 
	Результат.Вставить("seller_sku", "");
	Результат.Вставить("price",      0);
	Результат.Вставить("sale_price", 0);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Процедура ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса)
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type", "application/json");
	ПараметрыЗапроса.Заголовки.Вставить("Accept",       "application/json");
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Процедура РазобратьHTTPОтветПоКоду(СтруктураОтвета)
	
	Если СтруктураОтвета.КодОтвета = 400 Тогда
		
		Текст = СтрШаблон("Передан неверный параметр, код ответа: %1, ошибка: %2", 
			СтруктураОтвета.КодОтвета, СтруктураОтвета.Ответ);
	
	ИначеЕсли СтруктураОтвета.КодОтвета = 401 Тогда
		
		Текст = СтрШаблон("Отказ в доступе, код ответа: %1, ошибка: %2", 
			СтруктураОтвета.КодОтвета, СтруктураОтвета.Ответ);
	
	ИначеЕсли СтруктураОтвета.КодОтвета = 403 Тогда
		
		Текст = СтрШаблон("Доступ запрещен, код ответа: %1, ошибка: %2", 
			СтруктураОтвета.КодОтвета, СтруктураОтвета.Ответ);
		
	ИначеЕсли СтруктураОтвета.КодОтвета = 500 Тогда
		
		Текст = СтрШаблон("Произошла внутренняя ошибка сервера, код ответа: %1, ошибка: %2", 
			СтруктураОтвета.КодОтвета, СтруктураОтвета.Ответ);
		
	Иначе
		
		Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
			СтруктураОтвета.КодОтвета, СтруктураОтвета.Ответ);
		
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(Текст);

КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Процедура ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса)
       
	Если Не Профиль.РежимОтладки Тогда
		Возврат;
	КонецЕсли;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода;
		
	ИС_МП_Сервер.ЗаписатьДанныеОтладки(Профиль, Маркетплейс, ПараметрыЗапроса, РезультатЗапроса);	

КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 14.01.25 УА #90120
Функция СформироватьСтруктуруJsonRPC(ИмяМетода, ПараметрыЗапроса)
	
	СтруктураЗапроса = Новый Структура(
		"jsonrpc,
		|id,
		|method,
		|params");
	СтруктураЗапроса["jsonrpc"] = "2.0";
	СтруктураЗапроса["id"]      = Строка(Новый УникальныйИдентификатор);
	СтруктураЗапроса["method"]  = ИмяМетода;
	СтруктураЗапроса["params"]  = ПараметрыЗапроса;
	
	Возврат СтруктураЗапроса;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.01.25 УА #90120

//+ ИнфоСофт Власова И.С. 14.01.25 УА #90120
Функция ПолучитьСтруктуруЗапроса()
	
	Возврат Новый Структура("ИмяМетода, ПараметрыМетода");
	
КонецФункции //- ИнфоСофт Власова И.С. 14.01.25 УА #90120

//+ ИнфоСофт Власова И.С. 14.01.25 УА #90120
Функция ПроверитьОтветСервиса(СтруктураОтвета)
	
	ЕстьОшибки = Ложь;
	
	Если ЕстьКлюч(СтруктураОтвета, "error") Тогда
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Ошибка при проверке ответа от сервиса.
				|Код ошибки: %1,
				|Сообщение: %2.'"), 
			СтруктураОтвета["error"]["code"], 
			СтруктураОтвета["error"]["message"]);
			
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		ЕстьОшибки = Истина;
		
	КонецЕсли;
	
	Если Не ЕстьКлюч(СтруктураОтвета, "result") Тогда
		
		ТекстСообщения = НСтр("ru = 'Ошибка при проверке ответа от сервиса.
			|Отсутствует поле result.'");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		ЕстьОшибки = Истина;
		
	КонецЕсли;
	
	Возврат ЕстьОшибки;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.01.25 УА #90120

//+ ИнфоСофт Власова И.С. 14.01.25 УА #90120
Функция ЕстьКлюч(Коллекция, Ключ)
	
	Если Коллекция = Неопределено
		ИЛИ Не ТипЗнч(Коллекция) = Тип("Структура") Тогда
		
		Возврат Ложь;
		
	Иначе
		Возврат Не Коллекция.Свойство(Ключ) = Неопределено;
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.01.25 УА #90120

#КонецОбласти
