
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 22.06.21 УА #37078
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИС_МП_Сервер.ПриСозданииНаСервере(ЭтотОбъект);	
	Маркетплейс = "ВБ";
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.06.21 УА #37078

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ОпределитьИнтегрируемыеМаркетплейсы();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 01.10.23 УА #64020
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Оповещение", Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект));
	
	ИС_МП_Клиент.ПриОткрытии(ЭтотОбъект, Отказ, ДопПараметры);
	
	// +#Удалить
	Если Маркетплейс = "WildBerries" Тогда
		Маркетплейс = "ВБ";	
	КонецЕсли;
	// -#Удалить
	
	Элементы.ГруппаСтраницыМаркетплейсов.ТекущаяСтраница = Элементы["Страница" + Маркетплейс];
	ГруппаСтраницыМаркетплейсовПриСменеСтраницы(Элементы.ГруппаСтраницыМаркетплейсов, Элементы["Страница" + Маркетплейс]);	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.10.23 УА #64020

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	ОпределитьИнтегрируемыеМаркетплейсы();
	ГруппаСтраницыМаркетплейсовПриСменеСтраницы(Элементы.ГруппаСтраницыМаркетплейсов, 
		Элементы.ГруппаСтраницыМаркетплейсов.ТекущаяСтраница);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 01.10.23 УА #64020
&НаКлиенте
Процедура ГруппаСтраницыМаркетплейсовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Маркетплейс = СтрЗаменить(ТекущаяСтраница.Имя, "Страница", "");
	
	Если Маркетплейс = "Сбер" И Не ЗначениеЗаполнено(АдресВременногоХранилищаСбер) Тогда
		Элементы.ЗагрузитьТовары.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Маркетплейс = "МВМ" И Не ЗначениеЗаполнено(АдресВременногоХранилищаМВМ) Тогда
		Элементы.ЗагрузитьТовары.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ЗагрузитьТовары.Доступность = Истина;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.10.23 УА #64020

//+ ИнфоСофт Ивонин К.А. 24.10.24 УА #68001
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	
	Маркетплейс = СтрЗаменить(Элемент.Имя, "ПутьФайла", "");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Реквизит", Элемент.Имя);
	ДополнительныеПараметры.Вставить("Адрес", "АдресВременногоХранилища" + Маркетплейс);  	
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.Диалог.Заголовок = "Выберите файл товаров " + ИС_МП_Клиент.ПредставлениеМаркетплейса(Маркетплейс);
	ПараметрыЗагрузки.Диалог.ПроверятьСуществованиеФайла = Истина;
	ПараметрыЗагрузки.Диалог.Фильтр = "Excel файлы(*.xlsx)|*.xlsx";
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;

	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузки);
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 07.02.25 УА #92406
&НаКлиенте
Процедура ПутьФайлаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект[Элемент.Имя]) Тогда
		Постфикс = СтрЗаменить(Элемент.Имя, "ПутьФайла", "");
		УдалитьИзВременногоХранилища(ЭтотОбъект["АдресВременногоХранилища" + Постфикс]);
		ЭтотОбъект["АдресВременногоХранилища" + Постфикс] = "";
		Элементы.ЗагрузитьТовары.Доступность = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 01.10.23 УА #64020
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗначениеЗаполнено(АдресВременногоХранилищаСбер) Тогда
		УдалитьИзВременногоХранилища(АдресВременногоХранилищаСбер);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресВременногоХранилищаМВМ) Тогда
		УдалитьИзВременногоХранилища(АдресВременногоХранилищаМВМ);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.10.23 УА #64020

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 14.09.22 УА #49591
&НаКлиенте
Процедура ЗагрузитьТовары(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ИмяФункции = ИС_МП_Клиент.ИмяФункцииЗагрузкиТоваров(Маркетплейс);
	ДопПараметры = ИС_МП_Клиент.ДопПараметрыЗагрузкиТоваров(Маркетплейс, ЭтотОбъект);
	
	Если ДопПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = НачатьЗагрузкуТоваров(Профиль, Маркетплейс, ИмяФункции, 
		ДопПараметры, Перезаполнять, УникальныйИдентификатор);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ЗагрузитьТовары.Доступность = Ложь;
	Элементы.ДекорацияОжидание.Заголовок = "Пожалуйста, подождите. Идет загрузка товаров...";
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОжидание; 
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьТоварыЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.09.22 УА #49591

//+ ИнфоСофт Ивонин К.А. 28.10.22 УА #49591
&НаКлиенте
Процедура Назад(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаНачало;
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.10.22 УА #49591

//+ ИнфоСофт Ивонин К.А. 06.11.24 УА #68001
&НаКлиенте
Процедура Отменить(Команда)
	ОтменитьНаСервере(ИдентификаторЗадания);
	Элементы.ЗагрузитьТовары.Доступность = Истина;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаНачало;
	ОбщегоНазначенияКлиент.СообщитьПользователю("Загрузка товаров отменена");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.11.24 УА #68001

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #86001
&НаСервере   
Процедура ОпределитьИнтегрируемыеМаркетплейсы()
	
	ИнтегрируемыеМаркетплейсы = ИС_МП_Сервер.ИнтегрируемыеМаркетплейсы();
		
	СтруктураНастроек = Новый Структура;
	
	Для Каждого Элемент Из ИнтегрируемыеМаркетплейсы Цикл
		СтруктураНастроек.Вставить(Элемент, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "Интеграция" + Элемент));	
	КонецЦикла;
	
	ТребуетсяСменаСтраницы = Ложь;
	ПерваяДоступнаяСтраница = Неопределено;
	
	Для Каждого Элемент Из СтруктураНастроек Цикл 
		
		ИмяСтраницы = "Страница" + Элемент.Ключ;
		Видимость = ?(Элемент.Значение = Неопределено, Ложь, Элемент.Значение);
		Элементы[ИмяСтраницы].Видимость = Видимость;
		
		Если Видимость Тогда
			Элементы["ДекорацияТовары" + Элемент.Ключ].Заголовок = "Сейчас загружено: "
				+ ИС_МП_Сервер.КоличествоТоваров(Профиль, Элемент.Ключ);	
		КонецЕсли;
		
		Если Видимость И Не ЗначениеЗаполнено(ПерваяДоступнаяСтраница) Тогда
			ПерваяДоступнаяСтраница = ИмяСтраницы; 
		КонецЕсли;
		
		Если Не Видимость И Элементы.ГруппаСтраницыМаркетплейсов.ТекущаяСтраница = Элементы[ИмяСтраницы] Тогда
			ТребуетсяСменаСтраницы = Истина;	
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТребуетсяСменаСтраницы Тогда 
		
		Если ЗначениеЗаполнено(ПерваяДоступнаяСтраница) Тогда
			Элементы.ГруппаСтраницыМаркетплейсов.ТекущаяСтраница = Элементы[ПерваяДоступнаяСтраница];		
		Иначе
			
			Для Каждого Страница Из Элементы.ГруппаСтраницыМаркетплейсов.ПодчиненныеЭлементы Цикл
				
				Если Страница.Видимость Тогда
					Элементы.ГруппаСтраницыМаркетплейсов.ТекущаяСтраница = Страница;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;

		КонецЕсли;		
			
	КонецЕсли;
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #86001

//+ ИнфоСофт Ивонин К.А. 07.02.25 УА #92406
&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Не Результат Тогда
		Элементы.ПутьФайлаСбер.Доступность = Ложь;
		Элементы.ПутьФайлаМВМ.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 24.10.24 УА #68001
&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(Результат, Параметры) Экспорт
		
	Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Элементы.ЗагрузитьТовары.Доступность = Истина;

	ЭтотОбъект[Параметры.Реквизит] = Результат.Имя;
	ЭтотОбъект[Параметры.Адрес] = Результат.Хранение;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.22 УА #49591
&НаСервереБезКонтекста
Функция НачатьЗагрузкуТоваров(Профиль, Маркетплейс, ИмяФункции, Знач ДопПараметры, Перезаполнять, УникальныйИдентификатор)
	
	ДопПараметры = ИС_МП_Сервер.ОбработатьДопПараметрыЗагрузкиТоваров(Маркетплейс, ДопПараметры);
	
	Если ДопПараметры = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяФункции, Профиль, Перезаполнять, ДопПараметры);	

КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.22 УА #49591

//+ ИнфоСофт Ивонин К.А. 28.10.22 УА #49591
&НаКлиенте
Функция ПараметрыОжидания()
	
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОбновитьПрогрессВыполнения", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = "Идет процесс загрузки товаров...";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессеВыполнения;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ПолучатьРезультат = Истина;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.НавигационнаяСсылка = "e1cib/app/Обработка.ИС_МП_ЗагрузкаТоваров";
		
	Возврат ПараметрыОжидания;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.22 УА #49591

//+ ИнфоСофт Ивонин К.А. 28.10.22 УА #49591
&НаКлиенте
Процедура ЗагрузитьТоварыЗавершение(Результат, Параметры) Экспорт
	
	Элементы.ЗагрузитьТовары.Доступность = Истина;
	
	Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
				
	Если Результат.Статус = "Ошибка" Тогда
		
		ПоказатьПредупреждение( , Результат.ПодробноеПредставлениеОшибки, , 
			"Произошла ошибка во время загрузки товаров");
		
		Для Каждого Элемент Из Результат.Сообщения Цикл 
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);	
		КонецЦикла;
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаНачало;
		
		Возврат;
		
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаЗавершение;
	
	Если Результат.Свойство("АдресРезультата") И ЗначениеЗаполнено(Результат.АдресРезультата) Тогда	
		
		РезультатФункции = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если РезультатФункции <> Неопределено Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатФункции);
		КонецЕсли;
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Загрузка завершена");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.10.22 УА #49591

//+ ИнфоСофт Ивонин К.А. 06.11.24 УА #86001
&НаКлиенте
Процедура ОбновитьПрогрессВыполнения(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Прогресс <> Неопределено Тогда
		Элементы.ДекорацияОжидание.Заголовок = "Пожалуйста, подождите. Идет загрузка товаров..." 
			+ Символы.ПС + Результат.Прогресс.Текст;
	КонецЕсли;
	
	Если Результат.Свойство("Сообщения") И Результат.Сообщения <> Неопределено Тогда
	
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение.Текст);	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.11.24 УА #86001

//+ ИнфоСофт Ивонин К.А. 06.11.24 УА #68001
&НаСервереБезКонтекста
Процедура ОтменитьНаСервере(ИдентификаторЗадания)
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.11.24 УА #68001

#КонецОбласти
