
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 28.09.23 УА #64020
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Профиль") Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не выбран профиль");
		Возврат;
	КонецЕсли;
	
	Профиль = Параметры.Профиль;
	
	СписокМагазинов = ПолучитьСписокМагазиновНаСервере(Профиль);
	
	Если СписокМагазинов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
    ЗаполнитьТаблицуМагазинов(СписокМагазинов);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.09.23 УА #64020

//+ ИнфоСофт Ивонин К.А. 29.09.23 УА #64020
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЭтоВыбор Тогда
		
		ТекДанные = Элементы.ТаблицаМагазинов.ТекущиеДанные;
		
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("CampaignID", ТекДанные.id);
		ПараметрыЗакрытия.Вставить("BusinessID", ТекДанные.BusinessID);
		
		//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
		ПараметрыЗакрытия.Вставить("МодельРаботы", ТекДанные.placementType);
		//- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277

		Оповестить("ВыборМагазина", ПараметрыЗакрытия, ЭтотОбъект);
		
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.09.23 УА #64020

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 29.09.23 УА #64020
&НаКлиенте
Процедура Выбрать(Команда)
	ЭтоВыбор = Истина;
	Закрыть();	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.09.23 УА #64020

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 29.09.23 УА #64020
&НаСервереБезКонтекста   
Функция ПолучитьСписокМагазиновНаСервере(Профиль)
	Возврат ИС_ЯМ_Сервер.ПолучитьСписокМагазинов(Профиль);	
КонецФункции //- ИнфоСофт Ивонин К.А. 29.09.23 УА #64020

//+ ИнфоСофт Ивонин К.А. 29.09.23 УА #64020
&НаСервере   
Процедура ЗаполнитьТаблицуМагазинов(СписокМагазинов)
	
	ТаблицаМагазинов.Очистить();
	
	Для Каждого Магазин Из СписокМагазинов Цикл
		
		НоваяСтрока = ТаблицаМагазинов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Магазин);
		
		Если Магазин.Свойство("business") Тогда
			
			Если Магазин.business.Свойство("id") Тогда
				НоваяСтрока.BusinessID = Магазин.business.id;
			КонецЕсли;	
			
		КонецЕсли;
			
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.ЛичныйКабинет КАК Профиль,
	|	ИС_MP_Настройки.Значение КАК Значение
	|ИЗ
	|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.Наименование = ""ЯМКампанияID""";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПараметров = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаПараметров.Следующий() Цикл
	    
	    Если Не ЗначениеЗаполнено(ВыборкаПараметров.Значение) Тогда
	    	Продолжить;
	    КонецЕсли;
	    
	    Попытка 
	    	ИД = Число(ВыборкаПараметров.Значение);
	    Исключение
	    	Продолжить;
	    КонецПопытки;
	    
		НайденныеСтроки = ТаблицаМагазинов.НайтиСтроки(Новый Структура("id", ИД));
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			Строка.Профиль = ВыборкаПараметров.Профиль;
		КонецЦикла;
	
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.09.23 УА #64020

#КонецОбласти
