
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 19.12.22 УА #52439
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьНастройки();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.12.22 УА #52439

//+ ИнфоСофт Ивонин К.А. 19.12.22 УА #52439
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;

	СохранитьНастройки();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.12.22 УА #52439

//+ ИнфоСофт Ивонин К.А. 19.12.22 УА #52439

&НаКлиенте
Процедура ПутьККаталогуОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	ОчиститьСообщения(); 
	  	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Заголовок = "Выберите каталог обмена";
	ДиалогВыбораФайла.МножественныйВыбор =  Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
		
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ПутьККаталогуОбменаЗавершение", ЭтотОбъект));

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.12.22 УА #52439

#КонецОбласти

#Область ОбработчикиКомандФормы 

//+ ИнфоСофт Ивонин К.А. 19.12.22 УА #52439
&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	ВыполнитьОбменНаСервере(ПутьККаталогуОбмена);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.12.22 УА #52439

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 19.12.22 УА #52439
&НаСервереБезКонтекста
Процедура ВыполнитьОбменНаСервере(ПутьККаталогуОбмена)
	
	ВыборкаУзлов = ПланыОбмена.ИС_WB_ПланОбмена.Выбрать();

	Пока ВыборкаУзлов.Следующий() Цикл	
	
		Если ВыборкаУзлов.Ссылка <> ПланыОбмена.ИС_WB_ПланОбмена.ЭтотУзел() Тогда
			
			УзелОбъект = ВыборкаУзлов.ПолучитьОбъект();	
			УзелОбъект.ПрочитатьСообщениеСИзменениями(ПутьККаталогуОбмена);	
			УзелОбъект.ЗаписатьСообщениеСИзменениями(ПутьККаталогуОбмена);
				
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.12.22 УА #52439

//+ ИнфоСофт Ивонин К.А. 19.12.22 УА #52439
&НаСервере   
Процедура ПолучитьНастройки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Наименование КАК Наименование,
	|	ИС_MP_Настройки.Значение КАК Значение
	|ИЗ
	|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.Наименование = ""КаталогОбмена""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПутьККаталогуОбмена = Выборка.Значение;
	КонецЕсли;
	                                           	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.12.22 УА #52439

//+ ИнфоСофт Ивонин К.А. 19.12.22 УА #52439
&НаСервере   
Процедура СохранитьНастройки()
    
    Событие = ПолучитьИмяСобытия("СохранитьНастройки");
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Ссылка КАК Ссылка,
	|	ИС_MP_Настройки.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.Наименование = ""КаталогОбмена""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Если Выборка.Следующий() Тогда
	
		ОбъектЗаписи = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗаписи.Значение = ПутьККаталогуОбмена;
				
		Попытка
			ОбъектЗаписи.Записать();
		Исключение
		    ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 	    
		КонецПопытки;
		
	Иначе
	
		ОбъектЗаписи = Справочники.ИС_MP_Настройки.СоздатьЭлемент();		
		ОбъектЗаписи.Наименование = "КаталогОбмена";
		ОбъектЗаписи.Значение = ПутьККаталогуОбмена;
	
		Попытка
			ОбъектЗаписи.Записать();
		Исключение
	        ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.12.22 УА #52439

//+ ИнфоСофт Ивонин К.А. 19.12.22 УА #52439
&НаКлиенте
Процедура ПутьККаталогуОбменаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьККаталогуОбмена = Результат[0];	
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.12.22 УА #52439

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Функция ПолучитьИмяСобытия(Имя)
	Возврат СтрШаблон("ИС.ИС_WB_ОбменДанными.Форма.%1", Имя);
КонецФункции //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

#КонецОбласти
