
#Область ОбработчикиСобытий

//+ ИнфоСофт Стояк Ю.К. 26.03.2025 УА #67821
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	
	Если Константы.ИспользуетсяЦенообразование25.Получить() Тогда
		СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных25");
	Иначе
		СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КонецЕсли;	
	
	ИтоговыеНастройки = КомпоновщикНастроек.ПолучитьНастройки();		
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ИтоговыеНастройки, ДанныеРасшифровки);
	
	СтандартнаяОбработка = Истина;  
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 26.03.2025 УА #67821

#КонецОбласти