
#Область СлужебныйПрограммныйИнтерфейс

#Область Маркетплейсы

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #86001
Функция ИнтегрируемыеМаркетплейсы() Экспорт

	ДоступныеМаркетплейсы = Новый Массив;
	ДоступныеМаркетплейсы.Добавить("ВБ");
	ДоступныеМаркетплейсы.Добавить("Озон");
	ДоступныеМаркетплейсы.Добавить("ЯМ");
	ДоступныеМаркетплейсы.Добавить("Сбер");
	ДоступныеМаркетплейсы.Добавить("Али");
	ДоступныеМаркетплейсы.Добавить("МВМ");
	ДоступныеМаркетплейсы.Добавить("Ламода");
	
	Возврат ДоступныеМаркетплейсы;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.10.24 УА #86001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Функция НастройкиСоединенияПоУмолчанию(Маркетплейс) Экспорт
	
	ОбщийМодуль = ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.НастройкиСоединенияПоУмолчанию();	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
Функция ПараметрыТестаПодключения(Маркетплейс, Форма) Экспорт
	
	ОбщийМодуль = ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ПараметрыТестаПодключения(Форма);
	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 25.10.24 УА #68001
Функция ИмяФункцииЗагрузкиТоваров(Маркетплейс) Экспорт	

	ОбщийМодуль = ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ИмяФункцииЗагрузкиТоваров();	

КонецФункции //- ИнфоСофт Ивонин К.А. 25.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 25.10.24 УА #68001
Функция ДопПараметрыЗагрузкиТоваров(Маркетплейс, Форма) Экспорт	

	ОбщийМодуль = ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ДопПараметрыЗагрузкиТоваров(Форма);	

КонецФункции //- ИнфоСофт Ивонин К.А. 25.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 20.03.24 УА #71892
Функция ПолеСопоставленияОстатков(Маркетплейс) Экспорт
		
	ОбщийМодуль = ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ПолеСопоставленияОстатков();

КонецФункции //- ИнфоСофт Ивонин К.А. 20.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 27.05.24 УА #76529
Функция ПредставлениеМаркетплейса(Маркетплейс) Экспорт	

	ОбщийМодуль = ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ПредставлениеМаркетплейса();

КонецФункции //- ИнфоСофт Ивонин К.А. 27.05.24 УА #76529

#КонецОбласти

//+ ИнфоСофт Ивонин К.А. 05.06.23 УА #59411
Процедура ПриНачалеРаботыСистемы() Экспорт

 	Попытка
		ИС_MP_РаботаСРегламентнымиЗаданиями.ОбработкаЗапускаРегламентныхЗаданийЗагружена();
	Исключение
	КонецПопытки;
	
	Попытка
		ИС_МП_ОбновлениеМодуля.ВыполнитьОтложенноеОбновление();
	Исключение
	КонецПопытки;
		
	Попытка 
							
		Результат = ИС_МП_ОбновлениеМодуля.ТестПодключения(Истина);
		
		Если Результат = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если Результат.ТокенКорректный И Результат.ПроверкаПройдена Тогда 
			
			ИнформацияОбОбновлении = ИС_МП_ОбновлениеМодуля.ИнформацияОбОбновлении(Истина);
			
			Если ИнформацияОбОбновлении.ЕстьОшибки Тогда
				Возврат;
			КонецЕсли;
			
			Если ИнформацияОбОбновлении.ЕстьНоваяВерсия Тогда
				
				ТекстСообщения = "Обновление модуля ""Управление маркетплейсами на 1С"""; 
				
				Пояснение = СтрШаблон("Доступна новая версия модуля ""Управление маркетплейсами на 1С"": %1 (Нажмите для просмотра)",
					ИнформацияОбОбновлении.НоваяВерсия);

				ПоказатьОповещениеПользователя(ТекстСообщения, "e1cib/command/Обработка.ИС_МП_Поддержка.Команда.ОткрытьФормуПанельНавигации", Пояснение,
					БиблиотекаКартинок.ИС_MP_Оповещение, СтатусОповещенияПользователя.Важное, ИнформацияОбОбновлении.НоваяВерсия);
					
			КонецЕсли;
			
		КонецЕсли;

	Исключение
	КонецПопытки;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 05.06.23 УА #59411

//+ ИнфоСофт Ивонин К.А. 01.08.24 УА #79145
Процедура ПриОткрытии(ЭтотОбъект, Отказ, Знач ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;	
	КонецЕсли;
	
#Если ВебКлиент Тогда
	Оповещение = ?(ДопПараметры.Свойство("Оповещение"), ДопПараметры.Оповещение, Новый ОписаниеОповещения); 	
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(Оповещение);
#КонецЕсли

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.08.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 28.08.24 УА #81109
// Исходная версия см. ФайловаяСистемаКлиент.НапечататьИзПриложенияПоИмениФайла
// Выполняет печать файла внешним приложением.
//
// Параметры:
//  ИмяОткрываемогоФайла - Строка
//  Принтер - Строка
//
Процедура НапечататьИзПриложения(ИмяОткрываемогоФайла, Принтер = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяОткрываемогоФайла) Тогда
		Возврат;
	КонецЕсли;
	
#Если Не МобильныйКлиент Тогда
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
		Shell = Новый COMОбъект("Shell.Application");
		Shell.ShellExecute(ИмяОткрываемогоФайла, Принтер, "", "printto", 0);
	ИначеЕсли ОбщегоНазначенияКлиент.ЭтоLinuxКлиент() Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяОткрываемогоФайла", ИмяОткрываемогоФайла);
		ДополнительныеПараметры.Вставить("Принтер", Принтер);
		ОписаниеОповещения = Новый ОписаниеОповещения("НапечататьИзПриложенияПоИмениФайлаLinux", 
			ЭтотОбъект, ДополнительныеПараметры);
		ПроверитьПрограммаLinuxУстановлена("Unoconv", ОписаниеОповещения);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Печать файлов данного типа возможна только из приложения для Windows или Linux.'"));
		Возврат;
	КонецЕсли;
#КонецЕсли

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.08.24 УА #81109

//+ ИнфоСофт Ивонин К.А. 29.08.24 УА #81109
// Перенесено см. ФайловаяСистемаКлиент.ПроверитьПрограммаLinuxУстановленаЗавершение 
Процедура ПроверитьПрограммаLinuxУстановленаЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПроцедуры = СтрНайти(Результат.ПотокВывода, "Status: install ok installed") <> Ложь;
	ВыполнитьОбработкуОповещения(Параметры.Оповещение, РезультатПроцедуры);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.08.24 УА #81109

//+ ИнфоСофт Ивонин К.А. 28.08.24 УА #81109
// Перенесено см. ФайловаяСистемаКлиент.НапечататьИзПриложенияПоИмениФайлаLinux
Процедура НапечататьИзПриложенияПоИмениФайлаLinux(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = Ложь Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Требуется установка программы ""Unoconv"" в системе'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НапечататьИзПриложенияПоИмениФайлаLinuxЗапускUnoconv", 
		ЭтотОбъект, Параметры);
	ПолучитьПолноеИмяВременногоФайла(ОписаниеОповещения);
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.08.24 УА #81109

//+ ИнфоСофт Ивонин К.А. 28.08.24 УА #81109
// Исходная версия см. ФайловаяСистемаКлиент.НапечататьИзПриложенияПоИмениФайлаLinuxЗапускUnoconv
Процедура НапечататьИзПриложенияПоИмениФайлаLinuxЗапускUnoconv(ИмяВременногоФайла, Параметры) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ФайлКонвертируемыхДанных", ИмяВременногоФайла);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НапечататьИзПриложенияПоИмениФайлаLinuxЗапускLpr", 
		ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();
	ПараметрыЗапускаПрограммы.Вставить("ДождатьсяЗавершения", Истина);
	ПараметрыЗапускаПрограммы.Вставить("ПолучитьПотокОшибок", Истина);
	ПараметрыЗапускаПрограммы.Вставить("Оповещение", ОписаниеОповещения);
	
	СтрокаКоманды = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("unoconv %1 --stdout '%2' >""%3""",
		?(Параметры.Принтер = "", "", "-P " + Параметры.Принтер)
		, Параметры.ИмяОткрываемогоФайла, ИмяВременногоФайла);
	ФайловаяСистемаКлиент.ЗапуститьПрограмму(СтрокаКоманды, ПараметрыЗапускаПрограммы);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.08.24 УА #81109

//+ ИнфоСофт Ивонин К.А. 29.08.24 УА #81109
// Исходная версия см. ФайловаяСистемаКлиент.НапечататьИзПриложенияПоИмениФайлаLinuxЗапускLpr
Процедура НапечататьИзПриложенияПоИмениФайлаLinuxЗапускLpr(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.ПриложениеЗапущено Тогда
		ПоказатьПредупреждение(, Результат.ОписаниеОшибки);
	Иначе
		
		Параметры.Вставить("ОписаниеОшибки", Результат.ОписаниеОшибки);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НапечататьИзПриложенияПоИмениФайлаLinuxЗавершение", ЭтотОбъект, Параметры);
		ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();
		ПараметрыЗапускаПрограммы.Вставить("ДождатьсяЗавершения", Истина);
		ПараметрыЗапускаПрограммы.Вставить("ПолучитьПотокОшибок", Истина);
		ПараметрыЗапускаПрограммы.Вставить("Оповещение", ОписаниеОповещения);
		
		ФайловаяСистемаКлиент.ЗапуститьПрограмму(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("lpr %1", Параметры.ФайлКонвертируемыхДанных), 
			ПараметрыЗапускаПрограммы);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.08.24 УА #81109

//+ ИнфоСофт Ивонин К.А. 29.08.24 УА #81109
// Перенесено см. ФайловаяСистемаКлиент.НапечататьИзПриложенияПоИмениФайлаLinuxЗавершение
Процедура НапечататьИзПриложенияПоИмениФайлаLinuxЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(Параметры.ФайлКонвертируемыхДанных);
	Если Файл.Существует() Тогда// АПК:566 Выполняется только для Linux
		УдалитьФайлы(Параметры.ФайлКонвертируемыхДанных);// АПК:566 Выполняется только для Linux
	КонецЕсли;
	
	Если Не Результат.ПриложениеЗапущено Или ЗначениеЗаполнено(Результат.ОписаниеОшибки) Или ЗначениеЗаполнено(Результат.ПотокОшибок) Тогда
		ПоказатьПредупреждение(, ?(ЗначениеЗаполнено(Результат.ОписаниеОшибки),Результат.ОписаниеОшибки + Символы.ПС, "") + Результат.ПотокОшибок);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.08.24 УА #81109

//+ ИнфоСофт Ивонин К.А. 29.08.24 УА #81109
// Перенесено см. ФайловаяСистемаКлиент.ПолучитьИмяВременногоФайлаПослеПроверкиРасширенияРаботыСФайлами
// Продолжение процедуры ПолучитьПолноеИмяВременногоФайла.
// 
// Параметры:
//  РасширениеПодключено - Булево
//  Контекст - Структура:
//   * Оповещение - ОписаниеОповещения
//   * Расширение - Строка
//
Процедура ПолучитьИмяВременногоФайлаПослеПроверкиРасширенияРаботыСФайлами(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
#Если ВебКлиент Тогда
		Оповещение = Новый ОписаниеОповещения(
			"ПолучитьИмяВременногоФайлаПослеПолученияВременногоКаталога", ЭтотОбъект, Контекст,
			"ПолучитьИмяВременногоФайлаПриОбработкеОшибки", ЭтотОбъект);
		НачатьПолучениеКаталогаВременныхФайлов(Оповещение);
#Иначе
		ПолучитьИмяВременногоФайлаПослеПолученияВременногоКаталога("", Контекст);
#КонецЕсли
	Иначе
		ПолучитьИмяВременногоФайлаОповеститьОбОшибке(НСтр("ru = 'Не удалось установить расширение для работы с 1С:Предприятием.'"), Контекст);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.08.24 УА #81109

//+ ИнфоСофт Ивонин К.А. 29.08.24 УА #81109
// Перенесено см. ФайловаяСистемаКлиент.ПолучитьИмяВременногоФайлаПослеПолученияВременногоКаталога
// Продолжение процедуры ПолучитьПолноеИмяВременногоФайла.
// 
// Параметры:
//  ИмяКаталогаВременныхФайлов - Строка
//  Контекст - Структура:
//   * Оповещение - ОписаниеОповещения
//   * Расширение - Строка
//
Процедура ПолучитьИмяВременногоФайлаПослеПолученияВременногоКаталога(ИмяКаталогаВременныхФайлов, Контекст) Экспорт
	
	Оповещение = Контекст.Оповещение;
	Расширение = Контекст.Расширение;
	
#Если ВебКлиент Тогда
	ИмяВременногоФайла = ИмяКаталогаВременныхФайлов + Строка(Новый УникальныйИдентификатор);
#Иначе
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение); // АПК:441 Функция для получения имени временного файла.
#КонецЕсли
	
	Если Не ПустаяСтрока(Расширение) Тогда 
		ИмяВременногоФайла = ИмяВременногоФайла + "." + Расширение;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Оповещение, ИмяВременногоФайла);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.08.24 УА #81109

//+ ИнфоСофт Ивонин К.А. 29.08.24 УА #81109
// Перенесено см. ФайловаяСистемаКлиент.ПолучитьИмяВременногоФайлаПриОбработкеОшибки
// Продолжение процедуры ПолучитьПолноеИмяВременногоФайла.
Процедура ПолучитьИмяВременногоФайлаПриОбработкеОшибки(ИнформацияОбОшибке, СтандартнаяОбработка, Контекст) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	ПолучитьИмяВременногоФайлаОповеститьОбОшибке(ОписаниеОшибки, Контекст);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.08.24 УА #81109

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Функция ОбщийМодульМаркетплейса(Маркетплейс)
	
	Если Маркетплейс = "ВБ" Тогда
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИС_ВБ_Клиент");	
	КонецЕсли;
	
	Если Маркетплейс = "Озон" Тогда
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИС_Озон_Клиент");	
	КонецЕсли;
	
	Если Маркетплейс = "ЯМ" Тогда
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИС_ЯМ_Клиент");	
	КонецЕсли;	
	
	Если Маркетплейс = "Сбер" Тогда
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИС_Сбер_Клиент");	
	КонецЕсли;
	
	Если Маркетплейс = "Али" Тогда
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИС_Али_Клиент");	
	КонецЕсли;
	
	Если Маркетплейс = "МВМ" Тогда
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИС_МВМ_Клиент");	
	КонецЕсли;

	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если Маркетплейс = "Ламода" Тогда
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИС_Ламода_Клиент");	
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
	ВызватьИсключение("Неизвестный маркетплейс");
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 29.08.24 УА #81109
// Исходная версия см. ФайловаяСистемаКлиент.ПроверитьПрограммаLinuxУстановлена
Процедура ПроверитьПрограммаLinuxУстановлена(ИмяПрограммы, Оповещение)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Оповещение", Оповещение);
	ПрограммаLinuxУстановленаЗавершение = Новый ОписаниеОповещения("ПроверитьПрограммаLinuxУстановленаЗавершение", 
		ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();
	ПараметрыЗапускаПрограммы.Вставить("ДождатьсяЗавершения", Истина);
	ПараметрыЗапускаПрограммы.Вставить("ПолучитьПотокВывода", Истина);
	ПараметрыЗапускаПрограммы.Вставить("ПолучитьПотокОшибок", Истина);
	ПараметрыЗапускаПрограммы.Вставить("Оповещение", ПрограммаLinuxУстановленаЗавершение);
	
	ФайловаяСистемаКлиент.ЗапуститьПрограмму(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"dpkg -s '%1'", Строка(ИмяПрограммы)), ПараметрыЗапускаПрограммы);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.08.24 УА #81109

//+ ИнфоСофт Ивонин К.А. 29.08.24 УА #81109
// Перенечено см. ФайловаяСистемаКлиент.ПолучитьПолноеИмяВременногоФайла 
// Получение имени временного файла.
//
// Параметры:
//  Оповещение - ОписаниеОповещения - оповещение о результате получения со следующими параметрами.
//    -- ИмяВременногоФайла      - Строка - путь к временному файлу.
//    -- ДополнительныеПараметры - Структура - значение, которое было указано при создании объекта ОписаниеОповещения.
//  Расширение - Строка - расширение временного файла.
//
Процедура ПолучитьПолноеИмяВременногоФайла(Знач Оповещение, Расширение = "")
	
	Контекст = Новый Структура;
	Контекст.Вставить("Оповещение", Оповещение);
	Контекст.Вставить("Расширение", Расширение);
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьИмяВременногоФайлаПослеПроверкиРасширенияРаботыСФайлами",
		ЭтотОбъект, Контекст);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(Оповещение, 
		НСтр("ru = 'Для получения имени временного файла установите расширение для работы с 1С:Предприятием.'"), Ложь);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.08.24 УА #81109

//+ ИнфоСофт Ивонин К.А. 29.08.24 УА #81109
// Перенесено см. ФайловаяСистемаКлиент.ПолучитьИмяВременногоФайлаОповеститьОбОшибке
// Продолжение процедуры ПолучитьПолноеИмяВременногоФайла.
Процедура ПолучитьИмяВременногоФайлаОповеститьОбОшибке(ОписаниеОшибки, Контекст)
	
	ПоказатьПредупреждение(, ОписаниеОшибки);
	ИмяВременногоФайла = "";
	ВыполнитьОбработкуОповещения(Контекст.Оповещение, ИмяВременногоФайла);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.08.24 УА #81109

#КонецОбласти
