
#Область ОбработчикиСобытийФормы 

//+ ИнфоСофт Заварин К.В. 04.06.24 УА #70731
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Профиль") Тогда
		Профиль = Параметры.Профиль;
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль");
		Возврат;
	КонецЕсли;
	
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить("КоличествоСоставов");
	МассивЗначений.Добавить("КоличествоЭтикеток");   
	МассивЗначений.Добавить("КоличествоШтрихкодов");
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль,Перечисления.ИС_МП_Маркетплейсы.ВБ,МассивЗначений);
	
	
	Если Результат.Количество() = 0 Тогда
		КоличествоСоставов = 1;
		КоличествоЭтикеток = 1;
		КоличествоШтрихкодов = 2;
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 04.06.24 УА #70731

#КонецОбласти

#Область ОбработчикиКомандФормы  

//+ ИнфоСофт Заварин К.В. 04.06.24 УА #70731
&НаКлиенте
Процедура СохранитьДанные(Команда)
	СохранитьДанныеНаСервере(Профиль, КоличествоСоставов, КоличествоЭтикеток, КоличествоШтрихкодов);
	Закрыть();
КонецПроцедуры //- ИнфоСофт Заварин К.В. 04.06.24 УА #70731

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Заварин К.В. 04.06.24 УА #70731
&НаСервереБезКонтекста   
Процедура СохранитьДанныеНаСервере(Профиль, КоличествоСоставов, КоличествоЭтикеток, КоличествоШтрихкодов)
	
	СтруктураРезультатовЗначение = Новый Структура;
	СтруктураРезультатовЗначение.Вставить("КоличествоСоставов", КоличествоСоставов); 
	СтруктураРезультатовЗначение.Вставить("КоличествоЭтикеток", КоличествоЭтикеток);
	СтруктураРезультатовЗначение.Вставить("КоличествоШтрихкодов", КоличествоШтрихкодов);

	ИС_MP_Сервер.ЗаписатьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, СтруктураРезультатовЗначение);
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 04.06.24 УА #70731

#КонецОбласти
