
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Функция НастройкиСоединенияПоУмолчанию() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВБАдресАналитика", "seller-analytics-api.wildberries.ru");
	Результат.Вставить("ВБАдресВозвраты", "returns-api.wildberries.ru");
	Результат.Вставить("ВБАдресВопросы", "feedbacks-api.wildberries.ru");
	Результат.Вставить("ВБАдресДокументы", "documents-api.wildberries.ru");
	Результат.Вставить("ВБАдресКонтент", "content-api.wildberries.ru");
	Результат.Вставить("ВБАдресМаркетплейс", "marketplace-api.wildberries.ru");
	Результат.Вставить("ВБАдресПоставки", "supplies-api.wildberries.ru");
	Результат.Вставить("ВБАдресПродвижение", "advert-api.wildberries.ru");
	Результат.Вставить("ВБАдресСтатистика", "statistics-api.wildberries.ru");
	Результат.Вставить("ВБАдресТарифы", "common-api.wildberries.ru");
	Результат.Вставить("ВБАдресЦены", "discounts-prices-api.wildberries.ru");
	Результат.Вставить("ВБАдресЧат", "buyer-chat-api.wildberries.ru");
	Результат.Вставить("ВБПортАналитика", 443);
	Результат.Вставить("ВБПортВозвраты", 443);
	Результат.Вставить("ВБПортВопросы", 443);
	Результат.Вставить("ВБПортДокументы", 443);
	Результат.Вставить("ВБПортКонтент", 443);
	Результат.Вставить("ВБПортМаркетплейс", 443);
	Результат.Вставить("ВБПортПоставки", 443);
	Результат.Вставить("ВБПортПродвижение", 443);
	Результат.Вставить("ВБПортСтатистика", 443);
	Результат.Вставить("ВБПортТарифы", 443);
	Результат.Вставить("ВБПортЦены", 443);
	Результат.Вставить("ВБПортЧат", 443);
	Результат.Вставить("ВБHTTPSАналитика", Истина);
	Результат.Вставить("ВБHTTPSВозвраты", Истина);
	Результат.Вставить("ВБHTTPSВопросы", Истина);
	Результат.Вставить("ВБHTTPSДокументы", Истина);
	Результат.Вставить("ВБHTTPSКонтент", Истина);
	Результат.Вставить("ВБHTTPSМаркетплейс", Истина);
	Результат.Вставить("ВБHTTPSПоставки", Истина);
	Результат.Вставить("ВБHTTPSПродвижение", Истина);
	Результат.Вставить("ВБHTTPSСтатистика", Истина);
	Результат.Вставить("ВБHTTPSТарифы", Истина);
	Результат.Вставить("ВБHTTPSЦены", Истина);
	Результат.Вставить("ВБHTTPSЧат", Истина);
	Результат.Вставить("ВБКоличествоЭлементовНаЗапрос", 100);
	Результат.Вставить("ВБКоличествоПопытокЗапроса", 10);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
Функция ПараметрыТестаПодключения(Форма) Экспорт
	
	ТекстОшибки = "";
	
	Результат = Новый Структура;

	Результат.Вставить("АдресАналитика", Форма.ВБАдресАналитика);
	Результат.Вставить("АдресВозвраты", Форма.ВБАдресВозвраты);
	Результат.Вставить("АдресВопросы", Форма.ВБАдресВопросы);
	Результат.Вставить("АдресДокументы", Форма.ВБАдресДокументы);
	Результат.Вставить("АдресКонтент", Форма.ВБАдресКонтент);
	Результат.Вставить("АдресМаркетплейс", Форма.ВБАдресМаркетплейс);
	Результат.Вставить("АдресПоставки", Форма.ВБАдресПоставки);
	Результат.Вставить("АдресПродвижение", Форма.ВБАдресПродвижение);
	Результат.Вставить("АдресСтатистика", Форма.ВБАдресСтатистика);
	Результат.Вставить("АдресТарифы", Форма.ВБАдресТарифы);
	Результат.Вставить("АдресЦены", Форма.ВБАдресЦены);
	Результат.Вставить("АдресЧат", Форма.ВБАдресЧат);
	Результат.Вставить("ПортАналитика", Форма.ВБПортАналитика);
	Результат.Вставить("ПортВозвраты", Форма.ВБПортВозвраты);
	Результат.Вставить("ПортВопросы", Форма.ВБПортВопросы);
	Результат.Вставить("ПортДокументы", Форма.ВБПортДокументы);
	Результат.Вставить("ПортКонтент", Форма.ВБПортКонтент);
	Результат.Вставить("ПортМаркетплейс", Форма.ВБПортМаркетплейс);
	Результат.Вставить("ПортПоставки", Форма.ВБПортПоставки);
	Результат.Вставить("ПортПродвижение", Форма.ВБПортПродвижение);
	Результат.Вставить("ПортСтатистика", Форма.ВБПортСтатистика);
	Результат.Вставить("ПортТарифы", Форма.ВБПортТарифы);
	Результат.Вставить("ПортЦены", Форма.ВБПортЦены);
	Результат.Вставить("ПортЧат", Форма.ВБПортЧат);
	Результат.Вставить("HTTPSАналитика", Форма.ВБHTTPSАналитика);
	Результат.Вставить("HTTPSВозвраты", Форма.ВБHTTPSВозвраты);
	Результат.Вставить("HTTPSВопросы", Форма.ВБHTTPSВопросы);
	Результат.Вставить("HTTPSДокументы", Форма.ВБHTTPSДокументы);
	Результат.Вставить("HTTPSКонтент", Форма.ВБHTTPSКонтент);
	Результат.Вставить("HTTPSМаркетплейс", Форма.ВБHTTPSМаркетплейс);
	Результат.Вставить("HTTPSПоставки", Форма.ВБHTTPSПоставки);
	Результат.Вставить("HTTPSПродвижение", Форма.ВБHTTPSПродвижение);
	Результат.Вставить("HTTPSСтатистика", Форма.ВБHTTPSСтатистика);
	Результат.Вставить("HTTPSТарифы", Форма.ВБHTTPSТарифы);
	Результат.Вставить("HTTPSЦены", Форма.ВБHTTPSЦены);
	Результат.Вставить("HTTPSЧат", Форма.ВБHTTPSЧат);
	Результат.Вставить("РежимОтладки", Форма.ВБРежимОтладки);
	Результат.Вставить("КоличествоЭлементовНаЗапрос", Форма.ВБКоличествоЭлементовНаЗапрос);
	Результат.Вставить("КоличествоПопытокЗапроса", Форма.ВБКоличествоПопытокЗапроса);
	
	Если Не ЗначениеЗаполнено(Форма.ВБАдресАналитика) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен адрес API аналитики, тест данного сервиса не будет проведен" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ВБАдресВозвраты) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен адрес API возвратов, тест данного сервиса не будет проведен" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ВБАдресВопросы) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен адрес API вопросов, тест данного сервиса не будет проведен" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ВБАдресДокументы) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен адрес API документов, тест данного сервиса не будет проведен" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ВБАдресКонтент) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен адрес API контента, тест данного сервиса не будет проведен" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ВБАдресМаркетплейс) Тогда
		ТекстОшибки = ТекстОшибки 
			+ "Не заполнен адрес API маркетплейса, тест данного сервиса не будет проведен" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ВБАдресПоставки) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен адрес API поставок, тест данного сервиса не будет проведен" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ВБАдресПродвижение) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен адрес API продвижения, тест данного сервиса не будет проведен" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ВБАдресСтатистика) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен адрес API статистики, тест данного сервиса не будет проведен" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ВБАдресТарифы) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен адрес API тарифов, тест данного сервиса не будет проведен" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ВБАдресЦены) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен адрес API цен, тест данного сервиса не будет проведен" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ВБАдресЧат) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен адрес API чата, тест данного сервиса не будет проведен" + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 07.02.25 УА #92406
Функция ПредставлениеМаркетплейса() Экспорт
	Возврат "WildBerries";
КонецФункции //- ИнфоСофт Ивонин К.А. 07.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 07.02.25 УА #92406
Функция ИмяФункцииЗагрузкиТоваров() Экспорт
	Возврат "ИС_ВБ_Сервер.ЗагрузитьТовары";
КонецФункции //- ИнфоСофт Ивонин К.А. 07.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 07.02.25 УА #92406
Функция ДопПараметрыЗагрузкиТоваров(Форма) Экспорт
	Возврат Новый Структура;
КонецФункции //- ИнфоСофт Ивонин К.А. 07.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 04.03.25 УА #92887
Функция ПолеСопоставленияОстатков() Экспорт
	Возврат "РазмерWB";	
КонецФункции //- ИнфоСофт Ивонин К.А. 04.03.25 УА #92887

#КонецОбласти
