                                           
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 06.07.22 УА #46999
Функция ПолучитьПрофильПоУмолчанию() Экспорт

	Результат = Справочники.ИС_WB_Профили.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ИС_WB_Профили.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
	|ГДЕ
	|	НЕ ИС_WB_Профили.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Результат;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 06.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 27.06.22 УА #46999
Функция ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_Профили.АвтоматическиДобавлятьВПоставку КАК АвтоматическиДобавлятьВПоставку,
	|	ИС_WB_Профили.АвтоматическиСоздаватьЗаказы КАК АвтоматическиСоздаватьЗаказы,
	|	ИС_WB_Профили.РежимСозданияЗаказов КАК РежимСозданияЗаказов,
	|	ИС_WB_Профили.АвтоматическиСоздаватьРеализации КАК АвтоматическиСоздаватьРеализации,
	|	ИС_WB_Профили.Организация КАК Организация,
	|	ИС_WB_Профили.Партнер КАК Партнер,
	|	ИС_WB_Профили.Контрагент КАК Контрагент,
	|	ИС_WB_Профили.Соглашение КАК Соглашение,
	|	ИС_WB_Профили.Договор КАК Договор,
	|	ИС_WB_Профили.Подразделение КАК Подразделение,
	|	ИС_WB_Профили.ВидЦены КАК ВидЦены,
	|	ИС_WB_Профили.РассчитыватьДатыОтгрузки КАК РассчитыватьДатыОтгрузки,
	|	ИС_WB_Профили.ВремяОтсчета КАК ВремяОтсчета,
	|	ИС_WB_Профили.КоличествоДнейКОтгрузке КАК КоличествоДнейКОтгрузке,
	|	ИС_WB_Профили.ПриоритетЗаказа КАК ПриоритетЗаказа,
	|	ИС_WB_Профили.КоличествоДнейКРеализации КАК КоличествоДнейКРеализации,
	//+ ИнфоСофт Мурсалимов Д.Р. 05.03.24 УА #67173
	//|	ИС_WB_Профили.ПересчитыватьТоварПоКомлектам КАК ПересчитыватьТоварПоКомлектам,
	//- ИнфоСофт Мурсалимов Д.Р. 05.03.24 УА #67173
	//+ ИнфоСофт Макарова Н.Е. 04.04.2025 УА #88298
	//|	ИС_WB_Профили.АктивныйЗаказКлиента КАК АктивныйЗаказКлиента,
	//- ИнфоСофт Макарова Н.Е. 04.04.2025 УА #88298
	|	ИС_WB_Профили.ПроводитьЗаказы КАК ПроводитьЗаказы,
	|	ИС_WB_Профили.ПроводитьРеализации КАК ПроводитьРеализации,
	|	ИС_WB_Профили.РежимСозданияРеализаций КАК РежимСозданияРеализаций,
	|	ИС_WB_Профили.СтатусЗаказаКлиента КАК СтатусЗаказаКлиента,
	|	ИС_WB_Профили.ВариантОбеспечения КАК ВариантОбеспечения,
	//+ ИнфоСофт Мурсалимов Д.Р. 01.03.24 УА #67173
	|	ИС_WB_Профили.КоличествоСкрываемогоОстатка КАК КоличествоСкрываемогоОстатка,
	|	ИС_WB_Профили.РассчитыватьНесобранныеКомплекты КАК РассчитыватьНесобранныеКомплекты,
	|	ИС_WB_Профили.СоздатьЗаказНаСборку КАК СоздатьЗаказНаСборку,
	//- ИнфоСофт Мурсалимов Д.Р. 01.03.24 УА #67173
	//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801	
	|	ИС_WB_Профили.ВариантОбеспеченияПриНехватке КАК ВариантОбеспеченияПриНехватке,
	//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
	//+ ИнфоСофт Заварин К.В. 01.04.24 УА #67778
	|	ИС_WB_Профили.УдалятьРТУ КАК УдалятьРТУ,
	|	ИС_WB_Профили.ПричинаОтмены КАК ПричинаОтмены,
	//- ИнфоСофт Заварин К.В. 01.04.24 УА #67778 
	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	|	ИС_WB_Профили.ИспользоватьРазбиениеПоСкладам КАК ИспользоватьРазбиениеПоСкладам,
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800      
	|	ИС_WB_Профили.КоличествоДнейОбновлениеСтатусов КАК КоличествоДнейОбновлениеСтатусов
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	|ИЗ
	|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
	|ГДЕ
	|	ИС_WB_Профили.Ссылка = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Новый Структура;
	
	Если Выборка.Следующий() Тогда
	
		Для Каждого Элемент Из РезультатЗапроса.Колонки Цикл
			Результат.Вставить(Элемент.Имя, Выборка[Элемент.Имя]);	
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 27.06.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 12.02.23 УА #53535
Функция ПолучитьПараметрыВыгрузкиЦен(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_Профили.ВидЦены КАК ВидЦены,
	|	ИС_WB_Профили.ВидЦеныСоСкидкой КАК ВидЦеныСоСкидкой,
	|	ИС_WB_Профили.РежимОкругленияЦен КАК РежимОкругленияЦен
	|ИЗ
	|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
	|ГДЕ
	|	ИС_WB_Профили.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Новый Структура;
	
	Если Выборка.Следующий() Тогда
    
		Для Каждого Элемент Из РезультатЗапроса.Колонки Цикл
			Результат.Вставить(Элемент.Имя, Выборка[Элемент.Имя]);	
		КонецЦикла;
    	
    Иначе	
    	Возврат Неопределено;	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 12.02.23 УА #53535

#КонецОбласти
