#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	Перем Категория, Характеристика, СтрокаПоиска;

	СтандартнаяОбработка = Ложь;

	Параметры.Свойство("Категория", Категория);
	Параметры.Свойство("Характеристика", Характеристика);
	Параметры.Свойство("СтрокаПоиска", СтрокаПоиска);

	Значения = РегистрыСведений.ИС_Ozon_ЗначенияХарактеристикПоКатегориям.ЗначенияХарактеристик(Категория, Характеристика,
		СтрокаПоиска);

	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(Значения);

КонецПроцедуры

#КонецОбласти

#КонецЕсли