
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Мурсалимов Д.Р. 11.07.24 УА #79512
Функция ВерсияБезРедакции() Экспорт
	Возврат ИС_МП_Сервер.ВерсияБезРедакции();	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 11.07.24 УА #79512

//+ ИнфоСофт Мурсалимов Д.Р. 11.07.24 УА #79512
Функция ОбщийМодульШтрихкодирования() Экспорт
	Возврат ИС_MP_МаркировкаПовтИсп.ОпределитьОбщийМодульШтрихкодирования();	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 11.07.24 УА #79512

//+ ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842
Функция ОпределитьОбщийМодульШтрихкодированияКлиентСервер() Экспорт
	Возврат ИС_MP_МаркировкаПовтИсп.ОпределитьОбщийМодульШтрихкодированияКлиентСервер();	
КонецФункции //- ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842

//+ ИнфоСофт Власова И.С. 13.02.25 УА #93336
Функция ОпределитьОбщийМодульПараметровСканированияКлиент() Экспорт
	Возврат ИС_MP_МаркировкаПовтИсп.ОпределитьОбщийМодульПараметровСканированияКлиент();	
КонецФункции //- ИнфоСофт Власова И.С. 13.02.25 УА #93336

#КонецОбласти
