
//+ ИнфоСофт Ивонин К.А. 03.05.23 УА #58360
&После("ОпределитьОбъектыСКомандамиОтчетов")
Процедура ИС_WB_ОпределитьОбъектыСКомандамиОтчетов(Объекты)
	Объекты.Добавить(Метаданные.Документы.ИС_WB_СборочноеЗадание);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 03.05.23 УА #58360

&После("НастроитьВариантыОтчетов")
Процедура ИС_WB_НастроитьВариантыОтчетов(Настройки)
	
	#Область ЛистПодбораУниверсальный
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИС_WB_ЛистПодбора);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	#КонецОбласти

КонецПроцедуры
