
#Область ПрограммныйИнтерфейс

#Область Товары

//+ ИнфоСофт Ивонин К.А. 03.03.25 УА #92887
Функция КоличествоТоваров(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|ГДЕ
	|	ИС_ЯМ_Номенклатура.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКоличества = РезультатЗапроса.Выбрать();
	
	Если ВыборкаКоличества.Следующий() Тогда
		Возврат ВыборкаКоличества.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 03.03.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 07.02.25 УА #92406
Функция ОбработатьДопПараметрыЗагрузкиТоваров(ДопПараметры) Экспорт
	Возврат ДопПараметры;
КонецФункции //- ИнфоСофт Ивонин К.А. 07.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 14.04.23 УА #57127
Функция ПолучитьКарточкиТоваров(Профиль, Перезаполнять = Ложь, ДопПараметры = Неопределено) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения); 
	
	КоличествоЭлементовНаЗапрос = НастройкиСоединения["КоличествоЭлементовНаЗапрос"];
	КоличествоПопытокЗапроса = НастройкиСоединения["КоличествоОшибокЗапросов"];
	
	КодСтраницы = "";
	КоличествоОшибок = 0;
	СтруктураПараметров = Новый Структура;
	//+ ИнфоСофт Стояк Ю.К. 12.03.2024 УА #65893	
	СтруктураПараметров.Вставить("КампанияID", Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=0"));	
	СтруктураПараметров.Вставить("limit", КоличествоЭлементовНаЗапрос);
	СтруктураПараметров.Вставить("page_token", КодСтраницы);
	//СтруктураПараметров.Вставить("businessId", СтрЗаменить(Строка(НастройкиСоединения["ЯМКодБизнеса"]), Символы.НПП, ""));
	//- ИнфоСофт Стояк Ю.К. 12.03.2024 УА #65893
	ТелоЗапроса = Новый Структура;
	
	//+ ИнфоСофт Стояк Ю.К. 12.03.2024 УА #66043		
	МассивОфферов = Новый Массив;
	
	Пока Истина Цикл
		
		Если КоличествоОшибок > КоличествоПопытокЗапроса Тогда
			ОбщегоНазначения.СообщитьПользователю("Превышено количество ошибок запросов");
			Возврат Неопределено;
		КонецЕсли;
		
		Результат = ИС_ЯМ_API.ЗагрузитьКарточкиМагазина(Профиль, ПараметрыЗапроса, СтруктураПараметров, ТелоЗапроса); 
		
		Если Результат = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли;
		
		Для Каждого Элемент Из Результат.offers Цикл	
			МассивОфферов.Добавить(Элемент.offerId);			
		КонецЦикла;
		
		Если Результат.paging.Свойство("nextPageToken") Тогда
			СтруктураПараметров.page_token = Результат.paging.nextPageToken;			
		Иначе
			Прервать;
		КонецЕсли; 
		
	КонецЦикла; 
	
	ПометитьНаУдалениеКарточкиНеИзМагазина(Профиль, МассивОфферов); 
	  
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("businessId", СтрЗаменить(Строка(НастройкиСоединения["ЯМКодБизнеса"]), Символы.НПП, ""));    
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивОфферов, 200);
	
	Для Каждого Элемент Из РазбитыйМассив Цикл 
		
		ТелоЗапроса.Вставить("offerIds", Элемент);
		
		Результат = ИС_ЯМ_API.ЗагрузитьКарточкиТоваров(Профиль, ПараметрыЗапроса, СтруктураПараметров, ТелоЗапроса); 
		
		Если Результат = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для Каждого Товар Из Результат.offerMappings Цикл	
			СоздатьИлиОбновитьНоменклатуру(Профиль, Товар, Перезаполнять);			
		КонецЦикла; 
		
	КонецЦикла;
	
	//Пока Истина Цикл
	//	
	//	Если КоличествоОшибок > КоличествоПопытокЗапроса Тогда
	//		ОбщегоНазначения.СообщитьПользователю("Превышено количество ошибок запросов");
	//		Возврат Неопределено;
	//	КонецЕсли;
	//	
	//	Результат = ИС_ЯМ_API.ЗагрузитьКарточкиТоваров(Профиль, ПараметрыЗапроса, СтруктураПараметров, ТелоЗапроса); 
	//	
	//	Если Результат = Неопределено Тогда
	//		КоличествоОшибок = КоличествоОшибок + 1;
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Для Каждого Элемент Из Результат.offerMappings Цикл	
	//		СоздатьИлиОбновитьНоменклатуру(Профиль, Элемент, Перезаполнять);			
	//	КонецЦикла;
	//	
	//	Если Результат.paging.Свойство("nextPageToken") Тогда
	//		СтруктураПараметров.page_token = Результат.paging.nextPageToken;			
	//	Иначе
	//		Прервать;
	//	КонецЕсли; 
	//	
	//КонецЦикла;
	//- ИнфоСофт Стояк Ю.К. 12.03.2024 УА #66043
	
КонецФункции //- ИнфоСофт Ивонин К.А. 14.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 14.04.23 УА #57127
Процедура СоздатьИлиОбновитьНоменклатуру(Профиль, СтруктураНоменклатуры, Перезаполнять = Ложь)
	
	//+ ИнфоСофт Сумин Д.В. 22.05.23 УА #58026
	//Временное решение, пока не реализован функционал выбора
	//+ ИнфоСофт Мурсалимов Д.Р. 21.08.23 УА #61952
	//Функционал выбора реализован
	//Перезаполнять = Истина;    
	//- ИнфоСофт Мурсалимов Д.Р. 21.08.23 УА #61952
	//- ИнфоСофт Сумин Д.В. 22.05.23 УА #58026
	
	//+ ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869	
	//+ ИнфоСофт Сумин Д.В. 14.04.23 УА #57537
	Маппинг = Неопределено;	
	Оффер = Неопределено;	
	
	Если СтруктураНоменклатуры.Свойство("offer") Тогда 
		Оффер = СтруктураНоменклатуры.offer;
	КонецЕсли;
	
	Если СтруктураНоменклатуры.Свойство("mapping") Тогда 
		Маппинг = СтруктураНоменклатуры.mapping;
	КонецЕсли;
	
	//Попытка
	//	Маппинг = СтруктураНоменклатуры.mapping;
	//	Оффер = СтруктураНоменклатуры.offer;	
	//Исключение
	//	Маппинг = Неопределено;	
	//КонецПопытки;
	//Маппинг = СтруктураНоменклатуры.mapping;
	//Оффер = СтруктураНоменклатуры.offer;
	//- ИнфоСофт Сумин Д.В. 14.04.23 УА #57537
	//- ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869
	
	Если Оффер = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не Оффер.Свойство("name") Тогда
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Сумин Д.В. 22.05.23 УА #58026
	ЯМНоменклатура = ПолучитьНоменклатуруЯМ(Оффер.offerId, Профиль);
	//ЯМНоменклатура = Справочники.ИС_ЯМ_Номенклатура.НайтиПоРеквизиту("shopSku", Оффер.shopSku);
	//- ИнфоСофт Сумин Д.В. 22.05.23 УА #58026
	
	MD5 = ПолучитьMD5Хэш(СтруктураНоменклатуры);
	
	Если ЯМНоменклатура.Пустая() Тогда
		ЯМНоменклатура = Справочники.ИС_ЯМ_Номенклатура.СоздатьЭлемент();
	Иначе
		
		Если ЯМНоменклатура.MD5 = MD5 И Не Перезаполнять Тогда
			Возврат;
		КонецЕсли;					
		
		ЯМНоменклатура = ЯМНоменклатура.ПолучитьОбъект();
		
	КонецЕсли;
	//+ ИнфоСофт Стояк Ю.К. 12.03.2024 УА #66043	
	ЯМНоменклатура.ПометкаУдаления = Ложь;    
	//- ИнфоСофт Стояк Ю.К. 12.03.2024 УА #66043
	
	ЯМНоменклатура.Профиль = Профиль;
	ЯМНоменклатура.MD5 = MD5;	
	ЯМНоменклатура.Наименование = Оффер.name;
	//+ ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869
	ЯМНоменклатура.shopSku = Оффер.offerId;
	//ЯМНоменклатура.shopSku = Оффер.shopSku;
	//- ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869 
	//+ ИнфоСофт Стояк Ю.К. 09.02.2024 УА #70456
	Если Оффер.Свойство("archived") Тогда
		ЯМНоменклатура.archived = Оффер.archived;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 09.02.2024 УА #70456
	
	Если Оффер.Свойство("manufacturer") Тогда
		ЯМНоменклатура.manufacturer = Оффер.manufacturer;
	КонецЕсли;
	
	Если Оффер.Свойство("vendor") Тогда
		ЯМНоменклатура.vendor = Оффер.vendor;
	КонецЕсли;
	
	Если Оффер.Свойство("vendorCode") Тогда
		ЯМНоменклатура.vendorCode = Оффер.vendorCode;
	КонецЕсли;
	
	//+ ИнфоСофт Сумин Д.В. 20.02.2024 УА #66043
	Если Оффер.Свойство("weightDimensions") Тогда
		
		Если Оффер.weightDimensions.Свойство("length") Тогда
			length = Оффер.weightDimensions.length;	
		Иначе
			length = 0;	
		КонецЕсли;
		
		Если Оффер.weightDimensions.Свойство("width") Тогда
			width = Оффер.weightDimensions.width;	
		Иначе
			width = 0;	
		КонецЕсли; 
		
		Если Оффер.weightDimensions.Свойство("height") Тогда
			height = Оффер.weightDimensions.height;	
		Иначе
			height = 0;	
		КонецЕсли; 
		
		Если Оффер.weightDimensions.Свойство("weight") Тогда
			weight = Оффер.weightDimensions.weight;	
		Иначе
			weight = 0;	
		КонецЕсли;
		
		ЯМНоменклатура.length 	= length;
		ЯМНоменклатура.width 	= width;
		ЯМНоменклатура.height 	= height;
		ЯМНоменклатура.weight 	= weight; 
		//Объем считаем в метрах кубических
		ЯМНоменклатура.volume  	= length * width * height / 1000000;
		УстановитьПризнакКГТ(ЯМНоменклатура);
	КонецЕсли;	
	//- ИнфоСофт Сумин Д.В. 20.02.2024 УА #66043
	
	//+ ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869	
	Если ЗначениеЗаполнено(Маппинг) Тогда
		//+ ИнфоСофт Сумин Д.В. 06.09.2023 УА #63147
		Если Маппинг.Свойство("marketModelId") Тогда
			//Если Маппинг.Свойство("modelId") Тогда
			//- ИнфоСофт Сумин Д.В. 06.09.2023 УА #63147
			//+ ИнфоСофт Сумин Д.В. 06.09.2023 УА #63147 
			ЯМНоменклатура.modelId = Маппинг.marketModelId;
			//ЯМНоменклатура.modelId = Маппинг.modelId;
			//- ИнфоСофт Сумин Д.В. 06.09.2023 УА #63147
		КонецЕсли;
		
		//+ ИнфоСофт Стояк Ю.К. 11.09.2023 УА #62735		
		Если Маппинг.Свойство("marketSku") Тогда
			ЯМНоменклатура.marketSku = Маппинг.marketSku;
		КонецЕсли;
		//+ ИнфоСофт Сумин Д.В. 06.09.2023 УА #63147
		Если Маппинг.Свойство("marketCategoryId") Тогда
			ЯМНоменклатура.categoryId = Маппинг.marketCategoryId;
		КонецЕсли;                                  
		//- ИнфоСофт Стояк Ю.К. 11.09.2023 УА #62735
		//ЯМНоменклатура.categoryId = Маппинг.categoryId;
		//- ИнфоСофт Сумин Д.В. 06.09.2023 УА #63147
		
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869
	
	Попытка
		ЯМНоменклатура.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если Оффер.Свойство("barcodes") Тогда
		
		Для Каждого Штрихкод Из Оффер.barcodes Цикл 
			
			//+ ИнфоСофт Сумин Д.В. 22.05.23 УА #58026 
			ХарактеристикаЯМ = ПолучитьХарактеристикуЯМ(Штрихкод, Профиль, ЯМНоменклатура.Ссылка);
			//ХарактеристикаЯМ = Справочники.ИС_ЯМ_Штрихкоды.НайтиПоНаименованию(Штрихкод, Истина);
			//- ИнфоСофт Сумин Д.В. 22.05.23 УА #58026
			
			Если ХарактеристикаЯМ.Пустая() Тогда
				ХарактеристикаЯМ = Справочники.ИС_ЯМ_Штрихкоды.СоздатьЭлемент();							
			Иначе
				ХарактеристикаЯМ = ХарактеристикаЯМ.ПолучитьОбъект();					
			КонецЕсли;  
			
			ХарактеристикаЯМ.Владелец = ЯМНоменклатура.Ссылка;
			ХарактеристикаЯМ.Штрихкод = Штрихкод;
			ХарактеристикаЯМ.Наименование = Штрихкод;
			ХарактеристикаЯМ.Профиль = Профиль;
			
			Попытка
				ХарактеристикаЯМ.Записать();
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;				
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.04.23 УА #57127

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
Функция СоздатьИзменитьНоменклатуруПоИдентификаторам(Профиль, МассивИдентификаторов, Перезаполнять = Ложь) Экспорт
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("offerIds", МассивИдентификаторов);
	
	Результат = ПолучитьИнформациюОКарточкахПоАртикулу(Профиль, ТелоЗапроса);
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось получить информацию по номенклатуре Яндекс Маркет, загрузка карточек и сопоставление не будут выполнены'"));
		Возврат Неопределено;
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	
	СтруктураНоменклатура = Новый Структура("НоменклатураЯМ, offerId");
	
	Для Каждого Товар Из Результат.offerMappings Цикл	
		
		Если Товар.Свойство("offer") Тогда 
			
			НоменклатураЯМ = СоздатьОбновитьНоменклатуру(Профиль, Товар.offer, Перезаполнять);
			
			Если Не НоменклатураЯМ.Пустая() Тогда	
				
				СтруктураНоменклатура.НоменклатураЯМ = НоменклатураЯМ;
				СтруктураНоменклатура.offerId        = Товар.offer.offerId;
				
				МассивНоменклатуры.Добавить(СтруктураНоменклатура);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
Функция СоздатьОбновитьНоменклатуру(Профиль, СтруктураНоменклатуры, Перезаполнять = Ложь) Экспорт
	
	//+ ИнфоСофт Сумин Д.В. 22.05.23 УА #58026
	//Временное решение, пока не реализован функционал выбора
	//+ ИнфоСофт Мурсалимов Д.Р. 21.08.23 УА #61952
	//Функционал выбора реализован
	//Перезаполнять = Истина;    
	//- ИнфоСофт Мурсалимов Д.Р. 21.08.23 УА #61952
	//- ИнфоСофт Сумин Д.В. 22.05.23 УА #58026
	
	//+ ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869	
	//+ ИнфоСофт Сумин Д.В. 14.04.23 УА #57537
	Маппинг = Неопределено;	
	Оффер = Неопределено;	
	
	Если СтруктураНоменклатуры.Свойство("offer") Тогда 
		Оффер = СтруктураНоменклатуры.offer;
	КонецЕсли;
	
	Если СтруктураНоменклатуры.Свойство("mapping") Тогда 
		Маппинг = СтруктураНоменклатуры.mapping;
	КонецЕсли;
	
	//Попытка
	//	Маппинг = СтруктураНоменклатуры.mapping;
	//	Оффер = СтруктураНоменклатуры.offer;	
	//Исключение
	//	Маппинг = Неопределено;	
	//КонецПопытки;
	//Маппинг = СтруктураНоменклатуры.mapping;
	//Оффер = СтруктураНоменклатуры.offer;
	//- ИнфоСофт Сумин Д.В. 14.04.23 УА #57537
	//- ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869
	
	Если Оффер = Неопределено Тогда
		//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
		//Возврат;
		Возврат Неопределено;
		//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
	КонецЕсли; 
	
	Если Не Оффер.Свойство("name") Тогда
		//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
		//Возврат;
		Возврат Неопределено;
		//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
	КонецЕсли;
	
	//+ ИнфоСофт Сумин Д.В. 22.05.23 УА #58026
	ЯМНоменклатура = ПолучитьНоменклатуруЯМ(Оффер.offerId, Профиль);
	//ЯМНоменклатура = Справочники.ИС_ЯМ_Номенклатура.НайтиПоРеквизиту("shopSku", Оффер.shopSku);
	//- ИнфоСофт Сумин Д.В. 22.05.23 УА #58026
	
	MD5 = ПолучитьMD5Хэш(СтруктураНоменклатуры);
	
	Если ЯМНоменклатура.Пустая() Тогда
		ЯМНоменклатура = Справочники.ИС_ЯМ_Номенклатура.СоздатьЭлемент();
	Иначе
		
		Если ЯМНоменклатура.MD5 = MD5 И Не Перезаполнять Тогда
			//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
			//Возврат;
			Возврат ЯМНоменклатура;
			//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
		КонецЕсли;					
		
		ЯМНоменклатура = ЯМНоменклатура.ПолучитьОбъект();
		
	КонецЕсли;         
	//+ ИнфоСофт Стояк Ю.К. 12.03.2024 УА #66043	
	ЯМНоменклатура.ПометкаУдаления = Ложь;    
	//- ИнфоСофт Стояк Ю.К. 12.03.2024 УА #66043
	
	ЯМНоменклатура.Профиль = Профиль;
	ЯМНоменклатура.MD5 = MD5;	
	ЯМНоменклатура.Наименование = Оффер.name;
	//+ ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869
	ЯМНоменклатура.shopSku = Оффер.offerId;
	//ЯМНоменклатура.shopSku = Оффер.shopSku;
	//- ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869
	
	//+ ИнфоСофт Стояк Ю.К. 09.02.2024 УА #70456
	Если Оффер.Свойство("archived") Тогда
		ЯМНоменклатура.archived = Оффер.archived;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 09.02.2024 УА #70456
	
	Если Оффер.Свойство("manufacturer") Тогда
		ЯМНоменклатура.manufacturer = Оффер.manufacturer;
	КонецЕсли;
	
	Если Оффер.Свойство("vendor") Тогда
		ЯМНоменклатура.vendor = Оффер.vendor;
	КонецЕсли;
	
	Если Оффер.Свойство("vendorCode") Тогда
		ЯМНоменклатура.vendorCode = Оффер.vendorCode;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869	
	Если ЗначениеЗаполнено(Маппинг) Тогда
		//+ ИнфоСофт Сумин Д.В. 06.09.2023 УА #63147
		Если Маппинг.Свойство("marketModelId") Тогда
		//Если Маппинг.Свойство("modelId") Тогда
		//- ИнфоСофт Сумин Д.В. 06.09.2023 УА #63147
			//+ ИнфоСофт Сумин Д.В. 06.09.2023 УА #63147 
			ЯМНоменклатура.modelId = Маппинг.marketModelId;
			//ЯМНоменклатура.modelId = Маппинг.modelId;
			//- ИнфоСофт Сумин Д.В. 06.09.2023 УА #63147
		КонецЕсли;
		
		//+ ИнфоСофт Стояк Ю.К. 11.09.2023 УА #62735		
		Если Маппинг.Свойство("marketSku") Тогда
			ЯМНоменклатура.marketSku = Маппинг.marketSku;
		КонецЕсли;
		//+ ИнфоСофт Сумин Д.В. 06.09.2023 УА #63147
		Если Маппинг.Свойство("marketCategoryId") Тогда
			ЯМНоменклатура.categoryId = Маппинг.marketCategoryId;
		КонецЕсли;                                  
		//- ИнфоСофт Стояк Ю.К. 11.09.2023 УА #62735
		//ЯМНоменклатура.categoryId = Маппинг.categoryId;
		//- ИнфоСофт Сумин Д.В. 06.09.2023 УА #63147
		
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869
	
	Попытка
		ЯМНоменклатура.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если Оффер.Свойство("barcodes") Тогда
		
		Для Каждого Штрихкод Из Оффер.barcodes Цикл 
			
			//+ ИнфоСофт Сумин Д.В. 22.05.23 УА #58026 
			ХарактеристикаЯМ = ПолучитьХарактеристикуЯМ(Штрихкод, Профиль, ЯМНоменклатура.Ссылка);
			//ХарактеристикаЯМ = Справочники.ИС_ЯМ_Штрихкоды.НайтиПоНаименованию(Штрихкод, Истина);
			//- ИнфоСофт Сумин Д.В. 22.05.23 УА #58026
			
			Если ХарактеристикаЯМ.Пустая() Тогда
				ХарактеристикаЯМ = Справочники.ИС_ЯМ_Штрихкоды.СоздатьЭлемент();							
			Иначе
				ХарактеристикаЯМ = ХарактеристикаЯМ.ПолучитьОбъект();					
			КонецЕсли;  
			
			ХарактеристикаЯМ.Владелец = ЯМНоменклатура.Ссылка;
			ХарактеристикаЯМ.Штрихкод = Штрихкод;
			ХарактеристикаЯМ.Наименование = Штрихкод;
			ХарактеристикаЯМ.Профиль = Профиль;
			
			Попытка
				ХарактеристикаЯМ.Записать();
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;				
			
		КонецЦикла;
		
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
	Возврат ЯМНоменклатура.Ссылка;
	//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
	
КонецФункции //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

//+ ИнфоСофт Сумин Д.В. 22.05.23 УА #58026
Функция ПолучитьНоменклатуруЯМ(shopSku, Профиль)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|ГДЕ
	|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
	|	И ИС_ЯМ_Номенклатура.shopSku = &shopSku";
	
	Запрос.УстановитьПараметр("shopSku", shopSku);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ИС_ЯМ_Номенклатура.ПустаяСсылка();	
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 22.05.23 УА #58026	

//+ ИнфоСофт Сумин Д.В. 22.05.23 УА #58026
Функция ПолучитьХарактеристикуЯМ(Штрихкод, Профиль, Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Штрихкоды.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_ЯМ_Штрихкоды КАК ИС_ЯМ_Штрихкоды
	|ГДЕ
	|	ИС_ЯМ_Штрихкоды.Штрихкод = &Штрихкод
	|	И ИС_ЯМ_Штрихкоды.Профиль = &Профиль
	|	И ИС_ЯМ_Штрихкоды.Владелец = &Ссылка";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ИС_ЯМ_Штрихкоды.ПустаяСсылка();	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий(); 
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 22.05.23 УА #58026

//+ ИнфоСофт Стояк Ю.К. 12.03.2024 УА #66043
Процедура ПометитьНаУдалениеКарточкиНеИзМагазина(Профиль, МассивОфферов)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_ЯМ_Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
		|ГДЕ
		|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
		|	И НЕ ИС_ЯМ_Номенклатура.shopSku В (&shopSku)";
	
	Запрос.УстановитьПараметр("shopSku", МассивОфферов);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоменклатураЯМ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		НоменклатураЯМ.ПометкаУдаления = Истина;
		НоменклатураЯМ.Записать(); 
		
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.03.2024 УА #66043

//+ ИнфоСофт Стояк Ю.К. 22.05.2024 УА #65724
Процедура ЗагрузитьКатегорииТоваров(Профиль) Экспорт 
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Загрузка категорий невозможна");
		Возврат;
	КонецЕсли;
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения); 
	
	КоличествоЭлементовНаЗапрос = НастройкиСоединения["КоличествоЭлементовНаЗапрос"];
	КоличествоПопытокЗапроса = НастройкиСоединения["КоличествоОшибокЗапросов"];
	
	ТелоЗапроса = Новый Структура("language", "RU");
	
	Результат = ИС_ЯМ_API.ЗагрузитьКатегории(Профиль, ПараметрыЗапроса, ТелоЗапроса); 
	
	Если Результат.status = "OK" Тогда  
		
		КатегорияСсылка = Справочники.ИС_ЯМ_КатегорииТоваров.НайтиПоКоду(Результат.result.id);
		
		Если ЗначениеЗаполнено(КатегорияСсылка) Тогда
			СоздатьОбновитьКатегориюТоваров(Результат.result, КатегорияСсылка.parent_id, КатегорияСсылка); 
		Иначе
			СоздатьОбновитьКатегориюТоваров(Результат.result);
		КонецЕсли;
				
	Иначе
		ОбщегоНазначения.СообщитьПользователю(Результат.result);	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 22.05.2024 УА #65724
Функция СоздатьОбновитьКатегориюТоваров(ДанныеКатегории, РодительId = Неопределено, КатегорияСсылка = Неопределено)
	
	Если КатегорияСсылка = Неопределено Тогда
		Если ДанныеКатегории.Свойство("children") Тогда
			КатегорияОбъект = Справочники.ИС_ЯМ_КатегорииТоваров.СоздатьГруппу();
		Иначе
			КатегорияОбъект = Справочники.ИС_ЯМ_КатегорииТоваров.СоздатьЭлемент();
		КонецЕсли;
	Иначе
		КатегорияОбъект = КатегорияСсылка.ПолучитьОбъект();
	КонецЕсли;   
	
	КатегорияОбъект.Код 			= Число(ДанныеКатегории.id); 		
	КатегорияОбъект.Наименование 	= ДанныеКатегории.name; 	
	
	Если Не КатегорияОбъект.ЭтоГруппа Тогда		
		КатегорияОбъект.parent_id 	= РодительId;
	КонецЕсли;
	
	Если РодительId <> Неопределено Тогда
		КатегорияОбъект.Родитель 	= Справочники.ИС_ЯМ_КатегорииТоваров.НайтиПоКоду(РодительId);		
	КонецЕсли;   
	
	Попытка
		КатегорияОбъект.Записать();
	Исключение
		ИмяСобытия = ПолучитьИмяСобытия("СоздатьОбновитьКатегориюТоваров");
		Комментарий = "Не удалось записать категорию товаров: " + КатегорияОбъект.Наименование + Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
	КонецПопытки; 
	
	Если ДанныеКатегории.Свойство("children") Тогда 
		
		Для Каждого Категория Из ДанныеКатегории.children Цикл
			
			КатегорияСсылка = Справочники.ИС_ЯМ_КатегорииТоваров.НайтиПоКоду(Категория.id);
			
			Если ЗначениеЗаполнено(КатегорияСсылка) Тогда
				СоздатьОбновитьКатегориюТоваров(Категория, Число(КатегорияОбъект.Код), КатегорияСсылка); 
			Иначе
				СоздатьОбновитьКатегориюТоваров(Категория, Число(КатегорияОбъект.Код)); 
			КонецЕсли;
			
		КонецЦикла;    
		
	КонецЕсли;
					
	Возврат КатегорияОбъект.Ссылка;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.05.2024 УА #65724  

//+ ИнфоСофт Стояк Ю.К. 24.05.2024 УА #65724
Процедура ЗагрузитьХарактеристики(Профиль, Категория = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Загрузка характеристик невозможна");
		Возврат;
	КонецЕсли;
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения); 
	
	КоличествоЭлементовНаЗапрос = НастройкиСоединения["КоличествоЭлементовНаЗапрос"];
	КоличествоПопытокЗапроса = НастройкиСоединения["КоличествоОшибокЗапросов"];
		
	Если Не ЗначениеЗаполнено(Категория) Тогда 
		
		ПределОшибок = 10;
		КоличествоОшибок = 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_ЯМ_КатегорииТоваров.Ссылка.Код КАК Код,
		|	ИС_ЯМ_КатегорииТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_ЯМ_КатегорииТоваров КАК ИС_ЯМ_КатегорииТоваров
		|ГДЕ
		|	НЕ ИС_ЯМ_КатегорииТоваров.Ссылка.ЭтоГруппа
		|	И ИС_ЯМ_КатегорииТоваров.Ссылка.Используется";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
		
		Для Каждого Выборка Из ВыборкаДетальныеЗаписи Цикл
						
			Результат = ИС_ЯМ_API.ЗагрузитьХарактеристики(Профиль, ПараметрыЗапроса, Выборка.Код);
			
			Если Результат = Неопределено Или Результат.status <> "OK" Тогда
				КоличествоОшибок = КоличествоОшибок + 1;
				Продолжить;
			КонецЕсли;
			
			Если КоличествоОшибок = ПределОшибок Тогда
				Возврат;
			КонецЕсли;   
			
			Для Каждого Элемент Из Результат.result.parameters Цикл
						
				Характеристика = СоздатьИлиОбновитьХарактеристику(Элемент, Выборка.Ссылка);				
				ОбновитьКатегорию(Выборка.Ссылка, Характеристика, Элемент.required);
			
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 24.05.2024 УА #65724
Функция СоздатьИлиОбновитьХарактеристику(ДанныеХарактеристики, Категория)
		
	MD5 = ПолучитьMD5Хэш(ДанныеХарактеристики);
	
	СсылкаХарактеристика = Справочники.ИС_ЯМ_Характеристика.НайтиПоКоду(Число(ДанныеХарактеристики.id));	
	
	Если СсылкаХарактеристика.Пустая() Тогда
		ХарактеристикаОбъект = Справочники.ИС_ЯМ_Характеристика.СоздатьЭлемент();
	Иначе
		
		Если СсылкаХарактеристика.MD5 = MD5 Тогда
			Возврат СсылкаХарактеристика.Ссылка;
		КонецЕсли;					
		
		ХарактеристикаОбъект = СсылкаХарактеристика.ПолучитьОбъект();
		
	КонецЕсли;					
	
	ХарактеристикаОбъект.MD5 					= MD5; 		
	ХарактеристикаОбъект.Код 					= Число(ДанныеХарактеристики.id); 		
	ХарактеристикаОбъект.Наименование 			= ДанныеХарактеристики.name; 	 
		
	ХарактеристикаОбъект.type 					= ДанныеХарактеристики.type;
	ХарактеристикаОбъект.filtering 				= ДанныеХарактеристики.filtering;
	ХарактеристикаОбъект.distinctive 			= ДанныеХарактеристики.distinctive;
	ХарактеристикаОбъект.multivalue 			= ДанныеХарактеристики.multivalue;
	ХарактеристикаОбъект.allowCustomValues 		= ДанныеХарактеристики.allowCustomValues;
	
	Если ДанныеХарактеристики.Свойство("description") Тогда                                     
		ХарактеристикаОбъект.ОписаниеХарактеристики 		= ДанныеХарактеристики.description;		
	КонецЕсли;		
	
	Если ДанныеХарактеристики.Свойство("unit") Тогда 
		
		ХарактеристикаОбъект.unit.Очистить();
		
		ХарактеристикаОбъект.defaultUnitId 		= ДанныеХарактеристики.unit.defaultUnitId;
						
		Для Каждого Юнит Из ДанныеХарактеристики.unit.units Цикл
			
			СсылкаЕдИзм = Справочники.ИС_ЯМ_ЗначенияЕдиницИзмерения.НайтиПоКоду(Юнит.id);	
			
			Если СсылкаЕдИзм.Пустая() Тогда
				ОбъектЕдИзм = Справочники.ИС_ЯМ_ЗначенияЕдиницИзмерения.СоздатьЭлемент();
			Иначе										
				ОбъектЕдИзм = СсылкаЕдИзм.ПолучитьОбъект();				
			КонецЕсли;
			
			ОбъектЕдИзм.Код = Юнит.id;
			ОбъектЕдИзм.Наименование = Юнит.fullName; 
			
			Попытка
				ОбъектЕдИзм.Записать();
				НСтр = ХарактеристикаОбъект.unit.Добавить();
				НСтр.ЕдИзм = ОбъектЕдИзм.Ссылка;
			Исключение
				ИмяСобытия = ПолучитьИмяСобытия("СоздатьИлиОбновитьХарактеристику");
				Комментарий = "Не удалось записать значение единицы измерения: " + ОбъектЕдИзм.Наименование + Символы.ПС
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
			КонецПопытки; 						
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДанныеХарактеристики.Свойство("valueRestrictions") Тогда  
		
		ХарактеристикаОбъект.valueRestrictions.Очистить();
		
		Для Каждого Ограничение Из ДанныеХарактеристики.valueRestrictions Цикл 
			
			ХарактеристикаОбъект.limitingParameterId = Ограничение.limitingParameterId;						
			
			Для Каждого Значение Из Ограничение.limitedValues Цикл
				
				ИдЗначенияОграничения = Значение.limitingOptionValueId;
				
				Для Каждого Ид Из Значение.optionValueIds Цикл
					
					НСтр = ХарактеристикаОбъект.valueRestrictions.Добавить();
					НСтр.limitingOptionValueId = ИдЗначенияОграничения;
					НСтр.id = Ид;         
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Попытка
		ХарактеристикаОбъект.Записать();
	Исключение
		ИмяСобытия = ПолучитьИмяСобытия("СоздатьИлиОбновитьХарактеристику");
		Комментарий = "Не удалось записать характеристику категории: " + ХарактеристикаОбъект.Наименование + Символы.ПС
		+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());	
		Возврат Справочники.ИС_ЯМ_Характеристика.ПустаяСсылка();
	КонецПопытки;      
	
	Если ДанныеХарактеристики.Свойство("values") Тогда                                     			 
		
		Для Каждого Значение Из ДанныеХарактеристики.values Цикл
						
			СсылкаЗначение = Справочники.ИС_ЯМ_ЗначенияХарактеристик.НайтиПоКоду(Значение.id);	
			
			Если СсылкаЗначение.Пустая() Тогда
				ЗначениеОбъект = Справочники.ИС_ЯМ_ЗначенияХарактеристик.СоздатьЭлемент();
			Иначе										
				ЗначениеОбъект = СсылкаЗначение.ПолучитьОбъект();				
			КонецЕсли;
			
			ЗначениеОбъект.Код = Значение.id;
			ЗначениеОбъект.Наименование = Значение.value;  
			ЗначениеОбъект.Владелец = ХарактеристикаОбъект.Ссылка; 
			
			Отбор = Новый Структура();
			Отбор.Вставить("Категория", Категория);
			
			НайденноеЗначение = ЗначениеОбъект.Категории.НайтиСтроки(Отбор);
			
			Если НайденноеЗначение.Количество() = 0 Тогда
				
				НСтр = ЗначениеОбъект.Категории.Добавить();
				НСтр.Категория = Категория;				
				
			КонецЕсли;
			
			Попытка
				ЗначениеОбъект.Записать();
			Исключение
				ИмяСобытия = ПолучитьИмяСобытия("СоздатьИлиОбновитьХарактеристику");
				Комментарий = "Не удалось записать значение характеристики категории: " + ЗначениеОбъект.Наименование + Символы.ПС
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
			КонецПопытки;
			
		КонецЦикла;
				
	КонецЕсли;
	
	Возврат ХарактеристикаОбъект.Ссылка;

КонецФункции //- ИнфоСофт Стояк Ю.К. 24.05.2024 УА #65724 

//+ ИнфоСофт Стояк Ю.К. 24.05.2024 УА #65724
Процедура ОбновитьКатегорию(КатегорияСсылка, ХарактеристикаСсылка, Обязательная)
		
	Категория = КатегорияСсылка.ПолучитьОбъект(); 
	
	Отбор = Новый Структура();
	Отбор.Вставить("Характеристика", ХарактеристикаСсылка);
	
	НайденноеЗначение = Категория.properties.НайтиСтроки(Отбор);
	
	Если НайденноеЗначение.Количество() = 0 Тогда
		
		НСтр = Категория.properties.Добавить();
		НСтр.Характеристика = ХарактеристикаСсылка;
		НСтр.required = Обязательная;
		
	Иначе	
		Возврат;
	КонецЕсли;	
	
	Попытка
		Категория.Записать();
	Исключение
		ИмяСобытия = ПолучитьИмяСобытия("ОбновитьКатегорию");
		Комментарий = "Не удалось записать категорию: " + Категория.Наименование + Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
	КонецПопытки; 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724
Функция ЗаполнитьТаблицуОсновныхРеквизитов(ТаблицаРеквизитов, Категория) Экспорт

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "vendor";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Название бренда или производителя";
	НоваяСтрока.РасширеннаяПодсказка = "Название бренда или производителя. Должно быть записано так, как его пишет сам бренд.";
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "offerId";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Ваш SKU";
	НоваяСтрока.РасширеннаяПодсказка = "Идентификатор товара в вашей системе.";
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "vendorCode";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Артикул производителя";
	НоваяСтрока.РасширеннаяПодсказка = "Артикул товара от производителя.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "name";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Наименование товара";
	НоваяСтрока.РасширеннаяПодсказка = "Наименование товара.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "pictures";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Ссылка на главное фото";	

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "description";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Описание товара";
	НоваяСтрока.РасширеннаяПодсказка = "Подробное описание товара: например, его преимущества и особенности.";
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "vendor";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Название бренда или производителя";
	НоваяСтрока.РасширеннаяПодсказка = "Должно быть записано так, как его пишет сам бренд.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "ДлинаУпаковки";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Длина упаковки, см";
	НоваяСтрока.РасширеннаяПодсказка = "Длина - это наибольшая сторона упаковки товара. Перед измерением длины: - Одежда, текстиль, наборы для вышивания - сложите товар в упаковке пополам. 
									   |- Карты и интерьерные наклейки - скрутите в рулон. Длина рулона - самая большая величина. - Длина книжного комплекта - это длина всей стопки книг, которые входят в комплект.
									   |По умолчанию используются упаковки номенклатуры.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "ШиринаУпаковки";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Ширина упаковки, см";
	НоваяСтрока.РасширеннаяПодсказка = "Сначала измерьте длину и высоту, оставшаяся сторона - это ширина. Перед измерением ширины: - Одежда, текстиль, наборы для вышивания - сложите товар в упаковке пополам. 
									   |- Карты и интерьерные наклейки - скрутите в рулон. Ширина рулона - это его диаметр. - Ширина книжного комплекта - это ширина всей стопки книг, которые входят в комплект.
									   |По умолчанию используются упаковки номенклатуры.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "ВысотаУпаковки";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Высота упаковки, см";
	НоваяСтрока.РасширеннаяПодсказка = "Высота - это наименьшая сторона упаковки товара. Перед измерением высоты: - Одежда, текстиль, наборы для вышивания - сложите товар в упаковке пополам. 
									   |- Карты и интерьерные наклейки - скрутите в рулон. Высота рулона - это его диаметр. - Высота книжного комплекта - это высота всей стопки книг, которые входят в комплект.
									   |По умолчанию используются упаковки номенклатуры.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "ВесУпаковки";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Вес в упаковке, кг";
	НоваяСтрока.РасширеннаяПодсказка = "Вес единицы товара вместе с упаковкой в граммах.
									   |По умолчанию используются упаковки номенклатуры.";
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "boxCount";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Количество грузовых мест.";
	НоваяСтрока.РасширеннаяПодсказка = "Для товаров, занимающих одно место, не передавайте этот параметр."; 
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "downloadable";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Признак цифрового товара";
	НоваяСтрока.РасширеннаяПодсказка = "Укажите true (истина), если товар доставляется по электронной почте.";
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "adult";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Пометка 18+.";
	НоваяСтрока.РасширеннаяПодсказка = "Укажите true (истина), если товар относится к товарам для удовлетворения сексуальных потребностей";
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "customsCommodityCode";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Код ТН ВЭД ";
	НоваяСтрока.РасширеннаяПодсказка = "10 или 14 цифр без пробелов.";
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "certificates";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Номер документа на товар: сертификата, декларации соответствия и т. п.";
	НоваяСтрока.РасширеннаяПодсказка = "Передавать можно только номера документов, сканы которого загружены в кабинете продавца";
									   

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаРеквизитов", ТаблицаРеквизитов);
	Запрос.УстановитьПараметр("Категория", Категория);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРеквизитов.РеквизитТовара КАК РеквизитТовара,
	|	ТаблицаРеквизитов.ПредставлениеРеквизитаТовара КАК ПредставлениеРеквизитаТовара,
	|	ТаблицаРеквизитов.РасширеннаяПодсказка КАК РасширеннаяПодсказка
	|ПОМЕСТИТЬ вт_ОсновныеРеквизитыТовара
	|ИЗ
	|	&ТаблицаРеквизитов КАК ТаблицаРеквизитов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ОсновныеРеквизитыТовара.РеквизитТовара КАК РеквизитТовара,
	|	вт_ОсновныеРеквизитыТовара.ПредставлениеРеквизитаТовара КАК ПредставлениеРеквизитаТовара,
	|	вт_ОсновныеРеквизитыТовара.РасширеннаяПодсказка КАК РасширеннаяПодсказка,
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Реквизит1С КАК Реквизит1С,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ФиксированноеЗначение КАК ФиксированноеЗначение
	|ИЗ
	|	вт_ОсновныеРеквизитыТовара КАК вт_ОсновныеРеквизитыТовара
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара КАК ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара
	|		ПО вт_ОсновныеРеквизитыТовара.РеквизитТовара = ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара
	|			И (ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Категория = &Категория)";

	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРеквизитов = РезультатЗапроса.Выгрузить();

	СоответствиеРеквизитовНоменклатуры = ИС_MP_ВыгрузкаКарточек.СоответствиеРеквизитовНоменклатуры();

	Для Каждого стр Из ТаблицаРеквизитов Цикл
		Если стр.ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры
			И СоответствиеРеквизитовНоменклатуры.Получить(стр.Реквизит1С) = Неопределено Тогда

			ИС_MP_ВыгрузкаКарточек.УдалитьСопоставлениеОсновногоРеквизита(Категория, стр.РеквизитТовара, "ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара");
			стр.ВидРеквизита1С 	= Неопределено;
			стр.Реквизит1С 		= Неопределено;

		КонецЕсли;
	КонецЦикла;

	Возврат ТаблицаРеквизитов;

КонецФункции //- ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724
Функция ТаблицаСоответствийЗначений(Категория, ХарактеристикаЯМ, ВидРеквизита1С, Реквизит1С) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("ХарактеристикаЯМ", ХарактеристикаЯМ);
	Запрос.УстановитьПараметр("ВидРеквизита1С", ВидРеквизита1С);
	Запрос.УстановитьПараметр("Реквизит1С", Реквизит1С);

	ИмяРеквизита 	= Неопределено;
	ТипРеквизита 	= Неопределено;

	Если ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры Тогда

		СтандартныеРеквизиты = Метаданные.Справочники["Номенклатура"].СтандартныеРеквизиты;
		Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
			Если Реквизит.Имя = Реквизит1С Тогда
				ИмяРеквизита = Реквизит.Имя;
				ТипРеквизита = Реквизит.Тип;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ИмяРеквизита = Неопределено Тогда
			РеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].Реквизиты;
			Для Каждого Реквизит Из РеквизитыНоменклатуры Цикл
				Если Реквизит.Синоним = Реквизит1С Тогда
					ИмяРеквизита = Реквизит.Имя;
					ТипРеквизита = Реквизит.Тип;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры Тогда

		СтандартныеРеквизиты = Метаданные.Справочники["ХарактеристикиНоменклатуры"].СтандартныеРеквизиты;
		Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
			Если Реквизит.Имя = Реквизит1С Тогда
				ИмяРеквизита = Реквизит.Имя;
				ТипРеквизита = Реквизит.Тип;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ИмяРеквизита = Неопределено Тогда
			РеквизитыХарактеристики = Метаданные.Справочники["ХарактеристикиНоменклатуры"].Реквизиты;
			Для Каждого Реквизит Из РеквизитыХарактеристики Цикл
				Если Реквизит.Синоним = Реквизит1С Тогда
					ИмяРеквизита = Реквизит.Имя;
					ТипРеквизита = Реквизит.Тип;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры Тогда

		ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
		ИмяРеквизита = "Ссылка";

	Иначе
		
		ТипРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизит1С, "ТипЗначения");
		ИмяРеквизита = "Значение";

	КонецЕсли;

	Если ИС_Ozon_Сервер.ЭтоПримитивныйТип(ТипРеквизита) Тогда

		Отбор = "ГДЕ ЗначенияВ1С.Свойство = &Реквизит1С";

		Если ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры Тогда
			ПолноеИмяОбъекта =  "Справочник.Номенклатура";
			Отбор = "ГДЕ НЕ ЗначенияВ1С.Ссылка.ПометкаУдаления";
		ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры Тогда
			ПолноеИмяОбъекта =  "Справочник.Номенклатура.ДополнительныеРеквизиты";
		ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры Тогда
			ПолноеИмяОбъекта =  "РегистрСведений.ДополнительныеСведения";
		ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры Тогда
			ПолноеИмяОбъекта =  "Справочник.ХарактеристикиНоменклатуры";
			Отбор = "ГДЕ НЕ ЗначенияВ1С.Ссылка.ПометкаУдаления";
		ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры Тогда
			ПолноеИмяОбъекта =  "Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты";
		КонецЕсли;

		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					   |	ЗначенияВ1С.ИмяРеквизита КАК ЗначениеВ1С
					   |ПОМЕСТИТЬ вт_ЗначенияВ1С
					   |ИЗ
					   | " + ПолноеИмяОбъекта + " КАК ЗначенияВ1С
												| " + Отбор + "
															  |;
															  |
															  |////////////////////////////////////////////////////////////////////////////////
															  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
															  |	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ КАК ЗначениеХарактеристикиЯМ,
															  |	вт_ЗначенияВ1С.ЗначениеВ1С КАК ЗначениеВ1С
															  |ИЗ
															  |	вт_ЗначенияВ1С КАК вт_ЗначенияВ1С
															  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеЗначенийХарактеристик КАК ИС_ЯМ_СоответствиеЗначенийХарактеристик
															  |		ПО вт_ЗначенияВ1С.ЗначениеВ1С = ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики
															  |			И (ИС_ЯМ_СоответствиеЗначенийХарактеристик.Категория = &Категория)
															  |			И (ИС_ЯМ_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ = &ХарактеристикаЯМ)
															  |			И (ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = &ВидРеквизита1С)
															  |			И (ИС_ЯМ_СоответствиеЗначенийХарактеристик.Реквизит1С = &Реквизит1С)
															  |ГДЕ
															  |	НЕ вт_ЗначенияВ1С.ЗначениеВ1С ЕСТЬ null
															  |СГРУППИРОВАТЬ ПО
															  |	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ,
															  |	вт_ЗначенияВ1С.ЗначениеВ1С
															  |
															  |УПОРЯДОЧИТЬ ПО
															  |	ЗначениеВ1С";

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяРеквизита", ИмяРеквизита);

	Иначе   
		
 		ОбъектМетаданных 	= Метаданные.НайтиПоТипу(ТипРеквизита.Типы()[0]);
		ПолноеИмяОбъекта 	= ОбъектМетаданных.ПолноеИмя();
		ЭтоСправочник		= СтрНайти(ПолноеИмяОбъекта, "Справочник.") = 1;
		ЭтоПеречисление		= СтрНайти(ПолноеИмяОбъекта, "Перечисление.") = 1;

		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Категория КАК Категория,
		|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ КАК ХарактеристикаЯМ,
		|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ КАК ЗначениеХарактеристикиЯМ,
		|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
		|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
		|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.ИС_ЯМ_СоответствиеЗначенийХарактеристик КАК ИС_ЯМ_СоответствиеЗначенийХарактеристик
		|ГДЕ
		|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Категория = &Категория
		|	И ИС_ЯМ_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ = &ХарактеристикаЯМ
		|	И ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = &ВидРеквизита1С
		|	И ИС_ЯМ_СоответствиеЗначенийХарактеристик.Реквизит1С = &Реквизит1С";
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		РезультатЗапроса.Колонки.ЗначениеХарактеристики.Имя = "ЗначениеВРегистре";
		РезультатЗапроса.Колонки.Добавить("ЗначениеХарактеристики", ТипРеквизита);
		Для Каждого стр Из РезультатЗапроса Цикл
			Если ЭтоСправочник Тогда

				Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда
					стр.ЗначениеХарактеристики = Справочники[ОбъектМетаданных.Имя].ПолучитьСсылку(
						Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
				КонецЕсли;

			ИначеЕсли ЭтоПеречисление Тогда

				Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда
					стр.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Получить(стр.ЗначениеВРегистре - 1);
				КонецЕсли;

			КонецЕсли;
		КонецЦикла;

		Отбор = "";
		Если ЭтоСправочник Тогда
			Отбор = "ГДЕ НЕ ЗначенияОбъекта.ПометкаУдаления ";
			Если ТипРеквизита.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Или ТипРеквизита.СодержитТип(
				Тип("СправочникСсылка.ЗначенияСвойствОбъектовИерархия")) Тогда
				Отбор = Отбор + "И ЗначенияОбъекта.Владелец = &Реквизит1С";
			ИначеЕсли ТипРеквизита.СодержитТип(Тип("СправочникСсылка.ХарактеристикиНоменклатуры")) Тогда
				Отбор = Отбор + "И ЗначенияОбъекта.ВидНоменклатуры = &Реквизит1С";
			КонецЕсли;
		КонецЕсли;

		Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", РезультатЗапроса);
		Запрос.Текст = "ВЫБРАТЬ
					   |	ТаблицаСоответствийЗначений.Категория КАК Категория,
					   |	ТаблицаСоответствийЗначений.ХарактеристикаЯМ КАК ХарактеристикаЯМ,
					   |	ТаблицаСоответствийЗначений.ЗначениеХарактеристикиЯМ КАК ЗначениеХарактеристикиЯМ,
					   |	ТаблицаСоответствийЗначений.ВидРеквизита1С КАК ВидРеквизита1С,
					   |	ТаблицаСоответствийЗначений.Реквизит1С КАК Реквизит1С,
					   |	ТаблицаСоответствийЗначений.ЗначениеВРегистре КАК ЗначениеВРегистре,
					   |	ТаблицаСоответствийЗначений.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
					   |	ТаблицаСоответствийЗначений.ЕдиницаИзмерения КАК ЕдиницаИзмерения
					   |ПОМЕСТИТЬ вт_СоответствиеЗначенийХарактеристик
					   |ИЗ
					   |	&ТаблицаСоответствийЗначений КАК  ТаблицаСоответствийЗначений
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
					   |	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ КАК ЗначениеХарактеристикиЯМ,
					   |	ЗначенияОбъекта.Ссылка КАК ЗначениеВ1С
					   |ИЗ
					   |	" + ПолноеИмяОбъекта + " КАК ЗначенияОбъекта
												   |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК ИС_ЯМ_СоответствиеЗначенийХарактеристик
												   |		ПО ЗначенияОбъекта.Ссылка = ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики
												   | " + Отбор + " 								
																 |СГРУППИРОВАТЬ ПО
																 |	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ,
																 |	ЗначенияОбъекта.Ссылка
																 |
																 |УПОРЯДОЧИТЬ ПО
																 |	ЗначениеВ1С";

	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();

КонецФункции //- ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724
Функция ЗначенияХарактеристикЯМИзСтроки(ЗначенияСтрокой) Экспорт

	Результат = Новый Массив;

	МассивСтрок = СтрРазделить(ЗначенияСтрокой, ";", Ложь);
	Для Каждого стр Из МассивСтрок Цикл
		Если СтрДлина(стр) = 36 Тогда
			ЗначениеХарактеристики = Справочники.ИС_ЯМ_ЗначенияХарактеристик.ПолучитьСсылку(
				Новый УникальныйИдентификатор(стр));
			Если ЗначениеЗаполнено(ЗначениеХарактеристики) Тогда
				Результат.Добавить(ЗначениеХарактеристики);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724
Функция ТекстКоличествоСопоставленныхЗначений(Категория, ХарактеристикаЯМ, ВидРеквизита1С, Реквизит1С,
	ТребуетсяСопоставление) Экспорт

	Если Не ТребуетсяСопоставление Тогда
		Возврат "Сопоставление не требуется";
	КонецЕсли;

	Результат = "Сопоставлено 0 из 0";

	Если ЗначениеЗаполнено(Реквизит1С) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаСоответствийЗначений.ЗначениеВ1С КАК ЗначениеВ1С,
		|	ТаблицаСоответствийЗначений.ЗначениеХарактеристикиЯМ КАК ЗначениеХарактеристикиЯМ
		|ПОМЕСТИТЬ вт_Значения
		|ИЗ
		|	&ТаблицаСоответствийЗначений КАК  ТаблицаСоответствийЗначений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_Значения.ЗначениеВ1С) КАК Всего,
		|	КОЛИЧЕСТВО(вт_Значения.ЗначениеХарактеристикиЯМ) КАК Сопоставлено
		|ИЗ
		|	вт_Значения КАК вт_Значения";

		Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений(Категория,
			ХарактеристикаЯМ, ВидРеквизита1С, Реквизит1С));

		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = СтрШаблон("Сопоставлено %1 из %2", ?(Выборка.Сопоставлено = Null, 0, Выборка.Сопоставлено),
				Выборка.Всего);
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724
Процедура УдалитьСопоставлениеХарактеристики(Категория, ХарактеристикаЯМ) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_ЯМ_СоответствиеЗначенийХарактеристик.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.ХарактеристикаЯМ.Установить(ХарактеристикаЯМ);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724
Процедура ДобавитьСопоставлениеХарактеристики(Категория, ХарактеристикаЯМ, ВидРеквизита1С, Реквизит1С,
	ФиксированноеЗначение, ЕдиницаИзмерения) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_ЯМ_СоответствиеЗначенийХарактеристик.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.ХарактеристикаЯМ.Установить(ХарактеристикаЯМ);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.Категория 				= Категория;
	ЗаписьНабора.ХарактеристикаЯМ 		= ХарактеристикаЯМ;
	ЗаписьНабора.ВидРеквизита1С 		= ВидРеквизита1С;
	ЗаписьНабора.Реквизит1С 			= Реквизит1С;
	ЗаписьНабора.ФиксированноеЗначение 	= ФиксированноеЗначение;
	ЗаписьНабора.ЕдиницаИзмерения 		= ЕдиницаИзмерения;
	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 27.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724
Функция ХарактеристикаПоКоду(ИдСтрокой) Экспорт

	Характеристика = Справочники.ИС_ЯМ_Характеристика.НайтиПоКоду(Число(ИдСтрокой), Истина);

	Возврат Характеристика;

КонецФункции //- ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724 

//+ ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724
Функция ТаблицаСоответствийДопРеквизитов(Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории) Экспорт

	Если ЕстьНастройкиОсновныхРеквизитовДляКатегории Тогда
		КатегорияДляОсновныхРеквизитов = Категория;
	Иначе
		КатегорияДляОсновныхРеквизитов = ПредопределенноеЗначение("Справочник.ИС_ЯМ_КатегорииТоваров.ПустаяСсылка");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("КатегорияДляОсновныхРеквизитов", КатегорияДляОсновныхРеквизитов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ КАК ХарактеристикаЯМ,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ КАК ЗначениеХарактеристикиЯМ,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Реквизит1С.ТипЗначения КАК ТипЗначенияРеквизита,
	|	ИС_ЯМ_Характеристика.Код КАК ИС_ЯМ_ХарактеристикаКод,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	0 КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ВЫБОР КОГДА ИС_ЯМ_Характеристика.type = ""ENUM"" ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ТребуетсяСопоставление
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_СоответствиеЗначенийХарактеристик КАК ИС_ЯМ_СоответствиеЗначенийХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Характеристика КАК ИС_ЯМ_Характеристика
	|		ПО ИС_ЯМ_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ = ИС_ЯМ_Характеристика.Ссылка
	|ГДЕ
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Категория = &Категория
	|	И (ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры)
	|			ИЛИ ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры)
	|			ИЛИ ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры)
	|			ИЛИ ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	| 
	|ВЫБРАТЬ
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ,
	|	NULL,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ФиксированноеЗначение,
	|	ТипЗначения(ИС_ЯМ_СоответствиеЗначенийХарактеристик.ФиксированноеЗначение),
	|	ИС_ЯМ_Характеристика.Код КАК ИС_ЯМ_ХарактеристикаКод, 
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	0,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_СоответствиеЗначенийХарактеристик КАК ИС_ЯМ_СоответствиеЗначенийХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Характеристика КАК ИС_ЯМ_Характеристика
	|		ПО ИС_ЯМ_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ = ИС_ЯМ_Характеристика.Ссылка
	|ГДЕ
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Категория = &Категория
	|	И (ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение)
	|	ИЛИ ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара,
	|	NULL,
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С,
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Реквизит1С,
	|	NULL,
	|	NULL,
	|	NULL, 
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара КАК ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Категория = &КатегорияДляОсновныхРеквизитов
	|	И (ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры)
	|			ИЛИ ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры)
	|			ИЛИ ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры)
	|			ИЛИ ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара,
	|	NULL,
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С,
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Реквизит1С,
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ФиксированноеЗначение,
	|	ТипЗначения(ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ФиксированноеЗначение),
	|	NULL, 
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	0,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара КАК ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Категория = &КатегорияДляОсновныхРеквизитов
	|	И (ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение)
	|	ИЛИ ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры))";

	ТаблицаСоответствийЗначений = Запрос.Выполнить().Выгрузить();

	МассивОписанийТипов = ТаблицаСоответствийЗначений.ВыгрузитьКолонку("ТипЗначенияРеквизита");
	МассивОписанийТипов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивОписанийТипов);
	МассивТипов = Новый Массив;
	Для Каждого описаниеТипов Из МассивОписанийТипов Цикл
		Если ЗначениеЗаполнено(описаниеТипов) Тогда
			Если ТипЗнч(описаниеТипов) = Тип("ОписаниеТипов") Тогда
				МассивТипов.Добавить(ОписаниеТипов.Типы()[0]);
			ИначеЕсли ТипЗнч(описаниеТипов) = Тип("Тип") Тогда
				МассивТипов.Добавить(описаниеТипов);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если МассивТипов.Количество() = 0 Тогда
		МассивТипов.Добавить(Тип("Строка"));
	КонецЕсли;

	МассивТипов.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
	КС = Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная);
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов, , КС);

	ТаблицаСоответствийЗначений.Колонки.ЗначениеХарактеристики.Имя = "ЗначениеВРегистре";
	ТаблицаСоответствийЗначений.Колонки.Добавить("ЗначениеХарактеристики", ОписаниеТипов);

	Для Каждого стр Из ТаблицаСоответствийЗначений Цикл

		Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда

			Если ИС_MP_ВыгрузкаКарточек.ЭтоПримитивныйТип(стр.ТипЗначенияРеквизита) Тогда
				стр.ЗначениеХарактеристики = стр.ЗначениеВРегистре;
			Иначе

				Если стр.ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры Тогда
					стр.ЗначениеХарактеристики = Справочники["ХарактеристикиНоменклатуры"].ПолучитьСсылку(
						Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
				Иначе

					ОбъектМетаданных = Метаданные.НайтиПоТипу(стр.ТипЗначенияРеквизита.Типы()[0]);
					ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
					ЭтоСправочник	= СтрНайти(ПолноеИмяОбъекта, "Справочник.") = 1;
					ЭтоПеречисление	= СтрНайти(ПолноеИмяОбъекта, "Перечисление.") = 1;

					Если ЭтоСправочник Тогда
						стр.ЗначениеХарактеристики = Справочники[ОбъектМетаданных.Имя].ПолучитьСсылку(
							Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
					ИначеЕсли ЭтоПеречисление Тогда
						стр.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Получить(стр.ЗначениеВРегистре
							- 1);
					КонецЕсли;
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Возврат ТаблицаСоответствийЗначений;

КонецФункции //- ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724
Функция СтруктураПараметровЗначенийРеквизитовНоменклатуры(Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории) Экспорт

	Если ЕстьНастройкиОсновныхРеквизитовДляКатегории Тогда
		КатегорияДляОсновныхРеквизитов = Категория;
	Иначе
		КатегорияДляОсновныхРеквизитов = ПредопределенноеЗначение("Справочник.ИС_ЯМ_КатегорииТоваров.ПустаяСсылка");
	КонецЕсли;

	СоответствиеРеквизитов = Новый Соответствие;
	СписокРеквизитов = "";
	МассивТипов = Новый Массив;
	МассивСинонимов = Новый Массив;

	РеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].Реквизиты;
	Для Каждого реквизит Из РеквизитыНоменклатуры Цикл
		СоответствиеРеквизитов.Вставить(СокрЛП(реквизит.Синоним), реквизит);
		МассивСинонимов.Добавить(СокрЛП(реквизит.Синоним));
		СписокРеквизитов = СписокРеквизитов + реквизит.Имя + ", ";
		МассивТипов.Добавить(реквизит.тип.типы()[0]);
	КонецЦикла;

	СтандартныеРеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].СтандартныеРеквизиты;
	Для Каждого реквизит Из СтандартныеРеквизитыНоменклатуры Цикл
		СоответствиеРеквизитов.Вставить(реквизит.Имя, реквизит);
		МассивСинонимов.Добавить(реквизит.Имя);
		СписокРеквизитов = СписокРеквизитов + реквизит.Имя + ", ";
		МассивТипов.Добавить(реквизит.тип.типы()[0]);
	КонецЦикла;

	СписокРеквизитов = Лев(СписокРеквизитов, СтрДлина(СписокРеквизитов) - 2);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("КатегорияДляОсновныхРеквизитов", КатегорияДляОсновныхРеквизитов);
	Запрос.УстановитьПараметр("МассивСинонимов", МассивСинонимов);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ КАК ХарактеристикаЯМ,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ КАК ЗначениеХарактеристикиЯМ,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	|	ИС_ЯМ_Характеристика.Код КАК ИС_ЯМ_ХарактеристикаКод,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	0 КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ВЫБОР КОГДА ИС_ЯМ_Характеристика.type = ""ENUM"" ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ТребуетсяСопоставление
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_СоответствиеЗначенийХарактеристик КАК ИС_ЯМ_СоответствиеЗначенийХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Характеристика КАК ИС_ЯМ_Характеристика
	|		ПО ИС_ЯМ_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ = ИС_ЯМ_Характеристика.Ссылка
	|ГДЕ
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Категория = &Категория
	|	И ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры)
	|	И ИС_ЯМ_СоответствиеЗначенийХарактеристик.Реквизит1С В(&МассивСинонимов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара,
	|	NULL,
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С,
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Реквизит1С,
	|	NULL,
	|	NULL,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара КАК ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Категория = &КатегорияДляОсновныхРеквизитов
	|	И ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры)
	|	И ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Реквизит1С В(&МассивСинонимов)";

	ТаблицаСоответствийЗначений = Запрос.Выполнить().Выгрузить();
	ТаблицаСоответствийЗначений.Колонки.ЗначениеХарактеристики.Имя = "ЗначениеВРегистре";

	МассивТипов 	= ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивТипов);
	ОписаниеТипов 	= Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная));
	ТаблицаСоответствийЗначений.Колонки.Добавить("ЗначениеХарактеристики", ОписаниеТипов);

	Для Каждого стр Из ТаблицаСоответствийЗначений Цикл
		Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда

			РеквизитИзСоответствия = СоответствиеРеквизитов.Получить(стр.Реквизит1С);
			Если РеквизитИзСоответствия = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			ТипЗначенияРеквизита = РеквизитИзСоответствия.Тип;
			Если ИС_Ozon_Сервер.ЭтоПримитивныйТип(ТипЗначенияРеквизита) Тогда

				стр.ЗначениеХарактеристики = стр.ЗначениеВРегистре;

			Иначе

				ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначенияРеквизита.Типы()[0]);
				ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
				ЭтоСправочник	= СтрНайти(ПолноеИмяОбъекта, "Справочник.") = 1;
				ЭтоПеречисление	= СтрНайти(ПолноеИмяОбъекта, "Перечисление.") = 1;

				Если ЭтоСправочник Тогда
					стр.ЗначениеХарактеристики = Справочники[ОбъектМетаданных.Имя].ПолучитьСсылку(
						Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
				ИначеЕсли ЭтоПеречисление Тогда
					стр.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Получить(стр.ЗначениеВРегистре - 1);
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Результат = Новый Структура;
	Результат.Вставить("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);
	Результат.Вставить("СписокРеквизитов", СписокРеквизитов);
	Результат.Вставить("СоответствиеРеквизитов", СоответствиеРеквизитов);

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724
Функция СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры(Категория,
	ЕстьНастройкиОсновныхРеквизитовДляКатегории) Экспорт

	Если ЕстьНастройкиОсновныхРеквизитовДляКатегории Тогда
		КатегорияДляОсновныхРеквизитов = Категория;
	Иначе
		КатегорияДляОсновныхРеквизитов = ПредопределенноеЗначение("Справочник.ИС_ЯМ_КатегорииТоваров.ПустаяСсылка");
	КонецЕсли;

	СоответствиеРеквизитов = Новый Соответствие;
	СписокРеквизитов = "";
	МассивТипов = Новый Массив;

	РеквизитыНоменклатуры = Метаданные.Справочники["ХарактеристикиНоменклатуры"].Реквизиты;
	Для Каждого реквизит Из РеквизитыНоменклатуры Цикл
		СоответствиеРеквизитов.Вставить(реквизит.Синоним, реквизит);
		СписокРеквизитов = СписокРеквизитов + реквизит.Имя + ", ";
		МассивТипов.Добавить(реквизит.тип.типы()[0]);
	КонецЦикла;

	СтандартныеРеквизиты = Метаданные.Справочники["ХарактеристикиНоменклатуры"].СтандартныеРеквизиты;
	Для Каждого реквизит Из СтандартныеРеквизиты Цикл
		СоответствиеРеквизитов.Вставить(реквизит.Имя, реквизит);
		СписокРеквизитов = СписокРеквизитов + реквизит.Имя + ", ";
		МассивТипов.Добавить(реквизит.тип.типы()[0]);
	КонецЦикла;

	СписокРеквизитов = Лев(СписокРеквизитов, СтрДлина(СписокРеквизитов) - 2);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("КатегорияДляОсновныхРеквизитов", КатегорияДляОсновныхРеквизитов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ КАК ХарактеристикаЯМ,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ КАК ЗначениеХарактеристикиЯМ,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	|	ИС_ЯМ_Характеристика.Код КАК ИС_ЯМ_ХарактеристикаКод,
	|	ВЫБОР КОГДА ИС_ЯМ_Характеристика.type = ""ENUM"" ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ТребуетсяСопоставление
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_СоответствиеЗначенийХарактеристик КАК ИС_ЯМ_СоответствиеЗначенийХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Характеристика КАК ИС_ЯМ_Характеристика
	|		ПО ИС_ЯМ_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ = ИС_ЯМ_Характеристика.Ссылка
	|ГДЕ
	|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Категория = &Категория
	|	И ИС_ЯМ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара,
	|	NULL,
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С,
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Реквизит1С,
	|	NULL,
	|	NULL,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара КАК ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Категория = &КатегорияДляОсновныхРеквизитов
	|	И ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры)";

	ТаблицаСоответствийЗначений = Запрос.Выполнить().Выгрузить();
	ТаблицаСоответствийЗначений.Колонки.ЗначениеХарактеристики.Имя = "ЗначениеВРегистре";

	МассивТипов 	= ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивТипов);
	ОписаниеТипов 	= Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная));
	ТаблицаСоответствийЗначений.Колонки.Добавить("ЗначениеХарактеристики", ОписаниеТипов);

	Для Каждого стр Из ТаблицаСоответствийЗначений Цикл
		Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда

			ТипЗначенияРеквизита = СоответствиеРеквизитов.Получить(стр.Реквизит1С).тип;
			Если ИС_Ozon_Сервер.ЭтоПримитивныйТип(ТипЗначенияРеквизита) Тогда

				стр.ЗначениеХарактеристики = стр.ЗначениеВРегистре;

			Иначе

				ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначенияРеквизита.Типы()[0]);
				ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
				ЭтоСправочник	= СтрНайти(ПолноеИмяОбъекта, "Справочник.") = 1;
				ЭтоПеречисление	= СтрНайти(ПолноеИмяОбъекта, "Перечисление.") = 1;

				Если ЭтоСправочник Тогда
					стр.ЗначениеХарактеристики = Справочники[ОбъектМетаданных.Имя].ПолучитьСсылку(
						Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
				ИначеЕсли ЭтоПеречисление Тогда
					стр.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Получить(стр.ЗначениеВРегистре - 1);
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Результат = Новый Структура;
	Результат.Вставить("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);
	Результат.Вставить("СписокРеквизитов", СписокРеквизитов);
	Результат.Вставить("СоответствиеРеквизитов", СоответствиеРеквизитов);

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724
Функция ЕстьНастройкиОсновныхРеквизитовДляКатегории(Категория) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Категория КАК Категория
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара КАК ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_ЯМ_СоответствиеОсновныхРеквизитовТовара.Категория = &Категория";

	Запрос.УстановитьПараметр("Категория", Категория);

	РезультатЗапроса = Запрос.Выполнить();

	Возврат Не РезультатЗапроса.Пустой();

КонецФункции //- ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Процедура ЗаполнитьЗначенияПоДопРеквизитам(СтрокаТаблицы, ТаблицаСоответствийЗначений, РазделительФотографий,
	ИмяЗаполняемойКолонки = Неопределено) Экспорт

	Если ТаблицаСоответствийЗначений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСоответствийЗначений.ХарактеристикаЯМ КАК ХарактеристикаЯМ,
	|	ТаблицаСоответствийЗначений.ИС_ЯМ_ХарактеристикаКод КАК ИС_ЯМ_ХарактеристикаКод,
	|	ТаблицаСоответствийЗначений.ЗначениеХарактеристикиЯМ КАК ЗначениеХарактеристикиЯМ,
	|	ТаблицаСоответствийЗначений.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ТаблицаСоответствийЗначений.Реквизит1С КАК Реквизит1С,
	|	ТаблицаСоответствийЗначений.ЗначениеВРегистре КАК ЗначениеВРегистре,
	|	ТаблицаСоответствийЗначений.ЗначениеХарактеристики КАК ЗначениеХарактеристики, 
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ТаблицаСоответствийЗначений.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ТаблицаСоответствийЗначений.ТребуетсяСопоставление КАК ТребуетсяСопоставление
	|ПОМЕСТИТЬ вт_СоответствиеЗначенийХарактеристик
	|ИЗ
	|	&ТаблицаСоответствийЗначений КАК ТаблицаСоответствийЗначений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК Ссылка,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ КАК ХарактеристикаЯМ,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_ЯМ_ХарактеристикаКод КАК ИС_ЯМ_ХарактеристикаКод,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ КАК ЗначениеХарактеристикиЯМ,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	"""" КАК ТекстоваяСтрока
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
	|			И (ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
	|ГДЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка В (&ХарактеристикиНоменклатуры)
	|	И вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры)
	|	И вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_ЯМ_ХарактеристикаКод,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики, 
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство)
	|			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ ЕСТЬ NULL
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ = НЕОПРЕДЕЛЕНО)
	|ГДЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка В(&ХарактеристикиНоменклатуры)
	|	И вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры)
	|	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_ЯМ_ХарактеристикаКод,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (НоменклатураДополнительныеРеквизиты.Свойство = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
	|			И (НоменклатураДополнительныеРеквизиты.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
	|ГДЕ
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры)
	|	И НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
	|	И вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_ЯМ_ХарактеристикаКод,
	|	НоменклатураДополнительныеРеквизиты.Значение,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики, 
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	НоменклатураДополнительныеРеквизиты.ТекстоваяСтрока
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = НоменклатураДополнительныеРеквизиты.Свойство)
	|			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ ЕСТЬ NULL
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ = НЕОПРЕДЕЛЕНО)
	|ГДЕ
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры)
	|	И НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
	|	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_ЯМ_ХарактеристикаКод,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (ДополнительныеСведения.Свойство = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
	|			И (ДополнительныеСведения.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
	|ГДЕ
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры)
	|	И ДополнительныеСведения.Объект = &Номенклатура
	|	И вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_ЯМ_ХарактеристикаКод,
	|	ДополнительныеСведения.Значение,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = ДополнительныеСведения.Свойство)
	|			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ ЕСТЬ NULL
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ = НЕОПРЕДЕЛЕНО)
	|ГДЕ
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры)
	|	И ДополнительныеСведения.Объект = &Номенклатура
	|	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_ЯМ_ХарактеристикаКод,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеВРегистре,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|
	|ГДЕ
	|	(вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение)
	|	ИЛИ вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры))
	|	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление 
	|";

	Если ИС_MP_ВыгрузкаКарточек.ЕстьВидНоменклатурыУХарактеристики() Тогда
		Запрос.Текст = Запрос.Текст + "
									  |
									  |ОБЪЕДИНИТЬ ВСЕ
									  |
									  |////////////////////////////////////////////////////////////////////////////////
									  |ВЫБРАТЬ
									  |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
									  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ КАК ХарактеристикаЯМ,
									  |	вт_СоответствиеЗначенийХарактеристик.ИС_ЯМ_ХарактеристикаКод КАК ИС_ЯМ_ХарактеристикаКод,
									  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ КАК ЗначениеХарактеристикиЯМ,
									  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
									  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
									  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
									  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
									  |	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
									  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
									  |	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
									  |	"""" КАК ТекстоваяСтрока
									  |ИЗ
									  |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
									  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
									  |		ПО (ХарактеристикиНоменклатуры.ВидНоменклатуры = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
									  |			И (ХарактеристикиНоменклатуры.Ссылка = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
									  |ГДЕ
									  |	ХарактеристикиНоменклатуры.Ссылка В (&ХарактеристикиНоменклатуры)
									  |	И вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры)
									  |	И вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
									  |
									  |ОБЪЕДИНИТЬ ВСЕ
									  |
									  |ВЫБРАТЬ
									  |	ХарактеристикиНоменклатуры.Ссылка,
									  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ,
									  |	вт_СоответствиеЗначенийХарактеристик.ИС_ЯМ_ХарактеристикаКод,
									  |	ХарактеристикиНоменклатуры.Ссылка,
									  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
									  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
									  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики, 
									  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
									  |	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
									  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
									  |	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
									  |	""""
									  |ИЗ
									  |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
									  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
									  |		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = ХарактеристикиНоменклатуры.ВидНоменклатуры)
									  |			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
									  |				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ ЕСТЬ NULL
									  |				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ = НЕОПРЕДЕЛЕНО)
									  |ГДЕ
									  |	ХарактеристикиНоменклатуры.Ссылка В(&ХарактеристикиНоменклатуры)
									  |	И вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры)
									  |	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление";

	КонецЕсли;

	Запрос.УстановитьПараметр("ХарактеристикиНоменклатуры", СтрокаТаблицы.ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура", СтрокаТаблицы.Номенклатура);
	Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		ЗаполнитьЗначениеКолонки(Выборка, СтрокаТаблицы, РазделительФотографий, ИмяЗаполняемойКолонки);
		
	КонецЦикла
	;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Процедура ЗаполнитьЗначенияПоРеквизитамНоменклатуры(СтрокаТаблицы, СтруктураПараметров, РазделительФотографий,
	ИмяЗаполняемойКолонки = Неопределено) Экспорт

	ТаблицаСоответствийЗначений = СтруктураПараметров.ТаблицаСоответствийЗначений;
	Если ТаблицаСоответствийЗначений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	" + СтруктураПараметров.СписокРеквизитов + Символы.ПС + "
																				|ПОМЕСТИТЬ вт_ЗначенияРеквизитов1С
																				|ИЗ
																				|	Справочник.Номенклатура КАК Номенклатура
																				|ГДЕ
																				|	Номенклатура.Ссылка = &Номенклатура
																				|;
																				|
																				|////////////////////////////////////////////////////////////////////////////////
																				|";

	МассивРеквизитов = ТаблицаСоответствийЗначений.ВыгрузитьКолонку("Реквизит1С");
	МассивРеквизитов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивРеквизитов);
	ПервыйЗапрос = Истина;
	Если МассивРеквизитов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СинонимРеквизита Из МассивРеквизитов Цикл
		Реквизит = СтруктураПараметров.СоответствиеРеквизитов.Получить(СинонимРеквизита);
		Если Реквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СодержитСтроку = Реквизит.Тип.СодержитТип(Тип("Строка"));

		Запрос.текст = Запрос.Текст + ?(ПервыйЗапрос, "", "ОБЪЕДИНИТЬ ВСЕ") + Символы.ПС + Символы.ПС + "ВЫБРАТЬ
																										| " + ?(
			СодержитСтроку, "Выразить(вт_ЗначенияРеквизитов1С." + Реквизит.Имя + " КАК Строка(1024))",
			"вт_ЗначенияРеквизитов1С." + Реквизит.Имя) + " КАК Значение,
														 |	""" + СинонимРеквизита + """ КАК ИмяРеквизита1С,"
			+ Символы.ПС + "
						   | " + ?(СодержитСтроку, "вт_ЗначенияРеквизитов1С." + Реквизит.Имя, """""") + " КАК ТекстоваяСтрока 
																										| " + ?(
			ПервыйЗапрос, "ПОМЕСТИТЬ вт_таб2" + Символы.ПС, "") + "ИЗ
																  |	вт_ЗначенияРеквизитов1С КАК вт_ЗначенияРеквизитов1С"
			+ Символы.ПС + Символы.ПС;
		ПервыйЗапрос = Ложь;
	КонецЦикла;

	Запрос.Текст = Запрос.Текст + ";
								  |////////////////////////////////////////////////////////////////////////////////
								  |
								  |ВЫБРАТЬ
								  |	ТаблицаСоответствийЗначений.ХарактеристикаЯМ КАК ХарактеристикаЯМ,
								  |	ТаблицаСоответствийЗначений.ИС_ЯМ_ХарактеристикаКод КАК ИС_ЯМ_ХарактеристикаКод,
								  |	ТаблицаСоответствийЗначений.ЗначениеХарактеристикиЯМ КАК ЗначениеХарактеристикиЯМ,
								  |	ТаблицаСоответствийЗначений.ВидРеквизита1С КАК ВидРеквизита1С,
								  |	ТаблицаСоответствийЗначений.Реквизит1С КАК Реквизит1С,
								  |	ТаблицаСоответствийЗначений.ЗначениеВРегистре КАК ЗначениеВРегистре,
								  |	ТаблицаСоответствийЗначений.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
								  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
			  					  |	ТаблицаСоответствийЗначений.Множитель КАК Множитель,
								  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
								  |	ТаблицаСоответствийЗначений.ТребуетсяСопоставление КАК ТребуетсяСопоставление
								  |ПОМЕСТИТЬ вт_СоответствиеЗначенийХарактеристик
								  |ИЗ
								  |	&ТаблицаСоответствийЗначений КАК ТаблицаСоответствийЗначений
								  |;
								  |
								  |////////////////////////////////////////////////////////////////////////////////
								  |
								  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
								  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ,
								  |	вт_СоответствиеЗначенийХарактеристик.ИС_ЯМ_ХарактеристикаКод,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ,
								  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
								  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
			  					  |	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
								  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
								  |	РеквизитыНоменклатуры.ТекстоваяСтрока КАК ТекстоваяСтрока,
								  |   вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |ИЗ
								  |	вт_таб2 КАК РеквизитыНоменклатуры
								  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
								  |		ПО (РеквизитыНоменклатуры.ИмяРеквизита1С = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
								  |			И (РеквизитыНоменклатуры.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
								  |ГДЕ
								  |	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |
								  |ОБЪЕДИНИТЬ ВСЕ
								  |
								  |ВЫБРАТЬ
								  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ,
								  |	вт_СоответствиеЗначенийХарактеристик.ИС_ЯМ_ХарактеристикаКод,
								  |	РеквизитыНоменклатуры.Значение,
								  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,  
								  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
			  					  |	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
								  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
								  |	РеквизитыНоменклатуры.ТекстоваяСтрока,
								  |   вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |ИЗ
								  |	вт_таб2 КАК РеквизитыНоменклатуры
								  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
								  |		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = РеквизитыНоменклатуры.ИмяРеквизита1С)
								  |			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
								  |				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ ЕСТЬ NULL ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ = Неопределено)
								  |ГДЕ
								  |	НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление";

	Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);
	Запрос.УстановитьПараметр("Номенклатура", СтрокаТаблицы.Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначениеКолонки(Выборка, СтрокаТаблицы, РазделительФотографий, ИмяЗаполняемойКолонки);
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Процедура ЗаполнитьЗначенияПоРеквизитамХарактеристикиНоменклатуры(СтрокаТаблицы, СтруктураПараметров,
	РазделительФотографий, ИмяЗаполняемойКолонки = Неопределено) Экспорт

	ТаблицаСоответствийЗначений = СтруктураПараметров.ТаблицаСоответствийЗначений;
	Если ТаблицаСоответствийЗначений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	" + СтруктураПараметров.СписокРеквизитов + Символы.ПС + "
																				|ПОМЕСТИТЬ вт_ЗначенияРеквизитов1С
																				|ИЗ
																				|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
																				|ГДЕ
																				|	ХарактеристикиНоменклатуры.Ссылка = &ХарактеристикаНоменклатуры
																				|;
																				|
																				|////////////////////////////////////////////////////////////////////////////////
																				|";

	МассивРеквизитов = ТаблицаСоответствийЗначений.ВыгрузитьКолонку("Реквизит1С");
	МассивРеквизитов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивРеквизитов);
	ПервыйЗапрос = Истина;
	Для Каждого СинонимРеквизита Из МассивРеквизитов Цикл
		Реквизит = СтруктураПараметров.СоответствиеРеквизитов.Получить(СинонимРеквизита);
		Если Реквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СодержитСтроку = Реквизит.Тип.СодержитТип(Тип("Строка"));

		Запрос.текст = Запрос.Текст + ?(ПервыйЗапрос, "", "ОБЪЕДИНИТЬ ВСЕ") + Символы.ПС + Символы.ПС + "ВЫБРАТЬ
																										| " + ?(
			СодержитСтроку, "Выразить(вт_ЗначенияРеквизитов1С." + Реквизит.Имя + " КАК Строка(1024))",
			"вт_ЗначенияРеквизитов1С." + Реквизит.Имя) + " КАК Значение,
														 |	""" + СинонимРеквизита + """ КАК ИмяРеквизита1С,"
			+ Символы.ПС + "
						   | " + ?(СодержитСтроку, "вт_ЗначенияРеквизитов1С." + Реквизит.Имя, """""") + " КАК ТекстоваяСтрока 
																										| " + ?(
			ПервыйЗапрос, "ПОМЕСТИТЬ вт_таб2" + Символы.ПС, "") + "ИЗ
																  |	вт_ЗначенияРеквизитов1С КАК вт_ЗначенияРеквизитов1С"
			+ Символы.ПС + Символы.ПС;
		ПервыйЗапрос = Ложь;
	КонецЦикла;

	Запрос.Текст = Запрос.Текст + ";
								  |////////////////////////////////////////////////////////////////////////////////
								  |
								  |ВЫБРАТЬ
								  |	ТаблицаСоответствийЗначений.ХарактеристикаЯМ КАК ХарактеристикаЯМ,
								  |	ТаблицаСоответствийЗначений.ИС_ЯМ_ХарактеристикаКод КАК ИС_ЯМ_ХарактеристикаКод,
								  |	ТаблицаСоответствийЗначений.ЗначениеХарактеристикиЯМ КАК ЗначениеХарактеристикиЯМ,
								  |	ТаблицаСоответствийЗначений.ВидРеквизита1С КАК ВидРеквизита1С,
								  |	ТаблицаСоответствийЗначений.Реквизит1С КАК Реквизит1С,
								  |	ТаблицаСоответствийЗначений.ЗначениеВРегистре КАК ЗначениеВРегистре,
								  |	ТаблицаСоответствийЗначений.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
								  |	ТаблицаСоответствийЗначений.ТребуетсяСопоставление КАК ТребуетсяСопоставление
								  |ПОМЕСТИТЬ вт_СоответствиеЗначенийХарактеристик
								  |ИЗ
								  |	&ТаблицаСоответствийЗначений КАК ТаблицаСоответствийЗначений
								  |;
								  |
								  |////////////////////////////////////////////////////////////////////////////////
								  |
								  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
								  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ,
								  |	вт_СоответствиеЗначенийХарактеристик.ИС_ЯМ_ХарактеристикаКод,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ,
								  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
								  |	РеквизитыХарактеристики.ТекстоваяСтрока КАК ТекстоваяСтрока,
								  |   вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |ИЗ
								  |	вт_таб2 КАК РеквизитыХарактеристики
								  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
								  |		ПО (РеквизитыХарактеристики.ИмяРеквизита1С = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
								  |			И (РеквизитыХарактеристики.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
								  |ГДЕ
								  |	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |
								  |ОБЪЕДИНИТЬ ВСЕ
								  |
								  |ВЫБРАТЬ
								  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ,
								  |	вт_СоответствиеЗначенийХарактеристик.ИС_ЯМ_ХарактеристикаКод,
								  |	РеквизитыХарактеристики.Значение,
								  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
								  |	РеквизитыХарактеристики.ТекстоваяСтрока,
								  |   вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |ИЗ
								  |	вт_таб2 КАК РеквизитыХарактеристики
								  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
								  |		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = РеквизитыХарактеристики.ИмяРеквизита1С)
								  |			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
								  |				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ ЕСТЬ NULL ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ = Неопределено)
								  |ГДЕ
								  |	НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление";

	Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", СтрокаТаблицы.ХарактеристикаНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначениеКолонки(Выборка, СтрокаТаблицы, РазделительФотографий, ИмяЗаполняемойКолонки);
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Процедура ЗаполнитьЗначениеКолонки(Выборка, СтрокаТаблицы, РазделительФотографий, ИмяЗаполняемойКолонки) Экспорт

	Если ЗначениеЗаполнено(Выборка.ИС_ЯМ_ХарактеристикаКод) Тогда
		ИмяКолонки = "Атрибут_" + СтрЗаменить(Строка(Выборка.ИС_ЯМ_ХарактеристикаКод), Символы.НПП, "");
	Иначе
		ИмяКолонки = Выборка.ХарактеристикаЯМ;
	КонецЕсли;

	Если Не СтрокаТаблицы.Свойство(ИмяКолонки) Или (ЗначениеЗаполнено(ИмяЗаполняемойКолонки) И ИмяКолонки
		<> ИмяЗаполняемойКолонки) Тогда
		Возврат;
	КонецЕсли;
	
	Если Выборка.ВидРеквизита1С = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры") Тогда
		ЗначениеХарактеристикиЯМ = СтрокаТаблицы.Штрихкод;
	ИначеЕсли ЗначениеЗаполнено(Выборка.ТекстоваяСтрока) И Не Выборка.ТребуетсяСопоставление Тогда
		ЗначениеХарактеристикиЯМ = Выборка.ТекстоваяСтрока;
	Иначе
		//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
		//ЗначениеХарактеристикиЯМ = Выборка.ЗначениеХарактеристикиЯМ;
		Если Выборка.Множитель <> 0 Тогда
			ЗначениеХарактеристикиЯМ = Выборка.ЗначениеХарактеристикиЯМ * Выборка.Множитель;
		Иначе
			ЗначениеХарактеристикиЯМ = Выборка.ЗначениеХарактеристикиЯМ;
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	КонецЕсли;
	
	Если ТипЗнч(СтрокаТаблицы[ИмяКолонки]) = Тип("СписокЗначений") Тогда
		Если ТипЗнч(ЗначениеХарактеристикиЯМ) = Тип("Строка") И Выборка.ТребуетсяСопоставление Тогда
			МассивЗначений = ЗначенияХарактеристикЯМИзСтроки(
			ЗначениеХарактеристикиЯМ);
		Иначе
			МассивЗначений = Новый Массив;
			МассивЗначений.Добавить(ЗначениеХарактеристикиЯМ);
		КонецЕсли;
		//КонецЕсли;
		СтрокаТаблицы[ИмяКолонки].ЗагрузитьЗначения(МассивЗначений);
	Иначе
		
		Если ИмяКолонки = "pictures" Тогда
			ЗначениеХарактеристикиЯМ = ИС_Ozon_Сервер.ОбработатьСсылки(ЗначениеХарактеристикиЯМ);
		КонецЕсли;

		Если ТипЗнч(СтрокаТаблицы[ИмяКолонки]) <> ТипЗнч(ЗначениеХарактеристикиЯМ) Тогда

			Если Не ИС_MP_ВыгрузкаКарточек.ЭтоПримитивныйТип(ЗначениеХарактеристикиЯМ) Тогда
				ЗначениеХарактеристикиЯМ = Строка(ЗначениеХарактеристикиЯМ);
			КонецЕсли;
						
			Попытка
				Если ТипЗнч(СтрокаТаблицы[ИмяКолонки]) = Тип("Число") Тогда
					ЗначениеХарактеристикиЯМ = Число(ЗначениеХарактеристикиЯМ);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;

		СтрокаТаблицы[ИмяКолонки] = ЗначениеХарактеристикиЯМ;

	КонецЕсли;	

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 29.05.2024 УА #65724
Процедура ВыгрузитьКарточкиТовара(Профиль, ТелоЗапроса) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	КодБизнеса = СтрЗаменить(Строка(НастройкиСоединения["ЯМКодБизнеса"]), Символы.НПП, "");
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(ТелоЗапроса, 500);
	Ошибка = Ложь;
	
	Для Каждого Элемент Из РазбитыйМассив Цикл
				
		//+ ИнфоСофт Стояк Ю.К. 11.06.2024 УА #69782
		//Результат = ИС_ЯМ_API.ВыгрузитьЦеныNEW((Профиль, ПараметрыЗапроса, КодБизнеса, Элемент);
		Результат = ИС_ЯМ_API.ВыгрузитьКарточкиТовара(Профиль, ПараметрыЗапроса, КодБизнеса, Элемент);
		//- ИнфоСофт Стояк Ю.К. 11.06.2024 УА #69782
		
		Если ЗначениеЗаполнено(Результат) Тогда	
			ОбщегоНазначения.СообщитьПользователю("Выгрузка прошла со следующим статусом:" + Результат.status);	
			
			Если Результат.status = "ERROR" Тогда
				
				//+ ИнфоСофт Стояк Ю.К. 11.02.2025 УА #93204
				Для Каждого Товар Из Результат.results Цикл  
				//Для Каждого Товар Из Результат.result Цикл  
				//- ИнфоСофт Стояк Ю.К. 11.02.2025 УА #93204
					
					Для Каждого Ошибка Из Товар.errors Цикл
						ОбщегоНазначения.СообщитьПользователю("По товару с offerId: " + Товар.offerId + "Прооизошла ошибка " + Ошибка);	
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли; 
			
		Иначе			
			ЗаписьЖурналаРегистрации("Не удалось выгрузить карточки товаров!", УровеньЖурналаРегистрации.Ошибка);			
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
		Если Счетчик = 10 Тогда
			ИС_MP_Сервер.Пауза(60);
		КонецЕсли;		
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 29.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #69482
Функция ПолучитьИнформациюОКарточкахПоАртикулу(Профиль, ТелоЗапроса) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения); 
	
	КоличествоЭлементовНаЗапрос = НастройкиСоединения["КоличествоЭлементовНаЗапрос"];
	КоличествоПопытокЗапроса = НастройкиСоединения["КоличествоОшибокЗапросов"];
	
	КоличествоОшибок = 0;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("businessId", СтрЗаменить(Строка(НастройкиСоединения["ЯМКодБизнеса"]), Символы.НПП, ""));
		
	Пока Истина Цикл
		
		Если КоличествоОшибок > КоличествоПопытокЗапроса Тогда
			ОбщегоНазначения.СообщитьПользователю("Превышено количество ошибок запросов");
			Возврат Неопределено;
		КонецЕсли;
		
		Результат = ИС_ЯМ_API.ЗагрузитьКарточкиТоваров(Профиль, ПараметрыЗапроса, СтруктураПараметров, ТелоЗапроса); 
		
		Если Результат = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат Результат;
	КонецЦикла; 
		
КонецФункции //- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #69482

#КонецОбласти

#Область Склады 

//+ ИнфоСофт Ивонин К.А. 02.10.23 УА #64020
Процедура ЗагрузитьСклады(Профиль) Экспорт
		
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
				
	Результат = ИС_ЯМ_API.ЗагрузитьСклады(Профиль, ПараметрыЗапроса, НастройкиСоединения["ЯМКодБизнеса"]);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьИлиОбновитьСклады(Профиль, Результат, НастройкиСоединения["ЯМКампанияID"]);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 02.10.23 УА #64020

//+ ИнфоСофт Стояк Ю.К. 01.11.2023 УА #62748
Функция ПолучитьСкладыFBY(Профиль) Экспорт
		
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
				
	Результат = ИС_ЯМ_API.ПолучитьСкладыFBY(Профиль, ПараметрыЗапроса);
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 01.11.2023 УА #62748

#КонецОбласти

#Область ЦеныИОстатки 

//+ ИнфоСофт Стояк Ю.К. 06.02.2023 УА #54628
Функция ПолучитьСписокЦен(Профиль) Экспорт
			
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("businessId", СтрЗаменить(Строка(НастройкиСоединения["ЯМКодБизнеса"]), Символы.НПП, ""));
		
	ТаблицаЦен = Новый ТаблицаЗначений;   
	
	//+ ИнфоСофт Стояк Ю.К. 11.08.2023 УА #61971	
	МассивSKU = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.shopSku КАК shopSku
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|ГДЕ
	|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
	|	И НЕ ИС_ЯМ_Номенклатура.shopSku ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивSKU.Добавить(Строка(ВыборкаДетальныеЗаписи.shopSku));
	КонецЦикла;  
	//- ИнфоСофт Стояк Ю.К. 11.08.2023 УА #61971
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(20, 2, ДопустимыйЗнак.Неотрицательный);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(80);
	
	//ТаблицаЦен.Колонки.Добавить("id", Новый ОписаниеТипов("Строка",КвалификаторыСтроки));
	ТаблицаЦен.Колонки.Добавить("shopSku", Новый ОписаниеТипов("Строка",КвалификаторыСтроки));
	ТаблицаЦен.Колонки.Добавить("discountBase", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	ТаблицаЦен.Колонки.Добавить("value", Новый ОписаниеТипов("Число", КвалификаторыЧисла)); 
			
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивSKU, 200); 
	
	Для Каждого Элемент Из РазбитыйМассив Цикл 
		
		ТелоЗапроса = Новый Структура;
		ТелоЗапроса.Вставить("offerIds", Элемент);
	
		Результат = ИС_ЯМ_API.ЗагрузитьКарточкиТоваров(Профиль, ПараметрыЗапроса, СтруктураПараметров, ТелоЗапроса); 
		
		Если Результат = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Элемент Из Результат.offerMappings Цикл	
			
			Если Элемент.Свойство("offer") Тогда 
				Оффер = Элемент.offer;
			Иначе
				Продолжить;
			КонецЕсли; 
			
			Если Оффер.Свойство("basicPrice") Тогда 
				Цены = Оффер.basicPrice;
			Иначе
				Продолжить;
			КонецЕсли; 
			
			НоваяСтрока = ТаблицаЦен.Добавить();
			НоваяСтрока.shopSku = Оффер.offerId; 
			
			Если Цены.Свойство("discountBase") Тогда 
				НоваяСтрока.discountBase = Цены.discountBase;
			КонецЕсли;  
			
			Если Цены.Свойство("value") Тогда 
				НоваяСтрока.value = Цены.value;
			КонецЕсли;			
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаЦен;
	
КонецФункции //+ ИнфоСофт Стояк Ю.К. 06.02.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 02.07.2023 УА #59330
Функция ПолучитьОстатки(Профиль, КампанияID = Неопределено) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	МассивSKU = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.shopSku КАК shopSku
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|ГДЕ
	|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
	|	И НЕ ИС_ЯМ_Номенклатура.shopSku ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивSKU.Добавить(Строка(ВыборкаДетальныеЗаписи.shopSku));
	КонецЦикла;
	
	Если КампанияID = Неопределено Тогда
		КампанияID = Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=0");
	КонецЕсли;
	
	ТаблицаОстатков = Новый ТаблицаЗначений;  
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(20, 2, ДопустимыйЗнак.Неотрицательный);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(80);
	
	//+ ИнфоСофт Стояк Ю.К. 11.08.2023 УА #61971		
	ТаблицаОстатков.Колонки.Добавить("Склад", Новый ОписаниеТипов("Строка",КвалификаторыСтроки));
	ТаблицаОстатков.Колонки.Добавить("shopSku", Новый ОписаниеТипов("Строка",КвалификаторыСтроки));
	//- ИнфоСофт Стояк Ю.К. 11.08.2023 УА #61971
	ТаблицаОстатков.Колонки.Добавить("stock", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	ТаблицаОстатков.Колонки.Добавить("id", Новый ОписаниеТипов("Число", КвалификаторыЧисла));	
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивSKU, 500);	
	
	//+ ИнфоСофт Заварин К.В. 02.10.24 УА #79966
	Счетчик = 0;
	//- ИнфоСофт Заварин К.В. 02.10.24 УА #79966
	
	Для Каждого Элемент Из РазбитыйМассив Цикл	
		
		Результат = ИС_ЯМ_API.ПолучитьОстатки(Профиль, ПараметрыЗапроса, КампанияID, Элемент);
		
		Если ЗначениеЗаполнено(Результат) Тогда	
			
			Для Каждого Элемент Из Результат Цикл
				
				Если Не Элемент.Свойство("warehouses") Тогда
					Продолжить;
				КонецЕсли;
				
				Для Каждого Склад Из Элемент.warehouses Цикл 
					
					НоваяСтрока = ТаблицаОстатков.Добавить();
					НоваяСтрока.shopSku = Элемент.shopSku;
				   	НоваяСтрока.Склад = Склад.name; 
					НоваяСтрока.id = Склад.id;
					
					Для Каждого Остаток Из Склад.stocks Цикл 
						Если Остаток.type = "AVAILABLE" Тогда
							НоваяСтрока.stock = Остаток.count;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;  
				
			КонецЦикла;
			
		КонецЕсли; 
		
		//+ ИнфоСофт Заварин К.В. 02.10.24 УА #79966
		//+ ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78595
		//Если РазбитыйМассив.Количество() > 1 Тогда
		//	ИС_MP_Сервер.Пауза(60);
		//КонецЕсли;
		//- ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78595
		Счетчик = Счетчик + 1;
		
		Если Счетчик = 10 Тогда
			Счетчик = 0;
			ИС_MP_Сервер.Пауза(60);
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 02.10.24 УА #79966
						
	КонецЦикла; 
		
	Возврат ТаблицаОстатков;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 02.07.2023 УА #59330

//+ ИнфоСофт Ивонин К.А. 04.03.24 УА #66733
Функция ПолучитьТекстЗапросаОстатков() Экспорт
	
	Текст =
	"ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.Ссылка КАК ПолеСопоставления,
	|	ИС_ЯМ_Номенклатура.shopSku КАК shopSku,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.Упаковка, &ПустаяУпаковка) КАК Упаковка,
	|	ИС_MP_ОграничениеОстатков.Остаток КАК СкрываемыйОстаток,
	|	НЕ ИС_MP_ОграничениеОстатков.Остаток ЕСТЬ NULL КАК ЕстьСкрываемыйОстаток,
	|	ИС_MP_РучныеОстатки.Остаток КАК РучнойОстаток,
	|	НЕ ИС_ЯМ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL КАК ЕстьСопоставление,
	|	НЕ ИС_MP_РучныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьРучнойОстаток,
	|	ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
	|	ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Числитель, 1)
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Знаменатель, 1)
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	ЕСТЬNULL(ИС_MP_ПоследниеВыгруженныеОстатки.Остаток, 0) КАК ПоследнийВыгруженныйОстаток,
	|	НЕ ИС_MP_ПоследниеВыгруженныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьПоследнийВыгруженныйОстаток
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ПО ИС_ЯМ_Номенклатура.Ссылка = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ОграничениеОстатков КАК ИС_MP_ОграничениеОстатков
	|		ПО (ИС_MP_ОграничениеОстатков.Профиль = &Профиль)
	|			И (ИС_MP_ОграничениеОстатков.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ОграничениеОстатков.Склад КАК Справочник.ИС_ЯМ_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ОграничениеОстатков.КарточкаМП КАК Справочник.ИС_ЯМ_Номенклатура)) = ИС_ЯМ_Номенклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_РучныеОстатки КАК ИС_MP_РучныеОстатки
	|		ПО (ИС_MP_РучныеОстатки.Профиль = &Профиль)
	|			И (ИС_MP_РучныеОстатки.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_РучныеОстатки.Склад КАК Справочник.ИС_ЯМ_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_РучныеОстатки.КарточкаМП КАК Справочник.ИС_ЯМ_Номенклатура)) = ИС_ЯМ_Номенклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ПоследниеВыгруженныеОстатки КАК ИС_MP_ПоследниеВыгруженныеОстатки
	|		ПО (ИС_MP_ПоследниеВыгруженныеОстатки.Профиль = &Профиль)
	|			И (ИС_MP_ПоследниеВыгруженныеОстатки.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ПоследниеВыгруженныеОстатки.Склад КАК Справочник.ИС_ЯМ_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ПоследниеВыгруженныеОстатки.КарточкаМП КАК Справочник.ИС_ЯМ_Номенклатура)) = ИС_ЯМ_Номенклатура.Ссылка)
	|ГДЕ
	|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
	|	И НЕ ИС_ЯМ_Номенклатура.ПометкаУдаления";
	
	Текст = Текст + ";";
		
	Текст = Текст + ИС_МП_УправлениеОстатками.ТекстЗапросаОстатков();
	
	Текст = Текст +
	"ВЫБРАТЬ
	|	ВТ_Сопоставление.ПолеСопоставления КАК НоменклатураЯМ,
	|	ВТ_Сопоставление.shopSku КАК shopSku,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка,
	|	ВТ_Остатки.Свободно КАК Свободно,
	|	ВТ_Остатки.Резерв КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВТ_Сопоставление.СкрываемыйОстаток ЕСТЬ NULL
	|			ТОГДА &КоличествоСкрываемогоОстатка
	|		ИНАЧЕ ВТ_Сопоставление.СкрываемыйОстаток
	|	КОНЕЦ КАК СкрываемыйОстаток,
	|	ВТ_Сопоставление.ЕстьСкрываемыйОстаток КАК ЕстьСкрываемыйОстаток,
	|	ВТ_Сопоставление.РучнойОстаток КАК РучнойОстаток,
	|	ВТ_Сопоставление.ЕстьСопоставление КАК ЕстьСопоставление,
	|	ВТ_Сопоставление.ЕстьРучнойОстаток КАК ЕстьРучнойОстаток,
	|	МАКСИМУМ(ИС_ЯМ_Штрихкоды.Наименование) КАК Штрихкод,
	|	ВТ_Сопоставление.ПоследнийВыгруженныйОстаток КАК ПоследнийВыгруженныйОстаток,
	|	ВТ_Сопоставление.ЕстьПоследнийВыгруженныйОстаток КАК ЕстьПоследнийВыгруженныйОстаток
	|ИЗ
	|	ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_Остатки.ПолеСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Штрихкоды КАК ИС_ЯМ_Штрихкоды
	|		ПО (ИС_ЯМ_Штрихкоды.Профиль = &Профиль)
	|			И ВТ_Сопоставление.ПолеСопоставления = ИС_ЯМ_Штрихкоды.Владелец
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сопоставление.ПолеСопоставления,
	|	ВТ_Сопоставление.shopSku,
	|	ВТ_Сопоставление.Номенклатура,
	|	ВТ_Сопоставление.ЕстьСопоставление,
	|	ВТ_Сопоставление.Характеристика,
	|	ВТ_Сопоставление.Упаковка,
	|	ВТ_Сопоставление.ЕстьРучнойОстаток,
	|	ВТ_Сопоставление.РучнойОстаток,
	|	ВЫБОР
	|		КОГДА ВТ_Сопоставление.СкрываемыйОстаток ЕСТЬ NULL
	|			ТОГДА &КоличествоСкрываемогоОстатка
	|		ИНАЧЕ ВТ_Сопоставление.СкрываемыйОстаток
	|	КОНЕЦ,
	|	ВТ_Сопоставление.ЕстьСкрываемыйОстаток,
	|	ВТ_Остатки.Свободно,
	|	ВТ_Остатки.Резерв,
	|	ВТ_Сопоставление.ПоследнийВыгруженныйОстаток,
	|	ВТ_Сопоставление.ЕстьПоследнийВыгруженныйОстаток
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Сопоставление.ЕстьСопоставление УБЫВ";
	
	Возврат Текст;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 04.03.24 УА #66733

//+ ИнфоСофт Ивонин К.А. 04.03.24 УА #66733                                                                                  
Процедура УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад) Экспорт
	
	Событие = ПолучитьИмяСобытия("УстановитьПараметрыЗапросаОстатков");
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "Организация");
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ЯМ; 
	
	МассивПараметров = ИС_МП_УправлениеОстатками.МассивНастроекОстатков(ПеречислениеМП);
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивПараметров); 
	
	РассчитыватьНесобранныеКомплекты = Ложь;
	ВыгружатьОстаткиВРазрезеОрганизации = Ложь;
	СкрываемыйОстаток = 0;

	Если Настройки.РассчитыватьНесобранныеКомплекты <> Неопределено Тогда
		РассчитыватьНесобранныеКомплекты = Настройки.РассчитыватьНесобранныеКомплекты;	
	КонецЕсли; 

	Если Настройки.ВыгружатьОстаткиВРазрезеОрганизации <> Неопределено Тогда
		ВыгружатьОстаткиВРазрезеОрганизации = Настройки.ВыгружатьОстаткиВРазрезеОрганизации;	
	КонецЕсли;

	Если Настройки.СкрываемыйОстаток <> Неопределено Тогда
		СкрываемыйОстаток = Настройки.СкрываемыйОстаток;	
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Маркетплейс", ПеречислениеМП);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("КоличествоСкрываемогоОстатка", СкрываемыйОстаток);
	Запрос.УстановитьПараметр("РассчитыватьНесобранныеКомплекты", РассчитыватьНесобранныеКомплекты);
	Запрос.УстановитьПараметр("ВыгружатьОстаткиВРазрезеОрганизации", ВыгружатьОстаткиВРазрезеОрганизации);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПустаяУпаковка", ИС_МП_СерверЛокализация.ПустаяСсылкаУпаковка());
	
	СГТ = Ложь;
	Заменитель = "ИЕРАРХИИ";
	ПараметрСклад = Неопределено;
	
	ЗапросНазначений = Новый Запрос;
	ЗапросНазначений.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
	|ИЗ
	|	Справочник.ИС_ЯМ_Склады.НаправленияДеятельности КАК ИС_ЯМ_СкладыНаправленияДеятельности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ИС_ЯМ_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности
	|			И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|ГДЕ
	|	ИС_ЯМ_СкладыНаправленияДеятельности.Ссылка = &Ссылка";
	
	ЗапросНазначений.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
	
	Назначения = Новый Массив;
	
	ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
	
	Пока ВыборкаНазначения.Следующий() Цикл	
		Назначения.Добавить(ВыборкаНазначения.Назначение);
	КонецЦикла;
	
	Если Назначения.Количество() = 0 Тогда		
		Назначения = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;

	Запрос.УстановитьПараметр("Назначение", Назначения);
	
	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Склады.Ссылка КАК Ссылка,
	|	ИС_ЯМ_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_ЯМ_Склады.Склад КАК Склад,
	|	ИС_ЯМ_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_ЯМ_СкладыГруппаСкладов.Склад КАК СкладГруппы
	|ИЗ
	|	Справочник.ИС_ЯМ_Склады КАК ИС_ЯМ_Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Склады.ГруппаСкладов КАК ИС_ЯМ_СкладыГруппаСкладов
	|		ПО ИС_ЯМ_Склады.Ссылка = ИС_ЯМ_СкладыГруппаСкладов.Ссылка
	|ГДЕ
	|	ИС_ЯМ_Склады.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка";

	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСклад.Следующий() Цикл
			
        //СГТ = ВыборкаСклад.СГТ;			
				
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
		    
		    ПараметрСклад = Новый Массив;
		    
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
		
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
			
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда
			    	ПараметрСклад.Добавить(ВыборкаГруппаСкладов.СкладГруппы);
			    КонецЕсли;
			    
			КонецЦикла;				
		
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			Заменитель = "";
			ПараметрСклад = ВыборкаСклад.ОбщаяГруппаСкладов;
		Иначе
			ПараметрСклад = ВыборкаСклад.Склад;
		КонецЕсли;
	
	КонецЦикла;
	
	//Запрос.УстановитьПараметр("СГТ", СГТ); 
	Если ЗначениеЗаполнено(Заменитель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, Заменитель, ""); 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрСклад) Тогда
		Текст = СтрШаблон("Не заполнено сопоставление склада %1 (%2)", Склад, Профиль);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст); 
	КонецЕсли;
	 
	Запрос.УстановитьПараметр("Склад1С", ПараметрСклад);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.03.24 УА #66733

//+ ИнфоСофт Ивонин К.А. 08.03.24 УА #66733
Процедура ВыгрузитьОстатки(Профиль, Склад, ТаблицаВыгрузки = Неопределено) Экспорт  
	
	Событие = ПолучитьИмяСобытия("ВыгрузитьОстатки");

	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ЯМ;
	
	МассивНастроек = ИС_МП_УправлениеОстатками.МассивПараметровВыгрузкиОстатков();	
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивНастроек);
		
	ИспользоватьПоследниеОстатки = Ложь;
	
	Если Настройки.ИспользоватьПоследниеОстатки <> Неопределено Тогда
		ИспользоватьПоследниеОстатки = Настройки.ИспользоватьПоследниеОстатки;
	КонецЕсли;
		
	Если ТаблицаВыгрузки = Неопределено Тогда		
		ТаблицаВыгрузки = ИС_МП_УправлениеОстатками.СформироватьТаблицуВыгрузки(Профиль, Склад, ПеречислениеМП, Настройки);		
	КонецЕсли;  
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	skus = Новый Массив;
	Дата = ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата); 
	
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #88575	
	//КампанияID = Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=");
	Если Склад.ИДМагазинаОсновногоСкладаГруппы = 0 Тогда
		КампанияID = Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=");
		ИДСклада = Склад.id;
	Иначе
		КампанияID = Формат(Склад.ИДМагазинаОсновногоСкладаГруппы, "ЧГ=");
		ИДСклада = Склад.ИДОсновногоСкладаГруппы;
	КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #88575

	Для Каждого Строка Из ТаблицаВыгрузки Цикл
		
		stock = Новый Структура;
		items = Новый Массив;
		item = Новый Структура;
		
		stock.Вставить("sku", Строка.shopSku);
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #88575		
		//stock.Вставить("warehouseId", Склад.id);	
		stock.Вставить("warehouseId", ИДСклада);	
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #88575
		
		item.Вставить("type", "FIT");
		item.Вставить("count", Строка.Остаток);
		item.Вставить("updatedAt", Дата);
		
		items.Добавить(item);
		
		stock.Вставить("items", items);
		
		skus.Добавить(stock);
				
	КонецЦикла; 
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(skus, 500);
	
	БылиОшибкиВыгрузки = Ложь;
	
	Для Каждого Элемент Из РазбитыйМассив Цикл	
		
		Результат = ИС_ЯМ_API.ВыгрузитьОстатки(Профиль, ПараметрыЗапроса, КампанияID, Элемент);
		
		Если Результат = Неопределено Тогда
			БылиОшибкиВыгрузки = Истина;
			Продолжить;
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю("Выгрузка завершилась со следующим статусом: " + Результат);	
		
	КонецЦикла;
	
	Если Не ИспользоватьПоследниеОстатки Тогда
		Возврат;
	КонецЕсли;
	
	Если Не БылиОшибкиВыгрузки Тогда
	
		Для Каждого Строка Из ТаблицаВыгрузки Цикл
			ИС_МП_УправлениеОстатками.ЗаписатьПоследнийВыгруженныйОстаток(Профиль, 
				Перечисления.ИС_МП_Маркетплейсы.ЯМ, Склад, Строка.НоменклатураЯМ, Строка.Остаток);
		КонецЦикла;
	
	КонецЕсли; 
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.03.24 УА #66733 

//+ ИнфоСофт Мурсалимов Д.Р. 13.05.24 УА #66901
Процедура ВыгрузитьЦены(Профиль, ТаблицаВыгрузки = Неопределено) Экспорт

	Событие = ПолучитьИмяСобытия("ВыгрузитьЦены");
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	МассивПараметров = ПолучитьСписокПараметровЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, МассивПараметров);
	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
	
	РежимОкругленияЦен = СтруктураЦен.РежимОкругленияЦен;
	ИспользоватьПоследниеЦены = СтруктураЦен.ИспользоватьПоследниеЦены;
	ИспользоватьНовыеМетодыApi = СтруктураЦен.ИспользоватьНовыеМетодыApi;
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ЯМ;
	
	Если ТаблицаВыгрузки = Неопределено Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = ПолучитьТекстЗапросаЦен(); 
		
		УстановитьПараметрыЗапросаЦен(Запрос, Профиль);                                                       
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		ТаблицаВыгрузки = Новый ТаблицаЗначений;	
		
		ИС_МП_УправлениеЦенами.ЗаполнитьКолонкиТаблицыВыгрузкиЦен(ПеречислениеМП, ТаблицаВыгрузки);
		
		МассивПолей = ИС_МП_УправлениеЦенами.ПолучитьПоляДляВыгрузки(ПеречислениеМП);
		
		Пока Выборка.Следующий() Цикл
		
			Если Не Выборка.ЕстьСопоставление И Не Выборка.ЕстьРучнаяЦена И Не Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
				Продолжить;
			КонецЕсли;  
			
			Если Не ЗначениеЗаполнено(Выборка.shopSku) Тогда
				Продолжить;
			КонецЕсли;
						
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
		
			Для Каждого Элемент Из МассивПолей Цикл
				НоваяСтрока[Элемент] = Выборка[Элемент];
			КонецЦикла;
			
			ЭтоНабор = Выборка.ЭтоНабор;
			
			Если Выборка.ЕстьРучнаяЦена Тогда
				Цена = Выборка.РучнаяЦена;
			Иначе  
				Цена = Выборка.Цена;
			КонецЕсли;
			
			Цена = Окр(Цена, 0, РежимОкругленияЦен);
			
			НоваяСтрока.Цена = Цена;
			
			Если Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
				ЦенаСоСкидкой = Выборка.РучнаяЦенаСоСкидкой;
			Иначе
				ЦенаСоСкидкой = Выборка.ЦенаСоСкидкой;	
			КонецЕсли;
			
			ЦенаСоСкидкой = Окр(ЦенаСоСкидкой, 0, РежимОкругленияЦен);
			
			НоваяСтрока.ЦенаСоСкидкой = ЦенаСоСкидкой;
			
			Если НоваяСтрока.Цена = 0 И НоваяСтрока.ЦенаСоСкидкой = 0 Тогда 
				ТаблицаВыгрузки.Удалить(НоваяСтрока);
			КонецЕсли;
			
			Если Не ИспользоватьПоследниеЦены Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не Выборка.ЕстьРучнаяЦена И Не Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
			
				Если Не ИС_МП_УправлениеЦенами.ПроверитьПоследниеЦены(ПеречислениеМП, Выборка, НоваяСтрока) Тогда
					ТаблицаВыгрузки.Удалить(НоваяСтрока);
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Отсутствуют данные для выгрузки!");
		Возврат;
	КонецЕсли;  	
	
	offers = Новый Массив;	
	
	КодБизнеса = СтрЗаменить(Строка(НастройкиСоединения["ЯМКодБизнеса"]), Символы.НПП, "");
	КампанияID = Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=");
	
	Для Каждого Строка Из ТаблицаВыгрузки Цикл
		
		offer = Новый Структура; 
		
		price = Новый Структура;  
		
		offer.Вставить("offerId", 			Строка.shopSku);		
		
		price.Вставить("currencyId", 		"RUR");  
		
		Если ЗначениеЗаполнено(Строка.Цена) И Строка.Цена > 0 Тогда
			price.Вставить("discountBase", 	Строка.Цена); 
		КонецЕсли;
			
		price.Вставить("value", 			Строка.ЦенаСоСкидкой);
		
		offer.Вставить("price", 			price);
		
		offers.Добавить(offer);
		
	КонецЦикла; 
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(offers, 500);
	
	БылиОшибкиВыгрузки = Ложь;
	//+ ИнфоСофт Стояк Ю.К. 11.06.2024 УА #69782
	Счетчик = 0;
	//- ИнфоСофт Стояк Ю.К. 11.06.2024 УА #69782
	
	Если ИспользоватьНовыеМетодыApi Тогда 
					
		Для Каждого Элемент Из РазбитыйМассив Цикл	
			
			Результат = ИС_ЯМ_API.ВыгрузитьЦеныNEW(Профиль, ПараметрыЗапроса, КодБизнеса, Элемент);
			
			Если Результат = Неопределено Тогда
				БылиОшибкиВыгрузки = Истина;
				Продолжить;
			КонецЕсли;
			
			ОбщегоНазначения.СообщитьПользователю("Выгрузка прошла со следующим статусом:" + Результат);
			
			//+ ИнфоСофт Стояк Ю.К. 11.06.2024 УА #69782		
			Счетчик = Счетчик + 1;
			
			Если Счетчик = 10 Тогда
				Счетчик = 0;
				ИС_MP_Сервер.Пауза(60);
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 11.06.2024 УА #69782
			
		КонецЦикла; 		
		
	Иначе
		
		Для Каждого Элемент Из РазбитыйМассив Цикл	
			
			Результат = ИС_ЯМ_API.ВыгрузитьЦены(Профиль, ПараметрыЗапроса, КампанияID, Элемент);
			
			Если Результат = Неопределено Тогда
				БылиОшибкиВыгрузки = Истина;
				Продолжить;
			КонецЕсли;
			
			ОбщегоНазначения.СообщитьПользователю("Выгрузка прошла со следующим статусом:" + Результат);		
			
			//+ ИнфоСофт Стояк Ю.К. 11.06.2024 УА #69782		
			Счетчик = Счетчик + 1;
			
			Если Счетчик = 10 Тогда
				Счетчик = 0;
				ИС_MP_Сервер.Пауза(60);
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 11.06.2024 УА #69782
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не БылиОшибкиВыгрузки И ИспользоватьПоследниеЦены Тогда
		
		Для Каждого Строка Из ТаблицаВыгрузки Цикл	
			
			ИС_МП_УправлениеЦенами.ЗаписатьПоследнююВыгруженнуюЦену(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы.ЯМ, Строка.НоменклатураЯМ, Строка.Цена, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦены);
			
			ИС_МП_УправлениеЦенами.ЗаписатьПоследнююВыгруженнуюЦену(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы.ЯМ, Строка.НоменклатураЯМ, Строка.ЦенаСоСкидкой, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой);
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 13.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901
Функция ПолучитьТекстЗапросаЦен() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.Ссылка КАК ПолеСопоставления,
	|	ИС_МП_РучныеЦены.Цена КАК Цена,
	|	NULL КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_РучныеЦеныОбъединение
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_РучныеЦены КАК ИС_МП_РучныеЦены
	|		ПО (ИС_МП_РучныеЦены.Профиль = &Профиль)
	|			И (ИС_МП_РучныеЦены.Маркетплейс = &Маркетплейс)
	|			И (ИС_ЯМ_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_РучныеЦены.КарточкаМП КАК Справочник.ИС_ЯМ_Номенклатура)))
	|			И (ИС_МП_РучныеЦены.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦены))
	|ГДЕ
	|	ИС_МП_РучныеЦены.Профиль = &Профиль
	|	И ИС_МП_РучныеЦены.Маркетплейс = &Маркетплейс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.Ссылка,
	|	NULL,
	|	ИС_МП_РучныеЦеныСоСкидкой.Цена
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_РучныеЦены КАК ИС_МП_РучныеЦеныСоСкидкой
	|		ПО (ИС_МП_РучныеЦеныСоСкидкой.Профиль = &Профиль)
	|			И (ИС_МП_РучныеЦеныСоСкидкой.Маркетплейс = &Маркетплейс)
	|			И (ИС_ЯМ_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_РучныеЦеныСоСкидкой.КарточкаМП КАК Справочник.ИС_ЯМ_Номенклатура)))
	|			И (ИС_МП_РучныеЦеныСоСкидкой.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой))
	|ГДЕ
	|	ИС_МП_РучныеЦеныСоСкидкой.Профиль = &Профиль
	|	И ИС_МП_РучныеЦеныСоСкидкой.Маркетплейс = &Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.Ссылка КАК ПолеСопоставления,
	|	ИС_МП_ПоследниеЦены.Цена КАК Цена,
	|	NULL КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_ПоследниеЦеныОбъединение
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_ПоследниеВыгруженныеЦены КАК ИС_МП_ПоследниеЦены
	|		ПО (ИС_МП_ПоследниеЦены.Профиль = &Профиль)
	|			И (ИС_МП_ПоследниеЦены.Маркетплейс = &Маркетплейс)
	|			И (ИС_ЯМ_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_ПоследниеЦены.КарточкаМП КАК Справочник.ИС_ЯМ_Номенклатура)))
	|			И (ИС_МП_ПоследниеЦены.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦены))
	|ГДЕ
	|	ИС_МП_ПоследниеЦены.Профиль = &Профиль
	|	И ИС_МП_ПоследниеЦены.Маркетплейс = &Маркетплейс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.Ссылка,
	|	NULL,
	|	ИС_МП_ПоследниеЦеныСоСкидкой.Цена
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_ПоследниеВыгруженныеЦены КАК ИС_МП_ПоследниеЦеныСоСкидкой
	|		ПО (ИС_МП_ПоследниеЦеныСоСкидкой.Профиль = &Профиль)
	|			И (ИС_МП_ПоследниеЦеныСоСкидкой.Маркетплейс = &Маркетплейс)
	|			И (ИС_ЯМ_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_ПоследниеЦеныСоСкидкой.КарточкаМП КАК Справочник.ИС_ЯМ_Номенклатура)))
	|			И (ИС_МП_ПоследниеЦеныСоСкидкой.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой))
	|ГДЕ
	|	ИС_МП_ПоследниеЦеныСоСкидкой.Профиль = &Профиль
	|	И ИС_МП_ПоследниеЦеныСоСкидкой.Маркетплейс = &Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РучныеЦеныОбъединение.ПолеСопоставления КАК ПолеСопоставления,
	|	СУММА(ВТ_РучныеЦеныОбъединение.Цена) КАК Цена,
	|	СУММА(ВТ_РучныеЦеныОбъединение.ЦенаСоСкидкой) КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_РучныеЦены
	|ИЗ
	|	ВТ_РучныеЦеныОбъединение КАК ВТ_РучныеЦеныОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РучныеЦеныОбъединение.ПолеСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеЦеныОбъединение.ПолеСопоставления КАК ПолеСопоставления,
	|	СУММА(ВТ_ПоследниеЦеныОбъединение.Цена) КАК Цена,
	|	СУММА(ВТ_ПоследниеЦеныОбъединение.ЦенаСоСкидкой) КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_ПоследниеЦены
	|ИЗ
	|	ВТ_ПоследниеЦеныОбъединение КАК ВТ_ПоследниеЦеныОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоследниеЦеныОбъединение.ПолеСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.Ссылка КАК ПолеСопоставления,
	|	ИС_ЯМ_Номенклатура.shopSku КАК shopSku,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)) КАК ХарактеристикаЦО,
	|	ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
	|	ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.Упаковка, &ПустаяУпаковка) КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Числитель, 1)
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Знаменатель, 1)
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	НЕ ИС_ЯМ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL КАК ЕстьСопоставление,
	|	ВТ_РучныеЦены.Цена КАК РучнаяЦена,
	|	НЕ ВТ_РучныеЦены.Цена ЕСТЬ NULL КАК ЕстьРучнаяЦена,
	|	ВТ_РучныеЦены.ЦенаСоСкидкой КАК РучнаяЦенаСоСкидкой,
	|	НЕ ВТ_РучныеЦены.ЦенаСоСкидкой ЕСТЬ NULL КАК ЕстьРучнаяЦенаСоСкидкой,
	|	ЕСТЬNULL(ВТ_ПоследниеЦены.Цена, 0) КАК ПоследняяВыгруженнаяЦена,
	|	НЕ ВТ_ПоследниеЦены.Цена ЕСТЬ NULL КАК ЕстьПоследняяВыгруженнаяЦена,
	|	ЕСТЬNULL(ВТ_ПоследниеЦены.ЦенаСоСкидкой, 0) КАК ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	НЕ ВТ_ПоследниеЦены.ЦенаСоСкидкой ЕСТЬ NULL КАК ЕстьПоследняяВыгруженнаяЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ПО ИС_ЯМ_Номенклатура.Ссылка = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РучныеЦены КАК ВТ_РучныеЦены
	|		ПО (ВТ_РучныеЦены.ПолеСопоставления = ИС_ЯМ_Номенклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследниеЦены КАК ВТ_ПоследниеЦены
	|		ПО (ВТ_ПоследниеЦены.ПолеСопоставления = ИС_ЯМ_Номенклатура.Ссылка)
	|ГДЕ
	|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
	|	И НЕ ИС_ЯМ_Номенклатура.ПометкаУдаления";	
	
	Текст = Текст + ";";
	
	Текст = Текст + ИС_МП_УправлениеЦенами.ТекстЗапросаЦен();
	
	Текст = Текст +	
	
	"ВЫБРАТЬ
	|	ВТ_Сопоставление.ПолеСопоставления КАК НоменклатураЯМ,
	|	ВТ_Сопоставление.shopSku КАК shopSku,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка, 
	|	ВТ_Сопоставление.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Сопоставление.РучнаяЦена КАК РучнаяЦена,
	|	ВТ_Сопоставление.РучнаяЦенаСоСкидкой КАК РучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьРучнаяЦена КАК ЕстьРучнаяЦена,
	|	ВТ_Сопоставление.ЕстьРучнаяЦенаСоСкидкой КАК ЕстьРучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьСопоставление КАК ЕстьСопоставление,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦена КАК ПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦенаСоСкидкой КАК ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦена КАК ЕстьПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой КАК ЕстьПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Цены.Цена КАК Цена,
	|	ВТ_Цены.ЦенаСоСкидкой КАК ЦенаСоСкидкой,
	|	МАКСИМУМ(ИС_ЯМ_Штрихкоды.Наименование) КАК Штрихкод
	|ИЗ
	|	ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_Цены.ПолеСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Штрихкоды КАК ИС_ЯМ_Штрихкоды
	|		ПО (ИС_ЯМ_Штрихкоды.Профиль = &Профиль)
	|			И ВТ_Сопоставление.ПолеСопоставления = ИС_ЯМ_Штрихкоды.Владелец
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сопоставление.ПолеСопоставления,
	|	ВТ_Сопоставление.shopSku,
	|	ВТ_Сопоставление.Номенклатура,
	|	ВТ_Сопоставление.Характеристика,
	|	ВТ_Сопоставление.Упаковка, 
	|	ВТ_Сопоставление.ЭтоНабор,
	|	ВТ_Сопоставление.ЕстьСопоставление,
	|	ВТ_Сопоставление.РучнаяЦена,
	|	ВТ_Сопоставление.ЕстьРучнаяЦена,
	|	ВТ_Сопоставление.РучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьРучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Цены.Цена,
	|	ВТ_Цены.ЦенаСоСкидкой
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Сопоставление.ЕстьСопоставление УБЫВ,
	|	ВТ_Сопоставление.РучнаяЦена УБЫВ";
	
	Возврат Текст;
		
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
Функция ПолучитьСкладПоУмолчанию(Профиль) Экспорт

	Результат = Справочники.ИС_ЯМ_Склады.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ИС_ЯМ_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_ЯМ_Склады КАК ИС_ЯМ_Склады
	|ГДЕ
	|	НЕ ИС_ЯМ_Склады.ПометкаУдаления
	|	И ИС_ЯМ_Склады.ЛичныйКабинет = &Профиль";

	Запрос.УстановитьПараметр("Профиль", Профиль);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
Функция ПолучитьОстаткиFBS(Профиль, Склад) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	КампанияID = Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=0");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Склады.id КАК id
	|ИЗ
	|	Справочник.ИС_ЯМ_Склады КАК ИС_ЯМ_Склады
	|ГДЕ
	|	ИС_ЯМ_Склады.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать();
	
	ВыборкаСклад.Следующий();
	
	Id = ВыборкаСклад.id;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.Ссылка КАК Ссылка,
	|	ИС_ЯМ_Номенклатура.shopSku КАК shopSku
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|ГДЕ
	|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
	//+ ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91012	
	//|	И НЕ ИС_ЯМ_Номенклатура.vendorCode = """"";
	|	И НЕ ИС_ЯМ_Номенклатура.shopSku = """"";
	//- ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91012
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаOfferIds = РезультатЗапроса.Выбрать();
	
	МассивOfferIds = Новый Массив;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НоменклатураЯМ");
	Результат.Колонки.Добавить("OfferId");
	Результат.Колонки.Добавить("Остаток");
	
	Пока ВыборкаOfferIds.Следующий() Цикл
	
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.НоменклатураЯМ = ВыборкаOfferIds.Ссылка;
		НоваяСтрока.OfferId = ВыборкаOfferIds.shopSku;
		
		МассивOfferIds.Добавить(ВыборкаOfferIds.shopSku);
	
	КонецЦикла;
		
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивOfferIds, 500);
	
	Для Каждого Элемент Из РазбитыйМассив Цикл
		
		СтруктураТела = Новый Структура;
		//"withTurnover": false,
	    //"archived": false,
		СтруктураТела.Вставить("offerIds", Элемент);
			
		ОстаткиТоваров = ИС_ЯМ_API.ПолучитьОстаткиИОборачиваемость(Профиль, ПараметрыЗапроса, КампанияID, СтруктураТела);
		
		Если ОстаткиТоваров = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОстаткиТоваров.status = "ERROR" Тогда 
			Продолжить;
		КонецЕсли;
				
		Для Каждого warehouse Из ОстаткиТоваров.result.warehouses Цикл
		    
		    Если warehouse.warehouseId <> Id Тогда
		    	Продолжить;
		    КонецЕсли;
		    
		    Для Каждого Элемент Из warehouse.offers Цикл

		    	НайденныеСтроки = Результат.НайтиСтроки(Новый Структура("OfferId", Элемент.offerId));
				
				//+ ИнфоСофт Стояк Ю.К. 26.06.2024 УА #78464
				Если НайденныеСтроки.Количество() > 0 Тогда		
				//- ИнфоСофт Стояк Ю.К. 26.06.2024 УА #78464					
					Для Каждого stock Из Элемент.stocks Цикл
				
					Если stock.type = "FIT" Тогда 
						НайденныеСтроки[0].Остаток = stock.count;
						Прервать;	
					КонецЕсли;
		
					КонецЦикла;
				//+ ИнфоСофт Стояк Ю.К. 26.06.2024 УА #78464				
				КонецЕсли;
				//- ИнфоСофт Стояк Ю.К. 26.06.2024 УА #78464;
				
		    КонецЦикла;
		    	
		КонецЦикла;
	
	КонецЦикла;	
                							
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 01.04.24 УА #71892
Функция ПолучитьИнформациюОСкладе(Склад) Экспорт

	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Склады.Ссылка КАК Ссылка,
	|	ИС_ЯМ_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_ЯМ_Склады.Склад КАК Склад,
	|	ИС_ЯМ_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_ЯМ_СкладыГруппаСкладов.Склад КАК СкладГруппы
	|ИЗ
	|	Справочник.ИС_ЯМ_Склады КАК ИС_ЯМ_Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Склады.ГруппаСкладов КАК ИС_ЯМ_СкладыГруппаСкладов
	|		ПО ИС_ЯМ_Склады.Ссылка = ИС_ЯМ_СкладыГруппаСкладов.Ссылка
	|ГДЕ
	|	ИС_ЯМ_Склады.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Результат = "";
		
	Пока ВыборкаСклад.Следующий() Цикл				
				
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
		    
		    Результат = Результат + "Группа складов: " + Символы.ПС;
		    
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
		
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
			
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда
			    	Результат = Результат + Символы.Таб + " - " + ВыборкаГруппаСкладов.СкладГруппы + Символы.ПС;
			    КонецЕсли;
			    
			КонецЦикла;				
		
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			Результат = Результат + "Общая группа складов: " + ВыборкаСклад.ОбщаяГруппаСкладов + Символы.ПС;
		Иначе
			Результат = Результат + "Склад: " + ВыборкаСклад.Склад + Символы.ПС;		
		КонецЕсли;
	
	КонецЦикла;
    
    Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 01.04.24 УА #71892

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
Функция ПолучитьЦеныFBS(Профиль) Экспорт	
	
	//+ ИнфоСофт Мурсалимов Д.Р. 03.07.24 УА #66901
	МассивПараметров = Новый Массив;
	
	МассивПараметров.Добавить("ЯндексИспользоватьНовыеМетодыApi");
	
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивПараметров);
	
	ИспользоватьНовыеМетодыApi = Ложь;
	
	Если Настройки <> Неопределено Тогда		
		
		Если Настройки["ЯндексИспользоватьНовыеМетодыApi"] <> Неопределено Тогда
			ИспользоватьНовыеМетодыApi = Настройки["ЯндексИспользоватьНовыеМетодыApi"];
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИспользоватьНовыеМетодыApi Тогда
		Возврат ПолучитьЦеныFBSNEW(Профиль);
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 03.07.24 УА #66901	
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("businessId", СтрЗаменить(Строка(НастройкиСоединения["ЯМКодБизнеса"]), Символы.НПП, ""));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.Ссылка КАК Ссылка,
	|	ИС_ЯМ_Номенклатура.shopSku КАК shopSku
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|ГДЕ
	|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
	|	И НЕ ИС_ЯМ_Номенклатура.shopSku = """"
	|	И НЕ ИС_ЯМ_Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаOfferIds = РезультатЗапроса.Выбрать();
	
	МассивOfferIds = Новый Массив;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НоменклатураЯМ");
	Результат.Колонки.Добавить("OfferId");
	Результат.Колонки.Добавить("Цена");
	Результат.Колонки.Добавить("ЦенаСоСкидкой");
	
	Пока ВыборкаOfferIds.Следующий() Цикл
	
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.НоменклатураЯМ = ВыборкаOfferIds.Ссылка;
		НоваяСтрока.OfferId = ВыборкаOfferIds.shopSku;
		
		МассивOfferIds.Добавить(ВыборкаOfferIds.shopSku);
	
	КонецЦикла;
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивOfferIds, 200); 
	
	Для Каждого Элемент Из РазбитыйМассив Цикл
		
		СтруктураТела = Новый Структура;
		СтруктураТела.Вставить("offerIds", Элемент);
		
		ЦеныТоваров = ИС_ЯМ_API.ЗагрузитьКарточкиТоваров(Профиль, ПараметрыЗапроса, СтруктураПараметров, СтруктураТела);
		
		Если ЦеныТоваров = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		Для Каждого Элемент Из ЦеныТоваров.offerMappings Цикл	
			
			Если Элемент.Свойство("offer") Тогда 
				Оффер = Элемент.offer;
			Иначе
				Продолжить;
			КонецЕсли; 
			
			Если Оффер.Свойство("basicPrice") Тогда 
				Цены = Оффер.basicPrice;
			Иначе
				Продолжить;
			КонецЕсли;
			
			НайденныеСтроки = Результат.НайтиСтроки(Новый Структура("OfferId", Оффер.offerId));
			
			Если Цены.Свойство("discountBase") Тогда 
				НайденныеСтроки[0].Цена = Цены.discountBase;
			КонецЕсли;  
			
			Если Цены.Свойство("value") Тогда 
				НайденныеСтроки[0].ЦенаСоСкидкой = Цены.value;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 03.02.25 УА #92578
Функция ПолучитьЦеныFBSNEW(Профиль) Экспорт	
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса 	= ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	КоличествоЭлементовНаЗапрос = НастройкиСоединения["КоличествоЭлементовНаЗапрос"];
	КоличествоПопытокЗапроса 	= НастройкиСоединения["КоличествоОшибокЗапросов"];
	
	КодСтраницы 		= "";
	КоличествоОшибок 	= 0;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КампанияID", 	Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=0"));
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.Ссылка КАК Ссылка,
	|	ИС_ЯМ_Номенклатура.shopSku КАК shopSku
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|ГДЕ
	|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
	|	И НЕ ИС_ЯМ_Номенклатура.shopSku = """"
	|	И НЕ ИС_ЯМ_Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
		
	РезультатЗапроса 	= Запрос.Выполнить();
	
	ВыборкаOfferIds 	= РезультатЗапроса.Выбрать();
	
	МассивOfferIds 		= Новый Массив;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НоменклатураЯМ");
	Результат.Колонки.Добавить("OfferId");
	Результат.Колонки.Добавить("Цена");
	Результат.Колонки.Добавить("ЦенаСоСкидкой");
	
	Пока ВыборкаOfferIds.Следующий() Цикл
	
		НоваяСтрока 				= Результат.Добавить();
		
		НоваяСтрока.НоменклатураЯМ 	= ВыборкаOfferIds.Ссылка;
		НоваяСтрока.OfferId 		= ВыборкаOfferIds.shopSku;
		
		МассивOfferIds.Добавить(ВыборкаOfferIds.shopSku);
	
	КонецЦикла;
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивOfferIds, 200); 
	
	Для Каждого Элемент Из РазбитыйМассив Цикл
		
		СтруктураТела = Новый Структура;
		СтруктураТела.Вставить("offerIds", Элемент);
		
		ЦеныТоваров = ИС_ЯМ_API.ПолучитьСписокЦенNEW(Профиль, ПараметрыЗапроса, СтруктураПараметров, СтруктураТела);
		
		Если ЦеныТоваров = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		Для Каждого Элемент Из ЦеныТоваров.offers Цикл	
			
			НайденныеСтроки = Результат.НайтиСтроки(Новый Структура("OfferId", Элемент.OfferId));
			
			Если Элемент.price.Свойство("discountBase") Тогда 
				НайденныеСтроки[0].Цена = Элемент.price.discountBase;
			КонецЕсли;  
			
			Если Элемент.price.Свойство("value") Тогда 
				НайденныеСтроки[0].ЦенаСоСкидкой = Элемент.price.value;
			КонецЕсли;
							
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 03.02.25 УА #92578

//+ ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901
Процедура УстановитьПараметрыЗапросаЦен(Запрос, Профиль) Экспорт
	
	Событие = ПолучитьИмяСобытия("УстановитьПараметрыЗапросаЦен");
		
	МассивПараметров = ПолучитьСписокПараметровЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, МассивПараметров);
	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
		
	Запрос.УстановитьПараметр("Маркетплейс"			, Перечисления.ИС_МП_Маркетплейсы.ЯМ);
	Запрос.УстановитьПараметр("ВидЦены"				, СтруктураЦен.ВидЦены); 
	Запрос.УстановитьПараметр("ВидЦеныСоСкидкой"	, СтруктураЦен.ВидЦеныСоСкидкой);
	Запрос.УстановитьПараметр("ВидЦеныМинимальный"	, Справочники.ВидыЦен.ПустаяСсылка());
	//+ ИнфоСофт Заварин К.В. 03.09.24 УА #72696
	Запрос.УстановитьПараметр("ВидЦеныFBO"			, Справочники.ВидыЦен.ПустаяСсылка());
	//- ИнфоСофт Заварин К.В. 03.09.24 УА #72696
	Запрос.УстановитьПараметр("Профиль"				, Профиль); 
	Запрос.УстановитьПараметр("ПустаяУпаковка"		, ИС_MP_СерверЛокализация.ПустаяСсылкаУпаковка());
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьСписокПараметровЦен() Экспорт

	Результат = Новый Массив;
	
	Результат.Добавить("ВидЦены");
	Результат.Добавить("ВидЦеныСоСкидкой");
	Результат.Добавить("РежимОкругленияЦен");
	Результат.Добавить("ИспользоватьПоследниеЦены");
	Результат.Добавить("ИспользоватьНовыеМетодыApi");

    Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьСтруктуруПараметровЦен() Экспорт

	Результат = Новый Структура;
	
	Результат.Вставить("ВидЦены"					, Справочники.ВидыЦен.ПустаяСсылка());
	Результат.Вставить("ВидЦеныСоСкидкой"			, Справочники.ВидыЦен.ПустаяСсылка());
	Результат.Вставить("РежимОкругленияЦен"			, 0);
	Результат.Вставить("ИспользоватьПоследниеЦены"	, Ложь);
	Результат.Вставить("ИспользоватьНовыеМетодыApi" , Ложь);

    Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

#КонецОбласти

#Область Заказы

//+ ИнфоСофт Стояк Ю.К. 04.04.2023 УА #54628
Функция ПолучитьСписокЗаказов(Профиль, ДатаПоследнегоОтправления) Экспорт
	
	Событие = "ПолучитьСписокЗаказовЯМ";
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнен Профиль. Загрузка товаров невозможна");
		Возврат Неопределено;
	КонецЕсли;
		
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения); 
	
	КодСтраницы = 1;
	КампанияID = Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=0");
	ЕстьСтраницы = Истина; 
	
	МассивЗагруженныхЗаданий = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_ЯМ_Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_ЯМ_Склады КАК ИС_ЯМ_Склады
		|ГДЕ
		|	ИС_ЯМ_Склады.ИспользоватьВЗаказах = ИСТИНА
		|	И ИС_ЯМ_Склады.ЛичныйКабинет = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	 	Склад = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;	
	
	//+ ИнфоСофт Сумин Д.В. 04.09.2023 УА #63046
	ОбрабатываемаяДата = ДатаПоследнегоОтправления;
	//- ИнфоСофт Сумин Д.В. 04.09.2023 УА #6304
	
	Пока ЕстьСтраницы Цикл                  
		//+ ИнфоСофт Сумин Д.В. 04.09.2023 УА #63046
		Результат = ИС_ЯМ_API.ПолучитьСписокЗаказов(Профиль, ПараметрыЗапроса, КампанияID, Строка(КодСтраницы), ОбрабатываемаяДата);
		//Результат = ИС_ЯМ_API.ПолучитьСписокЗаказов(Профиль, ПараметрыЗапроса, КампанияID, Строка(КодСтраницы), ДатаПоследнегоОтправления - (24 * 3600)); 
		//- ИнфоСофт Сумин Д.В. 04.09.2023 УА #6304
		
		Если ЗначениеЗаполнено(Результат) Тогда
			pager = Результат.pager;
			orders = Результат.orders;
			КодСтраницы = КодСтраницы + 1;
			ЕстьСтраницы = ?(КодСтраницы <= pager.pagesCount, Истина, Ложь); 
		Иначе
			Прервать;
		КонецЕсли;
		
		Для Каждого order Из orders Цикл
			
			//+ ИнфоСофт Мурсалимов Д.Р. 28.11.23 УА #65333
			Если order.status <> Перечисления.ИС_ЯМ_СтатусыЗаказов.UNPAID Тогда 
				СсылкаЗадания = СоздатьИлиОбновитьЗаказ(Профиль, order, ДатаПоследнегоОтправления, Склад);	
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 28.11.23 УА #65333				 
			
			Если Не СсылкаЗадания.Пустая() Тогда					
				
				МассивЗагруженныхЗаданий.Добавить(СсылкаЗадания);
				
				//+ ИнфоСофт Стояк Ю.К. 21.04.2025 УА #97604				
				ЗаписатьСтатусЗаказа(Профиль, СсылкаЗадания, order);
				//+ ИнфоСофт Стояк Ю.К. 03.05.2023 УА #58008				
				//МенеджерЗаписи = РегистрыСведений.ИС_ЯМ_СтатусыСборочныхЗаданий.СоздатьМенеджерЗаписи();								
				//МенеджерЗаписи.Профиль = Профиль;
				//МенеджерЗаписи.Заказ = СсылкаЗадания;  
				//
				//Попытка
				//	МенеджерЗаписи.status = Перечисления.ИС_ЯМ_СтатусыЗаказов[order.status];
				//Исключение
				//КонецПопытки;
				//
				//Попытка
				//	МенеджерЗаписи.substatus = Перечисления.ИС_ЯМ_ДетальныеСтатусы[order.substatus]; 
				//Исключение
				//КонецПопытки;
				//
				//Попытка
				//	МенеджерЗаписи.Записать(Истина);	
				//Исключение
				//	Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				//	ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				//КонецПопытки;
				////- ИнфоСофт Стояк Ю.К. 03.05.2023 УА #58008
				//- ИнфоСофт Стояк Ю.К. 21.04.2025 УА #97604
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если МассивЗагруженныхЗаданий.Количество() > 0 Тогда
		ПроверитьФункциональныеОпцииСборочныхЗаданий(Профиль, МассивЗагруженныхЗаданий);	
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.04.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Функция СоздатьИлиОбновитьЗаказ(Профиль, Данные, ДатаПоследнегоОтправления, Склад)

    Событие = "СоздатьИлиОбновитьЗаказ";
	
	НомерЗаказа = Формат(Данные.id, "ЧГ=0"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Заказ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
	|ГДЕ
	|	ИС_ЯМ_Заказ.Профиль = &Профиль
	|	И ИС_ЯМ_Заказ.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", НомерЗаказа);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Заказ = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Заказ = Документы.ИС_ЯМ_Заказ.СоздатьДокумент();
	КонецЕсли;
		
	Заказ.Профиль = Профиль;
	Заказ.Номер = НомерЗаказа;
	
	СтрокаДата = СтрЗаменить(Данные.creationDate, "-",".");
    //+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #78828	
    //НоваяДата = Дата(СтрокаДата);               
	НоваяДата = ИС_MP_Сервер.СтрокаВДату(СтрокаДата);               
	//- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #78828
	
	Заказ.Дата = НоваяДата; 			
	Заказ.Склад = Склад;
	
	//+ ИнфоСофт Власова И.С. 06.02.25 УА #83194
	МассивПараметров = ПолучитьСписокПараметровЗаказов();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, МассивПараметров);
	
	СтруктураЗаказов = ПолучитьСтруктуруПараметровЗаказов();
	
	ЗаполнитьЗначенияСвойств(СтруктураЗаказов, Результат);
	
	МодельРаботы = СтруктураЗаказов.МодельРаботы;
	
	ЭтоDBS = Ложь;
	
	Если МодельРаботы = Перечисления.ИС_МП_МодельРаботы.DBS Тогда
		ЭтоDBS = Истина;
	КонецЕсли;
	
	ЗаполнятьЦеныСУчетомСкидок = СтруктураЗаказов.ЗаполнятьЦеныСУчетомСкидок;
	//- ИнфоСофт Власова И.С. 06.02.25 УА #83194
	
	subsidyTotal = 0;
	
	//+ ИнфоСофт Власова И.С. 06.02.25 УА #83194
	//Если Данные.Свойство("subsidies") И ТипЗнч(Данные.subsidies) = Тип("Массив") Тогда
	Если Данные.Свойство("subsidies") И ТипЗнч(Данные.subsidies) = Тип("Массив") 
		И Не ЗаполнятьЦеныСУчетомСкидок Тогда
	//- ИнфоСофт Власова И.С. 06.02.25 УА #83194
	
		Для Каждого Строка Из Данные.subsidies Цикл
			subsidyTotal = subsidyTotal + Строка.amount;	
		КонецЦикла; 
	
	КонецЕсли;
	
	Заказ.itemsTotal = Данные.itemsTotal + subsidyTotal; 
	Заказ.total = Заказ.itemsTotal + Данные.deliveryTotal;
	
	//+ ИнфоСофт Власова И.С. 06.02.25 УА #83194
	////+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
	//МассивПараметров = ПолучитьСписокПараметровЗаказов();
	//
	//Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, МассивПараметров);
	//
	//СтруктураЗаказов = ПолучитьСтруктуруПараметровЗаказов();
	//
	//ЗаполнитьЗначенияСвойств(СтруктураЗаказов, Результат);
	//
	//МодельРаботы = СтруктураЗаказов.МодельРаботы;
	//
	//ЭтоDBS = Ложь;
	//
	//Если МодельРаботы = Перечисления.ИС_МП_МодельРаботы.DBS Тогда
	//	ЭтоDBS = Истина;
	//КонецЕсли;
	////- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
	//- ИнфоСофт Власова И.С. 06.02.25 УА #83194
	
	//+ ИнфоСофт Мурсалимов Д.Р. 25.12.23 УА #67982
	Если Данные.delivery.Свойство("address") Тогда
		
		Адрес = Данные.delivery.address; 
		
		Если Адрес.Свойство("recipient") Тогда		
			Заказ.recipient = Адрес.recipient;
		//+ ИнфоСофт Стояк Ю.К. 04.04.2025 УА #96991
		ИначеЕсли Данные.Свойство("buyer") И Данные.buyer.Свойство("firstName") Тогда
			//+ ИнфоСофт Стояк Ю.К. 21.04.2025 УА #97604
			//В Апи сказано, что возвращаются все поля, если есть работа с ДБС. Фактически приходит случайный набор.
			//Заказ.recipient = Данные.buyer.lastName + " " + Данные.buyer.firstName + " " + Данные.buyer.middleName;			
			Попытка
				Заказ.recipient = Данные.buyer.lastName + " " + Данные.buyer.firstName + " " + Данные.buyer.middleName;			
			Исключение
				Заказ.recipient = Данные.buyer.firstName;			
			КонецПопытки;
			//- ИнфоСофт Стояк Ю.К. 21.04.2025 УА #97604
		//- ИнфоСофт Стояк Ю.К. 04.04.2025 УА #96991
		КонецЕсли;
		
		Если Адрес.Свойство("phone") Тогда		
			Заказ.phone = Адрес.phone;	
		КонецЕсли;
		
		МассивАдреса = Новый Массив;
		
		Если Адрес.Свойство("country") Тогда	
			МассивАдреса.Добавить(Адрес.country);	
		КонецЕсли;
		
		Если Адрес.Свойство("city") Тогда
			МассивАдреса.Добавить(Адрес.city);	
		КонецЕсли;
		
		Если Адрес.Свойство("street") Тогда	
			МассивАдреса.Добавить(Адрес.street);	
		КонецЕсли;
		
		Если Адрес.Свойство("house") Тогда
			МассивАдреса.Добавить(Адрес.house);
		КонецЕсли;	
		
		Если МассивАдреса.Количество() > 0 Тогда
			Заказ.address = СтрСоединить(МассивАдреса, ", "); 	
		КонецЕсли;						
				
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 25.12.23 УА #67982	
		
	Если Данные.delivery.shipments[0].Свойство("shipmentDate") Тогда
		ДатаОтгрузкиМассив = СтрРазделить(Данные.delivery.shipments[0].shipmentDate, "-");	
		ДатаОтгрузки = Дата(СтрШаблон("%3%2%(1)000000", ДатаОтгрузкиМассив[0], ДатаОтгрузкиМассив[1], ДатаОтгрузкиМассив[2]));
		Заказ.shipmentDate = ДатаОтгрузки;
	КонецЕсли;                                  
    
    Если Данные.Свойство("cancelRequested") И ТипЗнч(Данные.cancelRequested) = Тип("Булево") Тогда
		Заказ.cancelRequested = Данные.cancelRequested;
	КонецЕсли;
		
	Заказ.serviceName = Данные.delivery.serviceName; 
	Заказ.price = Данные.deliveryTotal; 
	Заказ.type = Данные.delivery.type; 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
	Заказ.ЭтоDBS = ЭтоDBS;
	//- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
	
	Заказ.items.Очистить();
	
	items = Данные.items;	
	
	Для Каждого Элемент Из items Цикл	
		
		НоваяСтрока = Заказ.items.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_ЯМ_Номенклатура.Ссылка КАК Ссылка,
		|	ИС_ЯМ_Штрихкоды.Ссылка КАК Штрихкод
		|ИЗ
		|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Штрихкоды КАК ИС_ЯМ_Штрихкоды
		|		ПО (ИС_ЯМ_Штрихкоды.Владелец = ИС_ЯМ_Номенклатура.Ссылка)
		|			И (ИС_ЯМ_Номенклатура.Профиль = &Профиль)
		|ГДЕ
		|	ИС_ЯМ_Номенклатура.shopSku = &shopSku
		|	И ИС_ЯМ_Номенклатура.Профиль = &Профиль";
		
		Запрос.УстановитьПараметр("shopSku", Элемент.offerId);
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока.НоменклатураЯМ = Выборка.Ссылка;
			НоваяСтрока.ШтрихкодЯМ = Выборка.Штрихкод;
		КонецЦикла;

		itemsubsidyTotal = 0;
		
		//+ ИнфоСофт Власова И.С. 06.02.25 УА #83194
		//Если Элемент.Свойство("subsidies") И ТипЗнч(Элемент.subsidies) = Тип("Массив") Тогда
		Если Элемент.Свойство("subsidies") И ТипЗнч(Элемент.subsidies) = Тип("Массив")
			И Не ЗаполнятьЦеныСУчетомСкидок Тогда
		//- ИнфоСофт Власова И.С. 06.02.25 УА #83194
		
			Для Каждого Строка Из Элемент.subsidies Цикл
				itemsubsidyTotal = itemsubsidyTotal + Строка.amount;	
			КонецЦикла; 
		
		КонецЕсли;

		НоваяСтрока.price = Число(Элемент.price) + itemsubsidyTotal;	
		НоваяСтрока.Сумма = НоваяСтрока.price * Элемент.count;		
		НоваяСтрока.count = Элемент.count;
		НоваяСтрока.shipmentDate = ДатаОтгрузки;

	КонецЦикла;  
	
	Попытка	      
		
		Заказ.Записать(РежимЗаписиДокумента.Запись);
		ДатаПоследнегоОтправления = Заказ.Дата;
		
		Возврат Заказ.Ссылка;		
		
	Исключение

		ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Текст = СтрШаблон("Произошла ошибка при записи элемента Заказ ЯМ: %1",	ИнформацияОбОшибке);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);

	КонецПопытки;
	
	Возврат Документы.ИС_ЯМ_Заказ.ПустаяСсылка();
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Сумин Д.В. 12.04.2023 УА #57537
Процедура ОбновитьСтатусыСборочныхЗаданий(Профиль, _30Дней = 2592000) Экспорт
	
	Событие = ПолучитьИмяСобытия("ОбновитьСтатусыСборочныхЗаданий");	
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800	
	//_30Дней = 2592000;                          
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	
	ДатаПоследнегоОтправления = ТекущаяДатаСеанса() - _30Дней;
		
	КодСтраницы = 1;
	КампанияID = Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=0");
	ЕстьСтраницы = Истина; 
	
	МассивЗагруженныхЗаданий = Новый Массив;	
	
	//+ ИнфоСофт Заварин К.В. 13.09.24 УА #83741
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_ЯМ_Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_ЯМ_Склады КАК ИС_ЯМ_Склады
		|ГДЕ
		|	ИС_ЯМ_Склады.ИспользоватьВЗаказах = ИСТИНА
		|	И ИС_ЯМ_Склады.ЛичныйКабинет = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	 	Склад = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	//- ИнфоСофт Заварин К.В. 13.09.24 УА #83741
	
	//+ ИнфоСофт Стояк Ю.К. 04.10.2024 УА #76537
	МассивЗаданий = Новый Массив;
	//- ИнфоСофт Стояк Ю.К. 04.10.2024 УА #76537
	
	Пока ЕстьСтраницы Цикл                  
		
		Результат = ИС_ЯМ_API.ПолучитьСписокЗаказов(Профиль, ПараметрыЗапроса, КампанияID, Строка(КодСтраницы), ДатаПоследнегоОтправления - (24 * 3600)); 
		
		Если ЗначениеЗаполнено(Результат) Тогда
			pager = Результат.pager;
			orders = Результат.orders;
			КодСтраницы = КодСтраницы + 1;
			ЕстьСтраницы = ?(КодСтраницы <= pager.pagesCount, Истина, Ложь); 
		Иначе
			Прервать;
		КонецЕсли;
		
		Для Каждого order Из orders Цикл
			
			//+ ИнфоСофт Сумин Д.В. 07.11.2023 УА #65561
			Заказ = ПолучитьЗаказПоНомеру(order.id);
			//Заказ = Документы.ИС_ЯМ_Заказ.НайтиПоНомеру(order.id);
			//- ИнфоСофт Сумин Д.В. 07.11.2023 УА #65561
			
			Если Заказ.Пустая() Тогда
				Продолжить;
			КонецЕсли;		 
			
			//+ ИнфоСофт Стояк Ю.К. 04.10.2024 УА #76537
			Если Заказ.shipmentDate = Дата('00010101') Тогда 					
				Заказ = СоздатьИлиОбновитьЗаказ(Профиль, order, ДатаПоследнегоОтправления, Склад);					
				МассивЗаданий.Добавить(Заказ);
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 04.10.2024 УА #76537
			
			//+ ИнфоСофт Стояк Ю.К. 21.04.2025 УА #97604			
			ЗаписатьСтатусЗаказа(Профиль, Заказ, order);
			//+ ИнфоСофт Стояк Ю.К. 03.05.2023 УА #58008
			//МенеджерЗаписи = РегистрыСведений.ИС_ЯМ_СтатусыСборочныхЗаданий.СоздатьМенеджерЗаписи();
			//МенеджерЗаписи.Профиль = Профиль;
			//МенеджерЗаписи.Заказ = Заказ;
			//
			//МенеджерЗаписи.Прочитать();
			//
			//МенеджерЗаписи.Профиль = Профиль;
			//МенеджерЗаписи.Заказ = Заказ;   
			//
			////+ ИнфоСофт Стояк Ю.К. 16.09.2024 УА #82955
			//БылОтменён = Ложь;
			//
			//Если МенеджерЗаписи.status = Перечисления.ИС_ЯМ_СтатусыЗаказов.CANCELLED Тогда
			//	БылОтменён = Истина;
			//КонецЕсли;
			////- ИнфоСофт Стояк Ю.К. 16.09.2024 УА #82955
			//
			//Попытка
			//	МенеджерЗаписи.status = Перечисления.ИС_ЯМ_СтатусыЗаказов[order.status];
			//Исключение
			//КонецПопытки;
			//
			//Попытка
			//	МенеджерЗаписи.substatus = Перечисления.ИС_ЯМ_ДетальныеСтатусы[order.substatus]; 
			//Исключение
			//КонецПопытки;
			//
			////+ ИнфоСофт Стояк Ю.К. 16.08.2023 УА #61318			
			////+ ИнфоСофт Стояк Ю.К. 16.09.2024 УА #82955
			////Если МенеджерЗаписи.status = Перечисления.ИС_ЯМ_СтатусыЗаказов.CANCELLED Тогда
			//Если МенеджерЗаписи.status = Перечисления.ИС_ЯМ_СтатусыЗаказов.CANCELLED И Не БылОтменён Тогда
			////- ИнфоСофт Стояк Ю.К. 16.09.2024 УА #82955			
			//	ОтменитьЗаказ(Заказ, Профиль);	
			//КонецЕсли;
			////- ИнфоСофт Стояк Ю.К. 16.08.2023 УА #61318
			//
			//Попытка
			//	МенеджерЗаписи.Записать(Истина);	
			//Исключение
			//	Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			//	ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			//КонецПопытки;
			//- ИнфоСофт Стояк Ю.К. 03.05.2023 УА #58008
			//- ИнфоСофт Стояк Ю.К. 21.04.2025 УА #97604
			
		КонецЦикла;
		
	КонецЦикла;
	
	//+ ИнфоСофт Стояк Ю.К. 04.10.2024 УА #76537	
	Если МассивЗаданий.Количество() > 0 Тогда
		ПроверитьФункциональныеОпцииСборочныхЗаданий(Профиль, МассивЗаданий);
	КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 04.10.2024 УА #76537
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 12.04.2023 УА #57537

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Процедура СоздатьЗаказы(Профиль, МассивЗаданий) Экспорт  
	
	Событие = "СоздатьЗаказыЯМ";
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Заказ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
	|		ПО (ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ = ИС_ЯМ_Заказ.Ссылка)
	|ГДЕ
	|	ИС_ЯМ_Заказ.Ссылка В(&МассивСсылок)
	|	И ИС_ЯМ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	//+ ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97627	
	//+ ИнфоСофт Мурсалимов Д.Р. 13.11.23 УА #65333
	//|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status <> ЗНАЧЕНИЕ(Перечисление.ИС_ЯМ_СтатусыЗаказов.UNPAID)
	//- ИнфоСофт Мурсалимов Д.Р. 13.11.23 УА #65333
	//- ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97627
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status <> ЗНАЧЕНИЕ(Перечисление.ИС_ЯМ_СтатусыЗаказов.CANCELLED)";
	//+ ИнфоСофт Стояк Ю.К. 05.11.2024 УА #86321
	////+ ИнфоСофт Стояк Ю.К. 04.10.2024 УА #76537
	//|	И ИС_ЯМ_Заказ.shipmentDate <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	////- ИнфоСофт Стояк Ю.К. 04.10.2024 УА #76537
	
	Если Не ФукнциональныеОпции.ЯндексСоздаватьЗаказыПоЮрЛицам Тогда
		Запрос.Текст = Запрос.Текст + "	И ИС_ЯМ_Заказ.shipmentDate <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//+ ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97627		
		|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status <> ЗНАЧЕНИЕ(Перечисление.ИС_ЯМ_СтатусыЗаказов.UNPAID)";		
		//- ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97627
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 05.11.2024 УА #86321
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивКСозданию = Новый Массив();
	Пока Выборка.Следующий() Цикл
		МассивКСозданию.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Если МассивКСозданию.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
    	
	Если ФукнциональныеОпции.РежимСозданияЗаказовЯМ = 0 Тогда // Один к одному
	
		Для Каждого СборочноеЗадание Из МассивКСозданию Цикл
			
			Заказ = СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции);
			
			Если Не Заказ.Пустая() Тогда
			
				ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
				ДокОбъект.Заказ = Заказ;
				
				Попытка
					ДокОбъект.Записать();
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;
			
			КонецЕсли; 	
			
		КонецЦикла;
		
	ИначеЕсли ФукнциональныеОпции.РежимСозданияЗаказовЯМ = 1 Тогда // Пакетный режим
	   	//+ ИнфоСофт Заварин К.В. 02.08.24 УА #80812
		МассивСтатусов = Новый Массив;
		МассивСтатусов.Добавить(Перечисления.ИС_ЯМ_СтатусыЗаказов.UNPAID);
		МассивСтатусов.Добавить(Перечисления.ИС_ЯМ_СтатусыЗаказов.CANCELLED);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_ЯМ_Заказ.Ссылка КАК Ссылка,
		|	ИС_ЯМ_Заказ.Склад КАК Склад
		|ИЗ
		|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
		|		ПО (ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ = ИС_ЯМ_Заказ.Ссылка)
		|ГДЕ
		|	ИС_ЯМ_Заказ.Ссылка В (&МассивСсылок)
		|	И ИС_ЯМ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И НЕ ИС_ЯМ_СтатусыСборочныхЗаданий.status В(&МассивСтатусов)
		|ИТОГИ ПО
		|	Склад";
		Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
		Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
		
		РезультатЗапроса = Запрос.Выполнить();
				
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();
			Заказ = Неопределено;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Заказ = СоздатьИлиДополнитьЗаказУТ11_5(ВыборкаДетальныеЗаписи.Ссылка, ФукнциональныеОпции, Заказ);
				
				Если Не Заказ.Пустая() И Заказ <> Неопределено Тогда	
					ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
					ДокОбъект.Заказ = Заказ;
					
					Попытка	
						ДокОбъект.Записать();
						
					Исключение
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
					КонецПопытки; 
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;
		
		//Заказ = СоздатьИлиДополнитьЗаказУТ11_5(МассивКСозданию[0], ФукнциональныеОпции);
		//	
		//Если Не Заказ.Пустая() Тогда
		//
		//	ДокОбъект = МассивКСозданию[0].ПолучитьОбъект();
		//	ДокОбъект.Заказ = Заказ;
		//	
		//	Попытка
		//		ДокОбъект.Записать();
		//	Исключение
		//		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//	КонецПопытки;
		//	
		//КонецЕсли;
		//
		//МассивКСозданию.Удалить(0);
		//
		//Для Каждого СборочноеЗадание Из МассивКСозданию Цикл
		//	
		//	Заказ = СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, Заказ);
		//	
		//	Если Не Заказ.Пустая() Тогда
		//		
		//		ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
		//		ДокОбъект.Заказ = Заказ;
		//		
		//		Попытка
		//			ДокОбъект.Записать();
		//		Исключение
		//			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//		КонецПопытки;
		//		
		//	КонецЕсли; 	
		//	
		//КонецЦикла;
		//- ИнфоСофт Заварин К.В. 02.08.24 УА #80812
	ИначеЕсли ФукнциональныеОпции.РежимСозданияЗаказовЯМ = 2 Тогда // Формирование в течение дня 		
		
		//+ ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
		//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		Если ФукнциональныеОпции.ФормироватьЕдиныйЗаказБезРазбиенияЯМ
			И НЕ ФукнциональныеОпции.ИспользоватьРазбиениеПоСкладамЯМ Тогда // без разбиения, создается только 1 заказ
		//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424  
			
			Если ФукнциональныеОпции.АктивныйЗаказКлиентаЯМ.Пустая() Тогда
				
				Заказ = СоздатьИлиДополнитьЗаказУТ11_5(МассивКСозданию[0], ФукнциональныеОпции);
				
				Если Не Заказ.Пустая() Тогда
					
					ДокОбъект = МассивКСозданию[0].ПолучитьОбъект();
					ДокОбъект.Заказ = Заказ;
					
					Попытка
						ДокОбъект.Записать();
					Исключение
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
					КонецПопытки;
					
				КонецЕсли;
						
				СоответствиеПараметровЗаписи = Новый Соответствие;				
				СоответствиеПараметровЗаписи.Вставить("АктивныйЗаказКлиентаЯМ", Заказ.Ссылка);
				ИС_MP_Сервер.ЗаписатьНастройкиСправочника(Профиль, СоответствиеПараметровЗаписи);				
						
				МассивКСозданию.Удалить(0);
				
			Иначе
				Заказ = ФукнциональныеОпции.АктивныйЗаказКлиентаЯМ;
			КонецЕсли;
			
			Для Каждого СборочноеЗадание Из МассивКСозданию Цикл
				
				СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, Заказ);
				
				ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
				ДокОбъект.Заказ = Заказ;
				
				Попытка
					ДокОбъект.Записать();
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;	
				
			КонецЦикла; 
			
			Возврат; 
			
		КонецЕсли;
		//- ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
		
		//+ ИнфоСофт Сумин Д.В. 01.06.2023 УА #59231
		Для Каждого СборочноеЗадание Из МассивКСозданию Цикл 
			
			ДобавитьЗапись = Ложь;
			
			//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
			АктивныйЗаказ = ПолучитьАктивныйЗаказКлиентаЯМ(СборочноеЗадание,
				НЕ ФукнциональныеОпции.ФормироватьЕдиныйЗаказБезРазбиенияЯМ, ФукнциональныеОпции.ИспользоватьРазбиениеПоСкладамЯМ);
			//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
			
			Если АктивныйЗаказ = Неопределено Тогда
				ДобавитьЗапись = Истина;	
			КонецЕсли;	
			
			Заказ = СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, АктивныйЗаказ); 
			
			Если Заказ = Документы.ЗаказКлиента.ПустаяСсылка() Тогда
				//+ ИнфоСофт Стояк Ю.К. 11.06.2024 УА #69782				
				Текст = "Отсутствует сопоставление по заказу ЯМ. Номер: " + СокрЛП(СборочноеЗадание.Номер); 
				//Текст = "Отсутствует сопоставление по заказу Озон. Номер: " + СокрЛП(СборочноеЗадание.Номер); 
				//- ИнфоСофт Стояк Ю.К. 11.06.2024 УА #69782
				ОбщегоНазначения.СообщитьПользователю(Текст);
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				Продолжить;	
			КонецЕсли;	
			
			Если ДобавитьЗапись Тогда
				ДобавитьЗаписьВРегистрЗаказовЯМ(Заказ, СборочноеЗадание);	
			КонецЕсли;	
			
			ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
			ДокОбъект.Заказ = Заказ;
			
			Попытка
				ДокОбъект.Записать();
			Исключение
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			КонецПопытки;	
		КонецЦикла;
		
		//Если ФукнциональныеОпции.АктивныйЗаказКлиентаЯМ.Пустая() Тогда
		//	
		//	Заказ = СоздатьИлиДополнитьЗаказУТ11_5(МассивКСозданию[0], ФукнциональныеОпции);
		//	
		//	Если Не Заказ.Пустая() Тогда
		//	
		//		ДокОбъект = МассивКСозданию[0].ПолучитьОбъект();
		//		ДокОбъект.Заказ = Заказ;
		//		
		//		Попытка
		//			ДокОбъект.Записать();
		//		Исключение
		//			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//		КонецПопытки;
		//		
		//	КонецЕсли;
		//	
		//	//+ ИнфоСофт Сумин Д.В. 15.04.2023 УА #57537			
		//	СоответствиеПараметровЗаписи = Новый Соответствие;
		//	
		//	СоответствиеПараметровЗаписи.Вставить("АктивныйЗаказКлиентаЯМ", Заказ.Ссылка);
		//	
		//	ИС_MP_Сервер.ЗаписатьНастройкиСправочника(Профиль, СоответствиеПараметровЗаписи);
		//	
		//	//ПрофильОбъект = Профиль.ПолучитьОбъект();
		//	//ПрофильОбъект.АктивныйЗаказКлиента = Заказ;
		//	
		//	//Попытка
		//	//ПрофильОбъект.Записать();
		//	//Исключение
		//	//	Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//	//	ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//	//КонецПопытки;
		//	//- ИнфоСофт Сумин Д.В. 15.04.2023 УА #57537
		//	
		//	МассивКСозданию.Удалить(0);
		//	
		//Иначе
		//	Заказ = ФукнциональныеОпции.АктивныйЗаказКлиентаЯМ;
		//КонецЕсли;
		//
		//Для Каждого СборочноеЗадание Из МассивКСозданию Цикл
		//	
		//	СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, Заказ);
		//	
		//	ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
		//	ДокОбъект.Заказ = Заказ;
		//	
		//	Попытка
		//		ДокОбъект.Записать();
		//	Исключение
		//		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//	КонецПопытки;	
		//	
		//КонецЦикла;
		//- ИнфоСофт Сумин Д.В. 01.06.2023 УА #59231
	Иначе
		ВызватьИсключение("Неизвестный режим формирования заказов");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
Процедура СоздатьРеализации(Профиль, МассивЗаданий) Экспорт
    
    Событие = "СоздатьРеализацииЯМ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//+ ИнфоСофт Стояк Ю.К. 18.12.2023 УА #63805
	"ВЫБРАТЬ
	|	ИС_ЯМ_Заказ.Заказ КАК Заказ,
	|	ИС_ЯМ_Заказ.Номер КАК Номер,
	//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
	|	ИС_ЯМ_Заказ.Склад.АвтоматическиСоздаватьОрдерНаОтгрузку КАК АвтоматическиСоздаватьОрдерНаОтгрузку,
	//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
	|	ИС_ЯМ_Заказ.Склад.СтатусСтрокиРасходногоОрдера КАК СтатусСтрокиРасходногоОрдера,
	//+ ИнфоСофт Ивонин К.А. 01.07.24 УА #76413
	|	ИС_ЯМ_Заказ.Склад.СтатусРасходногоОрдера КАК СтатусРасходногоОрдера,
	//- ИнфоСофт Ивонин К.А. 01.07.24 УА #76413
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.status КАК status,
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.substatus КАК substatus,
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732 
	|	ИС_ЯМ_Заказ.Склад КАК Склад,
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	ИС_ЯМ_Заказ.shipmentDate КАК shipmentDate
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
	|		ПО (ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ = ИС_ЯМ_Заказ.Ссылка)
	|ГДЕ
	|	ИС_ЯМ_Заказ.Ссылка В(&МассивСсылок)
	|	И НЕ ИС_ЯМ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_ЯМ_Заказ.Заказ,
	|	ИС_ЯМ_Заказ.Номер,
	//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
	|	ИС_ЯМ_Заказ.Склад.АвтоматическиСоздаватьОрдерНаОтгрузку,
	//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
	|	ИС_ЯМ_Заказ.Склад.СтатусСтрокиРасходногоОрдера,
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732 
	|	ИС_ЯМ_Заказ.Склад,
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.status,
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.substatus,
	|	ИС_ЯМ_Заказ.shipmentDate,
	|	ИС_ЯМ_Заказ.Склад.СтатусРасходногоОрдера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	СУММА(ВЫБОР
	|			КОГДА РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоРТУ,
	|	ВТ_Заказы.Номер КАК Номер,
	|	ВТ_Заказы.status КАК status,
	|	ВТ_Заказы.substatus КАК substatus
	|ПОМЕСТИТЬ ВТ_РТУ
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (РеализацияТоваровУслуг.ЗаказКлиента = ВТ_Заказы.Заказ.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказы.Заказ,
	|	ВТ_Заказы.Номер,
	|	ВТ_Заказы.status,
	|	ВТ_Заказы.substatus
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ,
	|	СУММА(ВЫБОР
	|			КОГДА ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ),
	|	ВТ_Заказы.Номер,
	|	ВТ_Заказы.status,
	|	ВТ_Заказы.substatus
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ВТ_Заказы.Заказ = ПередачаТоваровХранителю.ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказы.Заказ,
	|	ВТ_Заказы.Номер,
	|	ВТ_Заказы.status,
	|	ВТ_Заказы.substatus
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РТУ.Заказ КАК Заказ,
	|	СУММА(ВТ_РТУ.КоличествоРТУ) КАК КоличествоРТУ,
	|	ВТ_РТУ.Номер КАК Номер,
	|	ВТ_РТУ.status КАК status,
	|	ВТ_РТУ.substatus КАК substatus
	|ПОМЕСТИТЬ ВТ_РТУ_Группировка
	|ИЗ
	|	ВТ_РТУ КАК ВТ_РТУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РТУ.Заказ,
	|	ВТ_РТУ.Номер,
	|	ВТ_РТУ.status,
	|	ВТ_РТУ.substatus
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ КАК Заказ,
	//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
	|	ВТ_Заказы.АвтоматическиСоздаватьОрдерНаОтгрузку КАК АвтоматическиСоздаватьОрдерНаОтгрузку,
	//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872 
	|	ВТ_Заказы.СтатусСтрокиРасходногоОрдера КАК СтатусСтрокиРасходногоОрдера,
	//+ ИнфоСофт Ивонин К.А. 01.07.24 УА #76413
	|	ВТ_Заказы.СтатусРасходногоОрдера КАК СтатусРасходногоОрдера,
	//- ИнфоСофт Ивонин К.А. 01.07.24 УА #76413
	|	ВТ_РТУ_Группировка.КоличествоРТУ КАК КоличествоРТУ,
	|	ВТ_Заказы.Номер КАК Номер,
	|	ВТ_Заказы.status КАК Статус,
	|	ВТ_Заказы.substatus КАК Подстатус,
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	ВТ_Заказы.Склад КАК СкладЯМ,
	|	ВТ_Заказы.Заказ.Склад КАК Склад,
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	ВТ_Заказы.shipmentDate КАК shipmentDate
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ_Группировка КАК ВТ_РТУ_Группировка
	|		ПО ВТ_Заказы.Заказ = ВТ_РТУ_Группировка.Заказ
	//+ ИнфоСофт Стояк Ю.К. 11.03.2025 УА #95754
	|			И ВТ_Заказы.Номер = ВТ_РТУ_Группировка.Номер
	//- ИнфоСофт Стояк Ю.К. 11.03.2025 УА #95754
	|ГДЕ
	|	ВТ_РТУ_Группировка.КоличествоРТУ = 0
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732 
	|ИТОГИ
	|	МАКСИМУМ(СкладЯМ)
	|ПО
	|	Склад";
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	//- ИнфоСофт Стояк Ю.К. 18.12.2023 УА #63805
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);  
	
	Комиссия25 = ФукнциональныеОпции.ДоговорЯМ.КомиссионныеПродажи25;
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;  
	
	//+ ИнфоСофт Стояк Ю.К. 11.03.2025 УА #95754		
	МассивТиповРеализацитй = Новый Массив;
	МассивТиповРеализацитй.Добавить(Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	МассивТиповРеализацитй.Добавить(Новый ОписаниеТипов("ДокументСсылка.ПередачаТоваровХранителю"));
	
	ТаблицаДанныхПоЗаказам = Новый ТаблицаЗначений;	
	ТаблицаДанныхПоЗаказам.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
	ТаблицаДанныхПоЗаказам.Колонки.Добавить("Реализация", Новый ОписаниеТипов(МассивТиповРеализацитй));	
	//- ИнфоСофт Стояк Ю.К. 11.03.2025 УА #95754
    
    //+ ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
	ПорядокОформленияНакладныхРасходныхОрдеров = Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить();
	//- ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
	
	//+ ИнфоСофт Заварин К.В. 20.03.25 УА #96732
	Если ФукнциональныеОпции.ЯндексРежимСозданияРеализаций = 1 Тогда // Пакетный режим
		
		ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСклад.Следующий() Цикл
		    
		    Выборка = ВыборкаСклад.Выбрать();
			
			МассивДляЗаполнения = Новый Массив;
			
			Пока Выборка.Следующий() Цикл		
				МассивДляЗаполнения.Добавить(Выборка.Заказ);			
			КонецЦикла;
			
			Если ПорядокОформленияНакладныхРасходныхОрдеров 
				= Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные Тогда
				
				Выборка.Сбросить();
				Выборка.Следующий();
				
				СоздатьРеализацию(Профиль, Выборка, ФукнциональныеОпции, Комиссия25, МассивДляЗаполнения);
				
				Выборка.Сбросить();
				
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.Заказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
						ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
																	, Выборка.СтатусРасходногоОрдера
																	, Выборка.СтатусСтрокиРасходногоОрдера);	
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				Выборка.Сбросить();
				
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.Заказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
						ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
																	, Выборка.СтатусРасходногоОрдера
																	, Выборка.СтатусСтрокиРасходногоОрдера);	
					КонецЕсли;
					
				КонецЦикла;
				
				Выборка.Сбросить();
				Выборка.Следующий();
				
				СоздатьРеализацию(Профиль, Выборка, ФукнциональныеОпции, Комиссия25, МассивДляЗаполнения);
							
			КонецЕсли;
					
		КонецЦикла;
		
		Возврат; 
		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 20.03.25 УА #96732
	
    Пока Выборка.Следующий() Цикл
		
		//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
		Если Выборка.Заказ = Null Тогда
			Продолжить;
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
		
		//+ ИнфоСофт Стояк Ю.К. 11.03.2025 УА #95754
		НайденныеСтроки = ТаблицаДанныхПоЗаказам.НайтиСтроки(Новый Структура("Заказ", Выборка.Заказ));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Если ФукнциональныеОпции.ПереводитьЗаказВГотовностьЯМ И НайденныеСтроки[0].Реализация.Проведен Тогда 
				
				Если Выборка.Статус = Перечисления.ИС_ЯМ_СтатусыЗаказов.PROCESSING И Выборка.Подстатус = Перечисления.ИС_ЯМ_ДетальныеСтатусы.STARTED Тогда			
					Массив = Новый Массив;
					Массив.Добавить(Новый Структура("Номер", Выборка.Номер));
					ИзменитьСтатусыЗаказов(Профиль,	Массив,	Перечисления.ИС_ЯМ_СтатусыЗаказов.PROCESSING, Перечисления.ИС_ЯМ_ДетальныеСтатусы.READY_TO_SHIP);			
				КонецЕсли;
				
			КонецЕсли;
			
			Продолжить;
				
		ИначеЕсли ПорядокОформленияНакладныхРасходныхОрдеров 
			= Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные Тогда                                       		
		//+ ИнфоСофт Мурсалимов Д.Р. 10.06.24 УА #77595
		//Если ПорядокОформленияНакладныхРасходныхОрдеров 
		//	= Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные Тогда
		//- ИнфоСофт Стояк Ю.К. 11.03.2025 УА #95754
			
			//+ ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754			
			//СоздатьРеализацию(Профиль, Выборка, ФукнциональныеОпции, Комиссия25);
			Реализация = СоздатьРеализацию(Профиль, Выборка, ФукнциональныеОпции, Комиссия25);
			//- ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
			
			//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
			Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.Заказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
				ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
															, Выборка.СтатусРасходногоОрдера
															, Выборка.СтатусСтрокиРасходногоОрдера);	
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872	
					
		Иначе
			
			//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
			Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.Заказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
				ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
															, Выборка.СтатусРасходногоОрдера
															, Выборка.СтатусСтрокиРасходногоОрдера);	
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872		
			
			//+ ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754			
			//СоздатьРеализацию(Профиль, Выборка, ФукнциональныеОпции, Комиссия25);
			Реализация = СоздатьРеализацию(Профиль, Выборка, ФукнциональныеОпции, Комиссия25);
			//- ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
			
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 10.06.24 УА #77595
		
		//+ ИнфоСофт Стояк Ю.К. 11.03.2025 УА #95754
		НСтр = ТаблицаДанныхПоЗаказам.Добавить();
		НСтр.Заказ = Выборка.Заказ;
		НСтр.Реализация = Реализация;
		//- ИнфоСофт Стояк Ю.К. 11.03.2025 УА #95754
			
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
Функция НапечататьЭтикетки(Профиль, МассивЗаданий) Экспорт
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнен Профиль. Загрузка товаров невозможна");
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);	
	
	КодыОтправлений = Новый Массив;
	Для Каждого Задание Из МассивЗаданий Цикл
		КодыОтправлений.Добавить(СтрЗаменить(Задание.Номер, Символы.НПП, ""));		
	КонецЦикла;
	
	КампанияID = Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=0");
	МассивФайлов = Новый Массив;
	Для Каждого Элемент Из КодыОтправлений Цикл		 
		МассивФайлов.Добавить(ИС_ЯМ_API.НапечататьЭтикетки(Профиль, ПараметрыЗапроса, КампанияID, Элемент));
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629 
Функция ПолучитьАктивныйЗаказКлиентаЯМ(СборочноеЗадание, РазбиениеПоДатам, РазбиениеПоСкладам)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_ЗаказыВТеченииДня.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_ЗаказыВТеченииДня КАК ИС_ЯМ_ЗаказыВТеченииДня
	|ГДЕ
	|	ИС_ЯМ_ЗаказыВТеченииДня.ЗаказОткрыт
	|	И ИС_ЯМ_ЗаказыВТеченииДня.Профиль = &Профиль";
	
	Если РазбиениеПоДатам Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ИС_ЯМ_ЗаказыВТеченииДня.ДатаОтгрузки = &ДатаОтгрузки";
		
		Запрос.УстановитьПараметр("ДатаОтгрузки", СборочноеЗадание.items[0].shipmentDate);
		
	КонецЕсли;
	
	Если РазбиениеПоСкладам Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ИС_ЯМ_ЗаказыВТеченииДня.СкладМП = &Склад";
		
		Запрос.УстановитьПараметр("Склад", СборочноеЗадание.Склад);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Профиль", СборочноеЗадание.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	КонецЕсли; 	
	
	ВыборкаДетальныеЗаписи.Следующий();	
	
	Возврат ВыборкаДетальныеЗаписи.ЗаказКлиента;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629

//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
Процедура ДобавитьЗаписьВРегистрЗаказовЯМ(Заказ, СборочноеЗадание)
	
	МенеджерЗаписи = РегистрыСведений.ИС_ЯМ_ЗаказыВТеченииДня.СоздатьМенеджерЗаписи(); 
	
	МенеджерЗаписи.ДатаОтгрузки = СборочноеЗадание.items[0].shipmentDate;
	МенеджерЗаписи.ЗаказКлиента = Заказ;
	МенеджерЗаписи.СкладМП 		= СборочноеЗадание.Склад; 
	МенеджерЗаписи.Профиль 		= СборочноеЗадание.Профиль;
	МенеджерЗаписи.ЗаказОткрыт 	= Истина;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629

//+ ИнфоСофт Стояк Ю.К. 16.08.2023 УА #61318
Процедура ОтменитьЗаказ(Заказ, Профиль) Экспорт 
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 03.07.2024 УА #67813	
	//Если Не ФукнциональныеОпции.РежимСозданияЗаказовЯМ = 0 Тогда
	//	Возврат;
	//КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 03.07.2024 УА #67813
	
	//+ ИнфоСофт Заварин К.В. 05.06.24 УА #68574
	Если Не ФукнциональныеОпции.УдалятьРТУЯМ Тогда
		Возврат;
	КонецЕсли;
    //- ИнфоСофт Заварин К.В. 05.06.24 УА #68574
	
	//+ ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	Если ФукнциональныеОпции.ПроверятьДатуПередУдалениемЯМ Тогда
				
		Если ЗначениеЗаполнено(Заказ.shipmentDate) И ТекущаяДатаСеанса() >= Заказ.shipmentDate Тогда
			Возврат;	
		КонецЕсли;
		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	
	ИспользоватьПричины = Ложь;
	
	Если Константы.ИспользоватьПричиныОтменыЗаказовКлиентов.Получить() Тогда
		ИспользоватьПричины = Истина;
		Если Не ЗначениеЗаполнено(ФукнциональныеОпции.ПричинаОтменыЯМ) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #67813	
	//"ВЫБРАТЬ
	//|	ДокументИС_ЯМ_Заказ.Ссылка КАК Ссылка,
	//|	ДокументИС_ЯМ_Заказ.Заказ КАК Заказ
	//|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	//|ИЗ
	//|	Документ.ИС_ЯМ_Заказ КАК ДокументИС_ЯМ_Заказ
	//|ГДЕ
	//|	ДокументИС_ЯМ_Заказ.Ссылка = &Ссылка
	//|	И НЕ ДокументИС_ЯМ_Заказ.Заказ ЕСТЬ NULL
	//|;
	//|
		"ВЫБРАТЬ
		|	ИС_ЯМ_Заказitems.Ссылка КАК Ссылка,
		|	ИС_ЯМ_Заказitems.Ссылка.Заказ КАК Заказ,
		|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		|	ИС_ЯМ_СоответствиеХарактеристик.Упаковка КАК Упаковка,
		|	ИС_ЯМ_Заказitems.count КАК count,
		|	ИС_ЯМ_Заказitems.price КАК price,
		|	ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор		
		|ПОМЕСТИТЬ ВТ_ОсновныеДанные
		|ИЗ
		|	Документ.ИС_ЯМ_Заказ.items КАК ИС_ЯМ_Заказitems
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
		|		ПО ИС_ЯМ_Заказitems.НоменклатураЯМ = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ
		|ГДЕ
		|	ИС_ЯМ_Заказitems.Ссылка = &Ссылка
		|	И НЕ ИС_ЯМ_Заказitems.Ссылка.Заказ ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеДанные.Ссылка КАК Заказ,
		|	МАКСИМУМ(РеализацияТоваровУслуг.Ссылка) КАК РТУ,
		|	СУММА(ВЫБОР
		|			КОГДА РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоличествоРТУ
		|ПОМЕСТИТЬ ВТ_РТУ
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (ВТ_ОсновныеДанные.Ссылка.Заказ = (ВЫРАЗИТЬ(РеализацияТоваровУслуг.ЗаказКлиента КАК Документ.ЗаказКлиента)))
		|ГДЕ
		|	ВТ_ОсновныеДанные.Ссылка.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОсновныеДанные.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ОсновныеДанные.Ссылка,
		|	МАКСИМУМ(ПередачаТоваровХранителю.Ссылка),
		|	СУММА(ВЫБОР
		|			КОГДА ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ)
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
		|		ПО (ВТ_ОсновныеДанные.Ссылка.Заказ = (ВЫРАЗИТЬ(ПередачаТоваровХранителю.ЗаказКлиента КАК Документ.ЗаказКлиента)))
		|ГДЕ
		|	ВТ_ОсновныеДанные.Ссылка.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОсновныеДанные.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_РТУ.КоличествоРТУ) КАК КоличествоРТУ1,
		|	ВТ_РТУ.Заказ КАК Заказ,
		|	ВТ_РТУ.РТУ КАК РТУ
		|ПОМЕСТИТЬ ВТ_РТУ_Группировка
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РТУ.Заказ,
		|	ВТ_РТУ.РТУ
		|;
		|
		//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеДанные.Ссылка КАК Ссылка,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК РасходныйОрдер
		|ПОМЕСТИТЬ ВТ_РасходныйОрдер1
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|		ПО ВТ_ОсновныеДанные.Заказ = (ВЫРАЗИТЬ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Документ.ЗаказКлиента))
		|ГДЕ
		|	НЕ ВТ_ОсновныеДанные.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасходныйОрдер1.Ссылка КАК Ссылка,
		|	ВТ_РасходныйОрдер1.РасходныйОрдер КАК РасходныйОрдер,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) КАК РазличныхРаспоряжений
		|ПОМЕСТИТЬ ВТ_РасходныйОрдер
		|ИЗ
		|	ВТ_РасходныйОрдер1 КАК ВТ_РасходныйОрдер1
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|		ПО ВТ_РасходныйОрдер1.РасходныйОрдер = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
 	   	|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РасходныйОрдер1.Ссылка,
		|	ВТ_РасходныйОрдер1.РасходныйОрдер
		|;
		|
		//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеДанные.Ссылка КАК ЗаказЯМ,
		|	ВТ_ОсновныеДанные.Заказ КАК Заказ1С,
		|	ВТ_РТУ_Группировка.РТУ КАК РТУ,
		//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #67813
		|	ВТ_ОсновныеДанные.Номенклатура КАК Номенклатура,
		|	ВТ_ОсновныеДанные.Характеристика КАК Характеристика,
		|	ВТ_ОсновныеДанные.count КАК count,
		|	ВТ_ОсновныеДанные.price КАК price,
		|	ВТ_ОсновныеДанные.ЭтоНабор КАК ЭтоНабор,
		|	NULL КАК НоменклатураВНаборе,
		|	NULL КАК ХарактеристикаНабора,
		|	NULL КАК Количество,                     
		//- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #67813
		//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		|	ВТ_РасходныйОрдер.РасходныйОрдер КАК РасходныйОрдер,
		|   ВТ_РасходныйОрдер.РазличныхРаспоряжений КАК РазличныхРаспоряжений
		//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ_Группировка КАК ВТ_РТУ_Группировка
		|		ПО ВТ_ОсновныеДанные.Ссылка = ВТ_РТУ_Группировка.Заказ
		//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныйОрдер КАК ВТ_РасходныйОрдер		
		|       ПО ВТ_ОсновныеДанные.Ссылка = ВТ_РасходныйОрдер.Ссылка
		//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #67813
		|ГДЕ
		|	НЕ ВТ_ОсновныеДанные.ЭтоНабор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ОсновныеДанные.Ссылка,
		|	ВТ_РТУ_Группировка.Заказ,
		|	ВТ_ОсновныеДанные.Заказ,
		|	ВТ_ОсновныеДанные.Номенклатура,
		|	ВТ_ОсновныеДанные.Характеристика,
		|	ВТ_ОсновныеДанные.count,
		|	ВТ_ОсновныеДанные.price,
		|	ВТ_ОсновныеДанные.ЭтоНабор,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
		|	ВариантыКомплектацииНоменклатурыТовары.Количество,
		//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		|	ВТ_РасходныйОрдер.РасходныйОрдер КАК РасходныйОрдер,
		|   ВТ_РасходныйОрдер.РазличныхРаспоряжений КАК РазличныхРаспоряжений
		//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ_Группировка КАК ВТ_РТУ_Группировка
		|		ПО ВТ_ОсновныеДанные.Ссылка = ВТ_РТУ_Группировка.Заказ,
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ПО (ВТ_ОсновныеДанные.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
		|				И ВТ_ОсновныеДанные.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика)
		//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныйОрдер КАК ВТ_РасходныйОрдер		
		|       ПО ВТ_ОсновныеДанные.Ссылка = ВТ_РасходныйОрдер.Ссылка
		//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		|ГДЕ
		|	ВТ_ОсновныеДанные.ЭтоНабор";
		//- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #67813
	
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//+ ИнфоСофт Стояк Ю.К. 11.10.2024 УА #84967		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РТУ) И ФукнциональныеОпции.РежимСозданияЗаказовЯМ = 0 Тогда 
		//Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РТУ) И ФукнциональныеОпции.УдалятьРТУЯМ Тогда 
		//- ИнфоСофт Стояк Ю.К. 11.10.2024 УА #84967
			
			//+ ИнфоСофт Стояк Ю.К. 18.03.2024 УА #72349			
			Если Не ВыборкаДетальныеЗаписи.РТУ.ПометкаУдаления Тогда
				РТУ = ВыборкаДетальныеЗаписи.РТУ.ПолучитьОбъект();	
				
				Попытка	
					РТУ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение 
					
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
					Возврат;
					
				КонецПопытки;
				
				РТУ.ПометкаУдаления = Истина; 			
				
				Попытка	
					РТУ.Записать();
				Исключение 
					
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
					Возврат;
					
				КонецПопытки;
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 18.03.2024 УА #72349
			
		КонецЕсли;
		
		//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РасходныйОрдер)
			И ФукнциональныеОпции.РежимСозданияЗаказовЯМ = 0 Тогда
			
			РО = ВыборкаДетальныеЗаписи.РасходныйОрдер.ПолучитьОбъект();
			
			Если ВыборкаДетальныеЗаписи.РазличныхРаспоряжений = 1 Тогда
				
				Попытка	
					РО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение 	
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
					Возврат;	
				КонецПопытки;
				
				РО.ПометкаУдаления = Истина;
				
				Попытка	
					РО.Записать();
				Исключение	
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
					Возврат;	
				КонецПопытки; 	
				
			Иначе
				
				Отбор = Новый Структура(); 
				Отбор.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
				Отбор.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);
				
				НайденныеСтрокиОтгружаемые = РО.ОтгружаемыеТовары.НайтиСтроки(Отбор);
				
				Отбор.Вставить("Распоряжение", ВыборкаДетальныеЗаписи.Заказ1С);
				
				НайденныеСтрокиПоРаспоряжениям = РО.ТоварыПоРаспоряжениям.НайтиСтроки(Отбор);
				
				Если НайденныеСтрокиПоРаспоряжениям.Количество() > 0 Тогда
					
					РО.ТоварыПоРаспоряжениям.Удалить(НайденныеСтрокиПоРаспоряжениям[0]);
					
					НайденныеСтрокиОтгружаемые[0].Действие = 
					Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать;
					
					Попытка			
						РО.Записать(РежимЗаписиДокумента.Проведение);	
					Исключение 
						РО.Записать();			
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Заказ1С) Тогда
			
			Заказ1С = ВыборкаДетальныеЗаписи.Заказ1С.ПолучитьОбъект();
			
			//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #72349			
			Попытка
				Заказ1С.Заблокировать();    
			Исключение   
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", "Заказ " + Заказ1С.Ссылка + " заблокирован для изменения данных");     
				Продолжить;
			КонецПопытки;                               
			//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #72349 
			
			//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #67813			
			Если ФукнциональныеОпции.РежимСозданияЗаказовЯМ <> 0 Тогда
				
				Если ВыборкаДетальныеЗаписи.ЭтоНабор Тогда
					Отбор = Новый Структура();							
					Отбор.Вставить("НоменклатураНабора", ВыборкаДетальныеЗаписи.Номенклатура);
					Отбор.Вставить("ХарактеристикаНабора", ВыборкаДетальныеЗаписи.Характеристика); 
					Отбор.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.НоменклатураВНаборе);
					Отбор.Вставить("Характеристика", ВыборкаДетальныеЗаписи.ХарактеристикаНабора);					
					//+ ИнфоСофт Стояк Ю.К. 10.04.2025 УА #98469
					Отбор.Вставить("Количество", ВыборкаДетальныеЗаписи.Количество);
					//- ИнфоСофт Стояк Ю.К. 10.04.2025 УА #98469
					
					НайденныеСтроки = Заказ1С.Товары.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() > 0 Тогда	
											
						НайденныеСтроки[0].Отменено = Истина;
						Если ИспользоватьПричины Тогда		
							НайденныеСтроки[0].ПричинаОтмены = ФукнциональныеОпции.ПричинаОтменыЯМ;	
						КонецЕсли;  
						
					КонецЕсли; 
					
				Иначе
					Отбор = Новый Структура();							
					Отбор.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					Отбор.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);					
					//+ ИнфоСофт Стояк Ю.К. 10.04.2025 УА #98469
					Отбор.Вставить("Количество", ВыборкаДетальныеЗаписи.count);
					//- ИнфоСофт Стояк Ю.К. 10.04.2025 УА #98469
					
					НайденныеСтроки = Заказ1С.Товары.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() > 0 Тогда 
						
						НайденныеСтроки[0].Отменено = Истина;
						Если ИспользоватьПричины Тогда		
							НайденныеСтроки[0].ПричинаОтмены = ФукнциональныеОпции.ПричинаОтменыЯМ;	
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЕсли;                                                       
				
			Иначе 
				
				Для Каждого Товар Из Заказ1С.Товары Цикл
					Товар.Отменено = Истина;
					Если ИспользоватьПричины Тогда		
						Товар.ПричинаОтмены = ФукнциональныеОпции.ПричинаОтменыЯМ;	
					КонецЕсли;	
				КонецЦикла;
				
			КонецЕсли;                                  
			//Для Каждого Товар Из Заказ1С.Товары Цикл
			//	Товар.Отменено = Истина;
			//	Если ИспользоватьПричины Тогда		
			//		Товар.ПричинаОтмены = ФукнциональныеОпции.ПричинаОтменыЯМ;	
			//	КонецЕсли;	
			//КонецЦикла;
			//- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #67813
			
			Попытка	
				Заказ1С.Записать(РежимЗаписиДокумента.Проведение);
			Исключение 
				
				Заказ1С.Записать();			
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
				
			КонецПопытки; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 16.08.2023 УА #61318

//+ ИнфоСофт Мурсалимов Д.Р. 21.11.23 УА #56220
Функция УказатьКоличествоГрузовыхМест(Профиль, МассивЗаданий, Количество) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Заказ.Номер КАК Номер
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
	|		ПО (ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ = ИС_ЯМ_Заказ.Ссылка)
	|			И (ИС_ЯМ_Заказ.Профиль = &Профиль)
	|ГДЕ
	|	ИС_ЯМ_Заказ.Ссылка В(&МассивСсылок)
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status = ЗНАЧЕНИЕ(Перечисление.ИС_ЯМ_СтатусыЗаказов.PROCESSING)
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.substatus = ЗНАЧЕНИЕ(Перечисление.ИС_ЯМ_ДетальныеСтатусы.STARTED)";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивКСозданию = Новый Массив();
	Пока Выборка.Следующий() Цикл
		МассивКСозданию.Добавить(СтрЗаменить(Выборка.Номер, Символы.НПП, ""));	
	КонецЦикла;
	
	Если МассивКСозданию.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Проверьте статусы заказов. Указание количества грузовых мест невозможно!");
		Возврат Неопределено;
	КонецЕсли;	
	
	КампанияID = Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=0");
	
	Для Каждого Элемент Из МассивКСозданию Цикл
		
		ИС_ЯМ_API.УказатьКоличествоГрузовыхМест(Профиль, ПараметрыЗапроса, КампанияID, Элемент, Количество);
			
	КонецЦикла;
		
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 21.11.23 УА #56220

//+ ИнфоСофт Стояк Ю.К. 18.12.2023 УА #638058
Функция ИзменитьСтатусыЗаказов(Профиль, МассивЗаданий, Статус, Подстатус) Экспорт
	
	Событие = "ИзменитьСтатусыЗаказов";
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнен Профиль. Загрузка товаров невозможна");
		Возврат Неопределено;
	КонецЕсли;
		
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения); 
	
	КампанияID = Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=0"); 
	
	КодыОтправлений = Новый Массив;
	Для Каждого Задание Из МассивЗаданий Цикл
		КодыОтправлений.Добавить(СтрЗаменить(Задание.Номер, Символы.НПП, ""));		
	КонецЦикла;
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(КодыОтправлений, 30);		
	
	ИндексСтатуса = Перечисления.ИС_ЯМ_СтатусыЗаказов.Индекс(Статус); 
	ЗначениеСтатуса = Статус.Метаданные().ЗначенияПеречисления[ИндексСтатуса].Имя;
	
	ИндексДетальногоСтатуса = Перечисления.ИС_ЯМ_ДетальныеСтатусы.Индекс(Подстатус); 
	ЗначениеДетальногоСтатуса = Подстатус.Метаданные().ЗначенияПеречисления[ИндексДетальногоСтатуса].Имя;
	
	Для Каждого Элемент Из РазбитыйМассив Цикл 
		
		Тело = Новый Массив; 
		
		Для Каждого Код Из Элемент Цикл 
			
			Элемент = Новый Структура;
			Элемент.Вставить("id", Число(Код));
			Элемент.Вставить("status", ЗначениеСтатуса);
			Элемент.Вставить("substatus", ЗначениеДетальногоСтатуса);
			Тело.Добавить(Элемент);
			
		КонецЦикла; 
		
		Результат = ИС_ЯМ_API.ИзменитьСтатусЗаказов(Профиль, ПараметрыЗапроса, КампанияID, Тело);		
		
		Если ЗначениеЗаполнено(Результат) Тогда
			
			Если Результат.status = "OK" Тогда
				
				//+ ИнфоСофт Стояк Ю.К. 24.09.2024 УА #82955				
				//ОбщегоНазначения.СообщитьПользователю("Изменение статусов прошло со следующим результатом:" + Результат);
				ОбщегоНазначения.СообщитьПользователю("Отправка запроса на изменение статусов прошло со статусом: OK");
				//- ИнфоСофт Стояк Ю.К. 24.09.2024 УА #82955
				
				Для Каждого Задание Из Результат.result.orders Цикл  
					
					//+ ИнфоСофт Стояк Ю.К. 24.09.2024 УА #82955				
					Если Задание.updateStatus = "ERROR" Тогда
						ОбщегоНазначения.СообщитьПользователю("По заказу: " + Задание.id + " произошла ошибка изменения статуса: " + Задание.errorDetails);
					КонецЕсли;                                                  
					//- ИнфоСофт Стояк Ю.К. 24.09.2024 УА #82955				
					
					Заказ = ПолучитьЗаказПоНомеру(Задание.id);
					
					Если Заказ.Пустая() Тогда
						Продолжить;
					КонецЕсли;		 
					
					МенеджерЗаписи = РегистрыСведений.ИС_ЯМ_СтатусыСборочныхЗаданий.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Профиль = Профиль;
					МенеджерЗаписи.Заказ = Заказ;
					
					МенеджерЗаписи.Прочитать();
					
					МенеджерЗаписи.Профиль = Профиль;
					МенеджерЗаписи.Заказ = Заказ;  				
					
					МенеджерЗаписи.status = Статус;
					МенеджерЗаписи.substatus = Подстатус; 
					
					Попытка
						МенеджерЗаписи.Записать(Истина);	
					Исключение
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
					КонецПопытки;
					
				КонецЦикла;                   
				
			КонецЕсли;
			
		Иначе
			ЗаписьЖурналаРегистрации("Не удалось обновить статусы заказов!", УровеньЖурналаРегистрации.Ошибка);
		КонецЕсли;	
		
	КонецЦикла;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 18.12.2023 УА #63805

//+ ИнфоСофт Сумин Д.В. 15.04.2023 УА #57537
Функция ПолучитьТекстЗапросаСборочныхЗаданий() Экспорт
	
	//+ ИнфоСофт Стояк Ю.К. 30.01.2024 УА #66678	
	Текст = 
	"ВЫБРАТЬ
	|	ДокументИС_ЯМ_Заказ.Ссылка КАК Ссылка,
	|	ДокументИС_ЯМ_Заказ.Заказ КАК Заказ1C
	|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ КАК ДокументИС_ЯМ_Заказ
	//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #78004
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
	|		ПО (ДокументИС_ЯМ_Заказ.Ссылка = ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ)
	|			И (ДокументИС_ЯМ_Заказ.Профиль = &Профиль)
    //- ИнфоСофт Конышев А.Е. 12.12.24 УА #78004
	|ГДЕ
	|	ДокументИС_ЯМ_Заказ.Профиль = &Профиль
	//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #78004
	|	И &ВсеОтправления
    |
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДокументИС_ЯМ_Заказ.Ссылка КАК Ссылка,
	|	ДокументИС_ЯМ_Заказ.Заказ КАК Заказ1C
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ КАК ДокументИС_ЯМ_Заказ
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
	|		ПО (ДокументИС_ЯМ_Заказ.Ссылка = ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ)
	|			И (ДокументИС_ЯМ_Заказ.Профиль = &Профиль)
	|ГДЕ
	|	ДокументИС_ЯМ_Заказ.Профиль = &Профиль
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status В(&Статусы)
	//- ИнфоСофт Конышев А.Е. 12.12.24 УА #78004
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка КАК Заказ,	
	|	ПередачаТоваровХранителю.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ_РеализацииВсе
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ВТ_ОсновныеДанные.Заказ1C = ПередачаТоваровХранителю.ЗаказКлиента
	|			И (НЕ ВТ_ОсновныеДанные.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка,	
	|	ПередачаТоваровХранителюТовары.Ссылка
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО ВТ_ОсновныеДанные.Заказ1C = ПередачаТоваровХранителюТовары.ЗаказКлиента
	|			И (НЕ ВТ_ОсновныеДанные.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка,	
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_ОсновныеДанные.Заказ1C = РеализацияТоваровУслуг.ЗаказКлиента
	|			И (НЕ ВТ_ОсновныеДанные.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка,	
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_ОсновныеДанные.Заказ1C = РеализацияТоваровУслугТовары.ЗаказКлиента
	|			И (НЕ ВТ_ОсновныеДанные.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Заказ КАК Заказ,
	|	МАКСИМУМ(ВТ_Реализации.Реализация) КАК Реализация,
	|	СУММА(1) КАК Количество	
	|ПОМЕСТИТЬ ВТ_РТУ_Группировка
	|ИЗ
	|	ВТ_РеализацииВсе КАК ВТ_Реализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Заказ	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//+ ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ВТ_РасходныеОрдера
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|	ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = ВТ_ОсновныеДанные.Заказ1C
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//- ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ВТ_РасходныеОрдера.Ссылка) КАК Ссылка,
	|	ВТ_РасходныеОрдера.Распоряжение КАК Распоряжение,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_РасходныеОрдераКоличество
	|ИЗ
	|	ВТ_РасходныеОрдера КАК ВТ_РасходныеОрдера
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасходныеОрдера.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
    |ВЫБРАТЬ
	|	ДокументИС_ЯМ_Заказ.Ссылка КАК Ссылка,
	|	ДокументИС_ЯМ_Заказ.ПометкаУдаления КАК ПометкаУдаления,
	|	ДокументИС_ЯМ_Заказ.Номер КАК Номер,
	|	ДокументИС_ЯМ_Заказ.Дата КАК Дата,
	|	ДокументИС_ЯМ_Заказ.Проведен КАК Проведен,
	|	ДокументИС_ЯМ_Заказ.itemsTotal КАК itemsTotal,
	|	ДокументИС_ЯМ_Заказ.total КАК total,
	|	ДокументИС_ЯМ_Заказ.cancelRequested КАК cancelRequested,
	|	ДокументИС_ЯМ_Заказ.Профиль КАК Профиль,
	|	ДокументИС_ЯМ_Заказ.Заказ КАК Заказ,
	|	ДокументИС_ЯМ_Заказ.serviceName КАК serviceName,
	|	ДокументИС_ЯМ_Заказ.price КАК price,
	|	ДокументИС_ЯМ_Заказ.type КАК type,
	|	ДокументИС_ЯМ_Заказ.Склад КАК Склад,
	|	ДокументИС_ЯМ_Заказ.МоментВремени КАК МоментВремени,
	|	ДокументИС_ЯМ_Заказ.shipmentDate КАК shipmentDate,
	|	ВЫБОР
	|		КОГДА ВТ_РТУ_Группировка.Количество > 1
	|			ТОГДА ""РТУ несколько""
	|		ИНАЧЕ ВТ_РТУ_Группировка.Реализация
	|	КОНЕЦ КАК Реализация,
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|	ВЫБОР
	|		КОГДА ВТ_РасходныеОрдераКоличество.Ссылка ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ВТ_РасходныеОрдераКоличество.Количество = 1
	|			ТОГДА ВТ_РасходныеОрдераКоличество.Ссылка
	|		ИНАЧЕ ""Список ордеров""
	|	КОНЕЦ КАК РасходныйОрдер,
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.status КАК status,
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.substatus КАК substatus,
	//+ ИнфоСофт Тимофеева А.А. 04.09.2025 УА #79192 
	|	ВЫБОР        
	|		КОГДА ДокументИС_ЯМ_Заказ.Заказ.Проведен
	|			ТОГДА 3
	|		КОГДА НЕ ДокументИС_ЯМ_Заказ.Заказ.Проведен
	|			ТОГДА 1
	|       ИНАЧЕ 4
	|	КОНЕЦ КАК СтатусПроведенияЗаказа
	//- ИнфоСофт Тимофеева А.А. 04.09.2025 УА #79192
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ КАК ДокументИС_ЯМ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ_Группировка КАК ВТ_РТУ_Группировка
	|		ПО ДокументИС_ЯМ_Заказ.Ссылка = ВТ_РТУ_Группировка.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
	|		ПО ДокументИС_ЯМ_Заказ.Ссылка = ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ
	|			И ДокументИС_ЯМ_Заказ.Профиль = ИС_ЯМ_СтатусыСборочныхЗаданий.Профиль
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ПО ДокументИС_ЯМ_Заказ.Ссылка = ВТ_ОсновныеДанные.Ссылка
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныеОрдераКоличество КАК ВТ_РасходныеОрдераКоличество
	|		ПО ДокументИС_ЯМ_Заказ.Заказ = ВТ_РасходныеОрдераКоличество.Распоряжение
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|ГДЕ
	|	ДокументИС_ЯМ_Заказ.Профиль = &Профиль";
	//- ИнфоСофт Стояк Ю.К. 30.01.2024 УА #66678
	
	Возврат Текст;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 15.04.2023 УА #57537

//+ ИнфоСофт Сумин Д.В. 13.02.2024 УА #69650
Функция ПрикрепитьКиз(Профиль, НомерОтправления, МассивItems) Экспорт 
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	КампанияID = Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=0");
		
	//+ ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514	
	//СтруктураЭлементов = Новый Структура("items", МассивItems);
	//
	//МассивДанных = Новый Массив();
	//МассивДанных.Добавить(СтруктураЭлементов);
	//
	//ДанныеЗапроса = Новый Структура("boxes", МассивДанных);
	ДанныеЗапроса = Новый Структура("boxes", МассивItems);
	//- ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514
	
	Результат = ИС_ЯМ_API.ПрикрепитьКиз(Профиль, ПараметрыЗапроса, КампанияID, НомерОтправления, ДанныеЗапроса);
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Сумин Д.В. 13.02.2024 УА #69650

//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
Функция ПолучитьСписокПараметровЗаказов() Экспорт

	Результат = Новый Массив;
	
	Результат.Добавить("МодельРаботы");
	//+ ИнфоСофт Власова И.С. 06.02.25 УА #83194
	Результат.Добавить("ЗаполнятьЦеныСУчетомСкидок");
	//+ ИнфоСофт Власова И.С. 06.02.25 УА #83194

    Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277

//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
Функция ПолучитьСтруктуруПараметровЗаказов() Экспорт

	Результат = Новый Структура;
	
	Результат.Вставить("МодельРаботы", Перечисления.ИС_МП_МодельРаботы.FBS);
	//+ ИнфоСофт Власова И.С. 06.02.25 УА #83194
	Результат.Вставить("ЗаполнятьЦеныСУчетомСкидок", Ложь);
	//+ ИнфоСофт Власова И.С. 06.02.25 УА #83194
	
    Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277

//+ ИнфоСофт Стояк Ю.К. 04.12.2024 УА #73043
Функция ИзменитьДатуДоставкиДБС(Профиль, МассивЗаданий, НоваяДата, ПричинаПереноса) Экспорт
	
	Событие = "ИзменитьДатуДоставкиДБС";
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнен Профиль. Загрузка товаров невозможна");
		Возврат Неопределено;
	КонецЕсли;
		
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения); 
	
	КампанияID = Формат(НастройкиСоединения["ЯМКампанияID"], "ЧГ=0"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_ЯМ_Заказ.Номер КАК Номер,
		|	ИС_ЯМ_СтатусыСборочныхЗаданий.status КАК status
		|ИЗ
		|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
		|		ПО ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ = ИС_ЯМ_Заказ.Ссылка
		|ГДЕ
		|	ИС_ЯМ_Заказ.Ссылка В(&МассивЗаданий)
		|	И (ИС_ЯМ_СтатусыСборочныхЗаданий.status = ЗНАЧЕНИЕ(Перечисление.ИС_ЯМ_СтатусыЗаказов.PROCESSING)
		|			ИЛИ ИС_ЯМ_СтатусыСборочныхЗаданий.status = ЗНАЧЕНИЕ(Перечисление.ИС_ЯМ_СтатусыЗаказов.DELIVERY))";
	
	Запрос.УстановитьПараметр("МассивЗаданий", МассивЗаданий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблизаЗаказов = РезультатЗапроса.Выгрузить();                   
	
	Дата = Строка(Формат(НоваяДата, "ДФ=гггг-ММ-дд")); 
	
	Для Каждого Задание Из ТаблизаЗаказов Цикл 
		
		Тело = Новый Структура;
		Даты = Новый Массив;
		
		СтруктураДаты = Новый Структура("toDate", Дата);
		Даты.Добавить(СтруктураДаты);
		
		Тело.Вставить("dates", Даты);                                 
		Тело.Вставить("reason", ПричинаПереноса);
		
		КодОтправления = СтрЗаменить(Задание.Номер, Символы.НПП, ""); 			
		
		Результат = ИС_ЯМ_API.ИзменитьДатуДоставкиДБС(Профиль, ПараметрыЗапроса, КампанияID, КодОтправления, Тело);
		
		Если ЗначениеЗаполнено(Результат) Тогда
			
			Если Результат.status = "ERROR" Тогда			
				ОбщегоНазначения.СообщитьПользователю("Не удалось обновить дату доставки заказа: " + КодОтправления);
			КонецЕсли;
		Иначе
			ЗаписьЖурналаРегистрации("Не удалось обновить дату доставки заказа!", УровеньЖурналаРегистрации.Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.12.2024 УА #73043

//+ ИнфоСофт Сумин Д.В. 26.04.2023 УА #58166
Функция СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, Заказ = Неопределено)
	
	Событие = "СоздатьИлиДополнитьЗаказУТ11_5";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005
	"ВЫБРАТЬ
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ИС_ЯМ_СоответствиеХарактеристик.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Знаменатель
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	ИС_ЯМ_Заказitems.Ссылка.Дата КАК Дата,
	|	ИС_ЯМ_Заказitems.Ссылка.Номер КАК Номер,
	|	ИС_ЯМ_Заказitems.Ссылка.Склад КАК Склад,
	|	ИС_ЯМ_Заказitems.НоменклатураЯМ КАК НоменклатураЯМ,
	|	ИС_ЯМ_Заказitems.ШтрихкодЯМ КАК ШтрихкодЯМ,
	|	ИС_ЯМ_Заказitems.Ссылка.Склад.Склад КАК СкладУТ,
	|	ИС_ЯМ_Заказitems.Ссылка.Склад.ВыгружатьОстаткиИзГруппыСкладов КАК СкладВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_ЯМ_Заказitems.Ссылка.Склад.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_ЯМ_Заказitems.Ссылка.Склад.АдресДоставки КАК АдресДоставки,
	|	ИС_ЯМ_Заказitems.Ссылка.Склад.СпособДоставки КАК СпособДоставки,
	|	ИС_ЯМ_Заказitems.Ссылка.Склад.ЗонаДоставки КАК ЗонаДоставки,	
	|	ИС_ЯМ_Заказitems.Ссылка.Склад.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ИС_ЯМ_Заказitems.Ссылка.Склад.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	ИС_ЯМ_Заказitems.Ссылка.Склад.Грузополучатель КАК Грузополучатель,
	|	ИС_ЯМ_Заказitems.Ссылка.Склад.Грузоотправитель КАК Грузоотправитель,
	|	ИС_ЯМ_Заказitems.Ссылка.Склад.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	ИС_ЯМ_Заказitems.price КАК price,
	|	ИС_ЯМ_Заказitems.count КАК quantity,
	|	ИС_ЯМ_Заказitems.shipmentDate КАК shipmentDate
	|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ.items КАК ИС_ЯМ_Заказitems
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ПО ИС_ЯМ_Заказitems.НоменклатураЯМ = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ
	|			И ИС_ЯМ_Заказitems.НоменклатураЯМ.Профиль = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль
	|ГДЕ
	|	ИС_ЯМ_Заказitems.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ОсновныеДанные.Характеристика КАК Характеристика,
	|	ВТ_ОсновныеДанные.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВТ_ОсновныеДанные.Дата КАК Дата,
	|	ВТ_ОсновныеДанные.Номер КАК Номер,
	|	ВТ_ОсновныеДанные.Склад КАК Склад,
	|	ВТ_ОсновныеДанные.НоменклатураЯМ КАК НоменклатураЯМ,
	|	ВТ_ОсновныеДанные.ШтрихкодЯМ КАК ШтрихкодЯМ,
	|	ВТ_ОсновныеДанные.СкладУТ КАК СкладУТ,
	|	ВТ_ОсновныеДанные.СкладВыгружатьОстаткиИзГруппыСкладов КАК СкладВыгружатьОстаткиИзГруппыСкладов,
	|	ВТ_ОсновныеДанные.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов, 
	|	ВТ_ОсновныеДанные.АдресДоставки КАК АдресДоставки,
	|	ВТ_ОсновныеДанные.СпособДоставки КАК СпособДоставки,
	|	ВТ_ОсновныеДанные.ЗонаДоставки КАК ЗонаДоставки,	
	|	ВТ_ОсновныеДанные.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ВТ_ОсновныеДанные.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	ВТ_ОсновныеДанные.Грузополучатель КАК Грузополучатель,
	|	ВТ_ОсновныеДанные.Грузоотправитель КАК Грузоотправитель,
	|	ВТ_ОсновныеДанные.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	ВТ_ОсновныеДанные.price КАК price,
	|	ВТ_ОсновныеДанные.quantity КАК quantity,
	|	ВТ_ОсновныеДанные.shipmentDate КАК shipmentDate,
	|	ВТ_ОсновныеДанные.Упаковка КАК Упаковка,
	|	ВТ_ОсновныеДанные.КоэффициентУпаковки КАК КоэффициентУпаковки
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные";
	//- ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005
	
	Запрос.УстановитьПараметр("Ссылка", СборочноеЗадание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Заказ = Неопределено Тогда
		НовыйДокумент = Документы.ЗаказКлиента.СоздатьДокумент();
	Иначе
		НовыйДокумент = Заказ.ПолучитьОбъект();
	КонецЕсли;
	
	ГруппаСкладов = СборочноеЗадание.Склад.ОбщаяГруппаСкладов;	
	Организация = ФукнциональныеОпции.Организация; 
	Партнер = ФукнциональныеОпции.ПартнерЯМ; 
	Соглашение = ФукнциональныеОпции.СоглашениеЯМ;
	Контрагент = ФукнциональныеОпции.КонтрагентЯМ;
	Договор = ФукнциональныеОпции.ДоговорЯМ;
	
	ПродажаОблагаетсяНДС = ИС_MP_Сервер.ПолучитьПрименениеНДСОрганизации(Организация);
	СтруктураСтатусов = ИС_MP_Сервер.ПолучитьЗначенияСтатусовЗаказа(); 
	
	Если Заказ = Неопределено Тогда					
		
		Если ФукнциональныеОпции.РежимСозданияЗаказовЯМ = 2 Тогда
			НовыйДокумент.Дата = ТекущаяДатаСеанса();
		Иначе
			НовыйДокумент.Дата = СборочноеЗадание.Дата;
		КонецЕсли;
		
		НовыйДокумент.Заполнить(Партнер);
		
		НовыйДокумент.Организация = Организация;
		НовыйДокумент.Подразделение = ФукнциональныеОпции.ПодразделениеЯМ; 
		
		НовыйДокумент.Партнер = Партнер;
		НовыйДокумент.Контрагент = Контрагент;      
		
		НовыйДокумент.НеОтгружатьЧастями = Ложь;
		//+ ИнфоСофт Сумин Д.В. 22.11.2023 УА #61641
		//Если Соглашение.ИспользуютсяДоговорыКонтрагентов Тогда
		//	НовыйДокумент.Договор = Договор;
		//	НовыйДокумент.Соглашение = Соглашение;
		//	НовыйДокумент.ПорядокРасчетов = Договор.ПорядокРасчетов;
		//Иначе
		//	НовыйДокумент.Соглашение = Соглашение;
		//	НовыйДокумент.ПорядокРасчетов = Соглашение.ПорядокРасчетов;
		//КонецЕсли;
		//- ИнфоСофт Сумин Д.В. 22.11.2023 УА #61641
		Если ЗначениеЗаполнено(ГруппаСкладов) И ФукнциональныеОпции.РежимСозданияЗаказовЯМ = 2 Тогда
			НовыйДокумент.Склад = ГруппаСкладов; 
		Иначе
			НовыйДокумент.Склад = СборочноеЗадание.Склад.Склад;  
		КонецЕсли; 		 
		
		Если ЗначениеЗаполнено(ФукнциональныеОпции.СтатусЗаказаЯМ) Тогда
            НовыйДокумент.Статус = ФукнциональныеОпции.СтатусЗаказаЯМ; 
		Иначе
			НовыйДокумент.Статус = СтруктураСтатусов.СтатусЗаказа; 
		КонецЕсли;
		
		НовыйДокумент.Приоритет = ФукнциональныеОпции.ПриоритетЗаказаЯМ;
		
		НовыйДокумент.ЦенаВключаетНДС = Соглашение.ЦенаВключаетНДС;
		
		//+ ИнфоСофт Сумин Д.В. 22.11.2023 УА #61641
		ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
		
		Если ИспользоватьСоглашенияСКлиентами Тогда
			НовыйДокумент.ПорядокРасчетов 	= Соглашение.ПорядокРасчетов;
			НовыйДокумент.Менеджер 			= Соглашение.Менеджер;
			НовыйДокумент.Валюта 			= Соглашение.Валюта;
			//+ ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
			Если ЗначениеЗаполнено(Соглашение.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Соглашение.НаправлениеДеятельности;            
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
		Иначе
			НовыйДокумент.Менеджер 			= Договор.Менеджер;
			НовыйДокумент.Валюта 			= Договор.ВалютаВзаиморасчетов;
			НовыйДокумент.ПорядокРасчетов 	= Договор.ПорядокРасчетов;
			//+ ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
			Если ЗначениеЗаполнено(Договор.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Договор.НаправлениеДеятельности;            
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
		КонецЕсли; 
		
		НовыйДокумент.Договор = Договор;
		НовыйДокумент.Соглашение = Соглашение;
		//Если ЗначениеЗаполнено(Соглашение) Тогда
		//	НовыйДокумент.Валюта = Соглашение.Валюта;
		//ИначеЕсли ЗначениеЗаполнено(Договор) Тогда
		//	НовыйДокумент.Валюта = Договор.ВалютаВзаиморасчетов;
		//Иначе
		//	НовыйДокумент.Валюта = Справочники.Валюты.НайтиПоКоду("643");
		//КонецЕсли;	 
		//- ИнфоСофт Сумин Д.В. 22.11.2023 УА #61641
		
		
		//+ ИнфоСофт Стояк Ю.К. 28.09.2023 УА #61974		
		Если ЗначениеЗаполнено(Договор) Тогда
			НовыйДокумент.ХозяйственнаяОперация = Договор.ХозяйственнаяОперация;	
		ИначеЕсли ЗначениеЗаполнено(Соглашение) Тогда                                                                       
			НовыйДокумент.ХозяйственнаяОперация = Соглашение.ХозяйственнаяОперация;	
		КонецЕсли;	
		//- ИнфоСофт Стояк Ю.К. 28.09.2023 УА #61974
		
		//+ ИнфоСофт Заварин К.В. 05.12.24 УА #79415 
		Если ЗначениеЗаполнено(Соглашение) И Не Соглашение.ИспользуютсяДоговорыКонтрагентов Тогда 
			
			Если ЗначениеЗаполнено(Соглашение.ГруппаФинансовогоУчета) Тогда
				НовыйДокумент.ГруппаФинансовогоУчета 			= Соглашение.ГруппаФинансовогоУчета;            
			КонецЕсли;
			Если ЗначениеЗаполнено(Соглашение.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Соглашение.НаправлениеДеятельности;            
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Договор) Тогда 
			
			Если ЗначениеЗаполнено(Договор.ГруппаФинансовогоУчета) Тогда
				НовыйДокумент.ГруппаФинансовогоУчета 			= Договор.ГруппаФинансовогоУчета;            
			КонецЕсли;
			Если ЗначениеЗаполнено(Договор.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Договор.НаправлениеДеятельности;            
			КонецЕсли;
	
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 05.12.24 УА #79415
		
		Если ФукнциональныеОпции.РежимСозданияЗаказовЯМ = 0 Тогда
			НовыйДокумент.Комментарий = "Создан на основание заказа ЯМ "; 
		Иначе
			НовыйДокумент.Комментарий = "Создан на основание заказов ЯМ ";
		КонецЕсли;
		
		Если ПродажаОблагаетсяНДС = Неопределено Тогда
			ВызватьИсключение("Не заполнена учетная политика организации");
		КонецЕсли;
		
		Если ПродажаОблагаетсяНДС Тогда
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;			
		Иначе
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
		КонецЕсли;	
		
	КонецЕсли;
		
	Номер = СтрЗаменить(СборочноеЗадание.Номер, Символы.НПП, "");  
	//+ ИнфоСофт Стояк Ю.К. 13.07.2023 УА #60690
	//+ ИнфоСофт Мурсалимов Д.Р. 16.10.23 УА #63410
	//Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Организация, СборочноеЗадание.Дата); 
	//Попытка
	//	НовыйДокумент.Руководитель = Справочники.ОтветственныеЛицаОрганизаций.НайтиПоРеквизиту("ФизическоеЛицо", Руководители.Руководитель); 
	//	НовыйДокумент.ГлавныйБухгалтер = Справочники.ОтветственныеЛицаОрганизаций.НайтиПоРеквизиту("ФизическоеЛицо", Руководители.ГлавныйБухгалтер);
	//Исключение
	//	Текст = "Не удалось получить ответственные лица организации!";
	//	ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	//КонецПопытки;
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Дата", НовыйДокумент.Дата);
	Отбор.Вставить("Организация", Организация);
	ТЗОтветственныеЛицаОрг = ОтветственныеЛицаСервер.ПолучитьТаблицуОтветственныхЛицПоОтбору(Отбор);
	
	//+ ИнфоСофт Заварин К.В. 09.11.24 УА #74003
	НовыйДокумент.Руководитель = "";
	НовыйДокумент.ГлавныйБухгалтер = "";
	//- ИнфоСофт Заварин К.В. 09.11.24 УА #74003
	
	Для Каждого Результат Из ТЗОтветственныеЛицаОрг Цикл
		
		//+ ИнфоСофт Заварин К.В. 09.11.24 УА #74003
		Если Строка(Результат.ОтветственноеЛицо) = "Руководитель" Тогда
			НовыйДокумент.Руководитель = Результат.Ссылка;
		ИначеЕсли Строка(Результат.ОтветственноеЛицо) = "Главный бухгалтер" Тогда
			НовыйДокумент.ГлавныйБухгалтер = Результат.Ссылка;
		КонецЕсли;
		//Если Результат.ОтветственноеЛицо = "Руководитель" Тогда
		//	НовыйДокумент.Руководитель = Результат.ОтветственноеЛицо;
		//ИначеЕсли Результат.ОтветственноеЛицо = "ГлавныйБухгалтер" Тогда
		//	НовыйДокумент.ГлавныйБухгалтер = Результат.ОтветственноеЛицо;
		//КонецЕсли;  
		//- ИнфоСофт Заварин К.В. 09.11.24 УА #74003 
		
	КонецЦикла;
	//- ИнфоСофт Мурсалимов Д.Р. 16.10.23 УА #63410
	
	//+ ИнфоСофт Заварин К.В. 12.12.24 УА #89604
	Если ЗначениеЗаполнено(Договор) Тогда
		НовыйДокумент.БанковскийСчет = "";
		НовыйДокумент.БанковскийСчет = Договор.БанковскийСчет;		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 12.12.24 УА #89604
	
	НовыйДокумент.НомерПоДаннымКлиента = Число(СборочноеЗадание.Номер);
	НовыйДокумент.ДатаПоДаннымКлиента = СборочноеЗадание.Дата;
	//- ИнфоСофт Стояк Ю.К. 13.07.2023 УА #60690
	НовыйДокумент.Комментарий = СтрШаблон("%1%2; ", НовыйДокумент.Комментарий, Номер);  
	
	НовыйДокумент.Менеджер = НовыйДокумент.Договор.Менеджер;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	Назначения = Новый Массив;
	
	Если Метаданные.Перечисления.Найти("ТипыОбъектовНазначений") <> Неопределено Тогда
		
		ЗапросНазначений = Новый Запрос;
		ЗапросНазначений.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
		|ИЗ
		|	Справочник.ИС_ЯМ_Склады.НаправленияДеятельности КАК ИС_ЯМ_СкладыНаправленияДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|		ПО ИС_ЯМ_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности
		|			И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|ГДЕ
		|	ИС_ЯМ_СкладыНаправленияДеятельности.Ссылка = &Ссылка
		|	И Назначения.ТипОбъектаНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовНазначений.НаправлениеДеятельности)";
		
		ЗапросНазначений.УстановитьПараметр("Ссылка", СборочноеЗадание.Склад);
		
		РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();		
		
		ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
		
		Пока ВыборкаНазначения.Следующий() Цикл	
			Назначения.Добавить(ВыборкаНазначения.Назначение);
		КонецЦикла;
	
	КонецЕсли;
	
	Если Назначения.Количество() = 0 Тогда		
		Назначения.Добавить(Справочники.Назначения.ПустаяСсылка());
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99444
	ПострочнаяОтгрузка = Константы.ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента.Получить();
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99444
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Номенклатура = NULL Тогда
			ОбщегоНазначения.СообщитьПользователю("Отсутствует сопоставление");
			Возврат Документы.ЗаказКлиента.ПустаяСсылка();
		КонецЕсли;
		
		Если Выборка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
			ЭтоНабор = Истина;
		Иначе 
			ЭтоНабор = Ложь;
		КонецЕсли;
		
		ТоварыЗаказа = Новый ТаблицаЗначений;
		ТоварыЗаказа.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТоварыЗаказа.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));  
		
		//+ ИнфоСофт Мурсалимов Д.Р. 26.08.24 УА #82005
		ТоварыЗаказа.Колонки.Добавить("Упаковка");
		//- ИнфоСофт Мурсалимов Д.Р. 26.08.24 УА #82005
		
		ТоварыЗаказа.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10, 0)));
		ТоварыЗаказа.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
		ТоварыЗаказа.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2))); 
		
		//+ ИнфоСофт Заварин К.В. 11.02.25 УА #93503
		ТоварыЗаказа.Колонки.Добавить("ОстатокНеСвободен", Новый ОписаниеТипов("Булево")); 
		//- ИнфоСофт Заварин К.В. 11.02.25 УА #93503
		
		СтрокаТовары = ТоварыЗаказа.Добавить();
		СтрокаТовары.Номенклатура = Выборка.Номенклатура;
		СтрокаТовары.Характеристика = Выборка.Характеристика;
		
		//+ ИнфоСофт Мурсалимов Д.Р. 26.08.24 УА #82005
		СтрокаТовары.Упаковка = Выборка.Упаковка;
		//- ИнфоСофт Мурсалимов Д.Р. 26.08.24 УА #82005
		
		СтрокаТовары.Количество = Выборка.quantity;
		СтрокаТовары.Цена = Выборка.price;
		СтрокаТовары.Сумма = Выборка.price * Выборка.quantity;
		
		Если ЭтоНабор Тогда
			
			//+ ИнфоСофт Мурсалимов Д.Р. 28.05.24 УА #76561
			//ТоварыЗаказаТЗ = ПолучитьТаблицуТоваровНабора(ТоварыЗаказа);
			ТоварыЗаказаТЗ = ИС_MP_РаботаСЗаказами.ПолучитьТаблицуТоваровНабора(ТоварыЗаказа);
			//- ИнфоСофт Мурсалимов Д.Р. 28.05.24 УА #76561
			
			МассивКоэфф = ИС_WB_СерверУТ11_5.РассчитатьДолюСтоимости(ТоварыЗаказаТЗ, ФукнциональныеОпции.ЯндексВидЦеныСоСкидкой, НовыйДокумент.Дата);
			Если ТоварыЗаказаТЗ[0].ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям Тогда				
				СуммаПродажиПриДолях = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТоварыЗаказаТЗ[0].Сумма, ТоварыЗаказаТЗ.ВыгрузитьКолонку("ДоляСтоимости"));
			ИначеЕсли МассивКоэфф <> Неопределено Тогда
				СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТоварыЗаказаТЗ[0].Сумма, МассивКоэфф);
			КонецЕсли;                                  
			
		Иначе 
			ТоварыЗаказаТЗ = ТоварыЗаказа;
		КонецЕсли;                                  
		
		//+ ИнфоСофт Стояк Ю.К. 13.07.2023 УА #60690	
		Если ЗначениеЗаполнено(ГруппаСкладов) Тогда
			
			НовыйДокумент.Склад = ГруппаСкладов;
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083			
			//РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, ГруппаСкладов);
			РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, ГруппаСкладов, Назначения);
			//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
			СтрокаРезультат = РезультатПроверки[0];			
			Если СтрокаРезультат.ОстатокВНаличии Тогда
				СкладСОстатком = СтрокаРезультат.Склад;
			Иначе 
				СкладСОстатком = Выборка.СкладУТ;
			КонецЕсли;
			
		//+ ИнфоСофт Заварин К.В. 02.04.25 УА #97851
		ИначеЕсли Выборка.Склад.ИспользоватьОсновнойСкладВЗаказах Тогда
			
			Если ЗначениеЗаполнено(СборочноеЗадание.Склад.Склад) Тогда
				НовыйДокумент.Склад = СборочноеЗадание.Склад.Склад;
			Иначе
				НовыйДокумент.Склад = Выборка.Склад.ГруппаСкладов[0].Склад;
			КонецЕсли;
			
			СкладСОстатком = НовыйДокумент.Склад;
			
			РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, СкладСОстатком, Назначения);
			
		//- ИнфоСофт Заварин К.В. 02.04.25 УА #97851
		
		ИначеЕсли Выборка.СкладВыгружатьОстаткиИзГруппыСкладов И ФукнциональныеОпции.РежимСозданияЗаказовЯМ <> 2 Тогда
			
			Склады = Выборка.Склад.ГруппаСкладов.ВыгрузитьКолонку("Склад");
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083			
			//РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, Склады);
			РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, Склады, Назначения);
			//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
			
			СкладСОстатком = Выборка.СкладУТ;
			
			Для Каждого Строка Из Выборка.Склад.ГруппаСкладов Цикл
				
				НайденныйСклад = РезультатПроверки.НайтиСтроки(Новый Структура("Склад", Строка.Склад));
				Если НайденныйСклад.Количество() > 0 Тогда
					
					Если НайденныйСклад[0].ОстатокВНаличии Тогда 
						СкладСОстатком = НайденныйСклад[0].Склад;
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			НовыйДокумент.Склад = СкладСОстатком;
			
		Иначе
			НовыйДокумент.Склад = Выборка.СкладУТ;
			СкладСОстатком = Выборка.СкладУТ;			
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083			
			//РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, СкладСОстатком);
			РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, СкладСОстатком, Назначения);
			//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083			
		КонецЕсли;
	    //- ИнфоСофт Стояк Ю.К. 13.07.2023 УА #60690
		//Если ЗначениеЗаполнено(ГруппаСкладов) И ФукнциональныеОпции.РежимСозданияЗаказовЯМ <> 2 Тогда 
		//	
		//	Если Выборка.ВыгружатьОстаткиИзГруппыСкладов Тогда
		//		
		//		Для Каждого ДопСклад Из Выборка.Склад.ГруппаСкладов Цикл			
		//			
		//			СтруктураПроверки = ИС_WB_СерверУТ11_5.ПроверитьОстаткиТваровНаСервере(ТоварыЗаказаТЗ, ДопСклад.Склад, Организация);
		//			
		//			Если СтруктураПроверки.КоличестваХватает Тогда
		//				СкладСОстатком = ДопСклад.Склад;
		//				НовыйДокумент.Склад = ДопСклад.Склад; 
		//				Прервать;
		//			КонецЕсли;
		//			
		//		КонецЦикла;		
		//		
		//	Иначе
		//		
		//		СтруктураПроверки = ИС_WB_СерверУТ11_5.ПроверитьОстаткиТваровНаСервере(ТоварыЗаказаТЗ, Выборка.СкладУТ, Организация);
		//		
		//		Если СтруктураПроверки.КоличестваХватает Тогда
		//			СкладСОстатком = Выборка.СкладУТ;
		//			НовыйДокумент.Склад = Выборка.СкладУТ;
		//		КонецЕсли;	
		//		
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
		//+ ИнфоСофт Заварин К.В. 16.09.24 УА #83741		
		Если ЗначениеЗаполнено(Выборка.shipmentDate) Тогда
			ДатаОтгрузки = Выборка.shipmentDate;		
		Иначе                                                 
			ДатаОтгрузки = ТекущаяДатаСеанса();
		КонецЕсли;			
		//- ИнфоСофт Заварин К.В. 16.09.24 УА #83741
		
		//+ ИнфоСофт Заварин К.В. 02.04.25 УА #97851
		//+ ИнфоСофт Заварин К.В. 31.01.25 УА #88005
		//Если Выборка.Склад.ИспользоватьОсновнойСкладВЗаказах Тогда
		//	Если ЗначениеЗаполнено(СборочноеЗадание.Склад.Склад) Тогда
		//		НовыйДокумент.Склад = СборочноеЗадание.Склад.Склад;
		//	Иначе
		//		НовыйДокумент.Склад = Выборка.Склад.ГруппаСкладов[0].Склад;
		//	КонецЕсли;	
		//КонецЕсли;			
		//- ИнфоСофт Заварин К.В. 30.01.25 УА #88005
		//- ИнфоСофт Заварин К.В. 02.04.25 УА #97851
		
		Для Каждого Элемент Из ТоварыЗаказаТЗ Цикл
			
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			
			//+ ИнфоСофт Заварин К.В. 12.02.25 УА #93503
			//Если ЭтоНабор Тогда
			Если ЭтоНабор И Не Элемент.ОстатокНеСвободен Тогда
			//- ИнфоСофт Заварин К.В. 12.02.25 УА #93503
				
				НоваяСтрока.НоменклатураНабора = Элемент.Набор;
				
				//+ ИнфоСофт Мурсалимов Д.Р. 28.05.24 УА #76561
				НоваяСтрока.ХарактеристикаНабора = Элемент.ХарактеристикаНабора;
				//- ИнфоСофт Мурсалимов Д.Р. 28.05.24 УА #76561
				
				Если Элемент.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям Тогда
					Элемент.Сумма = СуммаПродажиПриДолях[0];
					СуммаПродажиПриДолях.Удалить(0);	
				Иначе					
					
					Если МассивКоэфф = Неопределено Тогда
						ОбщегоНазначения.СообщитьПользователю("Проверьте наличие цены на набор/его комплектующие " + Элемент.Набор);
						Элемент.Сумма = Элемент.Сумма / Элемент.КоличествоОбщее;
					Иначе
						Элемент.Сумма = СуммыПродажи[0];
						СуммыПродажи.Удалить(0);
					КонецЕсли;
					
				КонецЕсли;
				
				Элемент.Цена = Элемент.Сумма / Элемент.Количество;
				
			КонецЕсли;
			
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;
			НоваяСтрока.Характеристика = Элемент.Характеристика;
			
			//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
			СтрокаСОстатком = РезультатПроверки.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад", Элемент.Номенклатура, Элемент.Характеристика, СкладСОстатком));
			
			ЕстьОстаток = ?(СтрокаСОстатком.Количество() > 0, СтрокаСОстатком[0].ОстатокВНаличии, Ложь);
			
			//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
			ИспользованВариантОбеспеченияПриНехватке = Ложь;
			//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
			
			//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99444
			Если Не ПострочнаяОтгрузка И НовыйДокумент.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению") Тогда				
				НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;								
			ИначеЕсли Не ПострочнаяОтгрузка 
				И НовыйДокумент.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОтгрузке") Тогда
				НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;				
			//Если Не ЕстьОстаток И ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияПриНехваткеЯМ) Тогда
			ИначеЕсли Не ЕстьОстаток И ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияПриНехваткеЯМ) Тогда
			//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99444							
				НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспеченияПриНехваткеЯМ;
				//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
				ИспользованВариантОбеспеченияПриНехватке = Истина;
				//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
			Иначе
				//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
				Если ФукнциональныеОпции.РежимСозданияЗаказовЯМ = 2 Тогда	
					Если ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияЯМ) Тогда  
						НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспеченияЯМ;	
					Иначе
						НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
					КонецЕсли;				
				Иначе 
					Если ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияЯМ) Тогда  
						НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспеченияЯМ;	
					Иначе
						НоваяСтрока.ВариантОбеспечения = СтруктураСтатусов.СтатусСтроки;	
					КонецЕсли;	
				КонецЕсли;
				
				//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801				
			КонецЕсли;                                      
			//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
			
			//+ ИнфоСофт Заварин К.В. 12.02.25 УА #93503
			Если ФукнциональныеОпции.ЯндексОтделятьТоварыПриНехватке Тогда
				
				Если Не Элемент.ОстатокНеСвободен Тогда
					
					Если ЕстьОстаток И Элемент.Количество > СтрокаСОстатком[0].Свободно  Тогда			
						
						СтрокаТоварыЗаказаТЗСвободные = ТоварыЗаказаТЗ.Добавить();
						
						ЗаполнитьЗначенияСвойств(СтрокаТоварыЗаказаТЗСвободные, Элемент);
						СтрокаТоварыЗаказаТЗСвободные.Количество 	 	 = Элемент.Количество - СтрокаСОстатком[0].Свободно;
						СтрокаТоварыЗаказаТЗСвободные.Сумма 	 	 	 = Элемент.Сумма - Элемент.Цена * СтрокаСОстатком[0].Свободно; 
						СтрокаТоварыЗаказаТЗСвободные.ОстатокНеСвободен  = Истина;
						
						Элемент.Сумма = Элемент.Цена * СтрокаСОстатком[0].Свободно;
						Элемент.Количество = СтрокаСОстатком[0].Свободно;
						
					КонецЕсли;	
					
				КонецЕсли;
				
				Если Элемент.ОстатокНеСвободен И ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияПриНехваткеЯМ) Тогда
					НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспеченияПриНехваткеЯМ;	
				КонецЕсли;
				
			КонецЕсли;
			//- ИнфоСофт Заварин К.В. 11.02.25 УА #93503
			
			//+ ИнфоСофт Стояк Ю.К. 23.05.2024 УА #76351			
			//Если ФукнциональныеОпции.РежимСозданияЗаказовЯМ = 1 Тогда
			//	НоваяСтрока.Склад = Выборка.СкладУТ;
			//ИначеЕсли ЗначениеЗаполнено(ГруппаСкладов) Тогда
			//	НоваяСтрока.Склад = СкладСОстатком;		
			//Иначе
			//	НоваяСтрока.Склад = НовыйДокумент.Склад;
			//КонецЕсли;                                 		
			
			Если ЗначениеЗаполнено(ГруппаСкладов) Тогда
				НоваяСтрока.Склад = СкладСОстатком;		
			Иначе
				НоваяСтрока.Склад = НовыйДокумент.Склад;
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 23.05.2024 УА #76351
				
			
			НоваяСтрока.КоличествоУпаковок = Элемент.Количество;
			НоваяСтрока.Количество = Элемент.Количество;

			//+ ИнфоСофт Заварин К.В. 16.09.24 УА #83741
			//НоваяСтрока.ДатаОтгрузки = Выборка.shipmentDate;
			НоваяСтрока.ДатаОтгрузки = ДатаОтгрузки;
			//- ИнфоСофт Заварин К.В. 16.09.24 УА #83741
				
			Если ПродажаОблагаетсяНДС Тогда					
				
				НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС;
				
				НДС = ИС_MP_РаботаСЗаказами.ПолучитьПроцентНДС(Элемент.Номенклатура.СтавкаНДС);
				
				//+ ИнфоСофт Мурсалимов Д.Р. 24.01.25 УА #91921
				//Если НДС = 0 Или НДС = Неопределено Тогда
				//	НоваяСтрока.СуммаНДС = Элемент.Сумма;						
				//Иначе
				//	НоваяСтрока.СуммаНДС = ИС_MP_РаботаСЗаказами.РассчитатьСуммуНДС(Элемент.Сумма, НДС, Истина);						
				//КонецЕсли;                                     
				
				Если НДС = 0 Или НДС = Неопределено Тогда
					НоваяСтрока.СуммаНДС = 0;						
				Иначе
					НоваяСтрока.СуммаНДС = ИС_MP_РаботаСЗаказами.РассчитатьСуммуНДС(Элемент.Сумма, НДС, Истина);						
				КонецЕсли;
				//- ИнфоСофт Мурсалимов Д.Р. 24.01.25 УА #91921
				
				НоваяСтрока.Сумма = Элемент.Сумма;
				НоваяСтрока.СуммаСНДС = Элемент.Сумма;	
			Иначе 						
				НоваяСтрока.СуммаНДС = 0;
				НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
				НоваяСтрока.Сумма = Элемент.Сумма;
				НоваяСтрока.СуммаСНДС = Элемент.Сумма;	
			КонецЕсли;	
			
			НоваяСтрока.Цена = Элемент.Цена;
			
			//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			НоваяСтрока.Количество 	= Выборка.КоэффициентУпаковки * НоваяСтрока.Количество;
			НоваяСтрока.Упаковка 	= Элемент.Упаковка;
			//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005 
			
			//+ ИнфоСофт Заварин К.В. 25.11.24 УА #79380
			Если ФукнциональныеОпции.ЯМСоздатьЗаказНаСборку Тогда
				
				НовыйДокумент.Записать();
				ИС_MP_РаботаСЗаказами.ПроверкаНаличияКомплектов(Перечисления.ИС_МП_Маркетплейсы.ЯМ, НовыйДокумент, Выборка.Склад,,НоваяСтрока);
				НовыйДокумент = НовыйДокумент.ПолучитьОбъект();
				
			КонецЕсли;                                     
			//- ИнфоСофт Заварин К.В. 25.11.24 УА #79380
			
		КонецЦикла; 
		
	КонецЦикла;
	
	//+ ИнфоСофт Конышев А.Е. 03.12.24 УА #73126
	Если ЗначениеЗаполнено(ФукнциональныеОпции.ЯндексСтандартнаяДоставка) Тогда
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		НоваяСтрока.Номенклатура = ФукнциональныеОпции.ЯндексСтандартнаяДоставка;
		НоваяСтрока.КоличествоУпаковок = 1;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = СборочноеЗадание.price;
		НоваяСтрока.Сумма = НоваяСтрока.Цена;
		НоваяСтрока.ДатаОтгрузки = СборочноеЗадание.shipmentDate;
			
		Если ФукнциональныеОпции.РежимСозданияЗаказовЯМ = 2 Тогда	
			Если ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияЯМ) Тогда  
				НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспеченияЯМ;	
			Иначе
				НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
			КонецЕсли;				
		Иначе 
			Если ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияЯМ) Тогда  
				НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспеченияЯМ;	
			Иначе
				НоваяСтрока.ВариантОбеспечения = СтруктураСтатусов.СтатусСтроки;	
			КонецЕсли;	
		КонецЕсли;
			
		Если ПродажаОблагаетсяНДС Тогда					
			
			СтавкаНДС = ФукнциональныеОпции.ЯндексСтандартнаяДоставка.СтавкаНДС;
			НоваяСтрока.СтавкаНДС = СтавкаНДС;
			
			//+ ИнфоСофт Ивонин К.А. 22.01.25 УА #89159
			//НДС = ИС_WB_СерверУТ11_5.ПолучитьПроцентНДС(СтавкаНДС);
			НДС = ИС_WB_Сервер.ПолучитьПроцентНДС(СтавкаНДС);
			//- ИнфоСофт Ивонин К.А. 22.01.25 УА #89159
				
			Если НДС = 0 Или НДС = Неопределено Тогда
				НоваяСтрока.СуммаНДС = НоваяСтрока.Сумма;						
			Иначе
				НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.Сумма, НДС, Истина);						
			КонецЕсли;
				
			НоваяСтрока.Сумма = НоваяСтрока.Сумма;
			НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;	
		Иначе 						
			НоваяСтрока.СуммаНДС = 0;
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
			НоваяСтрока.Сумма = НоваяСтрока.Сумма;
			НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;	
		КонецЕсли;
	КонецЕсли;
	//- ИнфоСофт Конышев А.Е. 03.12.24 УА #73126
	
	//+ ИнфоСофт Заварин К.В. 16.09.24 УА #83741
	//НовыйДокумент.ДатаОтгрузки = Выборка.shipmentDate;
	НовыйДокумент.ДатаОтгрузки = ДатаОтгрузки;
	//- ИнфоСофт Заварин К.В. 16.09.24 УА #83741 
		
	//+ ИнфоСофт Мурсалимов Д.Р. 15.11.23 УА #66213
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах") Тогда
		НовыйДокумент.СкидкиРассчитаны = Истина;
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 15.11.23 УА #66213
	
	Если ЗначениеЗаполнено(Выборка.СпособДоставки) Тогда
		НовыйДокумент.СпособДоставки = Выборка.СпособДоставки; 
	Иначе
		НовыйДокумент.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;	
	КонецЕсли;
	
	НовыйДокумент.ЗонаДоставки = Выборка.ЗонаДоставки;
	
	Если ЗначениеЗаполнено(Выборка.АдресДоставки) Тогда
		НовыйДокумент.АдресДоставки = Выборка.АдресДоставки;
		НовыйДокумент.АдресДоставкиЗначение = Выборка.АдресДоставкиЗначение;	
		НовыйДокумент.АдресДоставкиЗначенияПолей = Выборка.АдресДоставкиЗначенияПолей;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Выборка.Грузополучатель) Тогда 
		НовыйДокумент.Грузополучатель = Выборка.Грузополучатель;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Грузоотправитель) Тогда
		НовыйДокумент.Грузоотправитель = Выборка.Грузоотправитель;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ПеревозчикПартнер) Тогда
		НовыйДокумент.ПеревозчикПартнер = Выборка.ПеревозчикПартнер;	
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	//+ ИнфоСофт Мурсалимов Д.Р. 12.03.24 УА #67173
	//Если ФукнциональныеОпции.ЯМСоздатьЗаказНаСборку Тогда
	//	
	//	НовыйДокумент.Записать();
	//	ИС_MP_РаботаСЗаказами.ПроверкаНаличияКомплектов(Перечисления.ИС_МП_Маркетплейсы.ЯМ, НовыйДокумент, Выборка.Склад);
	//	НовыйДокумент = НовыйДокумент.ПолучитьОбъект();
	//	
	//КонецЕсли;                                     
	//- ИнфоСофт Мурсалимов Д.Р. 12.03.24 УА #67173
	//- ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	
	ЗаписыватьДокумент = Ложь;
	Если ФукнциональныеОпции.ПроводитьЗаказыЯМ Тогда
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);		
		Исключение
			ЗаписыватьДокумент = Истина;
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
		
	Иначе
		ЗаписыватьДокумент = Истина;	
	КонецЕсли;

	Если ЗаписыватьДокумент Тогда	
		
		Попытка
			НовыйДокумент.Записать();			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
		
	КонецЕсли;
	
	//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
	Если ИспользованВариантОбеспеченияПриНехватке Тогда 
		Текст = СтрШаблон("%1 создан с использованием варианта обеспечения при нехватке товара", НовыйДокумент.Ссылка);    
    	ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст, УровеньЖурналаРегистрации.Информация);
	КонецЕсли;	
	//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
	
    Возврат НовыйДокумент.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 26.04.2023 УА #58166

//+ ИнфоСофт Сумин Д.В. 01.06.2023 УА #59231
Процедура ВыполнитьЗакрытиеЗаказов(Профиль)
	
	Событие = ПолучитьИмяСобытия("ВыполнитьЗакрытиеЗаказов");
	
	//+ ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);

	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Если ФукнциональныеОпции.ФормироватьЕдиныйЗаказБезРазбиенияЯМ
		И НЕ ФукнциональныеОпции.ИспользоватьРазбиениеПоСкладамЯМ Тогда // без разбиения, создается только 1 заказ
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		
		Если Не ЗначениеЗаполнено(ФукнциональныеОпции.АктивныйЗаказКлиентаЯМ) Тогда
			Возврат;
		КонецЕсли;
		
		МассивЗаданий = Новый Массив;
		МассивЗаданий.Добавить(ФукнциональныеОпции.АктивныйЗаказКлиентаЯМ);
		
		Если ФукнциональныеОпции.АвтоматическиСоздаватьРеализацииЯМ Тогда
			СоздатьРеализации(Профиль, МассивЗаданий);  
		КонецЕсли;
		
		СоответствиеПараметровЗаписи = Новый Соответствие;
		СоответствиеПараметровЗаписи.Вставить("АктивныйЗаказКлиентаЯМ", Документы.ЗаказКлиента.ПустаяСсылка());
		ИС_MP_Сервер.ЗаписатьНастройкиСправочника(Профиль.Ссылка, СоответствиеПараметровЗаписи); 
		
		Возврат;  
		
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
	
	//+ ИнфоСофт Стояк Ю.К. 28.03.2024 УА #72576
	Комиссия25 = ФукнциональныеОпции.ДоговорЯМ.КомиссионныеПродажи25;
	//- ИнфоСофт Стояк Ю.К. 28.03.2024 УА #72576
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	|	ИС_ЯМ_ЗаказыВТеченииДня.СкладМП КАК СкладМП,
	//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	|	ИС_ЯМ_ЗаказыВТеченииДня.Профиль КАК Профиль,
	|	ИС_ЯМ_ЗаказыВТеченииДня.ЗаказКлиента КАК ЗаказКлиента,
	|	ИС_ЯМ_ЗаказыВТеченииДня.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ИС_ЯМ_ЗаказыВТеченииДня.ЗаказКлиента.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_ЗаказыВТеченииДня КАК ИС_ЯМ_ЗаказыВТеченииДня
	|ГДЕ
	|	ИС_ЯМ_ЗаказыВТеченииДня.Профиль = &Профиль
	|	И ИС_ЯМ_ЗаказыВТеченииДня.ЗаказОткрыт";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Если ФукнциональныеОпции.ЗакрытиеЗаказаПоДатеОтгрузкиЯМ и НачалоДня(Выборка.ДатаОтгрузки) <> НачалоДня(ТекущаяДатаСеанса()) Тогда
			Продолжить;	
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		
		МенеджерЗаписи = РегистрыСведений.ИС_ЯМ_ЗаказыВТеченииДня.СоздатьМенеджерЗаписи(); 
		
		//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
		МенеджерЗаписи.СкладМП = Выборка.СкладМП; 
		//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
		
		МенеджерЗаписи.Профиль = Выборка.Профиль;
		МенеджерЗаписи.ЗаказКлиента = Выборка.ЗаказКлиента;
		МенеджерЗаписи.ДатаОтгрузки = Выборка.ДатаОтгрузки;
		
		МенеджерЗаписи.ЗаказОткрыт = Ложь;
		
		МенеджерЗаписи.Записать();
		
		//+ ИнфоСофт Стояк Ю.К. 28.03.2024 УА #72576
		//ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		
		Если Комиссия25 Тогда
			ДокументРеализация = Документы.ПередачаТоваровХранителю.СоздатьДокумент();	
		Иначе
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		КонецЕсли; 
		
		Попытка
			ДокументРеализация.Заполнить(Выборка.ЗаказКлиента);
		Исключение						
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);			                                                      			
			Продолжить;
		КонецПопытки;
		
		//ДокументРеализация.Заполнить(Выборка.ЗаказКлиента);
		//- ИнфоСофт Стояк Ю.К. 28.03.2024 УА #72576
		
		ДокументРеализация.Дата = Выборка.ДатаОтгрузки;	
		ДокументРеализация.Комментарий = Выборка.Комментарий;
		ДокументРеализация.СкидкиРассчитаны = Истина;
		
		ЗаписыватьДокумент = Ложь;
		Если ФукнциональныеОпции.ПроводитьРеализацииЯМ Тогда
			
			Попытка
				ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ЗаписыватьДокумент = Истина;
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			КонецПопытки;
			
		Иначе
			ЗаписыватьДокумент = Истина;	
		КонецЕсли;
		
		Если ЗаписыватьДокумент Тогда	
			
			Попытка
				ДокументРеализация.Записать();			
			Исключение
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 01.06.2023 УА #59231

//+ ИнфоСофт Стояк Ю.К. 01.11.2023 УА #62748
Процедура ВыполнитьАлгоритмПоОсновнойСхемеFbo(Профиль)
	
	Событие = ПолучитьИмяСобытия("ВыполнитьАлгоритмПоОсновнойСхемеFbo");
	
	СписокМагазинов = ПолучитьСписокМагазинов(Профиль); 		 
	
	Если СписокМагазинов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КампанияID = Неопределено;
	
	Для Каждого Магазин Из СписокМагазинов Цикл
		Если Магазин.placementType = "FBY" Тогда
			КампанияID = Формат(Магазин.id, "ЧГ=0");	
			Прервать;
		КонецЕсли;			
	КонецЦикла; 
	
	Если КампанияID = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СкладыFBY = ПолучитьСкладыFBY(Профиль);
	
	Попытка
		Остатки = ПолучитьОстатки(Профиль, КампанияID);		
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , Текст);
		Возврат;
	КонецПопытки;
	
	Если Остатки.Количество() = 0 Тогда
		Текст = "Яндекс Маркет не предоставляет информацию по остаткам. Проверьте корректность токена статистики. Если токен корректный, необходимо обратиться в техническую поддержку Яндекс Маркета для уточнения сроков исправления неисправностей.";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , Текст);
		Возврат;	
	КонецЕсли; 
	
	МассивIDСкладов = Новый Массив;
	
	Для Каждого Склад Из СкладыFBY.warehouses Цикл
		МассивIDСкладов.Добавить(Склад.id);
	КонецЦикла;
		
	МассивId = Новый Массив;
	
	Для Каждого Элемент Из Остатки Цикл
		
		Индекс = МассивIDСкладов.Найти(Элемент.id);
		//+ ИнфоСофт Заварин К.В. 05.08.24 УА #81079
		//Если Элемент.stock > 0 И ЗначениеЗаполнено(Индекс) Тогда
		Если Элемент.stock > 0 И ТипЗнч(Индекс) = Тип("Число") Тогда
		//- ИнфоСофт Заварин К.В. 05.08.24 УА #81079
			МассивId.Добавить(Элемент.shopSku);	
		КонецЕсли;	
	КонецЦикла;
	
	//Добавим записи ручных остатков по тем позициям, которых нет на fbo
	ЗапросСклады = Новый Запрос;
	ЗапросСклады.Текст =
	"ВЫБРАТЬ
	|	ИС_ЯМ_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_ЯМ_Склады КАК ИС_ЯМ_Склады
	|ГДЕ
	|	ИС_ЯМ_Склады.ИспользоватьСхемуFBO
	|	И ИС_ЯМ_Склады.ЛичныйКабинет = &Профиль";	
	
	ЗапросСклады.УстановитьПараметр("Профиль", Профиль);
	РезультатЗапросаСклады = ЗапросСклады.Выполнить();  
	
	Если РезультатЗапросаСклады.Пустой() Тогда
		Текст = "В информационной базе не найден ни один склад fbs с включенной опцией.";
		ЗаписьЖурналаРегистрации("ИС.ЯМ.ВыполнениеАлгоритмаПоОсновнойСхемеFbo", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		Возврат;	
	КонецЕсли;
	
	ВыборкаСклады = РезультатЗапросаСклады.Выбрать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|ГДЕ
	|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
	|	И ИС_ЯМ_Номенклатура.shopSku В(&shopSku)";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("shopSku", МассивId);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	ТаблицаВыгрузки = РезультатЗапроса.Выгрузить();	
	
	Пока ВыборкаСклады.Следующий() Цикл
		
		//Выполним очистку всех записей регистра ручных остатков
		//+ ИнфоСофт Мурсалимов Д.Р. 27.03.24 УА #72931
		НаборЗаписей = РегистрыСведений.ИС_MP_РучныеОстатки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Профиль.Установить(Профиль);
		НаборЗаписей.Отбор.Маркетплейс.Установить(Перечисления.ИС_МП_Маркетплейсы.ЯМ);
		НаборЗаписей.Отбор.Склад.Установить(ВыборкаСклады.Ссылка);
		НаборЗаписей.Записать();
		//- ИнфоСофт Мурсалимов Д.Р. 27.03.24 УА #72931
	
		Для Каждого Строка Из ТаблицаВыгрузки Цикл
			
			//+ ИнфоСофт Мурсалимов Д.Р. 27.03.24 УА #72931
			ИС_МП_УправлениеОстатками.ЗаписатьРучнойОстаток(Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, ВыборкаСклады.Ссылка, Строка.Номенклатура, 0);
						
			//НаборЗаписейОстатоков = РегистрыСведений.ИС_ЯМ_Остатки.СоздатьНаборЗаписей();			
			//НоваяЗапись = НаборЗаписейОстатоков.Добавить();	
			//НоваяЗапись.НоменклатураЯМ = Строка.Номенклатура;
			//НоваяЗапись.СкладЯМ = ВыборкаСклады.Ссылка; 
			//НоваяЗапись.Остаток = 0;			
			//НаборЗаписейОстатоков.Записать(Ложь);          
			//- ИнфоСофт Мурсалимов Д.Р. 27.03.24 УА #72931
			
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.11.2023 УА #62748

#КонецОбласти
             
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Настройки

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ПолучитьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияЯМ Тогда
		Возврат;
	КонецЕсли;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ; 
	
	//МассивНастроек = МассивНастроекПодключения();
	МассивНастроек = Новый Массив;
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	//МассивНастроек = МассивНастроекЦен(МассивНастроек);
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, МассивНастроек);

	СтруктураПараметров = Новый Структура;

	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить("ЯМ" + Элемент.Ключ, Элемент.Значение);	
	КонецЦикла;
		
	ЗаполнитьЗначенияСвойств(Форма, СтруктураПараметров);
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ЗаписатьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияЯМ Тогда
		Возврат;
	КонецЕсли;
	
	//МассивНастроек = МассивНастроекПодключения();
	МассивНастроек = Новый Массив;
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	//МассивНастроек = МассивНастроекЦен(МассивНастроек);
	
	СтруктураНастроек = Новый Структура;
	
	Для Каждого Элемент Из МассивНастроек Цикл
		СтруктураНастроек.Вставить("ЯМ" + Элемент, Неопределено);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, Форма);
	
	СтруктураПараметров = Новый Структура;
	
	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить(СтрЗаменить(Элемент.Ключ, "ЯМ", ""), Элемент.Значение);	
	КонецЦикла;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ;
	
	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, СтруктураПараметров);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция МассивНастроекОстатков(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("РассчитыватьНесобранныеКомплекты");
	МассивНастроек.Добавить("ВыгружатьОстаткиВРазрезеОрганизации");
	МассивНастроек.Добавить("ИспользоватьПоследниеОстатки");	
	МассивНастроек.Добавить("ИспользоватьФиксированныйОстаток");
	МассивНастроек.Добавить("ФиксированныйОстаток");
	МассивНастроек.Добавить("РежимСокрытияОстатков");
	МассивНастроек.Добавить("СкрываемыйОстаток");
	
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

#КонецОбласти

#Область РегламентныеЗадания

//+ ИнфоСофт Ивонин К.А. 11.11.23 УА #55166
Процедура ВыполнитьКомандуРеглЗадания(Профиль, ИдентификаторКомандыОбработки) Экспорт

	Событие = ПолучитьИмяСобытия("ВыполнитьКомандуРеглЗадания");
	
	//+ ИнфоСофт Стояк Ю.К. 12.02.2024 УА #70009
	Если ИдентификаторКомандыОбработки = "ПолучениеКарточекТоваровЯМ" Тогда
		ПолучитьКарточкиТоваров(Профиль, Истина);
		Возврат;				
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 12.02.2024 УА #70009
	
	Если ИдентификаторКомандыОбработки = "ВыгрузкаЦенЯМ" Тогда
		ВыгрузитьЦены(Профиль);
		Возврат;						
	КонецЕсли;  
	
	Если ИдентификаторКомандыОбработки = "ВыгрузкаОстатковЯМ" Тогда		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_ЯМ_Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_ЯМ_Склады КАК ИС_ЯМ_Склады
		|ГДЕ
		|	НЕ ИС_ЯМ_Склады.ПометкаУдаления
		|	И ИС_ЯМ_Склады.ЛичныйКабинет = &Профиль 
		//+ ИнфоСофт Заварин К.В. 13.08.24 УА #81097
		|	И НЕ(ИС_ЯМ_Склады.ОбщаяГруппаСкладов = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|				И ИС_ЯМ_Склады.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|				И ИС_ЯМ_Склады.ВыгружатьОстаткиИзГруппыСкладов = ЛОЖЬ)";
		//- ИнфоСофт Заварин К.В. 13.08.24 УА #81097
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			ВыгрузитьОстатки(Профиль, Выборка.Ссылка);	
		КонецЦикла;
	
		Возврат;
		
	КонецЕсли;    	
	
	Если ИдентификаторКомандыОбработки = "ПолучениеСборочныхЗаданийЯМ" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_ЯМ_Заказ.Дата КАК Дата
		|ИЗ
		|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
		|ГДЕ
		|	ИС_ЯМ_Заказ.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДатаНачала = ВыборкаДетальныеЗаписи.Дата;
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
			ДатаНачала = НачалоДня(ТекущаяДатаСеанса());	
		КонецЕсли;
		
		//+ ИнфоСофт Власова И.С. 18.12.2024 УА #89287
		//ПолучитьСписокЗаказов(Профиль, Дата("20241023"));
		ПолучитьСписокЗаказов(Профиль, ДатаНачала + 1);
		//- ИнфоСофт Власова И.С. 18.12.2024 УА #89287
		
		Возврат;				
	
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ОбновлениеСтатусовСборочныхЗаданийЯМ" Тогда
		//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
		ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль); 
		
		Если ФукнциональныеОпции.ЯндексКоличествоДнейОбновлениеСтатусов = 0 Тогда
			Период = 30 * 86400;
		Иначе
			Период = ФукнциональныеОпции.ЯндексКоличествоДнейОбновлениеСтатусов * 86400;
		КонецЕсли;
		
		ОбновитьСтатусыСборочныхЗаданий(Профиль,Период);
		//ОбновитьСтатусыСборочныхЗаданий(Профиль);
		//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800		
		Возврат;				
	КонецЕсли; 
	
	Если ИдентификаторКомандыОбработки = "ЗакрыватьЗаказВТечениеДняЯМ" Тогда 
        ВыполнитьЗакрытиеЗаказов(Профиль);
		Возврат;	
	КонецЕсли;
		
	Если ИдентификаторКомандыОбработки = "ВыполнениеАлгоритмаПоОсновнойСхемеFboЯМ" Тогда
		ВыполнитьАлгоритмПоОсновнойСхемеFBO(Профиль);			
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 11.11.23 УА #55166

#КонецОбласти

//+ ИнфоСофт Ивонин К.А. 28.09.23 УА #64020
Функция ПолучитьСписокМагазинов(Профиль) Экспорт
		
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
    
    Если Не ЗначениеЗаполнено(НастройкиСоединения["ЯМАдресСервисаAPI"]) Тогда
   		ОбщегоНазначения.СообщитьПользователю(
   			"Для данного профиля не заполнен ""Адрес Сервиса Яндекс Маркета"", проверьте настройки авторизации");
   		Возврат Неопределено;
   	КонецЕсли;
   	
   	Если Не ЗначениеЗаполнено(НастройкиСоединения["ЯМТокен"]) Тогда
   		ОбщегоНазначения.СообщитьПользователю(
   			"Для данного профиля не заполнен ""Токен Яндекс Маркета"", проверьте настройки авторизации");
   		Возврат Неопределено;
   	КонецЕсли;
   	    
	ПараметрыЗапроса.Сервер = НастройкиСоединения["ЯМАдресСервисаAPI"];
	ПараметрыЗапроса.Порт = 443;
	ПараметрыЗапроса.ЗащищенноеСоединение = Истина;
	ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer " + НастройкиСоединения["ЯМТокен"]);
	ПараметрыЗапроса.Заголовки.Вставить("Api-Key", НастройкиСоединения["ЯМТокен"]);
				
	Возврат ИС_ЯМ_API.ПолучитьСписокМагазинов(Профиль, ПараметрыЗапроса);
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.09.23 УА #64020

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 //+ ИнфоСофт Ивонин К.А. 14.04.23 УА #57127
Функция ПолучитьНастройкиСоединенияПрофиля(Профиль)
    
    НастройкиСоединения = ИС_ЯМ_СерверПовтИсп.ПолучитьНастройкиСоединения(Профиль);
    
	Если НастройкиСоединения.Количество() = 0 Тогда
		ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	КонецЕсли;

	Возврат НастройкиСоединения;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 14.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 14.04.23 УА #57127
Функция ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения)
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения["ЯМАдресСервисаAPI"]) Тогда
		ВызватьИсключение("Для данного профиля не заполнен ""Адрес Сервиса Яндекс Маркета"", проверьте настройки авторизации");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения["ЯМТокен"]) Тогда
		ВызватьИсключение("Для данного профиля не заполнен ""Токен Яндекс Маркета"", проверьте настройки авторизации");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения["ЯМКампанияID"]) Тогда
		ВызватьИсключение("Для данного профиля не заполнен ""ID Компании Яндекс Маркета"", проверьте настройки авторизации");
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения["ЯМКодБизнеса"]) Тогда
		ВызватьИсключение("Для данного профиля не заполнен ""Код бизнеса Яндекс Маркета"", проверьте настройки авторизации");
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	
	ПараметрыЗапроса.Сервер = НастройкиСоединения["ЯМАдресСервисаAPI"];
	ПараметрыЗапроса.Порт = 443;
	ПараметрыЗапроса.ЗащищенноеСоединение = Истина;
	ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer " + НастройкиСоединения["ЯМТокен"]);
	ПараметрыЗапроса.Заголовки.Вставить("Api-Key", НастройкиСоединения["ЯМТокен"]);
	
	Возврат ПараметрыЗапроса;	

КонецФункции //- ИнфоСофт Ивонин К.А. 14.04.23 УА #57127

//+ ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524
Функция ПолучитьMD5Хэш(СтруктураJSON)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураJSON);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
    Хеш.Добавить(СтрокаJSON);
    
    Возврат СтрЗаменить(Строка(Хеш.ХешСумма), " ", ""); 	
	 
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Процедура ПроверитьФункциональныеОпцииСборочныхЗаданий(Профиль, МассивЗаданий)

	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Если ФукнциональныеОпции.АвтоматическиСоздаватьЗаказыЯМ Тогда	
		СоздатьЗаказы(Профиль, МассивЗаданий);		
	КонецЕсли;
	
	Если ФукнциональныеОпции.АвтоматическиСоздаватьРеализацииЯМ 
		И ФукнциональныеОпции.РежимСозданияЗаказовЯМ <> 2 Тогда	
		СоздатьРеализации(Профиль, МассивЗаданий);		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Функция ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль) Экспорт
	
	Событие = "ПолучитьНастройкиФункциональностиСборочныхЗвданий";
	Параметры = Новый Структура;
	
	МассивНаименованийПараметров = Новый Массив;  
		
	МассивНаименованийПараметров.Добавить("АвтоматическиСоздаватьЗаказыЯМ");
	МассивНаименованийПараметров.Добавить("РежимСозданияЗаказовЯМ");
	МассивНаименованийПараметров.Добавить("АктивныйЗаказКлиентаЯМ");
	МассивНаименованийПараметров.Добавить("РассчитыватьДатыОтгрузкиЯМ");
	МассивНаименованийПараметров.Добавить("ВремяОтсчетаЯМ");
	МассивНаименованийПараметров.Добавить("КоличествоДнейКОтгрузкеЯМ");
	МассивНаименованийПараметров.Добавить("АвтоматическиСоздаватьРеализацииЯМ");
	МассивНаименованийПараметров.Добавить("КоличествоДнейКРеализацииЯМ");
	
	МассивНаименованийПараметров.Добавить("ПартнерЯМ");
	МассивНаименованийПараметров.Добавить("КонтрагентЯМ");
	МассивНаименованийПараметров.Добавить("СоглашениеЯМ");
	МассивНаименованийПараметров.Добавить("ДоговорЯМ");
	МассивНаименованийПараметров.Добавить("ПодразделениеЯМ");
	МассивНаименованийПараметров.Добавить("ПриоритетЗаказаЯМ");
	МассивНаименованийПараметров.Добавить("ЯндексВидЦеныСоСкидкой");
	МассивНаименованийПараметров.Добавить("Организация");
	//+ ИнфоСофт Сумин Д.В. 04.08.2023 УА #61481
    МассивНаименованийПараметров.Добавить("ПересчитыватьТоварПоКомлектамЯМ"); 
	//- ИнфоСофт Сумин Д.В. 04.08.2023 УА #61481 
	//+ ИнфоСофт Стояк Ю.К. 16.08.2023 УА #61318
	МассивНаименованийПараметров.Добавить("ПричинаОтменыЯМ");
	МассивНаименованийПараметров.Добавить("УдалятьРТУЯМ");
	МассивНаименованийПараметров.Добавить("СтатусЗаказаЯМ");
	//- ИнфоСофт Стояк Ю.К. 16.08.2023 УА #61318 
	
	//+ ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	МассивНаименованийПараметров.Добавить("ПроверятьДатуПередУдалениемЯМ");
	//- ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	
	//+ ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
	МассивНаименованийПараметров.Добавить("ФормироватьЕдиныйЗаказБезРазбиенияЯМ");
	//- ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	МассивНаименованийПараметров.Добавить("ИспользоватьРазбиениеПоСкладамЯМ");
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	МассивНаименованийПараметров.Добавить("ЗакрытиеЗаказаПоДатеОтгрузкиЯМ");
	//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	МассивНаименованийПараметров.Добавить("ПроводитьЗаказыЯМ");
	МассивНаименованийПараметров.Добавить("ПроводитьРеализацииЯМ");
	МассивНаименованийПараметров.Добавить("ВариантОбеспеченияЯМ");
	//+ ИнфоСофт Сумин Д.В. 09.04.2024 УА #67384
	МассивНаименованийПараметров.Добавить("ВариантОбеспеченияПриНехваткеЯМ");
	//- ИнфоСофт Сумин Д.В. 09.04.2024 УА #67384
	//+ ИнфоСофт Стояк Ю.К. 18.12.2023 УА #63805
	МассивНаименованийПараметров.Добавить("ПереводитьЗаказВГотовностьЯМ"); 
	//- ИнфоСофт Стояк Ю.К. 18.12.2023 УА #63805
	//+ ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	МассивНаименованийПараметров.Добавить("ДатаОтгрузкиИлиТекущаяДатаВРеализациюЯМ");
	//- ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	//+ ИнфоСофт Мурсалимов Д.Р. 13.03.24 УА #67173 
	МассивНаименованийПараметров.Добавить("ЯМРассчитатьНесобранныеКомплекты");
	МассивНаименованийПараметров.Добавить("ЯМСоздатьЗаказНаСборку");
	//- ИнфоСофт Мурсалимов Д.Р. 13.03.24 УА #67173
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	МассивНаименованийПараметров.Добавить("ЯндексКоличествоДнейОбновлениеСтатусов");
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	//+ ИнфоСофт Стояк Ю.К. 05.11.2024 УА #86321
	МассивНаименованийПараметров.Добавить("ЯндексСоздаватьЗаказыПоЮрЛицам");
	//- ИнфоСофт Стояк Ю.К. 05.11.2024 УА #86321
	//+ ИнфоСофт Конышев А.Е. 03.12.24 УА #73126
	МассивНаименованийПараметров.Добавить("ЯндексСтандартнаяДоставка");
	//- ИнфоСофт Конышев А.Е. 03.12.24 УА #73126
	
	//+ ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	МассивНаименованийПараметров.Добавить("ЯндексОтделятьТоварыПриНехватке");
	//- ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	МассивНаименованийПараметров.Добавить("ЯндексРежимСозданияРеализаций");
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	
	ПараметрыСоединения = Новый Структура;
	
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);
	
	Если Настройки = Неопределено Тогда
		
		Текст = "Параметры создания заказов не установлены";
		ЗаписьЖурналаРегистрации("ИС.ЯМ." + Событие, УровеньЖурналаРегистрации.Ошибка, , , Текст);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Ложь;
		
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #86321	
	Если Настройки["ЯндексСоздаватьЗаказыПоЮрЛицам"] <> Неопределено Тогда
		Параметры.Вставить("ЯндексСоздаватьЗаказыПоЮрЛицам", Настройки["ЯндексСоздаватьЗаказыПоЮрЛицам"]);
	Иначе
		Параметры.Вставить("ЯндексСоздаватьЗаказыПоЮрЛицам", Ложь);
	КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #86321
	
	Если Настройки["ПереводитьЗаказВГотовностьЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ПереводитьЗаказВГотовностьЯМ", Настройки["ПереводитьЗаказВГотовностьЯМ"]);
	Иначе
		Параметры.Вставить("ПереводитьЗаказВГотовностьЯМ", Ложь);
	КонецЕсли;  
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800	
	Если Настройки["ЯндексКоличествоДнейОбновлениеСтатусов"] <> Неопределено Тогда
		Параметры.Вставить("ЯндексКоличествоДнейОбновлениеСтатусов", Настройки["ЯндексКоличествоДнейОбновлениеСтатусов"]);
	Иначе
		Параметры.Вставить("ЯндексКоличествоДнейОбновлениеСтатусов", 30);
	КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	
	//+ ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	Если Настройки["ДатаОтгрузкиИлиТекущаяДатаВРеализациюЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ДатаОтгрузкиИлиТекущаяДатаВРеализациюЯМ", Настройки["ДатаОтгрузкиИлиТекущаяДатаВРеализациюЯМ"]);
	Иначе
		Параметры.Вставить("ДатаОтгрузкиИлиТекущаяДатаВРеализациюЯМ", Ложь);
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	
	Если Настройки["АвтоматическиСоздаватьЗаказыЯМ"] <> Неопределено Тогда
		Параметры.Вставить("АвтоматическиСоздаватьЗаказыЯМ", Настройки["АвтоматическиСоздаватьЗаказыЯМ"]);
	Иначе
		Параметры.Вставить("АвтоматическиСоздаватьЗаказыЯМ", Ложь);
	КонецЕсли;
	
	Если Настройки["РежимСозданияЗаказовЯМ"] <> Неопределено Тогда
		Параметры.Вставить("РежимСозданияЗаказовЯМ", Настройки["РежимСозданияЗаказовЯМ"]);
	Иначе
		Параметры.Вставить("РежимСозданияЗаказовЯМ", 0);
	КонецЕсли;
	
	Если Настройки["АктивныйЗаказКлиентаЯМ"] <> Неопределено Тогда
		Параметры.Вставить("АктивныйЗаказКлиентаЯМ", Настройки["АктивныйЗаказКлиентаЯМ"]);
	Иначе
		Параметры.Вставить("АктивныйЗаказКлиентаЯМ", Неопределено);
	КонецЕсли;
	
	Если Настройки["РассчитыватьДатыОтгрузкиЯМ"] <> Неопределено Тогда
		Параметры.Вставить("РассчитыватьДатыОтгрузкиЯМ", Настройки["РассчитыватьДатыОтгрузкиЯМ"]); 
	Иначе
		Параметры.Вставить("РассчитыватьДатыОтгрузкиЯМ", Ложь);
	КонецЕсли;
	
	Если Настройки["ВремяОтсчетаЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ВремяОтсчетаЯМ", Настройки["ВремяОтсчетаЯМ"]);
	Иначе
		Параметры.Вставить("ВремяОтсчетаЯМ", Дата(1,1,1));
	КонецЕсли;
	
	Если Настройки["КоличествоДнейКОтгрузкеЯМ"] <> Неопределено Тогда
		Параметры.Вставить("КоличествоДнейКОтгрузкеЯМ", Настройки["КоличествоДнейКОтгрузкеЯМ"]);
	Иначе
		Параметры.Вставить("КоличествоДнейКОтгрузкеЯМ", 0);
	КонецЕсли;
	
	Если Настройки["АвтоматическиСоздаватьРеализацииЯМ"] <> Неопределено Тогда
		Параметры.Вставить("АвтоматическиСоздаватьРеализацииЯМ", Настройки["АвтоматическиСоздаватьРеализацииЯМ"]);
	Иначе
		Параметры.Вставить("АвтоматическиСоздаватьРеализацииЯМ", Ложь);
	КонецЕсли;
	
	Если Настройки["КоличествоДнейКРеализацииЯМ"] <> Неопределено Тогда
		Параметры.Вставить("КоличествоДнейКРеализацииЯМ", Настройки["КоличествоДнейКРеализацииЯМ"]); 
	Иначе
		Параметры.Вставить("КоличествоДнейКРеализацииЯМ", 0);
	КонецЕсли; 
	
	
	Если Настройки["ПартнерЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ПартнерЯМ", Настройки["ПартнерЯМ"]);
	Иначе
		Параметры.Вставить("ПартнерЯМ", Неопределено);
	КонецЕсли;
	
	Если Настройки["КонтрагентЯМ"] <> Неопределено Тогда
		Параметры.Вставить("КонтрагентЯМ", Настройки["КонтрагентЯМ"]);
	Иначе
		Параметры.Вставить("КонтрагентЯМ", Неопределено);
	КонецЕсли;
	
	Если Настройки["СоглашениеЯМ"] <> Неопределено Тогда
		Параметры.Вставить("СоглашениеЯМ", Настройки["СоглашениеЯМ"]); 
	Иначе
		Параметры.Вставить("СоглашениеЯМ", Неопределено);
	КонецЕсли;
	
	Если Настройки["ДоговорЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ДоговорЯМ", Настройки["ДоговорЯМ"]);
	Иначе
		Параметры.Вставить("ДоговорЯМ", Неопределено);
	КонецЕсли;
	
	Если Настройки["ПодразделениеЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ПодразделениеЯМ", Настройки["ПодразделениеЯМ"]);
	Иначе
		Параметры.Вставить("ПодразделениеЯМ", Неопределено);
	КонецЕсли;
	
	Если Настройки["ПриоритетЗаказаЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ПриоритетЗаказаЯМ", Настройки["ПриоритетЗаказаЯМ"]); 
	Иначе
		Параметры.Вставить("ПриоритетЗаказаЯМ", Неопределено);
	КонецЕсли;
	
	Если Настройки["ЯндексВидЦеныСоСкидкой"] <> Неопределено Тогда
		Параметры.Вставить("ЯндексВидЦеныСоСкидкой", Настройки["ЯндексВидЦеныСоСкидкой"]); 
	Иначе
		Параметры.Вставить("ЯндексВидЦеныСоСкидкой", Неопределено);
	КонецЕсли;  
	
	//+ ИнфоСофт Сумин Д.В. 04.08.2023 УА #61481
    Если Настройки["ПересчитыватьТоварПоКомлектамЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ПересчитыватьТоварПоКомлектамЯМ", Настройки["ПересчитыватьТоварПоКомлектамЯМ"]); 
	Иначе
		Параметры.Вставить("ПересчитыватьТоварПоКомлектамЯМ", Ложь);
	КонецЕсли; 
	//- ИнфоСофт Сумин Д.В. 04.08.2023 УА #61481
	//+ ИнфоСофт Стояк Ю.К. 16.08.2023 УА #61318	
	Если Настройки["ПричинаОтменыЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ПричинаОтменыЯМ", Настройки["ПричинаОтменыЯМ"]); 
	Иначе
		Параметры.Вставить("ПричинаОтменыЯМ", Неопределено);
	КонецЕсли;
	
	Если Настройки["УдалятьРТУЯМ"] <> Неопределено Тогда
		Параметры.Вставить("УдалятьРТУЯМ", Настройки["УдалятьРТУЯМ"]); 
	Иначе
		Параметры.Вставить("УдалятьРТУЯМ", Ложь);
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 16.08.2023 УА #61318 
	
	//+ ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	Если Настройки["ПроверятьДатуПередУдалениемЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ПроверятьДатуПередУдалениемЯМ", Настройки["ПроверятьДатуПередУдалениемЯМ"]); 
	Иначе
		Параметры.Вставить("ПроверятьДатуПередУдалениемЯМ", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	
	Если Настройки["СтатусЗаказаЯМ"] <> Неопределено Тогда
		Параметры.Вставить("СтатусЗаказаЯМ", Настройки["СтатусЗаказаЯМ"]); 
	Иначе
		Параметры.Вставить("СтатусЗаказаЯМ", Неопределено);
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
	Если Настройки["ФормироватьЕдиныйЗаказБезРазбиенияЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ФормироватьЕдиныйЗаказБезРазбиенияЯМ", Настройки["ФормироватьЕдиныйЗаказБезРазбиенияЯМ"]);
	Иначе
		Параметры.Вставить("ФормироватьЕдиныйЗаказБезРазбиенияЯМ", Ложь);
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
	
	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Если Настройки["ИспользоватьРазбиениеПоСкладамЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ИспользоватьРазбиениеПоСкладамЯМ", Настройки["ИспользоватьРазбиениеПоСкладамЯМ"]);
	Иначе
		Параметры.Вставить("ИспользоватьРазбиениеПоСкладамЯМ", Ложь);
	КонецЕсли;
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	
	//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	Если Настройки["ЗакрытиеЗаказаПоДатеОтгрузкиЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ЗакрытиеЗаказаПоДатеОтгрузкиЯМ", Настройки["ЗакрытиеЗаказаПоДатеОтгрузкиЯМ"]);
	Иначе
		Параметры.Вставить("ЗакрытиеЗаказаПоДатеОтгрузкиЯМ", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	
	Если Настройки["ПроводитьЗаказыЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ПроводитьЗаказыЯМ", Настройки["ПроводитьЗаказыЯМ"]);
	Иначе
		Параметры.Вставить("ПроводитьЗаказыЯМ", Ложь);
	КонецЕсли;
	
	Если Настройки["ПроводитьРеализацииЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ПроводитьРеализацииЯМ", Настройки["ПроводитьРеализацииЯМ"]);
	Иначе
		Параметры.Вставить("ПроводитьРеализацииЯМ", Ложь);
	КонецЕсли; 
	
	Если Настройки["ВариантОбеспеченияЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ВариантОбеспеченияЯМ", Настройки["ВариантОбеспеченияЯМ"]);
	Иначе
		Параметры.Вставить("ВариантОбеспеченияЯМ", Неопределено);
	КонецЕсли;
	
	//+ ИнфоСофт Сумин Д.В. 09.04.2024 УА #67384
	Если Настройки["ВариантОбеспеченияПриНехваткеЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ВариантОбеспеченияПриНехваткеЯМ", Настройки["ВариантОбеспеченияПриНехваткеЯМ"]);
	Иначе
		Параметры.Вставить("ВариантОбеспеченияПриНехваткеЯМ", Неопределено);
	КонецЕсли;
	//- ИнфоСофт Сумин Д.В. 09.04.2024 УА #67384
	
	//+ ИнфоСофт Мурсалимов Д.Р. 13.03.24 УА #67173
	Если Настройки["ЯМСоздатьЗаказНаСборку"] <> Неопределено Тогда
		Параметры.Вставить("ЯМСоздатьЗаказНаСборку", Настройки["ЯМСоздатьЗаказНаСборку"]); 
	Иначе
		Параметры.Вставить("ЯМСоздатьЗаказНаСборку", Ложь);
	КонецЕсли;
	
	Если Настройки["ЯМРассчитатьНесобранныеКомплекты"] <> Неопределено Тогда
		Параметры.Вставить("ЯМРассчитатьНесобранныеКомплекты", Настройки["ЯМРассчитатьНесобранныеКомплекты"]); 
	Иначе
		Параметры.Вставить("ЯМРассчитатьНесобранныеКомплекты", Ложь);
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 13.03.24 УА #67173
	
	//+ ИнфоСофт Сумин Д.В. 08.04.2024 УА #74032
	Если Настройки["ВариантОбеспеченияПриНехваткеЯМ"] <> Неопределено Тогда
		Параметры.Вставить("ВариантОбеспеченияПриНехваткеЯМ", Настройки["ВариантОбеспеченияПриНехваткеЯМ"]); 
	Иначе
		Параметры.Вставить("ВариантОбеспеченияПриНехваткеЯМ", Неопределено);
	КонецЕсли; 
	//- ИнфоСофт Сумин Д.В. 08.04.2024 УА #74032
	
	//+ ИнфоСофт Конышев А.Е. 03.12.24 УА #73126
	Если Настройки["ЯндексСтандартнаяДоставка"] <> Неопределено Тогда
		Параметры.Вставить("ЯндексСтандартнаяДоставка", Настройки["ЯндексСтандартнаяДоставка"]); 
	Иначе
		Параметры.Вставить("ЯндексСтандартнаяДоставка", Неопределено);
	КонецЕсли;
	//- ИнфоСофт Конышев А.Е. 03.12.24 УА #73126
	
	//+ ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	Если Настройки["ЯндексОтделятьТоварыПриНехватке"] <> Неопределено Тогда
		Параметры.Вставить("ЯндексОтделятьТоварыПриНехватке", Настройки["ЯндексОтделятьТоварыПриНехватке"]); 
	Иначе
		Параметры.Вставить("ЯндексОтделятьТоварыПриНехватке", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 13.02.25 УА #93503 
	
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	Если Настройки["ЯндексРежимСозданияРеализаций"] <> Неопределено Тогда
		Параметры.Вставить("ЯндексРежимСозданияРеализаций", Настройки["ЯндексРежимСозданияРеализаций"]);
	Иначе
		Параметры.Вставить("ЯндексРежимСозданияРеализаций", 0);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_Профили.Организация КАК Организация
		|ИЗ
		|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
		|ГДЕ
		|	ИС_WB_Профили.Ссылка = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Параметры.Вставить("Организация", ВыборкаДетальныеЗаписи.Организация);
	КонецЦикла;
		
	Возврат Параметры;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628 

//+ ИнфоСофт Сумин Д.В. 26.04.2023 УА #58166
Функция ПолучитьТаблицуТоваровНабора(ТоварыЗаказа) Экспорт
	
	Запрос = Новый Запрос;		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВзаказе.Сумма КАК Сумма,
	|	ТоварыВзаказе.Номенклатура КАК Номенклатура,
	|	ТоварыВзаказе.Характеристика КАК Характеристика,
	|	ТоварыВзаказе.Цена КАК Цена,
	|	ТоварыВзаказе.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыВЗаказе
	|ИЗ
	|	&ТоварыВзаказе КАК ТоварыВзаказе
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости) КАК ОбщаяДоляСтоимости,
	|	СУММА(1) КАК Количество,
	|	ВТ_ТоварыВЗаказе.Сумма КАК Сумма,
	|	ВТ_ТоварыВЗаказе.Цена КАК Цена,
	|	ВТ_ТоварыВЗаказе.Номенклатура КАК Набор,
	|	ВТ_ТоварыВЗаказе.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ВТ_ТоварыВЗаказе.Количество) КАК КоличествоВЗаказе
	|ПОМЕСТИТЬ ВТ_Количество
	|ИЗ
	|	ВТ_ТоварыВЗаказе КАК ВТ_ТоварыВЗаказе
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО ВТ_ТоварыВЗаказе.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|			И ВТ_ТоварыВЗаказе.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыВЗаказе.Номенклатура,
	|	ВТ_ТоварыВЗаказе.Характеристика,
	|	ВТ_ТоварыВЗаказе.Сумма,
	|	ВТ_ТоварыВЗаказе.Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости,
	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Количество, 1) * ВТ_Количество.КоличествоВЗаказе КАК Количество,
	|	ВТ_Количество.ОбщаяДоляСтоимости КАК ОбщаяДоляСтоимости,
	|	ВТ_Количество.Количество КАК КоличествоОбщее,
	|	ВТ_Количество.Набор КАК Набор,
	|	ВТ_Количество.Сумма КАК Сумма,
	|	ВТ_Количество.Цена КАК Цена,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора
	|ИЗ
	|	ВТ_Количество КАК ВТ_Количество
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО ВТ_Количество.Набор = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|			И ВТ_Количество.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика
	//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #72423	
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура"; 
	//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #72423
	
	Запрос.УстановитьПараметр("ТоварыВзаказе", ТоварыЗаказа);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Сумин Д.В. 26.04.2023 УА #58166

//+ ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
Функция ДобавитьСопоставление(ТаблицаТранзакций, Профиль) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаТранзакций.НаименованиеТовара КАК НаименованиеТовара,
	|	ТаблицаТранзакций.SKU КАК SKU,
	|	ТаблицаТранзакций.ЦенаПродавца КАК ЦенаПродавца,
	|	ТаблицаТранзакций.ЦенаРеализация КАК ЦенаРеализация,
	|	ТаблицаТранзакций.Количество КАК Количество,
	|	ТаблицаТранзакций.РеализованоНаСумму КАК РеализованоНаСумму,
	|	ТаблицаТранзакций.ВозвратЦенаРеализации КАК ВозвратЦенаРеализации,
	|	ТаблицаТранзакций.ВозвратКоличество КАК ВозвратКоличество,
	|	ТаблицаТранзакций.ВозвращеноНаСумму КАК ВозвращеноНаСумму
	|ПОМЕСТИТЬ втТаблицаТранзакций
	|ИЗ
	|	&ТаблицаТранзакций КАК ТаблицаТранзакций
	|;
	|  
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблицаТранзакций.SKU КАК SKU,
	|	МАКСИМУМ(ИС_ЯМ_СоответствиеХарактеристик.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ИС_ЯМ_СоответствиеХарактеристик.Характеристика) КАК Характеристика,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЭтоНабор, 
	|	МАКСИМУМ(ИС_ЯМ_СоответствиеХарактеристик.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Знаменатель
	|	КОНЕЦ) КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	втТаблицаТранзакций КАК втТаблицаТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ПО (втТаблицаТранзакций.SKU = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku
	|				И ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблицаТранзакций.SKU 
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ВТ_Номенклатура.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Номенклатура.SKU КАК SKU,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ВТ_Номенклатура.КоэффициентУпаковки КАК КоэффициентУпаковки,
	|	втТаблицаТранзакций.НаименованиеТовара КАК НаименованиеТовара,
	|	втТаблицаТранзакций.ЦенаПродавца КАК ЦенаПродавца,
	|	втТаблицаТранзакций.ЦенаРеализация КАК ЦенаРеализация,
	|	втТаблицаТранзакций.Количество КАК Количество,
	|	втТаблицаТранзакций.РеализованоНаСумму КАК РеализованоНаСумму,
	|	втТаблицаТранзакций.ВозвратЦенаРеализации КАК ВозвратЦенаРеализации,
	|	втТаблицаТранзакций.ВозвратКоличество КАК ВозвратКоличество,
	|	втТаблицаТранзакций.ВозвращеноНаСумму КАК ВозвращеноНаСумму
	|ИЗ
	|	втТаблицаТранзакций КАК втТаблицаТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО втТаблицаТранзакций.SKU = ВТ_Номенклатура.SKU";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Профиль", 			Профиль);
	Запрос.УстановитьПараметр("ТаблицаТранзакций", 	ТаблицаТранзакций);		
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат РезультатЗапроса;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005 

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Функция СоздатьДокументОтчетКомиссионера(Профиль, Период, ТаблицаТранзакций, Комментарий, СтруктураПараметров = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Событие = "Создание отчета комиссионеров";

	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);

	Если Не ЗначениеЗаполнено(ФукнциональныеОпции.КонтрагентЯМ) Тогда

		ТекстСообщения = СтрШаблон(
			"Не заполнен контрагент в настройках ЯМ для аккаунта: %1. Документ отчет комиссионера не создан.",
			Профиль);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;

	КонецЕсли;

	ХозОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");

	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	Если ИспользоватьДоговорыСКлиентами Тогда

		Если ЗначениеЗаполнено(ФукнциональныеОпции.ДоговорЯМ) Тогда

			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(ФукнциональныеОпции.ДоговорЯМ, "ХозяйственнаяОперация") = ХозОперация Тогда

				ТекстСообщения = СтрШаблон(
					"В выбранный договор контрагента в настройках ЯМ для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат Неопределено;

			КонецЕсли;

		Иначе

			ТекстСообщения = СтрШаблон(
				"Не заполнен договор контрагента в настройках ЯМ для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;

		КонецЕсли;
	КонецЕсли;

	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	Если ИспользоватьСоглашенияСКлиентами Тогда

		Если ЗначениеЗаполнено(ФукнциональныеОпции.СоглашениеЯМ) Тогда

			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(ФукнциональныеОпции.СоглашениеЯМ, "ХозяйственнаяОперация") = ХозОперация Тогда

				ТекстСообщения = СтрШаблон(
					"В выбранное соглашение с клиентом в настройках ЯМ для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат Неопределено;

			КонецЕсли;

		Иначе

			ТекстСообщения = СтрШаблон(
				"Не заполнено соглашение с клиентом в настройках ЯМ для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;

		КонецЕсли;

	КонецЕсли;  
	
	ОбъектОтчетКомиссионера = Документы["ОтчетКомиссионера"].СоздатьДокумент();
	
	ОбъектОтчетКомиссионера.Дата 			= Период.ДатаОкончания;
	ОбъектОтчетКомиссионера.НачалоПериода 	= Период.ДатаНачала;
	ОбъектОтчетКомиссионера.КонецПериода 	= Период.ДатаОкончания;
	ОбъектОтчетКомиссионера.Комментарий		= Комментарий;
	
	//+ ИнфоСофт Стояк Ю.К. 12.08.2024 УА #81449                                   
	ИспользоватьПодразделения = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	
	Если ИспользоватьПодразделения Тогда		
		ОбъектОтчетКомиссионера.Подразделение = ФукнциональныеОпции.ПодразделениеЯМ;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 12.08.2024 УА #81449
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", ФукнциональныеОпции.Организация);
	ДанныеЗаполнения.Вставить("Партнер", ФукнциональныеОпции.ПартнерЯМ);
	ДанныеЗаполнения.Вставить("Контрагент", ФукнциональныеОпции.КонтрагентЯМ);
	ДанныеЗаполнения.Вставить("Договор", ФукнциональныеОпции.ДоговорЯМ);
	//+ ИнфоСофт Сумин Д.В. 19.04.2024 УА #72638
	Если ИспользоватьСоглашенияСКлиентами Тогда
		ДанныеЗаполнения.Вставить("Соглашение", ФукнциональныеОпции.СоглашениеЯМ); 
		ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина); 
	//+ ИнфоСофт Стояк Ю.К. 25.06.2024 УА #78446	
	Иначе
		ДанныеЗаполнения.Вставить("Соглашение", Неопределено); 
	//- ИнфоСофт Стояк Ю.К. 25.06.2024 УА #78446
	КонецЕсли; 
	//ДанныеЗаполнения.Вставить("Соглашение", ФукнциональныеОпции.СоглашениеЯМ);
	//ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина);
	//- ИнфоСофт Сумин Д.В. 19.04.2024 УА #72638
	ДанныеЗаполнения.Вставить("КонецПериода", Период.ДатаОкончания);
	ОбъектОтчетКомиссионера.Заполнить(ДанныеЗаполнения);
	
	ПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(ОбъектОтчетКомиссионера.СтавкаНДСВознаграждения);	

	ОбъектОтчетКомиссионера.СпособРасчетаВознаграждения = ПредопределенноеЗначение(
		"Перечисление.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается");
	ОбъектОтчетКомиссионера.ПроцентВознаграждения  		= 0;
	
	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97340
	НастройкиУчета = УчетНДСУП.ПараметрыУчетаПоОрганизации(Профиль.Организация, ТекущаяДатаСеанса());
	ОбъектОтчетКомиссионера.НалогообложениеНДС = НастройкиУчета.ОсновноеНалогообложениеНДСПродажи;
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97340
	
	//+ ИнфоСофт Стояк Ю.К. 31.05.2024 УА #74897
	ЗаполнитьТЧОтчетаКомиссионера(ОбъектОтчетКомиссионера, ТаблицаТранзакций, СтруктураПараметров);
	//ЗаполнитьТЧОтчетаКомиссионера(ОбъектОтчетКомиссионера, ТаблицаТранзакций);
	//- ИнфоСофт Стояк Ю.К. 31.05.2024 УА #74897

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
		ОбъектОтчетКомиссионера.Организация, ОбъектОтчетКомиссионера.НалогообложениеНДС, ОбъектОтчетКомиссионера.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
		ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ОбъектОтчетКомиссионера));
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
		ОбъектОтчетКомиссионера.ЦенаВключаетНДС));	
	СтруктураДействий.Вставить("ПересчитатьСуммуПродажиНДС");
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ОбъектОтчетКомиссионера.Товары, СтруктураДействий, Неопределено);

	ОбъектОтчетКомиссионера.СуммаВознаграждения = ОбъектОтчетКомиссионера.Товары.Итог("СуммаВознаграждения");
	ОбъектОтчетКомиссионера.СуммаНДСВознаграждения = Окр(ОбъектОтчетКомиссионера.СуммаВознаграждения * ПроцентНДС
		/ (100 + ПроцентНДС), 2, РежимОкругления.Окр15как20);
		
	//+ ИнфоСофт Мурсалимов Д.Р. 04.02.24 УА #62781
	ОбъектОтчетКомиссионера.ПорядокРасчетов = ВзаиморасчетыСервер.ПорядокРасчетов(,, ДанныеЗаполнения.Соглашение, ДанныеЗаполнения.Договор);	
	//- ИнфоСофт Мурсалимов Д.Р. 04.02.24 УА #62781	
		
	Попытка

		ОбъектОтчетКомиссионера.Записать(РежимЗаписиДокумента.Проведение);

	Исключение

		ТекстСообщения = СтрШаблон("Не удалось провести документ отчет комиссионера: %1%2", Символы.ПС,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

		Попытка
			ОбъектОтчетКомиссионера.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ТекстСообщения = СтрШаблон("Не удалось записать документ отчет комиссионера: %1%2", Символы.ПС,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;

	КонецПопытки;        
	
	Возврат ОбъектОтчетКомиссионера.Ссылка;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Процедура ЗаполнитьТЧОтчетаКомиссионера(ОтчетКомиссионера, ТаблицаТранзакций, СтруктураПараметров = Неопределено)
	
	//+ ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
	Если ЗначениеЗаполнено(СтруктураПараметров) И СтруктураПараметров.Свойство("СпособРасчетаЦеныВозврата") Тогда
		
		ЦеныВозвратаПоВидуЦен = ?(СтруктураПараметров.СпособРасчетаЦеныВозврата.СпособРасчета = 1, Истина, Ложь);
	
		ВидЦены = СтруктураПараметров.СпособРасчетаЦеныВозврата.ВидЦены; 
		
	Иначе
		
		ЦеныВозвратаПоВидуЦен = Ложь;		
		
	КонецЕсли; 
	//- ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
	//+ ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94609
	МассивПараметров = ПолучитьСписокПараметровЦен();
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(СтруктураПараметров.Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, МассивПараметров);	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен();
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
	//- ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94609
	ОтчетКомиссионера.Товары.Очистить();
	ОтчетКомиссионера.ВидыЗапасов.Очистить();
	Для Каждого Транзакция Из ТаблицаТранзакций Цикл
		
		//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
		Если СтруктураПараметров.ЗаполнитьКолонкуПокупательЯМ И Не Транзакция = Неопределено Тогда
			
			//+ ИнфоСофт Власова И.С. 10.12.24 УА #87450
			//Покупатель = ?(ЗначениеЗаполнено(ОтчетКомиссионера.Контрагент), ОтчетКомиссионера.Контрагент, Справочники.Контрагенты.ПустаяСсылка());
			Покупатель = СтруктураПараметров.РозничныйПокупательЯМ;
			//- ИнфоСофт Власова И.С. 10.12.24 УА #87450
			
			Если ЗначениеЗаполнено(Транзакция.ИннПокупателя) Тогда
				Покупатель = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", Транзакция.ИннПокупателя);
			КонецЕсли;
				
		КонецЕсли;                     
		//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
		
		Если Транзакция.ЭтоНабор Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Транзакция.Номенклатура,
				"ТипНоменклатуры, ВидНоменклатуры");

			Если Транзакция.Количество > 0 Тогда
				
				ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
				ПараметрыКомплектующих.Номенклатура   		= Транзакция.Номенклатура;
				ПараметрыКомплектующих.НоменклатураНабора   = Транзакция.Номенклатура;
				ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.ХарактеристикаНоменклатуры;				
				ПараметрыКомплектующих.КоличествоУпаковок	= Транзакция.Количество;
				ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
				ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
				ПараметрыКомплектующих.ЭтоТовар 			= Истина;
				ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
	
				Склады = Новый Массив;
	
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Дата", 		ОтчетКомиссионера.Дата);
				ДополнительныеПараметры.Вставить("Валюта", 		ОтчетКомиссионера.Валюта);
				ДополнительныеПараметры.Вставить("Склады", 		Склады);
				ДополнительныеПараметры.Вставить("Соглашение", 	ОтчетКомиссионера.Соглашение);
				ДополнительныеПараметры.Вставить("Цена", 		Транзакция.ЦенаПродавца);
				//+ ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252	
				//+ ИнфоСофт Власова И.С. 25.03.25 УА #96707
				//ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.ЦенаПродавца);
				//+ ИнфоСофт Заварин К.В. 10.04.25 УА #98479
				//ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.ЦенаРеализация); 
				ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.РеализованоНаСумму);
				//- ИнфоСофт Заварин К.В. 10.04.25 УА #98479
				//- ИнфоСофт Власова И.С. 25.03.25 УА #96707
				ДополнительныеПараметры.Вставить("Комиссия", 0);
				//- ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252
				ДополнительныеПараметры.Вставить("ЦенаПродажи", Транзакция.ЦенаРеализация);				
				ДополнительныеПараметры.Вставить("СтоимостьДопУслуг", 0);	
				//+ ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94609				
				//ДополнительныеПараметры.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
				ДополнительныеПараметры.Вставить("ВидЦены", СтруктураЦен.ВидЦеныСоСкидкой);
				//- ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94609
				
				//+ ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
				Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
				//- ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
				
				Для Каждого стрКомплекта Из Комплектующие Цикл
	
					НоваяСтрока = ОтчетКомиссионера.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
					НоваяСтрока.КоличествоУпаковокУчет 	= НоваяСтрока.КоличествоУпаковок;
					НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок
														+ стрКомплекта.Погрешность;
														
					//+ ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #83291									
					НоваяСтрока.СуммаПродажи            = НоваяСтрока.ЦенаПродажи * НоваяСтрока.КоличествоУпаковок
														+ стрКомплекта.ПогрешностьСуммаПродажи;
					НоваяСтрока.СуммаВознаграждения 	= стрКомплекта.Комиссия * НоваяСтрока.КоличествоУпаковок
														+ стрКомплекта.ПогрешностьКомиссия;
					//- ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #83291
					
					//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
					НоваяСтрока.Покупатель 			    = Покупатель; 
					//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
					
				КонецЦикла;
			КонецЕсли;
			
			Если Транзакция.ВозвратКоличество > 0 Тогда
				ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
				ПараметрыКомплектующих.Номенклатура   		= Транзакция.Номенклатура;
				ПараметрыКомплектующих.НоменклатураНабора   = Транзакция.Номенклатура;
				ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.ХарактеристикаНоменклатуры;				
				ПараметрыКомплектующих.КоличествоУпаковок	= Транзакция.ВозвратКоличество;
				ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
				ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
				ПараметрыКомплектующих.ЭтоТовар 			= Истина;
				ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
	
				Склады = Новый Массив;
	
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Дата", 		ОтчетКомиссионера.Дата);
				ДополнительныеПараметры.Вставить("Валюта", 		ОтчетКомиссионера.Валюта);
				ДополнительныеПараметры.Вставить("Склады", 		Склады);
				ДополнительныеПараметры.Вставить("Соглашение", 	ОтчетКомиссионера.Соглашение);
				ДополнительныеПараметры.Вставить("Цена", 		Транзакция.ЦенаПродавца);
				//+ ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252	
				ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.ВозвратЦенаРеализации);
				ДополнительныеПараметры.Вставить("Комиссия", 0);
				//- ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252
				ДополнительныеПараметры.Вставить("ЦенаПродажи", Транзакция.ВозвратЦенаРеализации);				
				ДополнительныеПараметры.Вставить("СтоимостьДопУслуг", 0);
				//+ ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94609				
				//ДополнительныеПараметры.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
				ДополнительныеПараметры.Вставить("ВидЦены", СтруктураЦен.ВидЦеныСоСкидкой);
				//- ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94609
				
				//+ ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
				Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
				//- ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
	
				Для Каждого стрКомплекта Из Комплектующие Цикл
	
					НоваяСтрока = ОтчетКомиссионера.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
					НоваяСтрока.КоличествоУпаковок 		= -стрКомплекта.КоличествоУпаковок;
					НоваяСтрока.КоличествоУпаковокУчет 	= -стрКомплекта.КоличествоУпаковок;
					
					//+ ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
					Если Не ЦеныВозвратаПоВидуЦен Тогда
						
						НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок
						+ стрКомплекта.Погрешность;
						
					Иначе
						
						ЦенаРозничная = ЗаполнитьСуммыПоВидуЦен(ВидЦены, ОтчетКомиссионера.Дата, ОтчетКомиссионера.Валюта, НоваяСтрока.Номенклатура, НоваяСтрока.Характеристика, НоваяСтрока.Упаковка);
						
						НоваяСтрока.Цена = -(ЦенаРозничная / НоваяСтрока.КоличествоУпаковок);
						НоваяСтрока.Сумма = -(ЦенаРозничная); 						
						
					КонецЕсли;
					//- ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897 
										
					//+ ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #83291
					НоваяСтрока.СуммаПродажи            = (НоваяСтрока.ЦенаПродажи * НоваяСтрока.КоличествоУпаковок
														+ стрКомплекта.ПогрешностьСуммаПродажи);
					НоваяСтрока.СуммаВознаграждения 	= -(стрКомплекта.Комиссия * стрКомплекта.КоличествоУпаковок
														+ стрКомплекта.ПогрешностьКомиссия);
					//- ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #83291
					
					//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
					НоваяСтрока.Покупатель 			    = Покупатель; 
					//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
										
				КонецЦикла;	
			КонецЕсли;
			
		Иначе
			
			Если Транзакция.Количество > 0 Тогда
				НоваяСтрока = ОтчетКомиссионера.Товары.Добавить();
				НоваяСтрока.Номенклатура 			= Транзакция.Номенклатура;
				НоваяСтрока.Характеристика 			= Транзакция.ХарактеристикаНоменклатуры;
				//+ ИнфоСофт Мурсалимов Д.Р. 23.01.24 УА #66705 
				//+ ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
				//НоваяСтрока.Количество 				= Транзакция.КоличествоВУпаковке * Транзакция.Количество;
                НоваяСтрока.Количество 				= Транзакция.КоэффициентУпаковки * Транзакция.Количество;
				//- ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
				НоваяСтрока.Упаковка 				= Транзакция.Упаковка;
				НоваяСтрока.КоличествоУпаковокУчет 	= Транзакция.Количество;
				НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
				//+ ИнфоСофт Сумин Д.В. 19.04.2024 УА #72638
				НоваяСтрока.Цена 					= Транзакция.ЦенаПродавца / НоваяСтрока.КоличествоУпаковок;
				НоваяСтрока.ЦенаПродажи             = Транзакция.РеализованоНаСумму / НоваяСтрока.КоличествоУпаковок;
				//НоваяСтрока.Цена 					= Транзакция.ЦенаПродавца / НоваяСтрока.Количество;
				//НоваяСтрока.ЦенаПродажи             = Транзакция.РеализованоНаСумму / НоваяСтрока.Количество;
				//- ИнфоСофт Сумин Д.В. 19.04.2024 УА #72638
				НоваяСтрока.Сумма 					= Транзакция.ЦенаПродавца;
				//НоваяСтрока.КоличествоУпаковокУчет 	= Транзакция.Количество;
				//НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
				//НоваяСтрока.Цена 					= Транзакция.ЦенаПродавца;
				//НоваяСтрока.ЦенаПродажи             = Транзакция.РеализованоНаСумму / Транзакция.Количество;
				//НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
				//- ИнфоСофт Мурсалимов Д.Р. 23.01.24 УА #66705	
				НоваяСтрока.СуммаПродажи            = Транзакция.РеализованоНаСумму;
				НоваяСтрока.СуммаВознаграждения 	= 0;
				
				//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
				НоваяСтрока.Покупатель 			    = Покупатель; 
				//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
				
			КонецЕсли;
			
			Если Транзакция.ВозвратКоличество > 0 Тогда
				
				НоваяСтрока = ОтчетКомиссионера.Товары.Добавить();
				НоваяСтрока.Номенклатура 			= Транзакция.Номенклатура;
				НоваяСтрока.Характеристика 			= Транзакция.ХарактеристикаНоменклатуры;
				//+ ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
				//НоваяСтрока.Количество 				= -Транзакция.КоличествоВУпаковке * Транзакция.ВозвратКоличество;
				НоваяСтрока.Количество 				= -Транзакция.КоэффициентУпаковки * Транзакция.ВозвратКоличество;	
				//- ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
				НоваяСтрока.Упаковка 				= Транзакция.Упаковка;			
				НоваяСтрока.КоличествоУпаковокУчет 	= -Транзакция.ВозвратКоличество;
				НоваяСтрока.КоличествоУпаковок 		= -Транзакция.ВозвратКоличество;
				//+ ИнфоСофт Сумин Д.В. 14.05.2024 УА #67999				
				НоваяСтрока.ЦенаПродажи             = -(Транзакция.ВозвращеноНаСумму) / НоваяСтрока.КоличествоУпаковок;
				//НоваяСтрока.Цена 					= Транзакция.ЦенаПродавца / НоваяСтрока.Количество;
				//НоваяСтрока.ЦенаПродажи             = -(Транзакция.ВозвращеноНаСумму) / НоваяСтрока.Количество;
				// ИнфоСофт Сумин Д.В. 14.05.2024 УА #67999
				
				//+ ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
				Если Не ЦеныВозвратаПоВидуЦен Тогда 
					
					НоваяСтрока.Цена 					= -(Транзакция.ЦенаПродавца) / НоваяСтрока.КоличествоУпаковок;
					НоваяСтрока.Сумма 					= -Транзакция.ЦенаПродавца;
					
				Иначе
					
					ЦенаРозничная = ЗаполнитьСуммыПоВидуЦен(ВидЦены, ОтчетКомиссионера.Дата, ОтчетКомиссионера.Валюта, НоваяСтрока.Номенклатура, НоваяСтрока.Характеристика, НоваяСтрока.Упаковка);
					
					НоваяСтрока.Цена = -(ЦенаРозничная / НоваяСтрока.КоличествоУпаковок);
					НоваяСтрока.Сумма = -(ЦенаРозничная); 					
					
				КонецЕсли;
				//- ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
								
				НоваяСтрока.СуммаПродажи            = -(Транзакция.ВозвращеноНаСумму);   
				НоваяСтрока.СуммаВознаграждения 	= 0;
				
				//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
				НоваяСтрока.Покупатель 			    = Покупатель; 
				//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
								
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008 

//+ ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
Функция ДобавитьСопоставлениеNew(ТаблицаТранзакций, Профиль) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаТранзакций.Профиль КАК Профиль,
	|	ТаблицаТранзакций.НомерЗаказа КАК НомерЗаказа, 
	|	ТаблицаТранзакций.ПродажаЮрЛицу КАК ПродажаЮрЛицу, 
	|	ТаблицаТранзакций.ИннПокупателя КАК ИннПокупателя,
	|	ТаблицаТранзакций.ДатаОформленияЗаказа КАК ДатаОформленияЗаказа,
	|	ТаблицаТранзакций.ДатаПередачиТовараВДоставку КАК ДатаПередачиТовараВДоставку,
	|	ТаблицаТранзакций.ДатаДоставкиТовара КАК ДатаДоставкиТовара,
	//+ ИнфоСофт Заварин К.В. 11.11.24 УА #87034
	|	ТаблицаТранзакций.ДатаПриёмаВозврата КАК ДатаПриёмаВозврата,
	//- ИнфоСофт Заварин К.В. 11.11.24 УА #87034
	|	ТаблицаТранзакций.СпособОплаты КАК СпособОплаты, 
	|	ТаблицаТранзакций.НаименованиеКлиента КАК НаименованиеКлиента,
	|	ТаблицаТранзакций.НаименованиеТовара КАК НаименованиеТовара,
	|	ТаблицаТранзакций.АдресКлиента КАК АдресКлиента,
	|	ТаблицаТранзакций.SKU КАК SKU,
	//+ ИнфоСофт Власова И.С. 01.04.25 УА #97214
	|	ТаблицаТранзакций.НомерУПД КАК НомерУПД,
	//- ИнфоСофт Власова И.С. 01.04.25 УА #97214
	|	ВЫРАЗИТЬ(ТаблицаТранзакций.ЦенаПродавца КАК ЧИСЛО(10,2)) КАК ЦенаПродавца,
	|	ВЫРАЗИТЬ(ТаблицаТранзакций.ЦенаРеализация КАК ЧИСЛО(10,2)) КАК ЦенаРеализация,
	|	ВЫРАЗИТЬ(ТаблицаТранзакций.Количество КАК ЧИСЛО(10,2))КАК Количество,
	|	ВЫРАЗИТЬ(ТаблицаТранзакций.ВозвратКоличество КАК ЧИСЛО(10,2)) КАК ВозвратКоличество,
	|	ВЫРАЗИТЬ(ТаблицаТранзакций.ВозвратЦенаРеализации КАК ЧИСЛО(10,2)) КАК ВозвратЦенаРеализации,
	|	ВЫРАЗИТЬ(ТаблицаТранзакций.ВозвращеноНаСумму КАК ЧИСЛО(10,2)) КАК ВозвращеноНаСумму,
	|	ВЫРАЗИТЬ(ТаблицаТранзакций.РеализованоНаСумму КАК Число(10,2)) КАК РеализованоНаСумму
	|ПОМЕСТИТЬ ВТ_ТаблицаТранзакций
	|ИЗ
	|	&ТаблицаТранзакций КАК ТаблицаТранзакций
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ИС_ЯМ_СоответствиеХарактеристик.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ИС_ЯМ_СоответствиеХарактеристик.Характеристика) КАК Характеристика,
	|	ВТ_ТаблицаТранзакций.SKU КАК SKU,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЭтоНабор,
	|	МАКСИМУМ(ИС_ЯМ_СоответствиеХарактеристик.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_ЯМ_СоответствиеХарактеристик.Упаковка.Знаменатель
	|	КОНЕЦ) КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_ТаблицаТранзакций КАК ВТ_ТаблицаТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ПО (ВТ_ТаблицаТранзакций.SKU = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku
	|				И ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаТранзакций.SKU 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ВТ_Номенклатура.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ВТ_Номенклатура.КоэффициентУпаковки КАК КоэффициентУпаковки,
	|	ВТ_ТаблицаТранзакций.SKU КАК SKU,
	|	ВТ_ТаблицаТранзакций.Профиль КАК Профиль,
	|	ВТ_ТаблицаТранзакций.НомерЗаказа КАК НомерЗаказа, 
	|	ВТ_ТаблицаТранзакций.ПродажаЮрЛицу КАК ПродажаЮрЛицу, 
	|	ВТ_ТаблицаТранзакций.ИннПокупателя КАК ИннПокупателя,
	//+ ИнфоСофт Власова И.С. 01.04.25 УА #97214
	|	ВТ_ТаблицаТранзакций.НомерУПД КАК НомерУПД,
	//- ИнфоСофт Власова И.С. 01.04.25 УА #97214
	|	ВТ_ТаблицаТранзакций.ДатаОформленияЗаказа КАК ДатаОформленияЗаказа,
	|	ВТ_ТаблицаТранзакций.ДатаПередачиТовараВДоставку КАК ДатаПередачиТовараВДоставку,
	|	ВТ_ТаблицаТранзакций.ДатаДоставкиТовара КАК ДатаДоставкиТовара,  
	//+ ИнфоСофт Заварин К.В. 11.11.24 УА #87034
	|	ВТ_ТаблицаТранзакций.ДатаПриёмаВозврата КАК ДатаПриёмаВозврата,
	//- ИнфоСофт Заварин К.В. 11.11.24 УА #87034
	|	ВТ_ТаблицаТранзакций.ЦенаПродавца КАК ЦенаПродавца, 
	|	ВТ_ТаблицаТранзакций.ЦенаРеализация КАК ЦенаРеализация, 
	|	ВТ_ТаблицаТранзакций.Количество КАК Количество, 
	|	ВТ_ТаблицаТранзакций.РеализованоНаСумму КАК РеализованоНаСумму,	
	|	ВТ_ТаблицаТранзакций.ВозвратКоличество КАК ВозвратКоличество, 
	|	ВТ_ТаблицаТранзакций.ВозвратЦенаРеализации КАК ВозвратЦенаРеализации, 
	|	ВТ_ТаблицаТранзакций.ВозвращеноНаСумму КАК ВозвращеноНаСумму,
	|	ВТ_ТаблицаТранзакций.АдресКлиента КАК АдресКлиента,
	|	ВТ_ТаблицаТранзакций.НаименованиеКлиента КАК НаименованиеКлиента,
	|	ВТ_ТаблицаТранзакций.НаименованиеТовара КАК НаименованиеТовара,
	|	ВТ_ТаблицаТранзакций.СпособОплаты КАК СпособОплаты
	|ИЗ
	|	ВТ_ТаблицаТранзакций КАК ВТ_ТаблицаТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО ВТ_ТаблицаТранзакций.SKU = ВТ_Номенклатура.SKU";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Профиль", 			Профиль);
	Запрос.УстановитьПараметр("ТаблицаТранзакций", 	ТаблицаТранзакций);		
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат РезультатЗапроса;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005

//+ ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252
Функция СоздатьДокументВозвратТоваров(СтруктураДанных) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(СтруктураДанных.Профиль);
	
	Документ = Документы.ВозвратТоваровОтКлиента.СоздатьДокумент();
	Документ.Дата = СтруктураДанных.Период.ДатаОкончания;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Партнер", ФукнциональныеОпции.ПартнерЯМ);
	ПараметрыФормы.Вставить("Контрагент", ФукнциональныеОпции.КонтрагентЯМ);
	ПараметрыФормы.Вставить("Договор", ФукнциональныеОпции.ДоговорЯМ);
	
	Документ.Заполнить(ПараметрыФормы);
	
	Документ.Соглашение = ФукнциональныеОпции.СоглашениеЯМ;
	Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера;
	
	Документ.Валюта = Документ.Договор.ВалютаВзаиморасчетов;
	
	Документ.Организация = СтруктураДанных.Профиль.Организация;    
	
	Склад = ПолучитьСкладПоУмолчанию(СтруктураДанных.Профиль).Склад;
	
	Документ.Склад = Склад; 
	
	Документ.ЦенаВключаетНДС = Истина;
	
	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	//ПродажаОблагаетсяНДС = ИС_WB_СерверУТ11_5.ПолучитьРезультатПроверкиУчетаНДС(СтруктураДанных.Профиль.Организация);
	//
	//Если ПродажаОблагаетсяНДС Тогда
	//	Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;			
	//Иначе
	//	Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
	//КонецЕсли;
	НастройкиУчета = УчетНДСУП.ПараметрыУчетаПоОрганизации(СтруктураДанных.Профиль.Организация, ТекущаяДатаСеанса());
	Документ.НалогообложениеНДС = НастройкиУчета.ОсновноеНалогообложениеНДСПродажи;
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	
	ЗаполнитьТЧРеализации(Документ, СтруктураДанных.ТаблицаПродаж);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
	Документ.Организация, Документ.НалогообложениеНДС, Документ.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
	ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Документ));
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
	Документ.ЦенаВключаетНДС));	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Документ.Товары, СтруктураДействий, Неопределено);	
	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		Документ.Записать();
	КонецПопытки; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Документ;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 23.08.2023 УА #61252
Функция СоздатьДокументВзаимозачетЗадолженности(ОбъектРасчетов, Документ, ОтчетКомиссионера) Экспорт  
	
	ДокументВзаимозачет = Документы.ВзаимозачетЗадолженности.СоздатьДокумент();
	
	ДокументВзаимозачет.Дата = Документ.Дата;
	ДокументВзаимозачет.Организация = Документ.Организация; 
	
	ДокументВзаимозачет.КонтрагентДебитор = Документ.Контрагент;
	ДокументВзаимозачет.КонтрагентКредитор = ОтчетКомиссионера.Контрагент; 
	
	ДокументВзаимозачет.СуммаДокумента = Документ.СуммаДокумента;
	ДокументВзаимозачет.Валюта = Документ.Валюта;
	ДокументВзаимозачет.ВидОперации = Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаКлиентаМеждуКонтрагентами;
	ДокументВзаимозачет.ТипДебитора = Перечисления.ТипыУчастниковВзаимозачета.Клиент;
	ДокументВзаимозачет.ТипКредитора = Перечисления.ТипыУчастниковВзаимозачета.Клиент;
	ДокументВзаимозачет.СуммаРегл = ИС_WB_СерверУТ11_5.ПересчитатьВСуммуРегл(Документ.СуммаДокумента, Документ.Валюта, Документ.Дата); 
	ДокументВзаимозачет.СуммаУпр = ИС_WB_СерверУТ11_5.ПересчитатьВСуммуУпр(Документ.СуммаДокумента, Документ.Валюта, Документ.Дата); 
	
	ДебиторскаяЗадолженностьТЧ = ДокументВзаимозачет.ДебиторскаяЗадолженность.Добавить();
	ДебиторскаяЗадолженностьТЧ.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	ДебиторскаяЗадолженностьТЧ.Партнер = Документ.Партнер; 	
	ДебиторскаяЗадолженностьТЧ.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ОбъектРасчетов);	
	ДебиторскаяЗадолженностьТЧ.СуммаВзаиморасчетов = Документ.СуммаДокумента;
	ДебиторскаяЗадолженностьТЧ.ВалютаВзаиморасчетов = Документ.Валюта;
	ДебиторскаяЗадолженностьТЧ.Организация = Документ.Организация; 
	ДебиторскаяЗадолженностьТЧ.СуммаРегл = ДокументВзаимозачет.СуммаРегл; 
	ДебиторскаяЗадолженностьТЧ.СуммаУпр = ДокументВзаимозачет.СуммаУпр;
	
	КредиторскаяЗадолженностьТЧ = ДокументВзаимозачет.КредиторскаяЗадолженность.Добавить();
	КредиторскаяЗадолженностьТЧ.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	КредиторскаяЗадолженностьТЧ.Партнер = ОтчетКомиссионера.Партнер;
	КредиторскаяЗадолженностьТЧ.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ОтчетКомиссионера.Ссылка);
	КредиторскаяЗадолженностьТЧ.СуммаВзаиморасчетов = Документ.СуммаДокумента;
	КредиторскаяЗадолженностьТЧ.ВалютаВзаиморасчетов = Документ.Валюта;
	КредиторскаяЗадолженностьТЧ.Организация = Документ.Организация;
	КредиторскаяЗадолженностьТЧ.СуммаРегл = ДокументВзаимозачет.СуммаРегл; 
	КредиторскаяЗадолженностьТЧ.СуммаУпр = ДокументВзаимозачет.СуммаУпр;
	
	Попытка
		ДокументВзаимозачет.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		ДокументВзаимозачет.Записать();
	КонецПопытки; 	 
	
	Возврат ДокументВзаимозачет.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 23.08.2023 УА #61252 

//+ ИнфоСофт Ивонин К.А. 02.10.23 УА #640257
Процедура СоздатьИлиОбновитьСклады(Профиль, Данные, КампанияID)

	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #88575
	Для Каждого ЭлементГруппы Из Данные.warehouseGroups Цикл
		
		НазваниеГруппы = ЭлементГруппы.name;
		
		Для Каждого Элемент Из ЭлементГруппы.warehouses Цикл
			
			Если Элемент.campaignId <> КампанияID Тогда
				Продолжить;
			КонецЕсли;
			
			СоздатьОбъектСклада(Профиль, Элемент, ЭлементГруппы.mainWarehouse, НазваниеГруппы); 		
			
		КонецЦикла;
		
	КонецЦикла;
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #88575 
	
	Для Каждого Элемент Из Данные.warehouses Цикл
	    
	    Если Элемент.campaignId <> КампанияID Тогда
	    	Продолжить;
	    КонецЕсли;
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #88575
		СоздатьОбъектСклада(Профиль, Элемент); 		
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #88575
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 02.10.23 УА #64020

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #88575
Процедура СоздатьОбъектСклада(Профиль, Данные, ДанныеОсновногоСкладаГруппы = Неопределено, НазваниеГруппы = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_ЯМ_Склады.Ссылка КАК Ссылка,
	|	ИС_ЯМ_Склады.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ИС_ЯМ_Склады КАК ИС_ЯМ_Склады
	|ГДЕ
	|	ИС_ЯМ_Склады.id = &id
	|	И ИС_ЯМ_Склады.ЛичныйКабинет = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("id", Данные.id);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать();
	
	Если ВыборкаСклад.Следующий() Тогда
		
		Если ВыборкаСклад.Наименование <> Данные.name Тогда
			СкладОбъект = ВыборкаСклад.Ссылка.ПолучитьОбъект();			
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		СкладОбъект = Справочники.ИС_ЯМ_Склады.СоздатьЭлемент();		
	КонецЕсли;
	
	СкладОбъект.ЛичныйКабинет = Профиль;
	СкладОбъект.Наименование = Данные.name;
	СкладОбъект.id = Данные.id;
	СкладОбъект.ИспользоватьВЗаказах = Истина;
	
	Если ТипЗнч(ДанныеОсновногоСкладаГруппы) = Тип("Структура") Тогда
		
		СкладОбъект.ИДМагазинаОсновногоСкладаГруппы = ДанныеОсновногоСкладаГруппы.campaignId;
		СкладОбъект.ИДОсновногоСкладаГруппы = ДанныеОсновногоСкладаГруппы.id;
		СкладОбъект.НаименованиеГруппыСкладов = НазваниеГруппы;
		
	КонецЕсли;
	
	Попытка
		СкладОбъект.Записать();	
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #88575

//+ ИнфоСофт Мурсалимов Д.Р. 16.10.23 УА #63301
Процедура ЗаписатьСкрываемыйОстаток(Профиль, Склад, НоменклатураЯМ, Остаток) Экспорт

	МенеджерЗаписи = РегистрыСведений.ИС_ЯМ_ОграничениеОстатков.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.НоменклатураЯМ = НоменклатураЯМ;
	МенеджерЗаписи.Прочитать();
			
	МенеджерЗаписи.Профиль = Профиль;	
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.НоменклатураЯМ = НоменклатураЯМ;
	МенеджерЗаписи.Количество = Остаток;

	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 16.10.23 УА #63301

//+ ИнфоСофт Сумин Д.В. 07.11.2023 УА #65561
Функция ПолучитьЗаказПоНомеру(id) 
	
	Попытка 
		НомерЗаказ = ПреобразоватьВСтрокуБезПробелов(id);
	Исключение
		Возврат Документы.ИС_ЯМ_Заказ.ПустаяСсылка();
	КонецПопытки;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ИС_ЯМ_Заказ.Ссылка, ЗНАЧЕНИЕ(Документ.ИС_ЯМ_Заказ.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
	|ГДЕ
	|	ИС_ЯМ_Заказ.Номер = &Номер"); 
	
	Запрос.УстановитьПараметр("Номер", НомерЗаказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Документы.ИС_ЯМ_Заказ.ПустаяСсылка();
    КонецЕсли;
		
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка; 
	
КонецФункции //- ИнфоСофт Сумин Д.В. 07.11.2023 УА #65561

//+ ИнфоСофт Сумин Д.В. 07.11.2023 УА #65561
Функция ПреобразоватьВСтрокуБезПробелов(id)
	НомерЗаказа = Строка(id);
	НомерЗаказа = СтрЗаменить(НомерЗаказа, " ", "");
	НомерЗаказа = СтрЗаменить(НомерЗаказа,Символы.НПП, ""); 
	Возврат НомерЗаказа;
КонецФункции //- ИнфоСофт Сумин Д.В. 07.11.2023 УА #65561

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Функция ПолучитьИмяСобытия(Имя)
	Возврат СтрШаблон("ИС.МП.ИС_ЯМ_Сервер.%1", Имя);
КонецФункции //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

//+ ИнфоСофт Мурсалимов Д.Р. 26.01.24 УА #62628
Процедура ДобавитьСоответствиеНоменклатуры(Профиль, НоменклатураЯМ, Номенклатура, 
	Характеристика, Упаковка, ТекНоменклатура = Неопределено, ТекХарактеристика = Неопределено) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_ЯМ_СоответствиеХарактеристик.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.НоменклатураЯМ.Установить(НоменклатураЯМ);
		
	НаборЗаписей.Прочитать(); 
	
	ТребуетсяНоваяЗапись = Истина;	
	Если НаборЗаписей.Количество() > 0 Тогда 
		
		Для Каждого Запись Из НаборЗаписей Цикл
		
			Если Запись.Номенклатура = ТекНоменклатура И Запись.Характеристика = ТекХарактеристика Тогда
			
				Запись.Номенклатура 	= Номенклатура;
				Запись.Характеристика 	= Характеристика;
				Запись.Упаковка 		= Упаковка;
        		ТребуетсяНоваяЗапись 	= Ложь;
        		Прервать;
			
			КонецЕсли;
		
		КонецЦикла; 	
	
	КонецЕсли;
   
    Если ТребуетсяНоваяЗапись Тогда
	
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.НоменклатураЯМ 		= НоменклатураЯМ;
		НоваяЗапись.Номенклатура 		= Номенклатура; 
		НоваяЗапись.Характеристика 		= Характеристика;
		НоваяЗапись.Упаковка 			= Упаковка;
		
	КонецЕсли;
				
	НаборЗаписей.Записывать = Истина; 
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 26.01.24 УА #62628

//+ ИнфоСофт Стояк Ю.К. 21.04.2025 УА #97604
Процедура ЗаписатьСтатусЗаказа(Профиль, ЗаказЯМ, ДанныеПоЗаказу)
	
	Событие = ПолучитьИмяСобытия("ЗаписатьСтатусЗаказа");	
	
	МенеджерЗаписи = РегистрыСведений.ИС_ЯМ_СтатусыСборочныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Заказ = ЗаказЯМ;
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Заказ = ЗаказЯМ;   
		
	БылОтменён = Ложь;
	
	Если МенеджерЗаписи.status = Перечисления.ИС_ЯМ_СтатусыЗаказов.CANCELLED Тогда
		БылОтменён = Истина;
	КонецЕсли;
		
	Попытка
		МенеджерЗаписи.status = Перечисления.ИС_ЯМ_СтатусыЗаказов[ДанныеПоЗаказу.status];
	Исключение
	КонецПопытки;
	
	Попытка
		МенеджерЗаписи.substatus = Перечисления.ИС_ЯМ_ДетальныеСтатусы[ДанныеПоЗаказу.substatus]; 
	Исключение
	КонецПопытки;
	
	Если МенеджерЗаписи.status = Перечисления.ИС_ЯМ_СтатусыЗаказов.CANCELLED И Не БылОтменён Тогда		
		ОтменитьЗаказ(ЗаказЯМ, Профиль);	
	КонецЕсли;	
	
	Попытка
		МенеджерЗаписи.Записать(Истина);	
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	КонецПопытки;
			
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.04.2025 УА #97604

//+ ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252
Функция СоздатьРеализациюТоваровЧерезКомиссионера(СтруктураДанных) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Событие = "Создание реализации через комиссионера"; 
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(СтруктураДанных.Профиль);
	
	ДокументОбъект = Документы["РеализацияТоваровУслуг"].СоздатьДокумент(); 
	
	Если СтруктураДанных.ЗаказКлиента <> Неопределено Тогда		
		ДокументОбъект.Заполнить(СтруктураДанных.ЗаказКлиента.Ссылка);
	Иначе
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Организация", ФукнциональныеОпции.Организация);
		ДанныеЗаполнения.Вставить("Соглашение", ФукнциональныеОпции.СоглашениеЯМ);
		ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина);
		ДанныеЗаполнения.Вставить("Договор", ФукнциональныеОпции.ДоговорЯМ);
		ДокументОбъект.Заполнить(ДанныеЗаполнения);		
	КонецЕсли;	
		
		ДокументОбъект.ЦенаВключаетНДС = Истина;
		
		//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
		//ПродажаОблагаетсяНДС = ИС_WB_СерверУТ11_5.ПолучитьРезультатПроверкиУчетаНДС(СтруктураДанных.Профиль.Организация);
		//
		//Если ПродажаОблагаетсяНДС Тогда 		
		//	ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС; 
		//Иначе
		//	ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
		//КонецЕсли;
		НастройкиУчета = УчетНДСУП.ПараметрыУчетаПоОрганизации(СтруктураДанных.Профиль.Организация, ТекущаяДатаСеанса());
		ДокументОбъект.НалогообложениеНДС = НастройкиУчета.ОсновноеНалогообложениеНДСПродажи;
		//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
		
		//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
		//Если Не ЗначениеЗаполнено(ФукнциональныеОпции.КонтрагентЯМ) Тогда	
		//	ТекстСообщения = СтрШаблон(
		//	"Не заполнен контрагент в настройках ЯМ для аккаунта: %1. Документ отчет комиссионера не создан.",
		//	СтруктураДанных.Профиль);
		//	ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
		//	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		//	Возврат Неопределено;
		//	
		//КонецЕсли;
		//- ИнфоСофт Власова И.С. 06.08.24 УА #67453
		
		Если СтруктураДанных.РеализацияЧерезКомиссионера Тогда
			ХозОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионера");
		Иначе
			ХозОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту");	
		КонецЕсли;
		
		ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
		//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
		//Если ИспользоватьДоговорыСКлиентами Тогда
		//	Если ЗначениеЗаполнено(СтруктураДанных.ТаблицаПродаж[0].Договор) Тогда	
		//		Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(СтруктураДанных.ТаблицаПродаж[0].Договор, "ХозяйственнаяОперация") = ХозОперация Тогда
		//			
		//			ТекстСообщения = СтрШаблон(
		//			"договор контрагента: %1 имеет хозяйственную операцию отличающуюся от ""Реализация через комиссионера"". Документ не создан.",
		//			СтруктураДанных.Профиль);
		//			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
		//			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		//			Возврат Неопределено;		
		//		КонецЕсли;
		//		
		//	Иначе	
		//		ТекстСообщения = СтрШаблон(
		//		"Не заполнен договор контрагента: %1. Документ не создан.",
		//		СтруктураДанных.Профиль);
		//		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
		//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		//		Возврат Неопределено;	
		//	КонецЕсли;
		//КонецЕсли;
		//- ИнфоСофт Власова И.С. 06.08.24 УА #67453
		
		ДокументОбъект.Дата 					= СтруктураДанных.Период.ДатаОкончания;
		ДокументОбъект.ХозяйственнаяОперация 	= ХозОперация;   
		
		Если СтруктураДанных.РеализацияЧерезКомиссионера Тогда 
			ДокументОбъект.Партнер					= ФукнциональныеОпции.ПартнерЯМ;
			ДокументОбъект.Контрагент				= ФукнциональныеОпции.КонтрагентЯМ;
			ДокументОбъект.Договор					= ФукнциональныеОпции.ДоговорЯМ;
			ДокументОбъект.Соглашение				= ФукнциональныеОпции.СоглашениеЯМ;
			ДокументОбъект.КлиентКонтрагент			= СтруктураДанных.ТаблицаПродаж[0].Контрагент;
			ДокументОбъект.КлиентПартнер			= СтруктураДанных.ТаблицаПродаж[0].Партнер;
			ДокументОбъект.КлиентДоговор			= СтруктураДанных.ТаблицаПродаж[0].Договор;	
		Иначе
			ДокументОбъект.СкидкиРассчитаны         = Истина;
			ДокументОбъект.Склад           			= ПолучитьСкладПоУмолчанию(СтруктураДанных.Профиль).Склад;	
			ДокументОбъект.Соглашение				= СтруктураДанных.ТаблицаПродаж[0].Соглашение;
			ДокументОбъект.Контрагент				= СтруктураДанных.ТаблицаПродаж[0].Контрагент;
			ДокументОбъект.Партнер					= СтруктураДанных.ТаблицаПродаж[0].Партнер;
			ДокументОбъект.Договор					= СтруктураДанных.ТаблицаПродаж[0].Договор;
			
			Если Не ЗначениеЗаполнено(ДокументОбъект.Соглашение) Или Не ЗначениеЗаполнено(ДокументОбъект.Соглашение.ПорядокРасчетов) Тогда
				ДокументОбъект.Порядокрасчетов = ДокументОбъект.Договор.ПорядокРасчетов;
			Иначе
				ДокументОбъект.Порядокрасчетов = ДокументОбъект.Соглашение.ПорядокРасчетов;	
			КонецЕсли;
			
		КонецЕсли; 
		
		//+ ИнфоСофт Власова И.С. 22.04.25 УА #99526			
		ДокументОбъект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРеализацийТоваровУслуг.Отгружено");	
		//- ИнфоСофт Власова И.С. 22.04.25 УА #99526
		
		//+ ИнфоСофт Власова И.С. 01.04.25 УА #97214
		Если СтруктураДанных.Свойство("НомерУПД") И ЗначениеЗаполнено(СтруктураДанных.НомерУПД) Тогда
			ДокументОбъект.Комментарий = СтрШаблон("Номер УПД: %1", СтруктураДанных.НомерУПД);
		КонецЕсли;
		//- ИнфоСофт Власова И.С. 01.04.25 УА #97214
		
		Если СтруктураДанных.ЗаказКлиента = Неопределено Тогда			
			ЗаполнитьТЧРеализации(ДокументОбъект, СтруктураДанных.ТаблицаПродаж, ДокументОбъект.Склад, СтруктураДанных.ЗаказКлиента);
		КонецЕсли; 
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
		ДокументОбъект.Организация, ДокументОбъект.НалогообложениеНДС, ДокументОбъект.Дата));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
		ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект));
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
		ДокументОбъект.ЦенаВключаетНДС));	
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокументОбъект.Товары, СтруктураДействий, Неопределено);
			
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		
		//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
		//ТекстСообщения = СтрШаблон("Не удалось провести документ отчет комиссионера: %1%2", Символы.ПС,
		//ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		//
		//Попытка
		//	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		//Исключение
		//	ТекстСообщения = СтрШаблон("Не удалось записать документ отчет комиссионера: %1%2", Символы.ПС,
		//	ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		//	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		//КонецПопытки;
		
		Попытка
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			ТекстСообщения = СтрШаблон("Не удалось провести документ реализации товаров: %1%2%3", ДокументОбъект.Ссылка, Символы.ПС, 
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка);
			
		Исключение
			
			ТекстСообщения = СтрШаблон("Не удалось записать документ реализации товаров по контрагенту: %1%2%3", ДокументОбъект.Контрагент, Символы.ПС,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			Возврат Неопределено;
			
		КонецПопытки;
		//- ИнфоСофт Власова И.С. 06.08.24 УА #67453
		
	КонецПопытки;        
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 22.08.2023 УА #61252
Функция СоздатьЗаказКлиента(СтруктураДанных) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	Событие = "Создание заказа клиента";
	
	ДокументОбъект = Документы["ЗаказКлиента"].СоздатьДокумент();
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(СтруктураДанных.Профиль);
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", ФукнциональныеОпции.Организация);
	ДанныеЗаполнения.Вставить("Соглашение", СтруктураДанных.ТаблицаПродаж[0].Соглашение);
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина);
	ДанныеЗаполнения.Вставить("Контрагент", СтруктураДанных.ТаблицаПродаж[0].Контрагент);
	ДанныеЗаполнения.Вставить("Партнер", СтруктураДанных.ТаблицаПродаж[0].Партнер);
	ДанныеЗаполнения.Вставить("Договор", ФукнциональныеОпции.ДоговорЯМ);
	
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	
	ДокументОбъект.ЦенаВключаетНДС = Истина;
	
	ПродажаОблагаетсяНДС = ИС_WB_СерверУТ11_5.ПолучитьРезультатПроверкиУчетаНДС(СтруктураДанных.Профиль.Организация);
	
	Если ПродажаОблагаетсяНДС Тогда 		
		ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС; 
	Иначе
		ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФукнциональныеОпции.КонтрагентЯМ) Тогда	
		ТекстСообщения = СтрШаблон(
		"Не заполнен контрагент.",
		СтруктураДанных.Профиль);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
		
	КонецЕсли; 
	
	ХозОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту");	
	
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	Если ИспользоватьДоговорыСКлиентами Тогда
		Если ЗначениеЗаполнено(СтруктураДанных.ТаблицаПродаж[0].Договор) Тогда	
			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(СтруктураДанных.ТаблицаПродаж[0].Договор, "ХозяйственнаяОперация") = ХозОперация Тогда
				
				ТекстСообщения = СтрШаблон(
				"договор контрагента: %1 имеет хозяйственную операцию отличающуюся от ""Реализация клиенту"". Документ не создан.",
				СтруктураДанных.Профиль);
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат Неопределено;		
			КонецЕсли;
			
		Иначе	
			ТекстСообщения = СтрШаблон(
			"Не заполнен договор контрагента: %1. Документ не создан.",
			СтруктураДанных.Профиль);
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;	
		КонецЕсли;
	КонецЕсли; 
	
	ДокументОбъект.Дата 					= СтруктураДанных.Период.ДатаОкончания;
	ДокументОбъект.ДатаОтгрузки             = СтруктураДанных.Период.ДатаОкончания;
	ДокументОбъект.ХозяйственнаяОперация 	= ХозОперация;   
	ДокументОбъект.СкидкиРассчитаны         = Истина;
	ДокументОбъект.Склад           			= ПолучитьСкладПоУмолчанию(СтруктураДанных.Профиль).Склад;	
	ДокументОбъект.Соглашение				= СтруктураДанных.ТаблицаПродаж[0].Соглашение;
	ДокументОбъект.Контрагент				= СтруктураДанных.ТаблицаПродаж[0].Контрагент;
	ДокументОбъект.Партнер					= СтруктураДанных.ТаблицаПродаж[0].Партнер;
	ДокументОбъект.Договор					= СтруктураДанных.ТаблицаПродаж[0].Договор;	
	ДокументОбъект.Согласован   			= Истина;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.Соглашение) Или Не ЗначениеЗаполнено(ДокументОбъект.Соглашение.ПорядокРасчетов) Тогда
		ДокументОбъект.Порядокрасчетов = ДокументОбъект.Договор.ПорядокРасчетов;
	Иначе
		ДокументОбъект.Порядокрасчетов = ДокументОбъект.Соглашение.ПорядокРасчетов;	
	КонецЕсли;
	
	ЗаполнитьТЧРеализации(ДокументОбъект, СтруктураДанных.ТаблицаПродаж, ДокументОбъект.Склад);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
	ДокументОбъект.Организация, ДокументОбъект.НалогообложениеНДС, ДокументОбъект.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
	ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект));
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
	ДокументОбъект.ЦенаВключаетНДС));	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокументОбъект.Товары, СтруктураДействий, Неопределено);
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстСообщения = СтрШаблон("Не удалось провести документ отчет комиссионера: %1%2", Символы.ПС,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ТекстСообщения = СтрШаблон("Не удалось записать документ отчет комиссионера: %1%2", Символы.ПС,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
	КонецПопытки;        
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 22.08.2023 УА #61252	

//+ ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252
Процедура ЗаполнитьТЧРеализации(Документ, ТаблицаТранзакций, Склад = Неопределено, ЗаказКлиента = Неопределено)
	
	Документ.Товары.Очистить(); 
	
	Если ТипЗнч(Документ.Ссылка) <> Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Документ.ВидыЗапасов.Очистить(); 	
		ТребуетсяСтатусСтроки = Ложь;
	Иначе		
		ТребуетсяСтатусСтроки = Истина;	
	КонецЕсли;
	
	Для Каждого Транзакция Из ТаблицаТранзакций Цикл
		Если Транзакция.ЭтоНабор Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Транзакция.Номенклатура,
			"ТипНоменклатуры, ВидНоменклатуры");
			
			Если Транзакция.Количество > 0 Тогда
				ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
				ПараметрыКомплектующих.Номенклатура   		= Транзакция.Номенклатура;
				ПараметрыКомплектующих.НоменклатураНабора   = Транзакция.Номенклатура;
				ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.ХарактеристикаНоменклатуры;				
				ПараметрыКомплектующих.КоличествоУпаковок	= Транзакция.Количество;
				ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
				ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
				ПараметрыКомплектующих.ЭтоТовар 			= Истина;
				ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
				
				Склады = Новый Массив;
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Дата", 		Документ.Дата);
				ДополнительныеПараметры.Вставить("Валюта", 		Документ.Валюта);
				ДополнительныеПараметры.Вставить("Склады", 		Склады);
				ДополнительныеПараметры.Вставить("Соглашение", 	Документ.Соглашение);
				ДополнительныеПараметры.Вставить("Цена", Транзакция.ЦенаРеализация);				
				ДополнительныеПараметры.Вставить("СтоимостьДопУслуг", 0);	
				ДополнительныеПараметры.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка")); 
				ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.ЦенаРеализация); 
				ДополнительныеПараметры.Вставить("Комиссия", 0);
				
				//+ ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
				Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
				//- ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
				
				Для Каждого стрКомплекта Из Комплектующие Цикл			
					НоваяСтрока = Документ.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
					НоваяСтрока.Количество 				= НоваяСтрока.КоличествоУпаковок;
					НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок
					+ стрКомплекта.Погрешность;
					Если Склад <> Неопределено Тогда
						НоваяСтрока.Склад 			= Склад;	
					КонецЕсли;
					Если ТребуетсяСтатусСтроки Тогда
						НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;	
					КонецЕсли;
					Если ЗаказКлиента <> Неопределено Тогда
						НоваяСтрока.ЗаказКлиента = ЗаказКлиента.Ссылка;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;			
		Иначе		
			Если Транзакция.Количество > 0 Тогда
				НоваяСтрока = Документ.Товары.Добавить();
				НоваяСтрока.Номенклатура 			= Транзакция.Номенклатура;
				НоваяСтрока.Характеристика 			= Транзакция.ХарактеристикаНоменклатуры;				
				НоваяСтрока.Количество 				= Транзакция.Количество;
				НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
				НоваяСтрока.Цена 					= Транзакция.ЦенаРеализация;
				НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
				Если ТребуетсяСтатусСтроки Тогда
					НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;	
				КонецЕсли;
				Если Склад <> Неопределено Тогда
					НоваяСтрока.Склад 				= Склад;	
				КонецЕсли; 
				Если ЗаказКлиента <> Неопределено Тогда
						НоваяСтрока.ЗаказКлиента = ЗаказКлиента.Ссылка;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 21.08.2023 УА #61252

//+ ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
Функция ЗаполнитьСуммыПоВидуЦен(ВидЦены, ДатаЗаполнения, ВалютаДокумента, Номенклатура, Характеристика, Упаковка)
	
	Если НЕ ЗначениеЗаполнено(ВидЦены) ИЛИ НЕ ЗначениеЗаполнено(ДатаЗаполнения) Тогда
		Возврат 0;
	КонецЕсли;
	
	СтруктураПараметровОтбора = Новый Структура;
	СтруктураПараметровОтбора.Вставить("Валюта", ВалютаДокумента);
	СтруктураПараметровОтбора.Вставить("Дата", ДатаЗаполнения);
	СтруктураПараметровОтбора.Вставить("ВидЦены", ВидЦены);
	СтруктураПараметровОтбора.Вставить("Номенклатура", Номенклатура);
	СтруктураПараметровОтбора.Вставить("Характеристика", Характеристика);
	СтруктураПараметровОтбора.Вставить("Упаковка", Упаковка);
	СтруктураПараметровОтбора.Вставить("Серия", "");
	
	Цена = ЦеныПредприятияЗаполнениеСервер.ПолучитьЦенуПоОтбору(СтруктураПараметровОтбора);
	
	Возврат Цена;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897

//+ ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
//+ ИнфоСофт Заварин К.В. 20.03.25 УА #96732
//Функция СоздатьРеализацию(Профиль, Выборка, ФукнциональныеОпции, Комиссия25) 
Функция СоздатьРеализацию(Профиль, Выборка, ФукнциональныеОпции, Комиссия25, МассивДляЗаполнения = Неопределено)
//- ИнфоСофт Заварин К.В. 20.03.25 УА #96732
//Процедура СоздатьРеализацию(Профиль, Выборка, ФукнциональныеОпции, Комиссия25)	
//- ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
	
	Событие = ПолучитьИмяСобытия("СоздатьРеализации1С");
	
	Если Комиссия25 Тогда
		ДокументРеализация = Документы.ПередачаТоваровХранителю.СоздатьДокумент();	
		//+ ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754		
		ПустаяСсылкаРеализации = Документы.ПередачаТоваровХранителю.ПустаяСсылка();
		//- ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
	Иначе
		ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		//+ ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
		ПустаяСсылкаРеализации = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
		//- ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 20.03.25 УА #96732
	Если Не МассивДляЗаполнения = Неопределено Тогда
		
		Попытка	
			
			Если Комиссия25 Тогда
				СтруктураЗаполнения = СозданиеНаОснованииУТВызовСервера.ПередачаТоваровХранителюПараметрыОткрытияФормы(МассивДляЗаполнения);
			Иначе
				СтруктураЗаполнения = СозданиеНаОснованииУТВызовСервера.РеализацияТоваровУслугПараметрыОткрытияФормы(МассивДляЗаполнения);
			КонецЕсли;
			
			Если СтруктураЗаполнения = Неопределено Тогда
				Возврат	ПустаяСсылкаРеализации;
			КонецЕсли;
			
			ДокументРеализация.Заполнить(СтруктураЗаполнения.Основание); 
			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки; 
		
	Иначе

	//- ИнфоСофт Заварин К.В. 20.03.25 УА #96732
	
	Попытка
		ДокументРеализация.Заполнить(Выборка.Заказ); 
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//+ ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
		Возврат ПустаяСсылкаРеализации;
		//- ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
	КонецПопытки;  
	
	//+ ИнфоСофт Заварин К.В. 20.03.25 УА #96732
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 20.03.25 УА #96732
	
	//+ ИнфоСофт Мурсалимов Д.Р. 04.03.25 УА #95186
	Если ДокументРеализация.Товары.Количество() = 0 Тогда
		
		ДокументРеализация.ЗаказКлиента 	= Неопределено;
		ДокументРеализация.ПометкаУдаления 	= Истина;
		 
		Попытка
			ДокументРеализация.Записать(РежимЗаписиДокумента.Запись);			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			//+ ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
			Возврат ПустаяСсылкаРеализации;
			//- ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
		КонецПопытки;
			
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 04.03.25 УА #95186
	
	Если Не ФукнциональныеОпции.ДатаОтгрузкиИлиТекущаяДатаВРеализациюЯМ Тогда
		Если ЗначениеЗаполнено(Выборка.shipmentDate) Тогда
			ДокументРеализация.Дата = Выборка.shipmentDate;		
		Иначе                                                 
			ДокументРеализация.Дата = ТекущаяДатаСеанса();
		КонецЕсли;	
	Иначе
		ДокументРеализация.Дата = ТекущаяДатаСеанса();	
	КонецЕсли;
	
	ДокументРеализация.Комментарий = Выборка.Заказ.Комментарий;
	
	Если Не Комиссия25 Тогда
		ДокументРеализация.СкидкиРассчитаны = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФукнциональныеОпции.ПодразделениеЯМ) Тогда  
		ДокументРеализация.Подразделение = ФукнциональныеОпции.ПодразделениеЯМ;
	КонецЕсли;		
	
	ЗаписыватьДокумент = Ложь;
	
	Если ФукнциональныеОпции.ПроводитьРеализацииЯМ Тогда
		
		Попытка
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписыватьДокумент = Истина;
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст); 
		КонецПопытки; 
		
		//+ ИнфоСофт Стояк Ю.К. 18.12.2023 УА #63805			
		Если Не ЗаписыватьДокумент И ФукнциональныеОпции.ПереводитьЗаказВГотовностьЯМ Тогда 
			
			Если Выборка.Статус = Перечисления.ИС_ЯМ_СтатусыЗаказов.PROCESSING И Выборка.Подстатус = Перечисления.ИС_ЯМ_ДетальныеСтатусы.STARTED Тогда			
				Массив = Новый Массив;
				Массив.Добавить(Новый Структура("Номер", Выборка.Номер));
				ИзменитьСтатусыЗаказов(Профиль,	Массив,	Перечисления.ИС_ЯМ_СтатусыЗаказов.PROCESSING, Перечисления.ИС_ЯМ_ДетальныеСтатусы.READY_TO_SHIP);			
			КонецЕсли;
			
		КонецЕсли;
		//- ИнфоСофт Стояк Ю.К. 18.12.2023 УА #63805
		
	Иначе
		ЗаписыватьДокумент = Истина;	
	КонецЕсли;
	
	Если ЗаписыватьДокумент Тогда	
		
		Попытка
			ДокументРеализация.Записать();			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			//+ ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
			Возврат ПустаяСсылкаРеализации;
			//- ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
		КонецПопытки;
		
	КонецЕсли; 
	
	//+ ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
	Возврат ДокументРеализация;
	//- ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
	
//+ ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
//КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Функция Комплектующие(Параметры, ДополнительныеПараметры)
		
	УстановитьПривилегированныйРежим(Истина);

	Если Не ЗначениеЗаполнено(Параметры.ВариантКомплектацииНоменклатуры) Тогда
		ВариантКомплектацииНоменклатуры = ВариантКомплектацииНоменклатурыПоУмолчанию(
			Параметры.НоменклатураНабора, Параметры.ХарактеристикаНабора);
	Иначе
		ВариантКомплектацииНоменклатуры = Параметры.ВариантКомплектацииНоменклатуры;
	КонецЕсли;

	Если Не Параметры.Свойство("КоличествоУпаковок") Тогда
		Параметры.Вставить("КоличествоУпаковок", 1);
	КонецЕсли;

	ПодобранныеТовары = Новый Массив;

	Если Не ЗначениеЗаполнено(ВариантКомплектацииНоменклатуры) Тогда
		ТекстОшибки = СтрШаблон("Для номенклатуры %1 %2 не определен состав набора", Параметры.НоменклатураНабора,
			Параметры.ХарактеристикаНабора);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат ПодобранныеТовары;
	КонецЕсли;
	
	Колонки = Новый Массив;
	Колонки.Добавить("НомерСтроки");
	Колонки.Добавить("НоменклатураКомплекта");
	Колонки.Добавить("ХарактеристикаКомплекта");
	Колонки.Добавить("Номенклатура");
	Колонки.Добавить("Характеристика");
	Колонки.Добавить("Цена");
	Колонки.Добавить("ВидЦены");
	Колонки.Добавить("Упаковка");
	Колонки.Добавить("Количество");
	Колонки.Добавить("КоличествоУпаковок");
	Колонки.Добавить("ПроцентРучнойСкидки");
	Колонки.Добавить("СуммаРучнойСкидки");
	Колонки.Добавить("Доступно");
	Колонки.Добавить("ВНаличии");

	Комплектующие = НаборыСервер.СоздатьТаблицуСоставаНабора(Колонки);
	Комплектующие.Колонки.Добавить("ТипНоменклатуры", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ВидНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Комплектующие.Колонки.Добавить("Комиссия", Новый ОписаниеТипов("Число"));

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки КАК НомерСтроки,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
						  |	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
						  |	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
						  |	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
						  |	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
						  |	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости,
						  |	СУММА(ЕСТЬNULL(ДоступностьТоваров.ВНаличии, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)) КАК ВНаличии,
						  |	СУММА(ЕСТЬNULL(ДоступностьТоваров.Свободно, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)) КАК Доступно
						  |ИЗ
						  |	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ДоступностьТоваров
						  |		ПО ДоступностьТоваров.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
						  |			И ДоступностьТоваров.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика
						  |			И ДоступностьТоваров.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
						  |			И ДоступностьТоваров.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
						  |			И &ФильтрСклады
						  |ГДЕ
						  |	ВариантыКомплектацииНоменклатурыТовары.Ссылка = &Ссылка
						  |
						  |СГРУППИРОВАТЬ ПО
						  |	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
						  |	ВариантыКомплектацииНоменклатурыТовары.Упаковка,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
						  |	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ТипНоменклатуры,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры,
						  |	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок,
						  |	ВариантыКомплектацииНоменклатурыТовары.Количество,
						  |	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости");

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
		Справочники["УпаковкиЕдиницыИзмерения"].ТекстЗапросаКоэффициентаУпаковки(
		"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения)",
		"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Справочник.Номенклатура)"));

	Запрос.УстановитьПараметр("Ссылка", ВариантКомплектацииНоменклатуры);

	Если ДополнительныеПараметры.Свойство("Склады") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрСклады", "ДоступностьТоваров.Склад В (&Склады)");
		Запрос.УстановитьПараметр("Склады", ДополнительныеПараметры.Склады);
	Иначе
		Запрос.УстановитьПараметр("ФильтрСклады", Истина);
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		НоваяСтрока = Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.КоличествоУпаковок   = НоваяСтрока.КоличествоУпаковок;
		НоваяСтрока.Количество           = НоваяСтрока.Количество;
		НоваяСтрока.НоменклатураНабора   = Параметры.НоменклатураНабора;
		НоваяСтрока.ХарактеристикаНабора = Параметры.ХарактеристикаНабора;

	КонецЦикла;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И ДополнительныеПараметры.Свойство("Соглашение")
		И ЗначениеЗаполнено(ДополнительныеПараметры.Соглашение) Тогда

		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
		ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
		ПараметрыРасчета.Вставить("Соглашение", ДополнительныеПараметры.Соглашение);
		ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");

	Иначе

		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
		ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
		ПараметрыРасчета.Вставить("ВидЦены", ДополнительныеПараметры.ВидЦены);
		ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");

	КонецЕсли;

	КоэффициентыПропорциональностиРасчетаЦенНаборов = КоэффициентыРаспределенияПоДолям(Комплектующие.Скопировать(),
		ПараметрыРасчета);

	ОбщаяСтоимость = 0;
	Для Каждого ТекущаяСтрока Из КоэффициентыПропорциональностиРасчетаЦенНаборов Цикл
		ОбщаяСтоимость = ОбщаяСтоимость + ТекущаяСтрока.Цена;
	КонецЦикла;

	СуммаКРаспределению 			= ДополнительныеПараметры.Цена * Параметры.КоличествоУпаковок;
	//+ ИнфоСофт Сумин Д.В. 28.11.2023 УА #66705
	СуммаПродажиКРаспределению 		= ДополнительныеПараметры.ЦенаПродажи;
	//СуммаПродажиКРаспределению 	= ДополнительныеПараметры.СуммаПродажиКРаспределению;
	//- ИнфоСофт Сумин Д.В. 28.11.2023 УА #66705
	СуммаКомиссииКРаспределению 	= ДополнительныеПараметры.Комиссия;

	СлужебнаяТЧ = Новый ТаблицаЗначений;
	СлужебнаяТЧ.Колонки.Добавить("СтрокаТЧ");
	СлужебнаяТЧ.Колонки.Добавить("НомерСтроки");

	Комплектующие.Сортировать("КоличествоУпаковок Убыв");
	Для Каждого ТекущаяСтрока Из Комплектующие Цикл

		Стоимость = КоэффициентыПропорциональностиРасчетаЦенНаборов.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки").Цена;

		ПараметрыТовара = ПодборТоваровКлиентСервер.ПараметрыТовара();
		ЗаполнитьЗначенияСвойств(ПараметрыТовара, Параметры);

		ПараметрыТовара.Номенклатура       = ТекущаяСтрока.Номенклатура;
		ПараметрыТовара.Характеристика     = ТекущаяСтрока.Характеристика;
		ПараметрыТовара.Упаковка           = ТекущаяСтрока.Упаковка;
		ПараметрыТовара.ТипНоменклатуры    = ТекущаяСтрока.ТипНоменклатуры;
		ПараметрыТовара.ВидНоменклатуры    = ТекущаяСтрока.ВидНоменклатуры;
		ПараметрыТовара.ЕдиницаИзмерения   = ТекущаяСтрока.ЕдиницаИзмерения;
		ПараметрыТовара.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок * Параметры.КоличествоУпаковок;
		ПараметрыТовара.Количество         = ТекущаяСтрока.Количество * Параметры.КоличествоУпаковок;
		ПараметрыТовара.Вставить("ПогрешностьКомиссия", 0);
		ПараметрыТовара.Вставить("ПогрешностьСуммаПродажи", 0);

		Если ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
			Или ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") Тогда
			ПараметрыТовара.Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
		КонецЕсли;

		Если ДополнительныеПараметры.Свойство("ВидЦены") Тогда
			ПараметрыТовара.ВидЦены = ДополнительныеПараметры.ВидЦены;
		Иначе
			ПараметрыТовара.ВидЦены =ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		КонецЕсли;

		Если ПараметрыТовара.КоличествоУпаковок <> 0 И ОбщаяСтоимость <> 0 Тогда
			ПараметрыТовара.Цена = Окр(((Стоимость / ОбщаяСтоимость) * СуммаКРаспределению)
				/ ПараметрыТовара.КоличествоУпаковок, 2);
			ПараметрыТовара.Вставить("ЦенаПродажи", Окр(((Стоимость / ОбщаяСтоимость) * СуммаПродажиКРаспределению)
				/ ПараметрыТовара.КоличествоУпаковок, 2));	
			ПараметрыТовара.Вставить("Комиссия", Окр(((Стоимость / ОбщаяСтоимость) * СуммаКомиссииКРаспределению
				/ ПараметрыТовара.КоличествоУпаковок), 2));
		Иначе
			ПараметрыТовара.Цена = 0;
			ПараметрыТовара.Вставить("ЦенаПродажи", 0);
			ПараметрыТовара.Вставить("Комиссия", 0);
		КонецЕсли;

		ОбщаяСтоимость = ОбщаяСтоимость - Стоимость;
		СуммаКРаспределению 		= СуммаКРаспределению - ПараметрыТовара.Цена * ПараметрыТовара.КоличествоУпаковок;
		СуммаПродажиКРаспределению 	= СуммаПродажиКРаспределению - ПараметрыТовара.ЦенаПродажи * ПараметрыТовара.КоличествоУпаковок;
		СуммаКомиссииКРаспределению = СуммаКомиссииКРаспределению - ПараметрыТовара.Комиссия
			* ПараметрыТовара.КоличествоУпаковок;

		ПараметрыТовара.Доступно = ТекущаяСтрока.Доступно;
		ПараметрыТовара.ВНаличии = ТекущаяСтрока.ВНаличии;

		ПараметрыТовара.ХарактеристикиИспользуются = ?(ЗначениеЗаполнено(ПараметрыТовара.Характеристика), Истина, Ложь);

		СлужебнаяСтрока = СлужебнаяТЧ.Добавить();
		СлужебнаяСтрока.СтрокаТЧ = ПараметрыТовара;
		СлужебнаяСтрока.НомерСтроки = ТекущаяСтрока.НомерСтроки;

	КонецЦикла;

	Если (СуммаКРаспределению <> 0 Или СуммаПродажиКРаспределению <> 0 Или СуммаКомиссииКРаспределению <> 0) И СлужебнаяТЧ.Количество() > 0 Тогда

		ПоследняяСтрока = СлужебнаяТЧ[СлужебнаяТЧ.Количество() - 1];
		ИсходнаяСтрока = ПоследняяСтрока.СтрокаТЧ;
		ИсходнаяСтрока.Погрешность 				= СуммаКРаспределению;
		ИсходнаяСтрока.ПогрешностьСуммаПродажи 	= СуммаПродажиКРаспределению;
		ИсходнаяСтрока.ПогрешностьКомиссия 		= СуммаКомиссииКРаспределению;

	КонецЕсли;

	СлужебнаяТЧ.Сортировать("НомерСтроки Возр");
	Для Каждого СтрокаТЧ Из СлужебнаяТЧ Цикл
		ПодобранныеТовары.Добавить(СтрокаТЧ.СтрокаТЧ);
	КонецЦикла;

	Возврат ПодобранныеТовары;

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Функция ВариантКомплектацииНоменклатурыПоУмолчанию(Знач Номенклатура, Знач Характеристика)

	ВариантКомплектацииНоменклатуры = Неопределено;

	Если Характеристика = Неопределено Тогда
		Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
						  |	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектацииНоменклатуры
						  |ИЗ
						  |	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
						  |ГДЕ
						  |	ВариантыКомплектацииНоменклатуры.Владелец = &Владелец
						  |	И ВариантыКомплектацииНоменклатуры.Характеристика = &Характеристика
						  |
						  |УПОРЯДОЧИТЬ ПО
						  |	ВариантыКомплектацииНоменклатуры.Основной УБЫВ,
						  |	ВариантыКомплектацииНоменклатуры.ПометкаУдаления");

	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВариантКомплектацииНоменклатуры = Выборка.ВариантКомплектацииНоменклатуры;
	КонецЕсли;

	Возврат ВариантКомплектацииНоменклатуры;

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Функция КоэффициентыРаспределенияПоДолям(ТабличнаяЧасть, Параметры)

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	Таблица.НомерСтроки                                       КАК НомерСтроки,
						  |	Таблица.НоменклатураНабора                                КАК НоменклатураНабора,
						  |	Таблица.ХарактеристикаНабора                              КАК ХарактеристикаНабора,
						  |	Таблица.Номенклатура                                      КАК Номенклатура,
						  |	Таблица.Характеристика                                    КАК Характеристика,
						  |	Таблица.Упаковка                                          КАК Упаковка,
						  |	Таблица.Количество                                        КАК Количество,
						  |	Таблица.КоличествоУпаковок                                КАК КоличествоУпаковок
						  |ПОМЕСТИТЬ Таблица
						  |ИЗ
						  |	&ТабличнаяЧасть КАК Таблица
						  |;
						  |
						  |//////////////////////////
						  |ВЫБРАТЬ
						  |	Таблица.НомерСтроки                                       КАК НомерСтроки,
						  |	Таблица.НоменклатураНабора                                КАК НоменклатураНабора,
						  |	Таблица.ХарактеристикаНабора                              КАК ХарактеристикаНабора,
						  |	Таблица.Номенклатура                                      КАК Номенклатура,
						  |	Таблица.Характеристика                                    КАК Характеристика,
						  |	Таблица.Упаковка                                          КАК Упаковка,
						  |	Таблица.Количество                                        КАК Количество,
						  |	Таблица.КоличествоУпаковок                                КАК КоличествоУпаковок,
						  |	ВариантыКомплектацииНоменклатуры.Ссылка                   КАК ВариантыКомплектацииНоменклатуры,
						  |	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора
						  |ПОМЕСТИТЬ ТаблицаСВариантамиКомплектации
						  |ИЗ
						  |	Таблица КАК Таблица
						  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
						  |		ПО Таблица.НоменклатураНабора = ВариантыКомплектацииНоменклатуры.Владелец
						  |			И Таблица.ХарактеристикаНабора = ВариантыКомплектацииНоменклатуры.Характеристика
						  |			И ВариантыКомплектацииНоменклатуры.Основной
						  |;
						  |
						  |/////
						  |ВЫБРАТЬ
						  |	Товары.Ссылка            КАК ВариантыКомплектацииНоменклатуры,
						  |	Товары.Номенклатура      КАК Номенклатура,
						  |	Товары.Характеристика    КАК Характеристика,
						  |	СУММА(ВЫБОР
						  |			КОГДА Товары.Количество <> 0
						  |				ТОГДА Выбор Когда Товары.ДоляСтоимости = 0 Тогда 1 Иначе  Товары.ДоляСтоимости Конец/ Товары.Количество
						  |			ИНАЧЕ 0
						  |		КОНЕЦ) КАК ДоляСтоимости
						  |ПОМЕСТИТЬ ДолиСтоимости
						  |ИЗ
						  |	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Товары
						  |
						  |СГРУППИРОВАТЬ ПО
						  |	Товары.Номенклатура,
						  |	Товары.Характеристика,
						  |	Товары.Ссылка
						  |;
						  |
						  |/////
						  |ВЫБРАТЬ
						  |	Таблица.НомерСтроки                                           КАК НомерСтроки,
						  |	Таблица.НоменклатураНабора                                    КАК НоменклатураНабора,
						  |	Таблица.ХарактеристикаНабора                                  КАК ХарактеристикаНабора,
						  |	Таблица.Номенклатура                                          КАК Номенклатура,
						  |	Таблица.Характеристика                                        КАК Характеристика,
						  |	Таблица.Упаковка                                              КАК Упаковка,
						  |	Таблица.Количество                                            КАК Количество,
						  |	Таблица.КоличествоУпаковок                                    КАК КоличествоУпаковок,
						  |	ВЫРАЗИТЬ(Таблица.Количество * ЕСТЬNULL(ДолиСтоимости.ДоляСтоимости, 0) КАК Число(15,2)) КАК Цена,
						  |	Таблица.ВариантыКомплектацииНоменклатуры                      КАК ВариантыКомплектацииНоменклатуры,
						  |	Таблица.ВариантРасчетаЦеныНабора                              КАК ВариантРасчетаЦеныНабора
						  |ИЗ
						  |	ТаблицаСВариантамиКомплектации КАК Таблица
						  |		ЛЕВОЕ СОЕДИНЕНИЕ ДолиСтоимости КАК ДолиСтоимости
						  |		ПО ДолиСтоимости.ВариантыКомплектацииНоменклатуры = Таблица.ВариантыКомплектацииНоменклатуры
						  |			И Таблица.Номенклатура = ДолиСтоимости.Номенклатура
						  |			И Таблица.Характеристика = ДолиСтоимости.Характеристика
						  |");
	
	// Выгрузить из таблицы источника
	Если ТипЗнч(ТабличнаяЧасть) = Тип("ТаблицаЗначений") Тогда
		Запрос.Параметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть.Скопировать());
	Иначе
		Запрос.Параметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть.Выгрузить());
	КонецЕсли;

	ПараметрыРасчета = Новый Структура;
	Для Каждого Параметр Из Параметры Цикл
		ПараметрыРасчета.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	ПараметрыРасчета.Вставить("РассчитыватьНаборы", Ложь);

	ТЧ = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрокаТЧ Из ТЧ Цикл
		СтрокаТЧ.Цена = Окр(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок, 2);
	КонецЦикла;

	Возврат ТЧ;

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Сумин Д.В. 23.08.2023 УА #61252
Функция ПолучитьКомплектующие(Параметры, ДополнительныеПараметры)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Параметры.ВариантКомплектацииНоменклатуры) Тогда
		ВариантКомплектацииНоменклатуры = ВариантКомплектацииНоменклатурыПоУмолчанию(
		Параметры.НоменклатураНабора, Параметры.ХарактеристикаНабора);
	Иначе
		ВариантКомплектацииНоменклатуры = Параметры.ВариантКомплектацииНоменклатуры;
	КонецЕсли;
	
	Если Не Параметры.Свойство("КоличествоУпаковок") Тогда
		Параметры.Вставить("КоличествоУпаковок", 1);
	КонецЕсли;
	
	ПодобранныеТовары = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ВариантКомплектацииНоменклатуры) Тогда
		ТекстОшибки = СтрШаблон("Для номенклатуры %1 %2 не определен состав набора", Параметры.НоменклатураНабора,
		Параметры.ХарактеристикаНабора);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат ПодобранныеТовары;
	КонецЕсли;
	
	Колонки = Новый Массив;
	Колонки.Добавить("НомерСтроки");
	Колонки.Добавить("НоменклатураКомплекта");
	Колонки.Добавить("ХарактеристикаКомплекта");
	Колонки.Добавить("Номенклатура");
	Колонки.Добавить("Характеристика");
	Колонки.Добавить("Цена");
	Колонки.Добавить("ВидЦены");
	Колонки.Добавить("Упаковка");
	Колонки.Добавить("Количество");
	Колонки.Добавить("КоличествоУпаковок");
	Колонки.Добавить("ПроцентРучнойСкидки");
	Колонки.Добавить("СуммаРучнойСкидки");
	Колонки.Добавить("Доступно");
	Колонки.Добавить("ВНаличии");
	
	Комплектующие = НаборыСервер.СоздатьТаблицуСоставаНабора(Колонки);
	Комплектующие.Колонки.Добавить("ТипНоменклатуры", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ВидНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Комплектующие.Колонки.Добавить("Комиссия", Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки КАК НомерСтроки,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
	|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости,
	|	СУММА(ЕСТЬNULL(ДоступностьТоваров.ВНаличии, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)) КАК ВНаличии,
	|	СУММА(ЕСТЬNULL(ДоступностьТоваров.Свободно, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)) КАК Доступно
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ДоступностьТоваров
	|		ПО ДоступностьТоваров.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
	|			И ДоступностьТоваров.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика
	|			И ДоступностьТоваров.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|			И ДоступностьТоваров.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			И &ФильтрСклады
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ТипНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество,
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
	Справочники["УпаковкиЕдиницыИзмерения"].ТекстЗапросаКоэффициентаУпаковки(
	"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения)",
	"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Справочник.Номенклатура)"));
	
	Запрос.УстановитьПараметр("Ссылка", ВариантКомплектацииНоменклатуры);
	
	Если ДополнительныеПараметры.Свойство("Склады") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрСклады", "ДоступностьТоваров.Склад В (&Склады)");
		Запрос.УстановитьПараметр("Склады", ДополнительныеПараметры.Склады);
	Иначе
		Запрос.УстановитьПараметр("ФильтрСклады", Истина);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.КоличествоУпаковок   = НоваяСтрока.КоличествоУпаковок;
		НоваяСтрока.Количество           = НоваяСтрока.Количество;
		НоваяСтрока.НоменклатураНабора   = Параметры.НоменклатураНабора;
		НоваяСтрока.ХарактеристикаНабора = Параметры.ХарактеристикаНабора;
		
	КонецЦикла;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И ДополнительныеПараметры.Свойство("Соглашение")
		И ЗначениеЗаполнено(ДополнительныеПараметры.Соглашение) Тогда
		
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
		ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
		ПараметрыРасчета.Вставить("Соглашение", ДополнительныеПараметры.Соглашение);
		ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");
		
	Иначе
		
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
		ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
		ПараметрыРасчета.Вставить("ВидЦены", ДополнительныеПараметры.ВидЦены);
		ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");
		
	КонецЕсли;
	
	КоэффициентыПропорциональностиРасчетаЦенНаборов = КоэффициентыРаспределенияПоДолям(Комплектующие.Скопировать(),
	ПараметрыРасчета);
	
	ОбщаяСтоимость = 0;
	Для Каждого ТекущаяСтрока Из КоэффициентыПропорциональностиРасчетаЦенНаборов Цикл
		ОбщаяСтоимость = ОбщаяСтоимость + ТекущаяСтрока.Цена;
	КонецЦикла;
	
	СуммаКРаспределению = ДополнительныеПараметры.Цена * Параметры.КоличествоУпаковок;
	
	СлужебнаяТЧ = Новый ТаблицаЗначений;
	СлужебнаяТЧ.Колонки.Добавить("СтрокаТЧ");
	СлужебнаяТЧ.Колонки.Добавить("НомерСтроки");
	
	Комплектующие.Сортировать("КоличествоУпаковок Убыв");
	Для Каждого ТекущаяСтрока Из Комплектующие Цикл
		
		Стоимость = КоэффициентыПропорциональностиРасчетаЦенНаборов.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки").Цена;
		
		ПараметрыТовара = ПодборТоваровКлиентСервер.ПараметрыТовара();
		ЗаполнитьЗначенияСвойств(ПараметрыТовара, Параметры);
		
		ПараметрыТовара.Номенклатура       = ТекущаяСтрока.Номенклатура;
		ПараметрыТовара.Характеристика     = ТекущаяСтрока.Характеристика;
		ПараметрыТовара.Упаковка           = ТекущаяСтрока.Упаковка;
		ПараметрыТовара.ТипНоменклатуры    = ТекущаяСтрока.ТипНоменклатуры;
		ПараметрыТовара.ВидНоменклатуры    = ТекущаяСтрока.ВидНоменклатуры;
		ПараметрыТовара.ЕдиницаИзмерения   = ТекущаяСтрока.ЕдиницаИзмерения;
		ПараметрыТовара.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок * Параметры.КоличествоУпаковок;
		ПараметрыТовара.Количество         = ТекущаяСтрока.Количество * Параметры.КоличествоУпаковок;
		ПараметрыТовара.Вставить("ПогрешностьКомиссия", 0);
		ПараметрыТовара.Вставить("ПогрешностьСуммаПродажи", 0);
		
		Если ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
			Или ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") Тогда
			ПараметрыТовара.Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ВидЦены") Тогда
			ПараметрыТовара.ВидЦены = ДополнительныеПараметры.ВидЦены;
		Иначе
			ПараметрыТовара.ВидЦены =ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		КонецЕсли;
		
		Если ПараметрыТовара.КоличествоУпаковок <> 0 И ОбщаяСтоимость <> 0 Тогда
			ПараметрыТовара.Цена = Окр(((Стоимость / ОбщаяСтоимость) * СуммаКРаспределению)
			/ ПараметрыТовара.КоличествоУпаковок, 2);
		Иначе
			ПараметрыТовара.Цена = 0;
		КонецЕсли;
		
		ОбщаяСтоимость = ОбщаяСтоимость - Стоимость;
		СуммаКРаспределению 		= СуммаКРаспределению - ПараметрыТовара.Цена * ПараметрыТовара.КоличествоУпаковок;
		
		ПараметрыТовара.Доступно = ТекущаяСтрока.Доступно;
		ПараметрыТовара.ВНаличии = ТекущаяСтрока.ВНаличии;
		
		ПараметрыТовара.ХарактеристикиИспользуются = ?(ЗначениеЗаполнено(ПараметрыТовара.Характеристика), Истина, Ложь);
		
		СлужебнаяСтрока = СлужебнаяТЧ.Добавить();
		СлужебнаяСтрока.СтрокаТЧ = ПараметрыТовара;
		СлужебнаяСтрока.НомерСтроки = ТекущаяСтрока.НомерСтроки;
		
	КонецЦикла;
	
	Если СуммаКРаспределению <> 0 И СлужебнаяТЧ.Количество() > 0 Тогда
		
		ПоследняяСтрока = СлужебнаяТЧ[СлужебнаяТЧ.Количество() - 1];
		ИсходнаяСтрока = ПоследняяСтрока.СтрокаТЧ;
		ИсходнаяСтрока.Погрешность 				= СуммаКРаспределению;
		
	КонецЕсли;
	
	СлужебнаяТЧ.Сортировать("НомерСтроки Возр");
	Для Каждого СтрокаТЧ Из СлужебнаяТЧ Цикл
		ПодобранныеТовары.Добавить(СтрокаТЧ.СтрокаТЧ);
	КонецЦикла;
	
	Возврат ПодобранныеТовары;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 23.08.2023 УА #61252

//+ ИнфоСофт Сумин Д.В. 04.08.2023 УА #61481
Процедура ВыполнитьАлгоритмПроверкиТоваровНаКомплект(ЗаказКлиента, Склад) Экспорт 
	
	ЗапросНазначений = Новый Запрос;
	ЗапросНазначений.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
	|ИЗ
	|	Справочник.ИС_ЯМ_Склады.НаправленияДеятельности КАК ИС_ЯМ_СкладыНаправленияДеятельности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ИС_ЯМ_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности
	|			И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|ГДЕ
	|	ИС_ЯМ_СкладыНаправленияДеятельности.Ссылка = &Ссылка";
	
	ЗапросНазначений.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
	
	Назначения = Новый Массив;
	
	ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
	
	Пока ВыборкаНазначения.Следующий() Цикл 
		Если ВыборкаНазначения.Назначение <> Справочники.Назначения.ПустаяСсылка() Тогда 
			Назначения.Добавить(ВыборкаНазначения.Назначение);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВзаказе.Номенклатура КАК Номенклатура,
	|	ТоварыВзаказе.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ТоварыВЗаказе
	|ИЗ
	|	&ТоварыВзаказе КАК ТоварыВзаказе
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВариантыКомплектацииНоменклатурыТовары.Номенклатура ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЭтоКомплект,
	|	ВТ_ТоварыВЗаказе.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Комплектация
	|ИЗ
	|	ВТ_ТоварыВЗаказе КАК ВТ_ТоварыВЗаказе
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО (ВТ_ТоварыВЗаказе.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|				И ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыВЗаказе.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспределениеЗапасов.Свободно КАК КомплектСвободно,
	|	ВТ_Комплектация.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_КомплектОстаток
	|ИЗ
	|	ВТ_Комплектация КАК ВТ_Комплектация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО ВТ_Комплектация.Номенклатура = РаспределениеЗапасов.Номенклатура
	|ГДЕ
	|	РаспределениеЗапасов.Склад В(&Склад)
	|	И РаспределениеЗапасов.Назначение В(&Назначение)
	|	И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_КомплектОстаток.КомплектСвободно, 0) КАК КомплектСвободно,
	|	ВТ_Комплектация.ЭтоКомплект КАК ЭтоКомплект,
	|	ВТ_Комплектация.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ_Комплектация КАК ВТ_Комплектация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомплектОстаток КАК ВТ_КомплектОстаток
	|		ПО ВТ_Комплектация.Номенклатура = ВТ_КомплектОстаток.Номенклатура";  
	
	Запрос.УстановитьПараметр("ТоварыВЗаказе", ЗаказКлиента.Товары);
	Запрос.УстановитьПараметр("Склад", ЗаказКлиента.Склад);
	Запрос.УстановитьПараметр("Назначение", Назначения);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	ДанныеКомплектов = РезультатЗапроса.Выгрузить();
	
	Если Не ДанныеКомплектов[0].ЭтоКомплект Или ДанныеКомплектов[0].КомплектСвободно > 0 Тогда
		Возврат;	
	КонецЕсли;
	
	СоздатьЗаказНаСборкуКомплектов(ЗаказКлиента, Склад);	
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.08.2023 УА #61481

//+ ИнфоСофт Сумин Д.В. 04.08.2023 УА #61481
Процедура СоздатьЗаказНаСборкуКомплектов(ЗаказКлиента, Склад)
	
	ЗаказНаСборку = Документы.ЗаказНаСборку.СоздатьДокумент(); 
	ЗаказНаСборку.Комментарий = ЗаказКлиента.Комментарий; 
	ЗаказНаСборку.Дата = ЗаказКлиента.Дата;
	ЗаказНаСборку.Подразделение = ЗаказКлиента.Подразделение;  
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("АдресТовары", ПоместитьВоВременноеХранилище(ЗаказКлиента.Товары.Выгрузить(), Новый УникальныйИдентификатор)); 
	СтруктураДанных.Вставить("Основание", ЗаказКлиента.Ссылка);
	СтруктураДанных.Вставить("Склад", ЗаказКлиента.Склад);
	
	ЗаказНаСборку.Заполнить(СтруктураДанных);
	
	ЗаказНаСборку.Организация = ЗаказКлиента.Организация;
	
	ЗаказНаСборку.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;  
	
	ЗаказНаСборку.ДокументОснование = ЗаказКлиента.Ссылка;
	
	ЗаказНаСборку.Подразделение = ЗаказКлиента.Подразделение;
	
	ЗаказНаСборку.НачалоСборкиРазборки = ЗаказКлиента.Дата;
	ЗаказНаСборку.ОкончаниеСборкиРазборки = ЗаказКлиента.Дата; 
	
	ОбеспечиватьОбособленно = ЗаказКлиента.Соглашение.ОбеспечиватьЗаказыОбособленно;
	НаправленияДеятельностиИспользуются = Склад.НаправленияДеятельности.Количество() > 0;
	
	Если ОбеспечиватьОбособленно И НаправленияДеятельностиИспользуются Тогда
		ЗаказНаСборку.НаправлениеДеятельности = ЗаказКлиента.Договор.НаправлениеДеятельности;	
		ЗаказНаСборку.Назначение = Справочники.Назначения.НайтиПоРеквизиту("НаправлениеДеятельности", ЗаказКлиента.Договор.НаправлениеДеятельности);

	КонецЕсли;	
	
	Для Каждого Элемент Из ЗаказНаСборку.Товары Цикл
		Элемент.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
		Если ОбеспечиватьОбособленно И НаправленияДеятельностиИспользуются Тогда
			Элемент.Обособленно = Истина;		
		КонецЕсли;
	КонецЦикла;
	//Если используется обособление, то сначала выполняется попытка проведения с обособлением товара. При неудаче выполняется поптыка проведения без обособления. 
	Попытка
		ЗаказНаСборку.Записать(РежимЗаписиДокумента.Проведение);	
	Исключение 
		
		Если ОбеспечиватьОбособленно И НаправленияДеятельностиИспользуются Тогда	
			Попытка
				Для Каждого Элемент Из ЗаказНаСборку.Товары Цикл
					Элемент.Обособленно = Ложь;		
				КонецЦикла;	
				ЗаказНаСборку.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ЗаказНаСборку.Статус = Перечисления.СтатусыВнутреннихЗаказов.КОбеспечению;
				Для Каждого Элемент Из ЗаказНаСборку.Товары Цикл
					Элемент.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
					Элемент.Обособленно = Ложь;	
					
				КонецЦикла;  
				ЗаписьЖурналаРегистрации("ИС.WB.РазборЗаказов", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаказНаСборку.Записать();	
			КонецПопытки;
		Иначе
			ЗаказНаСборку.Статус = Перечисления.СтатусыВнутреннихЗаказов.КОбеспечению;
			Для Каждого Элемент Из ЗаказНаСборку.Товары Цикл
				Элемент.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
				Элемент.Обособленно = Ложь;	
				
			КонецЦикла;  
			ЗаписьЖурналаРегистрации("ИС.WB.РазборЗаказов", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаказНаСборку.Записать();
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.08.2023 УА #61481      

//+ ИнфоСофт Сумин Д.В. 20.02.2024 УА #66043
Процедура УстановитьПризнакКГТ(ЯМНоменклатура)
	
	КГТ = Ложь;
	
	Если ЯМНоменклатура.length > 200 Или ЯМНоменклатура.width > 200 Или ЯМНоменклатура.height > 200 Тогда
		КГТ = Истина;	
	КонецЕсли;
	
	Если ЯМНоменклатура.weight > 30 Тогда
		КГТ = Истина;	
	КонецЕсли;
	
	Если ЯМНоменклатура.volume > 0.5 Тогда
		КГТ = Истина;	
	КонецЕсли;
	
	ЯМНоменклатура.КГТ = КГТ;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.02.2024 УА #66043

#КонецОбласти
