
#Область ПрограммныйИнтерфейс

#Область Цены                        

//+ ИнфоСофт Стояк Ю.К. 10.02.2023 УА #54628
Функция ПолучитьСписокЦен(Профиль, ПараметрыЗапроса, КампанияID, КодСтраницы = Неопределено) Экспорт

	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json");		              
	ПараметрыЗапроса.АдресРесурса = "/v2/campaigns/" + КампанияID + "/offer-prices.json?limit=2000" + КодСтраницы;
	ПараметрыЗапроса.ФорматОтвета = "Строка";
		
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьGETЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.GET, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ, Истина);
			
			Если ТипЗнч(JSON) = Тип("Соответствие") Тогда				
				Возврат JSON["result"];	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
             
            Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
      		ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 10.02.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 02.07.2023 УА #59330
Функция ПолучитьОстатки(Профиль, ПараметрыЗапроса, КампанияID, Тело) Экспорт

	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json");		              
	ПараметрыЗапроса.АдресРесурса = "/campaigns/" + КампанияID + "/stats/skus";
	ПараметрыЗапроса.ФорматОтвета = "Строка";                                                       
	
	Список = Новый Структура;
	Список.Вставить("shopSkus", Тело); 
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Список);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result.shopSkus;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
             
            Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
      		ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 02.07.2023 УА #59330

//+ ИнфоСофт Ивонин К.А. 20.03.24 УА #71892
Функция ПолучитьОстаткиИОборачиваемость(Профиль, ПараметрыЗапроса, КампанияID, СтруктураТела) Экспорт
    
    ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
    		              
	ПараметрыЗапроса.АдресРесурса = "campaigns/" + КампанияID + "/offers/stocks";
	ПараметрыЗапроса.ФорматОтвета = "Строка";                                                        
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(СтруктураТела);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
             
            Текст = СтрШаблон("Запрос содержит неправильные данные: %1", РезультатЗапроса.Ответ); 
      		ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.03.24 УА #71892

//+ ИнфоСофт Стояк Ю.К. 10.02.2023 УА #54628
Функция ВыгрузитьЦены(Профиль, ПараметрыЗапроса, КампанияID, СтруктураТела) Экспорт

	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json");		              
	ПараметрыЗапроса.АдресРесурса = "/v2/campaigns/" + КампанияID + "/offer-prices/updates.json";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("offers", СтруктураТела);
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
		
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ, Истина);
			
			Если ТипЗнч(JSON) = Тип("Соответствие") Тогда				
				Возврат JSON["status"];	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
             
            Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
      		ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;            
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 423 Тогда
             
            Текст = СтрШаблон("Нужно активировать флаг Использовать новые методы API"); 
      		ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 10.02.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 28.07.2023 УА #60348
Функция ВыгрузитьЦеныNEW(Профиль, ПараметрыЗапроса, КодБизнеса, СтруктураТела) Экспорт

	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json");		              
	ПараметрыЗапроса.АдресРесурса = "/businesses/" + КодБизнеса + "/offer-prices/updates";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("offers", СтруктураТела);
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
		
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.status;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
             
            Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
      		ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 28.07.2023 УА #60348

//+ ИнфоСофт Мурсалимов Д.Р. 03.02.25 УА #92578
Функция ПолучитьСписокЦенNEW(Профиль, ПараметрыЗапроса, СтруктураПараметров, ТелоЗапроса) Экспорт

	ПараметрыЗапроса.Заголовки.Вставить("Content-Type", "application/json");		              
	
	АдресРесурса 					= СтрШаблон("/campaigns/%1/offer-prices", СтруктураПараметров.КампанияID);
	
	ПараметрыЗапроса.АдресРесурса 	= АдресРесурса;
	ПараметрыЗапроса.ФорматОтвета 	= "Строка";
 	ПараметрыЗапроса.ТелоСтрока 	= ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
             
            Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
      		ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 03.02.25 УА #92578

#КонецОбласти

#Область Товары

//+ ИнфоСофт Сумин Д.В. 14.04.23 УА #575378
Функция ЗагрузитьКарточкиТоваров(Профиль, ПараметрыЗапроса, СтруктураПараметров, ТелоЗапроса) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json");		              
	
	АдресРесурса = СтрШаблон("/businesses/%1/offer-mappings", СтруктураПараметров.businessId);
	
	Если СтруктураПараметров.Свойство("limit") Тогда
		АдресРесурса = АдресРесурса + "?limit=" + Строка(СтруктураПараметров.limit);
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("page_token") Тогда
		АдресРесурса = АдресРесурса + "&page_token=" + Строка(СтруктураПараметров.page_token);
	КонецЕсли;
	
	ПараметрыЗапроса.АдресРесурса = АдресРесурса;
	ПараметрыЗапроса.ФорматОтвета = "Строка";  
 	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если JSON.Свойство("result") Тогда				
				Возврат JSON.result;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
			
			Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 14.04.23 УА #57537

//+ ИнфоСофт Стояк Ю.К. 12.03.2024 УА #66043
Функция ЗагрузитьКарточкиМагазина(Профиль, ПараметрыЗапроса, СтруктураПараметров, ТелоЗапроса) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json");		              
	
	АдресРесурса = СтрШаблон("/campaigns/%1/offers", СтруктураПараметров.КампанияID);
	
	Если СтруктураПараметров.Свойство("limit") Тогда
		АдресРесурса = АдресРесурса + "?limit=" + Строка(СтруктураПараметров.limit);
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("page_token") Тогда
		АдресРесурса = АдресРесурса + "&page_token=" + Строка(СтруктураПараметров.page_token);
	КонецЕсли;
	
	ПараметрыЗапроса.АдресРесурса = АдресРесурса;
	ПараметрыЗапроса.ФорматОтвета = "Строка";
 	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса); 
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если JSON.Свойство("result") Тогда				
				Возврат JSON.result;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
			
			Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.03.2024 УА #66043

//+ ИнфоСофт Стояк Ю.К. 22.05.2024 УА #65724
Функция ЗагрузитьКатегории(Профиль, ПараметрыЗапроса, ТелоЗапроса) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json");		              
	
	АдресРесурса = "/categories/tree";
		
	ПараметрыЗапроса.АдресРесурса = АдресРесурса;
	ПараметрыЗапроса.ФорматОтвета = "Строка";
 	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
		
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если JSON.Свойство("result") Тогда				
				Возврат JSON;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
			
			Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 24.05.2024 УА #65724
Функция ЗагрузитьХарактеристики(Профиль, ПараметрыЗапроса, Код) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json");		              
	
	АдресРесурса = СтрШаблон("/category/%1/parameters", СтрЗаменить(Строка(Код), Символы.НПП, ""));
		
	ПараметрыЗапроса.АдресРесурса = АдресРесурса;
	ПараметрыЗапроса.ФорматОтвета = "Строка"; 	
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса); 
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);	
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если JSON.Свойство("result") Тогда				
				Возврат JSON;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
			
			Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 24.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 29.05.2024 УА #65724
Функция ВыгрузитьКарточкиТовара(Профиль, ПараметрыЗапроса, КодБизнеса, СтруктураТела) Экспорт

	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json");		              
	ПараметрыЗапроса.АдресРесурса = "/businesses/" + КодБизнеса + "/offer-mappings/update";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("offerMappings", СтруктураТела);
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
		
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);	
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
             
            Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
      		ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 29.05.2024 УА #65724

#КонецОбласти

#Область Заказы

//+ ИнфоСофт Стояк Ю.К. 03.04.2023 УА #54628
Функция ПолучитьСписокЗаказов(Профиль, ПараметрыЗапроса, КампанияID, КодСтраницы = Неопределено, Дата) Экспорт
	
	Дата = Строка(Формат(Дата, "ДФ=dd-ММ-yyyy"));
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json");		              
	ПараметрыЗапроса.АдресРесурса = "/campaigns/" + КампанияID + "/orders?fake=false" + "&fromDate=" + Дата + "&page=" + КодСтраницы;
	ПараметрыЗапроса.ФорматОтвета = "Строка";
		
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьGETЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.GET, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
             
            Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
      		ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.04.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Функция НапечататьЭтикетки(Профиль, ПараметрыЗапроса, КампанияID, orderID) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #89295	
	//ПараметрыЗапроса.АдресРесурса = "/campaigns/" + КампанияID + "/orders/" + orderID + "/delivery/labels";	
	ПараметрыЗапроса.АдресРесурса = "/campaigns/" + КампанияID + "/orders/" + orderID + "/delivery/labels?format=A9";
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #89295
	ПараметрыЗапроса.ФорматОтвета = "ДвоичныеДанные"; 	
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьGETЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.GET, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
						
			Если ЗначениеЗаполнено(РезультатЗапроса.Ответ) Тогда
				Возврат РезультатЗапроса.Ответ;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
			
			Ответ = ПолучитьСтрокуИзДвоичныхДанных(РезультатЗапроса.Ответ);
			Текст = СтрШаблон("Передан неверный параметр: %1", Ответ);
			ОбщегоНазначения.СообщитьПользователю(Текст);
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Мурсалимов Д.Р. 21.11.23 УА #56220
Функция УказатьКоличествоГрузовыхМест(Профиль, ПараметрыЗапроса, КампанияID, orderID, Количество) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/campaigns/" + КампанияID + "/orders/" + orderID + "/delivery/shipments/1/boxes";
	ПараметрыЗапроса.ФорматОтвета = "Строка"; 
	
	Список = Новый Структура;
	МассивСтруктур = Новый Массив;

	Коробка = Новый Структура;
	Для Итер = 1 По Количество Цикл	
	    МассивСтруктур.Добавить(Коробка);
	КонецЦикла;
	
	Список.Вставить("boxes", МассивСтруктур); 
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Список);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPUTЗапрос(ПараметрыЗапроса); 
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.PUT, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
						
			Если ЗначениеЗаполнено(РезультатЗапроса.Ответ) Тогда
				Возврат РезультатЗапроса.Ответ;
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
			
			//+ ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78837			
			Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ);			
			//Ответ = ПолучитьСтрокуИзДвоичныхДанных(РезультатЗапроса.Ответ);
			//Текст = СтрШаблон("Передан неверный параметр: %1", Ответ);     
			//- ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78837
			ОбщегоНазначения.СообщитьПользователю(Текст);
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 21.11.23 УА #56220

//+ ИнфоСофт Стояк Ю.К. 18.12.2023 УА #63805
Функция ИзменитьСтатусЗаказов(Профиль, ПараметрыЗапроса, КампанияID, СтруктураТела) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/campaigns/" + КампанияID + "/orders/status-update";
	ПараметрыЗапроса.ФорматОтвета = "Строка";  
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("orders", СтруктураТела);
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
						
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
			
			Ответ = ПолучитьСтрокуИзДвоичныхДанных(РезультатЗапроса.Ответ);
			Текст = СтрШаблон("Передан неверный параметр: %1", Ответ);
			ОбщегоНазначения.СообщитьПользователю(Текст);
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 18.12.2023 УА #63805

//+ ИнфоСофт Сумин Д.В. 13.02.2024 УА #69650
Функция ПрикрепитьКиз(Профиль, ПараметрыЗапроса, КампанияID, НомерЗаказа, ДанныеЗапроса) Экспорт  
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json");		              
	ПараметрыЗапроса.АдресРесурса = "/campaigns/" + КампанияID + "/orders/" + НомерЗаказа + "/boxes";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ДанныеЗапроса); 
		
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPUTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.PUT, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 204 Или РезультатЗапроса.КодОтвета = 200 Тогда
		
			Возврат Истина;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
	         
	
	        Текст = СтрШаблон("Запрос содержит некорректные данные: %1", РезультатЗапроса.Ответ); 
	  		ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 13.02.2024 УА #69650 

//+ ИнфоСофт Стояк Ю.К. 04.12.2024 УА #73043
Функция ИзменитьДатуДоставкиДБС(Профиль, ПараметрыЗапроса, КампанияID, КодОтправления, СтруктураТела) Экспорт
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json; charset=utf-8");
	ПараметрыЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ПараметрыЗапроса.АдресРесурса = "/campaigns/" + КампанияID + "/orders/" + КодОтправления + "/delivery/date";
	ПараметрыЗапроса.ФорматОтвета = "Строка";  
		
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(СтруктураТела);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
		
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание); 
		ОбщегоНазначения.СообщитьПользователю(Текст);  
		Возврат Неопределено;	
	Иначе
		
		Если РезультатЗапроса.КодОтвета = 200 Тогда
						
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
			
			Ответ = ПолучитьСтрокуИзДвоичныхДанных(РезультатЗапроса.Ответ);
			Текст = СтрШаблон("Передан неверный параметр: %1", Ответ);
			ОбщегоНазначения.СообщитьПользователю(Текст);
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.12.2024 УА #73043

#КонецОбласти

#Область Склады

//+ ИнфоСофт Ивонин К.А. 02.10.23 УА #64020
Функция ЗагрузитьСклады(Профиль, ПараметрыЗапроса, КодБизнеса) Экспорт 
	
	ПараметрыЗапроса.АдресРесурса = СтрШаблон("/businesses/%1/warehouses", Формат(КодБизнеса, "ЧГ=0"));                      	
	ПараметрыЗапроса.ФорматОтвета = "Строка";    
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьGETЗапрос(ПараметрыЗапроса);
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.GET, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
						
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 02.10.23 УА #64020

Функция ПолучитьСкладыFBY(Профиль, ПараметрыЗапроса) Экспорт 
	
	ПараметрыЗапроса.АдресРесурса = "/warehouses";                      	
	ПараметрыЗапроса.ФорматОтвета = "Строка";    
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьGETЗапрос(ПараметрыЗапроса);
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.GET, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.result;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
						
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 01.11.2023 УА #62748

#КонецОбласти

#Область Остатки

//+ ИнфоСофт Стояк Ю.К. 10.02.2023 УА #54628
Функция ВыгрузитьОстатки(Профиль, ПараметрыЗапроса, КампанияID, СтруктураТела) Экспорт

	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "application/json");		              
	ПараметрыЗапроса.АдресРесурса = "/v2/campaigns/" + КампанияID + "/offers/stocks.json";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("skus", СтруктураТела);
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
		
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPUTЗапрос(ПараметрыЗапроса);
	
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.PUT, ПараметрыЗапроса, РезультатЗапроса);
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #76506
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ, Истина);
			
			Если ТипЗнч(JSON) = Тип("Соответствие") Тогда				
				Возврат JSON["status"];	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
             
            Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
      		ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
			
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 10.02.2023 УА #54628

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 28.09.23 УА #64020
Функция ПолучитьСписокМагазинов(Профиль, ПараметрыЗапроса) Экспорт 
	
	// campaigns?page=&pageSize=	
	ПараметрыЗапроса.АдресРесурса = "/campaigns";                      	
	ПараметрыЗапроса.ФорматОтвета = "Строка";    
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьGETЗапрос(ПараметрыЗапроса);
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.GET, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
			
			Если ТипЗнч(JSON) = Тип("Структура") Тогда				
				Возврат JSON.campaigns;	
			Иначе
				Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", РезультатЗапроса.Ответ);
			 	ОбщегоНазначения.СообщитьПользователю(Текст);
				Возврат Неопределено;
			КонецЕсли;
						
		Иначе
			
			РазобратьHTTPОтветПоКоду(РезультатЗапроса);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.09.23 УА #64020

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 08.02.24 УА #70082
Процедура ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса)
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type", "application/json");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.02.24 УА #70082

//+ ИнфоСофт Ивонин К.А. 28.09.23 УА #64020
Процедура РазобратьHTTPОтветПоКоду(СтруктураОтвета)

	Если СтруктураОтвета.КодОтвета = 400 Тогда
		
		Текст = СтрШаблон("Неверная форма запроса: %1", СтруктураОтвета.Ответ);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
	ИначеЕсли СтруктураОтвета.КодОтвета = 401 Тогда
		
		Текст = СтрШаблон("В запросе не указаны данные для авторизации: %1", СтруктураОтвета.Ответ);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
	ИначеЕсли СтруктураОтвета.КодОтвета = 403 Тогда
		
		Текст = СтрШаблон("Данные для авторизации неверны или доступ к ресурсу запрещен
						  |Возможно используется пустой или отозванный токен. 
						  |Проверьте настройки авторизации: %1", СтруктураОтвета.Ответ);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
	ИначеЕсли СтруктураОтвета.КодОтвета = 404 Тогда
		
		Текст = СтрШаблон("Запрашиваемый ресурс не найден: %1", СтруктураОтвета.Ответ);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
	ИначеЕсли СтруктураОтвета.КодОтвета = 420 Тогда
		
		Текст = СтрШаблон("Превышено ограничение на доступ к ресурсу, повторите попытку позже: %1", СтруктураОтвета.Ответ);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
								
	Иначе
		Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
			СтруктураОтвета.КодОтвета, СтруктураОтвета.Ответ);			
		ОбщегоНазначения.СообщитьПользователю(Текст);				
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.09.23 УА #64020

//+ ИнфоСофт Ивонин К.А. 27.06.22 УА #46999
Процедура ЗаписатьДанныеОтладки(Профиль, Метод, ПараметрыЗапроса, РезультатЗапроса)
       
	Если Не Профиль.РежимОтладки Тогда
		Возврат;
	КонецЕсли;
		
	ИС_MP_Сервер.ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, Метод, ПараметрыЗапроса, РезультатЗапроса);	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.06.22 УА #46999

#КонецОбласти
