
#Область СлужебныйПрограммныйИнтерфейс

#Область Настройки

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ПолучитьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияАли Тогда
		Возврат;
	КонецЕсли;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али; 
	
	//МассивНастроек = МассивНастроекПодключения();
	МассивНастроек = Новый Массив;
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	//МассивНастроек = МассивНастроекЦен(МассивНастроек);
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, МассивНастроек);

	СтруктураПараметров = Новый Структура;

	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить("Али" + Элемент.Ключ, Элемент.Значение);	
	КонецЦикла;
		
	ЗаполнитьЗначенияСвойств(Форма, СтруктураПараметров);
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ЗаписатьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияАли Тогда
		Возврат;
	КонецЕсли;
	
	//МассивНастроек = МассивНастроекПодключения();
	МассивНастроек = Новый Массив;
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	//МассивНастроек = МассивНастроекЦен(МассивНастроек);
	
	СтруктураНастроек = Новый Структура;
	
	Для Каждого Элемент Из МассивНастроек Цикл
		СтруктураНастроек.Вставить("Али" + Элемент, Неопределено);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, Форма);
	
	СтруктураПараметров = Новый Структура;
	
	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить(СтрЗаменить(Элемент.Ключ, "Али", ""), Элемент.Значение);	
	КонецЦикла;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али;
	
	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, СтруктураПараметров);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция МассивНастроекОстатков(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("РассчитыватьНесобранныеКомплекты");
	МассивНастроек.Добавить("ВыгружатьОстаткиВРазрезеОрганизации");
	МассивНастроек.Добавить("ИспользоватьПоследниеОстатки");	
	МассивНастроек.Добавить("ИспользоватьФиксированныйОстаток");
	МассивНастроек.Добавить("ФиксированныйОстаток");
	МассивНастроек.Добавить("РежимСокрытияОстатков");
	МассивНастроек.Добавить("СкрываемыйОстаток");
	
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

#КонецОбласти

#Область ТестПодключения

//+ ИнфоСофт Украинцева А.А. 30.11.2023 УА #62922
Функция ТестПодключенияAliexpressНаСервере(Профиль) Экспорт 
	
	ПараметрыСоединения = Неопределено;
	
	Если Не ПолучитьПараметрыСоединения(Профиль, ПараметрыСоединения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Заголовки = Неопределено;
	Если Не CформироватьЗаголовкиЗапроса(Заголовки, ПараметрыСоединения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	ПараметрыЗапроса.Сервер = ПараметрыСоединения.АдресСервиса;
	ПараметрыЗапроса.Порт = ПараметрыСоединения.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = ПараметрыСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.Заголовки.Вставить("x-auth-token", Заголовки["x-auth-token"]); 
	
	Возврат ИС_АЛИ_API.ПолучитьВалютуАккаунта(Профиль, ПараметрыЗапроса)
	
КонецФункции //- ИнфоСофт Украинцева А.А. 30.11.2023 УА #62922

#КонецОбласти

#Область РегламентныеЗадания

//+ ИнфоСофт Ивонин К.А. 11.11.23 УА #55166
Процедура ВыполнитьКомандуРеглЗадания(Профиль, ИдентификаторКомандыОбработки) Экспорт

	Событие = ПолучитьИмяСобытия("ВыполнитьКомандуРеглЗадания");
	
	Если ИдентификаторКомандыОбработки = "ВыгрузкаЦенАли" Тогда
		ВыгрузитьЦены(Профиль);
		Возврат;				
	КонецЕсли;  
	
	Если ИдентификаторКомандыОбработки = "ВыгрузкаОстатковАли" Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Али_Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_Али_Склады КАК ИС_Али_Склады
		|ГДЕ
		|	НЕ ИС_Али_Склады.ПометкаУдаления
		|	И ИС_Али_Склады.Профиль = &Профиль
		//+ ИнфоСофт Заварин К.В. 13.08.24 УА #81097
		|	И НЕ(ИС_Али_Склады.ОбщаяГруппаСкладов = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|				И ИС_Али_Склады.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|				И ИС_Али_Склады.ВыгружатьОстаткиИзГруппыСкладов = ЛОЖЬ)";
		//- ИнфоСофт Заварин К.В. 13.08.24 УА #81097
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ВыгрузитьОстатки(Профиль, Выборка.Ссылка);
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ПолучениеСборочныхЗаданийАли" Тогда
		ПолучитьСписокЗаказов(Профиль, ПолучитьДатуПоследнегоЗаказа(Профиль));
		Возврат;			
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ЗакрыватьЗаказВТечениеДняАли" Тогда 
        ВыполнитьЗакрытиеЗаказов(Профиль);
		Возврат;	
    КонецЕсли;
    
	Если ИдентификаторКомандыОбработки = "ОбновлениеСтатусовСборочныхЗаданийАли" Тогда
		ПолучитьСтатусы(Профиль);
		Возврат;
	КонецЕсли; 

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 11.11.23 УА #55166

#КонецОбласти

#Область КарточкиТоваров

//+ ИнфоСофт Ивонин К.А. 03.03.25 УА #92887
Функция КоличествоТоваров(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество
	|ИЗ
	|	Справочник.ИС_АЛИ_Номенклатура КАК ИС_АЛИ_Номенклатура
	|ГДЕ
	|	ИС_АЛИ_Номенклатура.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКоличества = РезультатЗапроса.Выбрать();
	
	Если ВыборкаКоличества.Следующий() Тогда
		Возврат ВыборкаКоличества.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 03.03.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 07.02.25 УА #92406
Функция ОбработатьДопПараметрыЗагрузкиТоваров(ДопПараметры) Экспорт
	Возврат ДопПараметры;
КонецФункции //- ИнфоСофт Ивонин К.А. 07.02.25 УА #92406

//+ ИнфоСофт Стояк Ю.К. 04.03.2023 УА #54628    
Функция ПолучитьКарточкиТоваров(Профиль, Перезаполнять = Ложь, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Загрузка товаров невозможна");
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыСоединения = Неопределено;
	Если Не ПолучитьПараметрыСоединения(Профиль, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Заголовки = Неопределено;
	Если Не CформироватьЗаголовкиЗапроса(Заголовки, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	ПараметрыЗапроса.Сервер = ПараметрыСоединения.АдресСервиса;
	ПараметрыЗапроса.Порт = ПараметрыСоединения.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = ПараметрыСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.Заголовки = Заголовки;
	
	СписокТоваров = Новый Массив;
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30)));
	ТаблицаТоваров.Колонки.Добавить("ДатаПоследнегоИзменения", Новый ОписаниеТипов("Дата"));
	
	КоличествоЭлементовНаСтранице = 50;
	ПределОшибок = 10;
	КоличествоОшибок = 0;
	last_id = Неопределено;
	Обработано = 0;
	Всего = 0;
	
	rawData = Новый Структура;
	rawData.Вставить("limit", КоличествоЭлементовНаСтранице);
	
	Пока Истина Цикл	                                         
		
		Если ЗначениеЗаполнено(last_id) Тогда
			rawData.Вставить("last_product_id", last_id);  
		КонецЕсли;
		
		Если КоличествоОшибок >= ПределОшибок Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Результат = ИС_АЛИ_API.ЗагрузитьКарточкиТоваров(Профиль, ПараметрыЗапроса, rawData); 
		
		Если Результат = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли;
		
		Если Результат.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Для Каждого Элемент Из Результат Цикл
			
			НоваяСтрока = ТаблицаТоваров.Добавить();
			НоваяСтрока.Номер = Элемент.id;
			НоваяСтрока.ДатаПоследнегоИзменения = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Элемент.ali_updated_at, ФорматДатыJSON.ISO); 
			
		КонецЦикла;               
		
		last_id = Результат[Результат.ВГраница()].id; 
		
		Всего = ТаблицаТоваров.Количество();
		
		ДлительныеОперации.СообщитьПрогресс( , СтрШаблон("Уже обработано %1 товаров из %2", Обработано, Всего));
		
	КонецЦикла;
	
	Если Перезаполнять Тогда
		
		Для Каждого Элемент Из ТаблицаТоваров Цикл
			СписокТоваров.Добавить(Элемент.Номер);
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Номер КАК Номер,
		|	ТЧ.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения
		|ПОМЕСТИТЬ ВТ_ТЧ
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧ.Номер КАК Номер
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_АЛИ_Номенклатура КАК ИС_АЛИ_Номенклатура
		|		ПО ВТ_ТЧ.Номер = ИС_АЛИ_Номенклатура.Код
		|			И (ИС_АЛИ_Номенклатура.Профиль = &Профиль)
		|ГДЕ
		|	ВТ_ТЧ.ДатаПоследнегоИзменения > ЕСТЬNULL(ИС_АЛИ_Номенклатура.ali_updated_at, ДАТАВРЕМЯ(1, 1, 1))";
		
		Запрос.УстановитьПараметр("ТЧ", ТаблицаТоваров);
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаТовары = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл
			СписокТоваров.Добавить(ВыборкаТовары.Номер);	
		КонецЦикла;
		
		Всего = СписокТоваров.Количество();
		
	КонецЕсли;
	
	МассивОшибок = Новый Массив;
	
	Счетчик = 0;
	
	Для Каждого Элемент Из СписокТоваров Цикл 
		
		Если Счетчик % 10 = 0 Тогда
			ДлительныеОперации.СообщитьПрогресс( , СтрШаблон("Уже обработано %1 товаров из %2", Обработано, Всего));
		КонецЕсли;
		
		rawData = Новый Структура;                                  
		rawData.Вставить("product_id", Элемент);
		
		ИнформацияОТоваре = ИС_АЛИ_API.ПолучитьДанныеОТоваре(Профиль, ПараметрыЗапроса, rawData);						
		
		Если ИнформацияОТоваре = Неопределено Тогда
			МассивОшибок.Добавить(Элемент);
			Продолжить;
		КонецЕсли;  
		
		//+ ИнфоСофт Мурсалимов Д.Р. 18.06.24 УА #77964
		//AliНоменклатура = Справочники.ИС_АЛИ_Номенклатура.НайтиПоКоду(ИнформацияОТоваре.id);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_АЛИ_Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_АЛИ_Номенклатура КАК ИС_АЛИ_Номенклатура
		|ГДЕ
		|	ИС_АЛИ_Номенклатура.Профиль = &Профиль
		|	И ИС_АЛИ_Номенклатура.Код = &Код";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		Запрос.УстановитьПараметр("Код", ИнформацияОТоваре.id); 
				
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНоменклатуры = РезультатЗапроса.Выбрать();
		
		Если ВыборкаНоменклатуры.Следующий() Тогда
			AliНоменклатура = ВыборкаНоменклатуры.Ссылка;
		Иначе
			AliНоменклатура = Справочники.ИС_АЛИ_Номенклатура.ПустаяСсылка();
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 18.06.24 УА #77964
		
		Если Не AliНоменклатура.Пустая() Тогда				
			AliНоменклатура = AliНоменклатура.ПолучитьОбъект();	
		Иначе
			AliНоменклатура = Справочники.ИС_АЛИ_Номенклатура.СоздатьЭлемент();
		КонецЕсли; 
		
		AliНоменклатура.Код = ИнформацияОТоваре.id;
		AliНоменклатура.ali_updated_at = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(ИнформацияОТоваре.ali_updated_at, ФорматДатыJSON.ISO);
		
		Попытка 
			
			subject = "";
			
			Для Каждого Элем Из ИнформацияОТоваре.subject Цикл
				
				Если Элем.locale = "ru_RU" Тогда
					subject = Элем.name;
				КонецЕсли; 	
				
			КонецЦикла;
			
			AliНоменклатура.Наименование = subject;
			AliНоменклатура.ПолноеНаименование = subject;
			
		Исключение
		КонецПопытки;
		
		AliНоменклатура.category_id = ИнформацияОТоваре.category_id;									
		AliНоменклатура.Профиль = Профиль;
		
		Обработано = Обработано + 1;
		
		Попытка
			AliНоменклатура.Записать();
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		Для Каждого Вариация Из ИнформацияОТоваре.sku Цикл
			
			//+ ИнфоСофт Мурсалимов Д.Р. 18.06.24 УА #77964
			//AliВариация = Справочники.ИС_АЛИ_Вариации.НайтиПоКоду(Вариация.code);
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИС_АЛИ_Вариации.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
			|ГДЕ
			|	ИС_АЛИ_Вариации.Профиль = &Профиль
			|	И ИС_АЛИ_Вариации.Код = &Код";
			
			Запрос.УстановитьПараметр("Профиль", Профиль);
			Запрос.УстановитьПараметр("Код", Вариация.sku_id); 
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаВариации = РезультатЗапроса.Выбрать();
			
			Если ВыборкаВариации.Следующий() Тогда
				AliВариация = ВыборкаВариации.Ссылка;
			Иначе
				AliВариация = Справочники.ИС_АЛИ_Вариации.ПустаяСсылка();
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 18.06.24 УА #77964
			
			Если Не AliВариация = Справочники.ИС_АЛИ_Вариации.ПустаяСсылка() Тогда				
				AliВариация = AliВариация.ПолучитьОбъект();					
			Иначе
				AliВариация = Справочники.ИС_АЛИ_Вариации.СоздатьЭлемент();
			КонецЕсли;
			
			AliВариация.Владелец = AliНоменклатура.Ссылка;
			AliВариация.id = Вариация.id;				
			AliВариация.Код = Вариация.sku_id;
			AliВариация.КодВариации = Вариация.code;
			AliВариация.Наименование = Вариация.id;						
			AliВариация.sku_id = Вариация.sku_id;			
			AliВариация.gtin = Вариация.gtin;
			AliВариация.Профиль = Профиль;
			
			Для Каждого Код Из Вариация.classifier_codes Цикл					
				НоваяСтрока	= AliВариация.classifier_codes.Добавить();
				НоваяСтрока.type = Код.type;
				НоваяСтрока.value = Код.value;					
			КонецЦикла;                         				
			
			Для Каждого Характеристика Из Вариация.property Цикл
				НоваяСтрока	= AliВариация.property.Добавить();				
				НоваяСтрока.name_id = Характеристика.name_id;					
				НоваяСтрока.name = Характеристика.name;
				НоваяСтрока.value_id = Характеристика.value_id;			
				НоваяСтрока.value = Характеристика.value;
				НоваяСтрока.value_definition = Характеристика.value_definition;					
			КонецЦикла;
			
			Попытка
				AliВариация.Записать();
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
				Продолжить;
			КонецПопытки;				
			
		КонецЦикла;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	Если МассивОшибок.Количество() > 0 Тогда
		Возврат "Загрузка завершена с ошибками. Не все товары были загруженны, повторите загрузку позже...";
	КонецЕсли;
	
	Возврат "Загрузка завершена";
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

//+ ИнфоСофт Стояк Ю.К. 10.04.2024 УА #62574
Функция СоздатьОбновитьКатегориюТоваров(Профиль, ПараметрыЗапроса, ДанныеКатегории, РодительId = Неопределено,
	КатегорияСсылка = Неопределено)
	
	Если КатегорияСсылка = Неопределено Тогда
		Если ДанныеКатегории.children_ids.Количество() Тогда
			КатегорияОбъект = Справочники.ИС_АЛИ_КатегорииТоваров.СоздатьГруппу();
		Иначе
			КатегорияОбъект = Справочники.ИС_АЛИ_КатегорииТоваров.СоздатьЭлемент();
		КонецЕсли;
	Иначе
		КатегорияОбъект = КатегорияСсылка.ПолучитьОбъект();
	КонецЕсли;   
	
	КатегорияОбъект.Код 			= Число(ДанныеКатегории.id); 		
	КатегорияОбъект.Наименование 	= ДанныеКатегории.name; 	
	
	Если Не КатегорияОбъект.ЭтоГруппа Тогда
		КатегорияОбъект.is_visible = ДанныеКатегории.is_visible;                                  
		КатегорияОбъект.parent_id 	= РодительId;
	КонецЕсли;
	
	Если РодительId <> Неопределено Тогда
		КатегорияОбъект.Родитель 	= Справочники.ИС_АЛИ_КатегорииТоваров.НайтиПоКоду(РодительId);		
	КонецЕсли;   
	
	Для Каждого Элемент Из ДанныеКатегории.sku_properties Цикл
		
		Атрибут = СоздатьИлиОбновитьАтрибут(Элемент); 
		
		Отбор = Новый Структура();
		Отбор.Вставить("Атрибут", Атрибут);
		НайденноеЗначение = КатегорияОбъект.sku_properties.НайтиСтроки(Отбор); 
		
		Если НайденноеЗначение.Количество() = 0 Тогда
		
			НСтр = КатегорияОбъект.sku_properties.Добавить();
					
			НСтр.Атрибут		= Атрибут;
			НСтр.is_required 	= Элемент.is_required;
			
		КонецЕсли;
	
	КонецЦикла;   
	
	Для Каждого Элемент Из ДанныеКатегории.properties Цикл
		
		Атрибут = СоздатьИлиОбновитьАтрибут(Элемент); 
		
		Отбор = Новый Структура();
		Отбор.Вставить("Атрибут", Атрибут);
		НайденноеЗначение = КатегорияОбъект.properties.НайтиСтроки(Отбор);
		
		Если НайденноеЗначение.Количество() = 0 Тогда
		
			НСтр = КатегорияОбъект.properties.Добавить();
					
			НСтр.Атрибут		= Атрибут;
			НСтр.is_required 	= Элемент.is_required;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Попытка
		КатегорияОбъект.Записать();
	Исключение
		ИмяСобытия = ПолучитьИмяСобытия("ЗагрузкаКатегорийТоваров");
		Комментарий = "Не удалось записать категорию товаров: " + КатегорияОбъект.Наименование + Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
	КонецПопытки; 
	
	МассивДочернихКатегорий = Новый Массив;
	
	Для Каждого Элемент Из ДанныеКатегории.children_ids Цикл
		МассивДочернихКатегорий.Добавить(Строка(Элемент));	
	КонецЦикла; 
	
	Если МассивДочернихКатегорий.Количество() > 0 Тогда
		
		РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивДочернихКатегорий, 20);
		
		Для Каждого Элемент Из РазбитыйМассив Цикл 
			
			rawData = Новый Структура("ids", Элемент);
			
			Результат = ИС_АЛИ_API.ПолучитьДочерниеКатегории(Профиль, ПараметрыЗапроса, rawData); 
			
			Если Результат = Неопределено Или Результат.Количество() = 0 Тогда			
				Продолжить;
			КонецЕсли; 
			
			Для Каждого Категория Из Результат Цикл						
				
				КатегорияСсылка = Справочники.ИС_АЛИ_КатегорииТоваров.НайтиПоКоду(Категория.id);
				
				Если ЗначениеЗаполнено(КатегорияСсылка) Тогда
					СоздатьОбновитьКатегориюТоваров(Профиль, ПараметрыЗапроса, Категория, Число(Категория.parent_id), КатегорияСсылка); 
				Иначе
					СоздатьОбновитьКатегориюТоваров(Профиль, ПараметрыЗапроса, Категория, Число(Категория.parent_id)); 
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;

	Возврат КатегорияОбъект.Ссылка;

КонецФункции //- ИнфоСофт Стояк Ю.К. 10.04.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 10.04.2024 УА #62574
Функция СоздатьИлиОбновитьАтрибут(ДанныеАтрибута)
	
	
	MD5 = ПолучитьMD5Хэш(ДанныеАтрибута);
	
	СсылкаАтрибут = Справочники.ИС_АЛИ_Атрибут.НайтиПоКоду(Число(ДанныеАтрибута.id));	
	
	Если СсылкаАтрибут.Пустая() Тогда
		АтрибутОбъект = Справочники.ИС_АЛИ_Атрибут.СоздатьЭлемент();
	Иначе
		
		Если СсылкаАтрибут.MD5 = MD5 Тогда
			Возврат СсылкаАтрибут.Ссылка;
		КонецЕсли;					
		
		АтрибутОбъект = СсылкаАтрибут.ПолучитьОбъект();
		
	КонецЕсли;					
	
	АтрибутОбъект.MD5 					= MD5; 		
	АтрибутОбъект.Код 					= Число(ДанныеАтрибута.id); 		
	АтрибутОбъект.Наименование 			= ДанныеАтрибута.name; 	 
		
	АтрибутОбъект.is_key 				= ДанныеАтрибута.is_key;
	АтрибутОбъект.is_brand 				= ДанныеАтрибута.is_brand;
	АтрибутОбъект.is_enum_prop 			= ДанныеАтрибута.is_enum_prop;
	АтрибутОбъект.is_multi_select 		= ДанныеАтрибута.is_multi_select;
	АтрибутОбъект.is_input_prop 		= ДанныеАтрибута.is_input_prop;
	АтрибутОбъект.has_unit 				= ДанныеАтрибута.has_unit;
	АтрибутОбъект.has_customized_pic 	= ДанныеАтрибута.has_customized_pic;
	АтрибутОбъект.has_customized_name	= ДанныеАтрибута.has_customized_name;
	
	
	Если АтрибутОбъект.has_unit Тогда 
		
		Для Каждого Элемент Из ДанныеАтрибута.units Цикл
			
			НСтр = АтрибутОбъект.units.Добавить(); 
			
			НСтр.rate 				= Элемент.rate;
			НСтр.name 				= Элемент.name;
			
		КонецЦикла;  
		
	КонецЕсли;
	
	Попытка
		АтрибутОбъект.Записать();
	Исключение
		ИмяСобытия = ПолучитьИмяСобытия("СоздатьИлиОбновитьАтрибут");
		Комментарий = "Не удалось записать атрибут категории: " + АтрибутОбъект.Наименование + Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
	КонецПопытки; 
	
	Возврат АтрибутОбъект.Ссылка;

КонецФункции //- ИнфоСофт Стояк Ю.К. 10.04.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 10.04.2024 УА #62574
Функция ЗагрузитьКатегорииТоваров(Профиль) Экспорт
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Загрузка категорий невозможна");
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыСоединения = Неопределено;
	Если Не ПолучитьПараметрыСоединения(Профиль, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Заголовки = Неопределено;
	Если Не CформироватьЗаголовкиЗапроса(Заголовки, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	ПараметрыЗапроса.Сервер = ПараметрыСоединения.АдресСервиса;
	ПараметрыЗапроса.Порт = ПараметрыСоединения.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = ПараметрыСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.Заголовки = Заголовки;
	
	ПределОшибок = 10;
	КоличествоОшибок = 0;			
	
	Пока Истина Цикл	                                         
				
		Если КоличествоОшибок >= ПределОшибок Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Результат = ИС_АЛИ_API.ПолучитьКатегорииВерхнегоУровня(Профиль, ПараметрыЗапроса); 
		
		Если Результат = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли;
		
		Если Результат.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Для Каждого Элемент Из Результат Цикл						
			
			КатегорияСсылка = Справочники.ИС_АЛИ_КатегорииТоваров.НайтиПоКоду(Число(Элемент.id));
			
			Если ЗначениеЗаполнено(КатегорияСсылка) Тогда
				СоздатьОбновитьКатегориюТоваров(Профиль, ПараметрыЗапроса, Элемент, , КатегорияСсылка); 
			Иначе
			    СоздатьОбновитьКатегориюТоваров(Профиль, ПараметрыЗапроса, Элемент); 
			КонецЕсли;
		КонецЦикла;
		
		Прервать;
		
	КонецЦикла;				
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 10.04.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 10.04.2024 УА #62574
Процедура ЗагрузитьЗнченияАтрибутов(Профиль, Категория = Неопределено, Свойство = Неопределено, ШаблонДоствки = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Загрузка категорий невозможна");
		Возврат;
	КонецЕсли;
	
	ПараметрыСоединения = Неопределено;
	Если Не ПолучитьПараметрыСоединения(Профиль, ПараметрыСоединения) Тогда
		Возврат;
	КонецЕсли;
	
	Заголовки = Неопределено;
	Если Не CформироватьЗаголовкиЗапроса(Заголовки, ПараметрыСоединения) Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	ПараметрыЗапроса.Сервер = ПараметрыСоединения.АдресСервиса;
	ПараметрыЗапроса.Порт = ПараметрыСоединения.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = ПараметрыСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.Заголовки = Заголовки;
	
	Если Не ЗначениеЗаполнено(Категория) Тогда 
		
		ПределОшибок = 10;
		КоличествоОшибок = 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_АЛИ_КатегорииТоваровproperties.Ссылка.Код КАК Код,
		|	ИС_АЛИ_КатегорииТоваровproperties.Атрибут.Код КАК АтрибутКод,
		|	ЛОЖЬ КАК СвойствоВариации,
		|	ИС_АЛИ_КатегорииТоваровproperties.Атрибут.Ссылка КАК АтрибутСсылка
		|ИЗ
		|	Справочник.ИС_АЛИ_КатегорииТоваров.properties КАК ИС_АЛИ_КатегорииТоваровproperties
		|ГДЕ
		|	НЕ ИС_АЛИ_КатегорииТоваровproperties.Ссылка.ЭтоГруппа
		|	И ИС_АЛИ_КатегорииТоваровproperties.Ссылка.Используется
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИС_АЛИ_КатегорииТоваровsku_properties.Ссылка.Код,
		|	ИС_АЛИ_КатегорииТоваровsku_properties.Атрибут.Код,
		|	ИСТИНА,
		|	ИС_АЛИ_КатегорииТоваровsku_properties.Атрибут.Ссылка
		|ИЗ
		|	Справочник.ИС_АЛИ_КатегорииТоваров.sku_properties КАК ИС_АЛИ_КатегорииТоваровsku_properties
		|ГДЕ
		|	НЕ ИС_АЛИ_КатегорииТоваровsku_properties.Ссылка.ЭтоГруппа
		|	И ИС_АЛИ_КатегорииТоваровsku_properties.Ссылка.Используется";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
		
		Для Каждого Выборка Из ВыборкаДетальныеЗаписи Цикл
			
			rawData = Новый Структура("category_id, property_id, is_sku_property",
			Выборка.Код, Выборка.АтрибутКод, Выборка.СвойствоВариации);
			
			Результат = ИС_АЛИ_API.ПолучитьЗначенияАтрибутов(Профиль, ПараметрыЗапроса, rawData);
			
			Если Результат = Неопределено Тогда
				КоличествоОшибок = КоличествоОшибок + 1;
				Продолжить;
			КонецЕсли;
			
			Если КоличествоОшибок = ПределОшибок Тогда
				Возврат;
			КонецЕсли;
			
			ОбработатьЗначенияАтрибута(Результат, Выборка.АтрибутСсылка);				
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 10.04.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 10.04.2024 УА #62574
Процедура ОбработатьЗначенияАтрибута(Результат, Атрибут)

	Для Каждого Значение Из Результат Цикл
		
		ЗначениеАтрибута = Справочники.ИС_АЛИ_ЗначенияАтрибутов.НайтиПоКоду(Число(Значение.id));
		
		Если ЗначениеЗаполнено(ЗначениеАтрибута) И Не ЗначениеАтрибута.Пустая() Тогда
			ЗначениеАтрибута = ЗначениеАтрибута.ПолучитьОбъект();	
		Иначе                                                                                  
			ЗначениеАтрибута = Справочники.ИС_АЛИ_ЗначенияАтрибутов.СоздатьЭлемент();									
		КонецЕсли;   
		
		ЗначениеАтрибута.Код 			= Число(Значение.id);
		ЗначениеАтрибута.Наименование 	= Значение.name;
		ЗначениеАтрибута.Владелец		= Атрибут; 
		
		Попытка
			ЗначениеАтрибута.Записать();
		Исключение
			ИмяСобытия = ПолучитьИмяСобытия("ОбработатьЗначенияАтрибута");
			Комментарий = "Не удалось записать значение атрибута: " + ЗначениеАтрибута.Наименование + Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
		КонецПопытки;	
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 10.04.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
Функция ТекстКоличествоСопоставленныхЗначений(Категория, АтрибутАли, ВидРеквизита1С, Реквизит1С,
	ТребуетсяСопоставление) Экспорт

	Если Не ТребуетсяСопоставление Тогда
		Возврат "Сопоставление не требуется";
	КонецЕсли;

	Результат = "Сопоставлено 0 из 0";

	Если ЗначениеЗаполнено(Реквизит1С) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаСоответствийЗначений.ЗначениеВ1С КАК ЗначениеВ1С,
		|	ТаблицаСоответствийЗначений.ЗначениеАтрибутаАли КАК ЗначениеАтрибутаАли
		|ПОМЕСТИТЬ вт_Значения
		|ИЗ
		|	&ТаблицаСоответствийЗначений КАК  ТаблицаСоответствийЗначений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_Значения.ЗначениеВ1С) КАК Всего,
		|	КОЛИЧЕСТВО(вт_Значения.ЗначениеАтрибутаАли) КАК Сопоставлено
		|ИЗ
		|	вт_Значения КАК вт_Значения";

		Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений(Категория,
			АтрибутАли, ВидРеквизита1С, Реквизит1С));

		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = СтрШаблон("Сопоставлено %1 из %2", ?(Выборка.Сопоставлено = Null, 0, Выборка.Сопоставлено),
				Выборка.Всего);
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
Функция ТаблицаСоответствийЗначений(Категория, АтрибутАли, ВидРеквизита1С, Реквизит1С) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("АтрибутАли", АтрибутАли);
	Запрос.УстановитьПараметр("ВидРеквизита1С", ВидРеквизита1С);
	Запрос.УстановитьПараметр("Реквизит1С", Реквизит1С);

	ИмяРеквизита 	= Неопределено;
	ТипРеквизита 	= Неопределено;

	Если ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры Тогда

		СтандартныеРеквизиты = Метаданные.Справочники["Номенклатура"].СтандартныеРеквизиты;
		Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
			Если Реквизит.Имя = Реквизит1С Тогда
				ИмяРеквизита = Реквизит.Имя;
				ТипРеквизита = Реквизит.Тип;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ИмяРеквизита = Неопределено Тогда
			РеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].Реквизиты;
			Для Каждого Реквизит Из РеквизитыНоменклатуры Цикл
				Если Реквизит.Синоним = Реквизит1С Тогда
					ИмяРеквизита = Реквизит.Имя;
					ТипРеквизита = Реквизит.Тип;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры Тогда

		СтандартныеРеквизиты = Метаданные.Справочники["ХарактеристикиНоменклатуры"].СтандартныеРеквизиты;
		Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
			Если Реквизит.Имя = Реквизит1С Тогда
				ИмяРеквизита = Реквизит.Имя;
				ТипРеквизита = Реквизит.Тип;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ИмяРеквизита = Неопределено Тогда
			РеквизитыХарактеристики = Метаданные.Справочники["ХарактеристикиНоменклатуры"].Реквизиты;
			Для Каждого Реквизит Из РеквизитыХарактеристики Цикл
				Если Реквизит.Синоним = Реквизит1С Тогда
					ИмяРеквизита = Реквизит.Имя;
					ТипРеквизита = Реквизит.Тип;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры Тогда

		ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
		ИмяРеквизита = "Ссылка";

	Иначе
		
		ТипРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизит1С, "ТипЗначения");
		ИмяРеквизита = "Значение";

	КонецЕсли;

	Если ИС_Ozon_Сервер.ЭтоПримитивныйТип(ТипРеквизита) Тогда

		Отбор = "ГДЕ ЗначенияВ1С.Свойство = &Реквизит1С";

		Если ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры Тогда
			ПолноеИмяОбъекта =  "Справочник.Номенклатура";
			Отбор = "ГДЕ НЕ ЗначенияВ1С.Ссылка.ПометкаУдаления";
		ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры Тогда
			ПолноеИмяОбъекта =  "Справочник.Номенклатура.ДополнительныеРеквизиты";
		ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры Тогда
			ПолноеИмяОбъекта =  "РегистрСведений.ДополнительныеСведения";
		ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры Тогда
			ПолноеИмяОбъекта =  "Справочник.ХарактеристикиНоменклатуры";
			Отбор = "ГДЕ НЕ ЗначенияВ1С.Ссылка.ПометкаУдаления";
		ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры Тогда
			ПолноеИмяОбъекта =  "Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты";
		КонецЕсли;

		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					   |	ЗначенияВ1С.ИмяРеквизита КАК ЗначениеВ1С
					   |ПОМЕСТИТЬ вт_ЗначенияВ1С
					   |ИЗ
					   | " + ПолноеИмяОбъекта + " КАК ЗначенияВ1С
												| " + Отбор + "
															  |;
															  |
															  |////////////////////////////////////////////////////////////////////////////////
															  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
															  |	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли КАК ЗначениеАтрибутаАли,
															  |	вт_ЗначенияВ1С.ЗначениеВ1С КАК ЗначениеВ1С
															  |ИЗ
															  |	вт_ЗначенияВ1С КАК вт_ЗначенияВ1С
															  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеЗначенийХарактеристик КАК ИС_АЛИ_СоответствиеЗначенийХарактеристик
															  |		ПО вт_ЗначенияВ1С.ЗначениеВ1С = ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики
															  |			И (ИС_АЛИ_СоответствиеЗначенийХарактеристик.Категория = &Категория)
															  |			И (ИС_АЛИ_СоответствиеЗначенийХарактеристик.АтрибутАли = &АтрибутАли)
															  |			И (ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = &ВидРеквизита1С)
															  |			И (ИС_АЛИ_СоответствиеЗначенийХарактеристик.Реквизит1С = &Реквизит1С)
															  |ГДЕ
															  |	НЕ вт_ЗначенияВ1С.ЗначениеВ1С ЕСТЬ null
															  |СГРУППИРОВАТЬ ПО
															  |	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли,
															  |	вт_ЗначенияВ1С.ЗначениеВ1С
															  |
															  |УПОРЯДОЧИТЬ ПО
															  |	ЗначениеВ1С";

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяРеквизита", ИмяРеквизита);

	Иначе   
		
 		ОбъектМетаданных 	= Метаданные.НайтиПоТипу(ТипРеквизита.Типы()[0]);
		ПолноеИмяОбъекта 	= ОбъектМетаданных.ПолноеИмя();
		ЭтоСправочник		= СтрНайти(ПолноеИмяОбъекта, "Справочник.") = 1;
		ЭтоПеречисление		= СтрНайти(ПолноеИмяОбъекта, "Перечисление.") = 1;

		Запрос.Текст =
		"ВЫБРАТЬ 
		|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Категория КАК Категория,
		|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.АтрибутАли КАК АтрибутАли,
		|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли КАК ЗначениеАтрибутаАли,
		|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
		|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
		|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики
		|ИЗ
		|	РегистрСведений.ИС_АЛИ_СоответствиеЗначенийХарактеристик КАК ИС_АЛИ_СоответствиеЗначенийХарактеристик
		|ГДЕ
		|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Категория = &Категория
		|	И ИС_АЛИ_СоответствиеЗначенийХарактеристик.АтрибутАли = &АтрибутАли
		|	И ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = &ВидРеквизита1С
		|	И ИС_АЛИ_СоответствиеЗначенийХарактеристик.Реквизит1С = &Реквизит1С";
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		РезультатЗапроса.Колонки.ЗначениеХарактеристики.Имя = "ЗначениеВРегистре";
		РезультатЗапроса.Колонки.Добавить("ЗначениеХарактеристики", ТипРеквизита);
		Для Каждого стр Из РезультатЗапроса Цикл
			Если ЭтоСправочник Тогда

				Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда
					стр.ЗначениеХарактеристики = Справочники[ОбъектМетаданных.Имя].ПолучитьСсылку(
						Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
				КонецЕсли;

			ИначеЕсли ЭтоПеречисление Тогда

				Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда
					стр.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Получить(стр.ЗначениеВРегистре - 1);
				КонецЕсли;

			КонецЕсли;
		КонецЦикла;

		Отбор = "";
		Если ЭтоСправочник Тогда
			Отбор = "ГДЕ НЕ ЗначенияОбъекта.ПометкаУдаления ";
			Если ТипРеквизита.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Или ТипРеквизита.СодержитТип(
				Тип("СправочникСсылка.ЗначенияСвойствОбъектовИерархия")) Тогда
				Отбор = Отбор + "И ЗначенияОбъекта.Владелец = &Реквизит1С";
			ИначеЕсли ТипРеквизита.СодержитТип(Тип("СправочникСсылка.ХарактеристикиНоменклатуры")) Тогда
				Отбор = Отбор + "И ЗначенияОбъекта.ВидНоменклатуры = &Реквизит1С";
			КонецЕсли;
		КонецЕсли;

		Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", РезультатЗапроса);
		Запрос.Текст = "ВЫБРАТЬ
					   |	ТаблицаСоответствийЗначений.Категория КАК Категория,
					   |	ТаблицаСоответствийЗначений.АтрибутАли КАК АтрибутАли,
					   |	ТаблицаСоответствийЗначений.ЗначениеАтрибутаАли КАК ЗначениеАтрибутаАли,
					   |	ТаблицаСоответствийЗначений.ВидРеквизита1С КАК ВидРеквизита1С,
					   |	ТаблицаСоответствийЗначений.Реквизит1С КАК Реквизит1С,
					   |	ТаблицаСоответствийЗначений.ЗначениеВРегистре КАК ЗначениеВРегистре,
					   |	ТаблицаСоответствийЗначений.ЗначениеХарактеристики КАК ЗначениеХарактеристики
					   |ПОМЕСТИТЬ вт_СоответствиеЗначенийХарактеристик
					   |ИЗ
					   |	&ТаблицаСоответствийЗначений КАК  ТаблицаСоответствийЗначений
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
					   |	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли КАК ЗначениеАтрибутаАли,
					   |	ЗначенияОбъекта.Ссылка КАК ЗначениеВ1С
					   |ИЗ
					   |	" + ПолноеИмяОбъекта + " КАК ЗначенияОбъекта
												   |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК ИС_АЛИ_СоответствиеЗначенийХарактеристик
												   |		ПО ЗначенияОбъекта.Ссылка = ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики
												   | " + Отбор + " 								
																 |СГРУППИРОВАТЬ ПО
																 |	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли,
																 |	ЗначенияОбъекта.Ссылка
																 |
																 |УПОРЯДОЧИТЬ ПО
																 |	ЗначениеВ1С";

	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();

КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
Функция ЗначенияАтрибутовАлиИзСтроки(ЗначенияСтрокой) Экспорт

	Результат = Новый Массив;

	МассивСтрок = СтрРазделить(ЗначенияСтрокой, ";", Ложь);
	Для Каждого стр Из МассивСтрок Цикл
		Если СтрДлина(стр) = 36 Тогда
			ЗначениеХарактеристики = Справочники.ИС_АЛИ_ЗначенияАтрибутов.ПолучитьСсылку(
				Новый УникальныйИдентификатор(стр));
			Если ЗначениеЗаполнено(ЗначениеХарактеристики) Тогда
				Результат.Добавить(ЗначениеХарактеристики);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
Процедура УдалитьСопоставлениеХарактеристики(Категория, АтрибутАли) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_АЛИ_СоответствиеЗначенийХарактеристик.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.АтрибутАли.Установить(АтрибутАли);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574                              

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574 
Процедура ДобавитьСопоставлениеХарактеристики(Категория, АтрибутАли, ВидРеквизита1С, Реквизит1С,
	ФиксированноеЗначение) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_АЛИ_СоответствиеЗначенийХарактеристик.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.АтрибутАли.Установить(АтрибутАли);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.Категория 				= Категория;
	ЗаписьНабора.АтрибутАли 	= АтрибутАли;
	ЗаписьНабора.ВидРеквизита1С 		= ВидРеквизита1С;
	ЗаписьНабора.Реквизит1С 			= Реквизит1С;
	ЗаписьНабора.ФиксированноеЗначение 	= ФиксированноеЗначение;
	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
Функция ЗаполнитьТаблицуОсновныхРеквизитов(ТаблицаРеквизитов, Категория) Экспорт

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "freight_template_id";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Идентификатор шаблона доставки";
	НоваяСтрока.РасширеннаяПодсказка = "Откройте в личном кабинете продавца раздел Магазин → Шаблоны доставки и скопируйте идентификатор из столбца ID.";
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "sku_code";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Артикул";
	НоваяСтрока.РасширеннаяПодсказка = "Уникальный идентификатор товара в разрезе характеристики номенклатуры.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "multi_language_subject_list";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Наименование товара";
	НоваяСтрока.РасширеннаяПодсказка = "Наименование товара. Поддерживается выгрузка только на русском языке";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "main_image_urls_list";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Ссылка на главное фото";	

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "multi_language_description_list";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Описание товара";
	НоваяСтрока.РасширеннаяПодсказка = "Описание товара. Поддерживается выгрузка только на русском языке";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "ДлинаУпаковки";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Длина упаковки, мм";
	НоваяСтрока.РасширеннаяПодсказка = "Длина - это наибольшая сторона упаковки товара. Перед измерением длины: - Одежда, текстиль, наборы для вышивания - сложите товар в упаковке пополам. 
									   |- Карты и интерьерные наклейки - скрутите в рулон. Длина рулона - самая большая величина. - Длина книжного комплекта - это длина всей стопки книг, которые входят в комплект.
									   |По умолчанию используются упаковки номенклатуры.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "ШиринаУпаковки";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Ширина упаковки, мм";
	НоваяСтрока.РасширеннаяПодсказка = "Сначала измерьте длину и высоту, оставшаяся сторона - это ширина. Перед измерением ширины: - Одежда, текстиль, наборы для вышивания - сложите товар в упаковке пополам. 
									   |- Карты и интерьерные наклейки - скрутите в рулон. Ширина рулона - это его диаметр. - Ширина книжного комплекта - это ширина всей стопки книг, которые входят в комплект.
									   |По умолчанию используются упаковки номенклатуры.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "ВысотаУпаковки";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Высота упаковки, мм";
	НоваяСтрока.РасширеннаяПодсказка = "Высота - это наименьшая сторона упаковки товара. Перед измерением высоты: - Одежда, текстиль, наборы для вышивания - сложите товар в упаковке пополам. 
									   |- Карты и интерьерные наклейки - скрутите в рулон. Высота рулона - это его диаметр. - Высота книжного комплекта - это высота всей стопки книг, которые входят в комплект.
									   |По умолчанию используются упаковки номенклатуры.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "ВесУпаковки";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Вес в упаковке, г";
	НоваяСтрока.РасширеннаяПодсказка = "Вес единицы товара вместе с упаковкой в граммах.
									   |По умолчанию используются упаковки номенклатуры.";
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "product_unit";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Единица измерения товара";
	НоваяСтрока.РасширеннаяПодсказка = "Единица измерения товара:
	|100000013 — пара,
	|100000014 — упаĸовĸа/упаĸовĸи,
	|100000015 — штуĸа/штуĸи,
	|100000017 — ĸомплеĸт/ĸомплеĸты,
	|100000019 — ĸвадратный метр."; 
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "shipping_lead_time";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Время на отправку заказа";
	НоваяСтрока.РасширеннаяПодсказка = "Рекомендуем указывать не больше 5. Значения от 1 до 30";
									   

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаРеквизитов", ТаблицаРеквизитов);
	Запрос.УстановитьПараметр("Категория", Категория);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРеквизитов.РеквизитТовара КАК РеквизитТовара,
	|	ТаблицаРеквизитов.ПредставлениеРеквизитаТовара КАК ПредставлениеРеквизитаТовара,
	|	ТаблицаРеквизитов.РасширеннаяПодсказка КАК РасширеннаяПодсказка
	|ПОМЕСТИТЬ вт_ОсновныеРеквизитыТовара
	|ИЗ
	|	&ТаблицаРеквизитов КАК ТаблицаРеквизитов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ОсновныеРеквизитыТовара.РеквизитТовара КАК РеквизитТовара,
	|	вт_ОсновныеРеквизитыТовара.ПредставлениеРеквизитаТовара КАК ПредставлениеРеквизитаТовара,
	|	вт_ОсновныеРеквизитыТовара.РасширеннаяПодсказка КАК РасширеннаяПодсказка,
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Реквизит1С КАК Реквизит1С,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ФиксированноеЗначение КАК ФиксированноеЗначение
	|ИЗ
	|	вт_ОсновныеРеквизитыТовара КАК вт_ОсновныеРеквизитыТовара
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара КАК ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара
	|		ПО вт_ОсновныеРеквизитыТовара.РеквизитТовара = ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара
	|			И (ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Категория = &Категория)";

	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРеквизитов = РезультатЗапроса.Выгрузить();

	СоответствиеРеквизитовНоменклатуры = ИС_Ozon_Сервер.СоответствиеРеквизитовНоменклатуры();

	Для Каждого стр Из ТаблицаРеквизитов Цикл
		Если стр.ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры
			И СоответствиеРеквизитовНоменклатуры.Получить(стр.Реквизит1С) = Неопределено Тогда

			УдалитьСопоставлениеОсновногоРеквизита(Категория, стр.РеквизитТовара);
			стр.ВидРеквизита1С 	= Неопределено;
			стр.Реквизит1С 		= Неопределено;

		КонецЕсли;
	КонецЦикла;

	Возврат ТаблицаРеквизитов;

КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Заварин К.В. 20.05.24 УА #71157
//Добавлен множитель
Процедура ДобавитьСопоставлениеОсновногоРеквизита(Категория, РеквизитТовара, ВидРеквизита1С, Реквизит1С,
	ФиксированноеЗначение, Множитель = 0) Экспорт
//- ИнфоСофт Заварин К.В. 20.05.24 УА #71157

	НаборЗаписей = РегистрыСведений.ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.РеквизитТовара.Установить(РеквизитТовара);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.Категория 				= Категория;
	ЗаписьНабора.РеквизитТовара 		= РеквизитТовара;
	ЗаписьНабора.ВидРеквизита1С 		= ВидРеквизита1С;
	ЗаписьНабора.Реквизит1С 			= Реквизит1С;
	ЗаписьНабора.ФиксированноеЗначение 	= ФиксированноеЗначение;
	//+ ИнфоСофт Заварин К.В. 20.05.24 УА #71157
	ЗаписьНабора.Множитель 				= Множитель;      
	//- ИнфоСофт Заварин К.В. 20.05.24 УА #71157
	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
Процедура УдалитьСопоставлениеОсновногоРеквизита(Категория, РеквизитТовара) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.РеквизитТовара.Установить(РеквизитТовара);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Функция ЕстьНастройкиОсновныхРеквизитовДляКатегории(Категория) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Категория КАК Категория
	|ИЗ
	|	РегистрСведений.ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара КАК ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Категория = &Категория";

	Запрос.УстановитьПараметр("Категория", Категория);

	РезультатЗапроса = Запрос.Выполнить();

	Возврат Не РезультатЗапроса.Пустой();

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Функция ТаблицаСоответствийДопРеквизитов(Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории) Экспорт

	Если ЕстьНастройкиОсновныхРеквизитовДляКатегории Тогда
		КатегорияДляОсновныхРеквизитов = Категория;
	Иначе
		КатегорияДляОсновныхРеквизитов = ПредопределенноеЗначение("Справочник.ИС_Ozon_КатегорииТоваров.ПустаяСсылка");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("КатегорияДляОсновныхРеквизитов", КатегорияДляОсновныхРеквизитов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.АтрибутАли КАК АтрибутАли,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли КАК ЗначениеАтрибутаАли,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Реквизит1С.ТипЗначения КАК ТипЗначенияРеквизита,
	|	ИС_АЛИ_Атрибут.Код КАК ИС_АЛИ_АтрибутКод,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	0 КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ИСТИНА КАК ТребуетсяСопоставление
	|ИЗ
	|	РегистрСведений.ИС_АЛИ_СоответствиеЗначенийХарактеристик КАК ИС_АЛИ_СоответствиеЗначенийХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_АЛИ_Атрибут КАК ИС_АЛИ_Атрибут
	|		ПО ИС_АЛИ_СоответствиеЗначенийХарактеристик.АтрибутАли = ИС_АЛИ_Атрибут.Ссылка
	|ГДЕ
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Категория = &Категория
	|	И (ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры)
	|			ИЛИ ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры)
	|			ИЛИ ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры)
	|			ИЛИ ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	| 
	|ВЫБРАТЬ
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.АтрибутАли,
	|	NULL,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ФиксированноеЗначение,
	|	ТипЗначения(ИС_АЛИ_СоответствиеЗначенийХарактеристик.ФиксированноеЗначение),
	|	ИС_АЛИ_Атрибут.Код КАК ИС_АЛИ_АтрибутКод,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	0,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_АЛИ_СоответствиеЗначенийХарактеристик КАК ИС_АЛИ_СоответствиеЗначенийХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_АЛИ_Атрибут КАК ИС_АЛИ_Атрибут
	|		ПО ИС_АЛИ_СоответствиеЗначенийХарактеристик.АтрибутАли = ИС_АЛИ_Атрибут.Ссылка
	|ГДЕ
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Категория = &Категория
	|	И (ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение)
	|	ИЛИ ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара,
	|	NULL,
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С,
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Реквизит1С,
	|	NULL,
	|	NULL,
	|	NULL,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара КАК ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Категория = &КатегорияДляОсновныхРеквизитов
	|	И (ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры)
	|			ИЛИ ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры)
	|			ИЛИ ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры)
	|			ИЛИ ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара,
	|	NULL,
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С,
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Реквизит1С,
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ФиксированноеЗначение,
	|	ТипЗначения(ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ФиксированноеЗначение),
	|	NULL,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	0,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара КАК ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Категория = &КатегорияДляОсновныхРеквизитов
	|	И (ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение)
	|	ИЛИ ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры))";

	ТаблицаСоответствийЗначений = Запрос.Выполнить().Выгрузить();

	МассивОписанийТипов = ТаблицаСоответствийЗначений.ВыгрузитьКолонку("ТипЗначенияРеквизита");
	МассивОписанийТипов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивОписанийТипов);
	МассивТипов = Новый Массив;
	Для Каждого описаниеТипов Из МассивОписанийТипов Цикл
		Если ЗначениеЗаполнено(описаниеТипов) Тогда
			Если ТипЗнч(описаниеТипов) = Тип("ОписаниеТипов") Тогда
				МассивТипов.Добавить(ОписаниеТипов.Типы()[0]);
			ИначеЕсли ТипЗнч(описаниеТипов) = Тип("Тип") Тогда
				МассивТипов.Добавить(описаниеТипов);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если МассивТипов.Количество() = 0 Тогда
		МассивТипов.Добавить(Тип("Строка"));
	КонецЕсли;

	МассивТипов.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
	КС = Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная);
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов, , КС);

	ТаблицаСоответствийЗначений.Колонки.ЗначениеХарактеристики.Имя = "ЗначениеВРегистре";
	ТаблицаСоответствийЗначений.Колонки.Добавить("ЗначениеХарактеристики", ОписаниеТипов);

	Для Каждого стр Из ТаблицаСоответствийЗначений Цикл

		Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда

			Если ИС_Ozon_Сервер.ЭтоПримитивныйТип(стр.ТипЗначенияРеквизита) Тогда
				стр.ЗначениеХарактеристики = стр.ЗначениеВРегистре;
			Иначе

				Если стр.ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры Тогда
					стр.ЗначениеХарактеристики = Справочники["ХарактеристикиНоменклатуры"].ПолучитьСсылку(
						Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
				Иначе

					ОбъектМетаданных = Метаданные.НайтиПоТипу(стр.ТипЗначенияРеквизита.Типы()[0]);
					ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
					ЭтоСправочник	= СтрНайти(ПолноеИмяОбъекта, "Справочник.") = 1;
					ЭтоПеречисление	= СтрНайти(ПолноеИмяОбъекта, "Перечисление.") = 1;

					Если ЭтоСправочник Тогда
						стр.ЗначениеХарактеристики = Справочники[ОбъектМетаданных.Имя].ПолучитьСсылку(
							Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
					ИначеЕсли ЭтоПеречисление Тогда
						стр.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Получить(стр.ЗначениеВРегистре
							- 1);
					КонецЕсли;
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Возврат ТаблицаСоответствийЗначений;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Функция СтруктураПараметровЗначенийРеквизитовНоменклатуры(Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории) Экспорт

	Если ЕстьНастройкиОсновныхРеквизитовДляКатегории Тогда
		КатегорияДляОсновныхРеквизитов = Категория;
	Иначе
		КатегорияДляОсновныхРеквизитов = ПредопределенноеЗначение("Справочник.ИС_Ozon_КатегорииТоваров.ПустаяСсылка");
	КонецЕсли;

	СоответствиеРеквизитов = Новый Соответствие;
	СписокРеквизитов = "";
	МассивТипов = Новый Массив;
	МассивСинонимов = Новый Массив;

	РеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].Реквизиты;
	Для Каждого реквизит Из РеквизитыНоменклатуры Цикл
		СоответствиеРеквизитов.Вставить(СокрЛП(реквизит.Синоним), реквизит);
		МассивСинонимов.Добавить(СокрЛП(реквизит.Синоним));
		СписокРеквизитов = СписокРеквизитов + реквизит.Имя + ", ";
		МассивТипов.Добавить(реквизит.тип.типы()[0]);
	КонецЦикла;

	СтандартныеРеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].СтандартныеРеквизиты;
	Для Каждого реквизит Из СтандартныеРеквизитыНоменклатуры Цикл
		СоответствиеРеквизитов.Вставить(реквизит.Имя, реквизит);
		МассивСинонимов.Добавить(реквизит.Имя);
		СписокРеквизитов = СписокРеквизитов + реквизит.Имя + ", ";
		МассивТипов.Добавить(реквизит.тип.типы()[0]);
	КонецЦикла;

	СписокРеквизитов = Лев(СписокРеквизитов, СтрДлина(СписокРеквизитов) - 2);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("КатегорияДляОсновныхРеквизитов", КатегорияДляОсновныхРеквизитов);
	Запрос.УстановитьПараметр("МассивСинонимов", МассивСинонимов);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.АтрибутАли КАК АтрибутАли,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли КАК ЗначениеАтрибутаАли,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	|	ИС_АЛИ_Атрибут.Код КАК ИС_АЛИ_АтрибутКод, 
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	0 КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ИСТИНА КАК ТребуетсяСопоставление
	|ИЗ
	|	РегистрСведений.ИС_АЛИ_СоответствиеЗначенийХарактеристик КАК ИС_АЛИ_СоответствиеЗначенийХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_АЛИ_Атрибут КАК ИС_АЛИ_Атрибут
	|		ПО ИС_АЛИ_СоответствиеЗначенийХарактеристик.АтрибутАли = ИС_АЛИ_Атрибут.Ссылка
	|ГДЕ
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Категория = &Категория
	|	И ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры)
	|	И ИС_АЛИ_СоответствиеЗначенийХарактеристик.Реквизит1С В(&МассивСинонимов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара,
	|	NULL,
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С,
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Реквизит1С,
	|	NULL,
	|	NULL, 
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара КАК ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Категория = &КатегорияДляОсновныхРеквизитов
	|	И ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры)
	|	И ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Реквизит1С В(&МассивСинонимов)";

	ТаблицаСоответствийЗначений = Запрос.Выполнить().Выгрузить();
	ТаблицаСоответствийЗначений.Колонки.ЗначениеХарактеристики.Имя = "ЗначениеВРегистре";

	МассивТипов 	= ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивТипов);
	ОписаниеТипов 	= Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная));
	ТаблицаСоответствийЗначений.Колонки.Добавить("ЗначениеХарактеристики", ОписаниеТипов);

	Для Каждого стр Из ТаблицаСоответствийЗначений Цикл
		Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда

			РеквизитИзСоответствия = СоответствиеРеквизитов.Получить(стр.Реквизит1С);
			Если РеквизитИзСоответствия = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			ТипЗначенияРеквизита = РеквизитИзСоответствия.Тип;
			Если ИС_Ozon_Сервер.ЭтоПримитивныйТип(ТипЗначенияРеквизита) Тогда

				стр.ЗначениеХарактеристики = стр.ЗначениеВРегистре;

			Иначе

				ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначенияРеквизита.Типы()[0]);
				ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
				ЭтоСправочник	= СтрНайти(ПолноеИмяОбъекта, "Справочник.") = 1;
				ЭтоПеречисление	= СтрНайти(ПолноеИмяОбъекта, "Перечисление.") = 1;

				Если ЭтоСправочник Тогда
					стр.ЗначениеХарактеристики = Справочники[ОбъектМетаданных.Имя].ПолучитьСсылку(
						Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
				ИначеЕсли ЭтоПеречисление Тогда
					стр.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Получить(стр.ЗначениеВРегистре - 1);
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Результат = Новый Структура;
	Результат.Вставить("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);
	Результат.Вставить("СписокРеквизитов", СписокРеквизитов);
	Результат.Вставить("СоответствиеРеквизитов", СоответствиеРеквизитов);

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Функция СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры(Категория,
	ЕстьНастройкиОсновныхРеквизитовДляКатегории) Экспорт

	Если ЕстьНастройкиОсновныхРеквизитовДляКатегории Тогда
		КатегорияДляОсновныхРеквизитов = Категория;
	Иначе
		КатегорияДляОсновныхРеквизитов = ПредопределенноеЗначение("Справочник.ИС_Ozon_КатегорииТоваров.ПустаяСсылка");
	КонецЕсли;

	СоответствиеРеквизитов = Новый Соответствие;
	СписокРеквизитов = "";
	МассивТипов = Новый Массив;

	РеквизитыНоменклатуры = Метаданные.Справочники["ХарактеристикиНоменклатуры"].Реквизиты;
	Для Каждого реквизит Из РеквизитыНоменклатуры Цикл
		СоответствиеРеквизитов.Вставить(реквизит.Синоним, реквизит);
		СписокРеквизитов = СписокРеквизитов + реквизит.Имя + ", ";
		МассивТипов.Добавить(реквизит.тип.типы()[0]);
	КонецЦикла;

	СтандартныеРеквизиты = Метаданные.Справочники["ХарактеристикиНоменклатуры"].СтандартныеРеквизиты;
	Для Каждого реквизит Из СтандартныеРеквизиты Цикл
		СоответствиеРеквизитов.Вставить(реквизит.Имя, реквизит);
		СписокРеквизитов = СписокРеквизитов + реквизит.Имя + ", ";
		МассивТипов.Добавить(реквизит.тип.типы()[0]);
	КонецЦикла;

	СписокРеквизитов = Лев(СписокРеквизитов, СтрДлина(СписокРеквизитов) - 2);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("КатегорияДляОсновныхРеквизитов", КатегорияДляОсновныхРеквизитов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.АтрибутАли КАК АтрибутАли,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли КАК ЗначениеАтрибутаАли,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	|	ИС_АЛИ_Атрибут.Код КАК ИС_АЛИ_АтрибутКод,
	|	ИСТИНА КАК ТребуетсяСопоставление
	|ИЗ
	|	РегистрСведений.ИС_АЛИ_СоответствиеЗначенийХарактеристик КАК ИС_АЛИ_СоответствиеЗначенийХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_АЛИ_Атрибут КАК ИС_АЛИ_Атрибут
	|		ПО ИС_АЛИ_СоответствиеЗначенийХарактеристик.АтрибутАли = ИС_АЛИ_Атрибут.Ссылка
	|ГДЕ
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Категория = &Категория
	|	И ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара,
	|	NULL,
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С,
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Реквизит1С,
	|	NULL,
	|	NULL,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара КАК ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.Категория = &КатегорияДляОсновныхРеквизитов
	|	И ИС_АЛИ_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры)";

	ТаблицаСоответствийЗначений = Запрос.Выполнить().Выгрузить();
	ТаблицаСоответствийЗначений.Колонки.ЗначениеХарактеристики.Имя = "ЗначениеВРегистре";

	МассивТипов 	= ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивТипов);
	ОписаниеТипов 	= Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная));
	ТаблицаСоответствийЗначений.Колонки.Добавить("ЗначениеХарактеристики", ОписаниеТипов);

	Для Каждого стр Из ТаблицаСоответствийЗначений Цикл
		Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда

			ТипЗначенияРеквизита = СоответствиеРеквизитов.Получить(стр.Реквизит1С).тип;
			Если ИС_Ozon_Сервер.ЭтоПримитивныйТип(ТипЗначенияРеквизита) Тогда

				стр.ЗначениеХарактеристики = стр.ЗначениеВРегистре;

			Иначе

				ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначенияРеквизита.Типы()[0]);
				ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
				ЭтоСправочник	= СтрНайти(ПолноеИмяОбъекта, "Справочник.") = 1;
				ЭтоПеречисление	= СтрНайти(ПолноеИмяОбъекта, "Перечисление.") = 1;

				Если ЭтоСправочник Тогда
					стр.ЗначениеХарактеристики = Справочники[ОбъектМетаданных.Имя].ПолучитьСсылку(
						Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
				ИначеЕсли ЭтоПеречисление Тогда
					стр.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Получить(стр.ЗначениеВРегистре - 1);
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Результат = Новый Структура;
	Результат.Вставить("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);
	Результат.Вставить("СписокРеквизитов", СписокРеквизитов);
	Результат.Вставить("СоответствиеРеквизитов", СоответствиеРеквизитов);

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Процедура ЗаполнитьЗначенияПоДопРеквизитам(СтрокаТаблицы, ТаблицаСоответствийЗначений, РазделительФотографий,
	ИмяЗаполняемойКолонки = Неопределено) Экспорт

	Если ТаблицаСоответствийЗначений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСоответствийЗначений.АтрибутАли КАК АтрибутАли,
	|	ТаблицаСоответствийЗначений.ИС_АЛИ_АтрибутКод КАК ИС_АЛИ_АтрибутКод,
	|	ТаблицаСоответствийЗначений.ЗначениеАтрибутаАли КАК ЗначениеАтрибутаАли,
	|	ТаблицаСоответствийЗначений.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ТаблицаСоответствийЗначений.Реквизит1С КАК Реквизит1С,
	|	ТаблицаСоответствийЗначений.ЗначениеВРегистре КАК ЗначениеВРегистре,
	|	ТаблицаСоответствийЗначений.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ТаблицаСоответствийЗначений.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	ТаблицаСоответствийЗначений.ТребуетсяСопоставление КАК ТребуетсяСопоставление
	|ПОМЕСТИТЬ вт_СоответствиеЗначенийХарактеристик
	|ИЗ
	|	&ТаблицаСоответствийЗначений КАК ТаблицаСоответствийЗначений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК Ссылка,
	|	вт_СоответствиеЗначенийХарактеристик.АтрибутАли КАК АтрибутАли,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_АЛИ_АтрибутКод КАК ИС_АЛИ_АтрибутКод,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли КАК ЗначениеАтрибутаАли,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	"""" КАК ТекстоваяСтрока
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
	|			И (ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
	|ГДЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка В (&ХарактеристикиНоменклатуры)
	|	И вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры)
	|	И вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка,
	|	вт_СоответствиеЗначенийХарактеристик.АтрибутАли,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_АЛИ_АтрибутКод,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство)
	|			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли ЕСТЬ NULL
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли = НЕОПРЕДЕЛЕНО)
	|ГДЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка В(&ХарактеристикиНоменклатуры)
	|	И вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры)
	|	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка,
	|	вт_СоответствиеЗначенийХарактеристик.АтрибутАли,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_АЛИ_АтрибутКод,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (НоменклатураДополнительныеРеквизиты.Свойство = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
	|			И (НоменклатураДополнительныеРеквизиты.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
	|ГДЕ
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры)
	|	И НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
	|	И вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка,
	|	вт_СоответствиеЗначенийХарактеристик.АтрибутАли,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_АЛИ_АтрибутКод,
	|	НоменклатураДополнительныеРеквизиты.Значение,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	НоменклатураДополнительныеРеквизиты.ТекстоваяСтрока
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = НоменклатураДополнительныеРеквизиты.Свойство)
	|			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли ЕСТЬ NULL
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли = НЕОПРЕДЕЛЕНО)
	|ГДЕ
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры)
	|	И НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
	|	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	вт_СоответствиеЗначенийХарактеристик.АтрибутАли,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_АЛИ_АтрибутКод,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (ДополнительныеСведения.Свойство = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
	|			И (ДополнительныеСведения.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
	|ГДЕ
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры)
	|	И ДополнительныеСведения.Объект = &Номенклатура
	|	И вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	вт_СоответствиеЗначенийХарактеристик.АтрибутАли,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_АЛИ_АтрибутКод,
	|	ДополнительныеСведения.Значение,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = ДополнительныеСведения.Свойство)
	|			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли ЕСТЬ NULL
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли = НЕОПРЕДЕЛЕНО)
	|ГДЕ
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры)
	|	И ДополнительныеСведения.Объект = &Номенклатура
	|	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	вт_СоответствиеЗначенийХарактеристик.АтрибутАли,
	|	вт_СоответствиеЗначенийХарактеристик.ИС_АЛИ_АтрибутКод,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеВРегистре,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|
	|ГДЕ
	|	(вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение)
	|	ИЛИ вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры))
	|	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление 
	|";

	Если ИС_Ozon_Сервер.ЕстьВидНоменклатурыУХарактеристики() Тогда
		Запрос.Текст = Запрос.Текст + "
									  |
									  |ОБЪЕДИНИТЬ ВСЕ
									  |
									  |////////////////////////////////////////////////////////////////////////////////
									  |ВЫБРАТЬ
									  |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
									  |	вт_СоответствиеЗначенийХарактеристик.АтрибутАли КАК АтрибутАли,
									  |	вт_СоответствиеЗначенийХарактеристик.ИС_АЛИ_АтрибутКод КАК ИС_АЛИ_АтрибутКод,
									  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли КАК ЗначениеАтрибутаАли,
									  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
									  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
									  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
									  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
									  |	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
									  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
									  |	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
									  |	"""" КАК ТекстоваяСтрока
									  |ИЗ
									  |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
									  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
									  |		ПО (ХарактеристикиНоменклатуры.ВидНоменклатуры = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
									  |			И (ХарактеристикиНоменклатуры.Ссылка = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
									  |ГДЕ
									  |	ХарактеристикиНоменклатуры.Ссылка В (&ХарактеристикиНоменклатуры)
									  |	И вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры)
									  |	И вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
									  |
									  |ОБЪЕДИНИТЬ ВСЕ
									  |
									  |ВЫБРАТЬ
									  |	ХарактеристикиНоменклатуры.Ссылка,
									  |	вт_СоответствиеЗначенийХарактеристик.АтрибутАли,
									  |	вт_СоответствиеЗначенийХарактеристик.ИС_АЛИ_АтрибутКод,
									  |	ХарактеристикиНоменклатуры.Ссылка,
									  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
									  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
									  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
									  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
									  |	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
									  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
									  |	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
									  |	""""
									  |ИЗ
									  |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
									  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
									  |		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = ХарактеристикиНоменклатуры.ВидНоменклатуры)
									  |			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
									  |				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли ЕСТЬ NULL
									  |				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли = НЕОПРЕДЕЛЕНО)
									  |ГДЕ
									  |	ХарактеристикиНоменклатуры.Ссылка В(&ХарактеристикиНоменклатуры)
									  |	И вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры)
									  |	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление";

	КонецЕсли;

	Запрос.УстановитьПараметр("ХарактеристикиНоменклатуры", СтрокаТаблицы.ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура", СтрокаТаблицы.Номенклатура);
	Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		ЗаполнитьЗначениеКолонки(Выборка, СтрокаТаблицы, РазделительФотографий, ИмяЗаполняемойКолонки);
		
	КонецЦикла
	;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Процедура ЗаполнитьЗначенияПоРеквизитамНоменклатуры(СтрокаТаблицы, СтруктураПараметров, РазделительФотографий,
	ИмяЗаполняемойКолонки = Неопределено) Экспорт

	ТаблицаСоответствийЗначений = СтруктураПараметров.ТаблицаСоответствийЗначений;
	Если ТаблицаСоответствийЗначений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	" + СтруктураПараметров.СписокРеквизитов + Символы.ПС + "
																				|ПОМЕСТИТЬ вт_ЗначенияРеквизитов1С
																				|ИЗ
																				|	Справочник.Номенклатура КАК Номенклатура
																				|ГДЕ
																				|	Номенклатура.Ссылка = &Номенклатура
																				|;
																				|
																				|////////////////////////////////////////////////////////////////////////////////
																				|";

	МассивРеквизитов = ТаблицаСоответствийЗначений.ВыгрузитьКолонку("Реквизит1С");
	МассивРеквизитов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивРеквизитов);
	ПервыйЗапрос = Истина;
	Если МассивРеквизитов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СинонимРеквизита Из МассивРеквизитов Цикл
		Реквизит = СтруктураПараметров.СоответствиеРеквизитов.Получить(СинонимРеквизита);
		Если Реквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СодержитСтроку = Реквизит.Тип.СодержитТип(Тип("Строка"));

		Запрос.текст = Запрос.Текст + ?(ПервыйЗапрос, "", "ОБЪЕДИНИТЬ ВСЕ") + Символы.ПС + Символы.ПС + "ВЫБРАТЬ
																										| " + ?(
			СодержитСтроку, "Выразить(вт_ЗначенияРеквизитов1С." + Реквизит.Имя + " КАК Строка(1024))",
			"вт_ЗначенияРеквизитов1С." + Реквизит.Имя) + " КАК Значение,
														 |	""" + СинонимРеквизита + """ КАК ИмяРеквизита1С,"
			+ Символы.ПС + "
						   | " + ?(СодержитСтроку, "вт_ЗначенияРеквизитов1С." + Реквизит.Имя, """""") + " КАК ТекстоваяСтрока 
																										| " + ?(
			ПервыйЗапрос, "ПОМЕСТИТЬ вт_таб2" + Символы.ПС, "") + "ИЗ
																  |	вт_ЗначенияРеквизитов1С КАК вт_ЗначенияРеквизитов1С"
			+ Символы.ПС + Символы.ПС;
		ПервыйЗапрос = Ложь;
	КонецЦикла;

	Запрос.Текст = Запрос.Текст + ";
								  |////////////////////////////////////////////////////////////////////////////////
								  |
								  |ВЫБРАТЬ
								  |	ТаблицаСоответствийЗначений.АтрибутАли КАК АтрибутАли,
								  |	ТаблицаСоответствийЗначений.ИС_АЛИ_АтрибутКод КАК ИС_АЛИ_АтрибутКод,
								  |	ТаблицаСоответствийЗначений.ЗначениеАтрибутаАли КАК ЗначениеАтрибутаАли,
								  |	ТаблицаСоответствийЗначений.ВидРеквизита1С КАК ВидРеквизита1С,
								  |	ТаблицаСоответствийЗначений.Реквизит1С КАК Реквизит1С,
								  |	ТаблицаСоответствийЗначений.ЗначениеВРегистре КАК ЗначениеВРегистре,
								  |	ТаблицаСоответствийЗначений.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
								  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
			  					  |	ТаблицаСоответствийЗначений.Множитель КАК Множитель,
								  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
								  |	ТаблицаСоответствийЗначений.ТребуетсяСопоставление КАК ТребуетсяСопоставление
								  |ПОМЕСТИТЬ вт_СоответствиеЗначенийХарактеристик
								  |ИЗ
								  |	&ТаблицаСоответствийЗначений КАК ТаблицаСоответствийЗначений
								  |;
								  |
								  |////////////////////////////////////////////////////////////////////////////////
								  |
								  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
								  |	вт_СоответствиеЗначенийХарактеристик.АтрибутАли,
								  |	вт_СоответствиеЗначенийХарактеристик.ИС_АЛИ_АтрибутКод,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли,
								  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
								  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
			  					  |	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
								  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
								  |	РеквизитыНоменклатуры.ТекстоваяСтрока КАК ТекстоваяСтрока,
								  |   вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |ИЗ
								  |	вт_таб2 КАК РеквизитыНоменклатуры
								  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
								  |		ПО (РеквизитыНоменклатуры.ИмяРеквизита1С = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
								  |			И (РеквизитыНоменклатуры.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
								  |ГДЕ
								  |	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |
								  |ОБЪЕДИНИТЬ ВСЕ
								  |
								  |ВЫБРАТЬ
								  |	вт_СоответствиеЗначенийХарактеристик.АтрибутАли,
								  |	вт_СоответствиеЗначенийХарактеристик.ИС_АЛИ_АтрибутКод,
								  |	РеквизитыНоменклатуры.Значение,
								  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
								  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
			  					  |	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
								  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
								  |	РеквизитыНоменклатуры.ТекстоваяСтрока,
								  |   вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |ИЗ
								  |	вт_таб2 КАК РеквизитыНоменклатуры
								  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
								  |		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = РеквизитыНоменклатуры.ИмяРеквизита1С)
								  |			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
								  |				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли ЕСТЬ NULL ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли = Неопределено)
								  |ГДЕ
								  |	НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление";

	Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);
	Запрос.УстановитьПараметр("Номенклатура", СтрокаТаблицы.Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначениеКолонки(Выборка, СтрокаТаблицы, РазделительФотографий, ИмяЗаполняемойКолонки);
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Процедура ЗаполнитьЗначенияПоРеквизитамХарактеристикиНоменклатуры(СтрокаТаблицы, СтруктураПараметров,
	РазделительФотографий, ИмяЗаполняемойКолонки = Неопределено) Экспорт

	ТаблицаСоответствийЗначений = СтруктураПараметров.ТаблицаСоответствийЗначений;
	Если ТаблицаСоответствийЗначений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	" + СтруктураПараметров.СписокРеквизитов + Символы.ПС + "
																				|ПОМЕСТИТЬ вт_ЗначенияРеквизитов1С
																				|ИЗ
																				|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
																				|ГДЕ
																				|	ХарактеристикиНоменклатуры.Ссылка = &ХарактеристикаНоменклатуры
																				|;
																				|
																				|////////////////////////////////////////////////////////////////////////////////
																				|";

	МассивРеквизитов = ТаблицаСоответствийЗначений.ВыгрузитьКолонку("Реквизит1С");
	МассивРеквизитов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивРеквизитов);
	ПервыйЗапрос = Истина;
	Для Каждого СинонимРеквизита Из МассивРеквизитов Цикл
		Реквизит = СтруктураПараметров.СоответствиеРеквизитов.Получить(СинонимРеквизита);
		Если Реквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СодержитСтроку = Реквизит.Тип.СодержитТип(Тип("Строка"));

		Запрос.текст = Запрос.Текст + ?(ПервыйЗапрос, "", "ОБЪЕДИНИТЬ ВСЕ") + Символы.ПС + Символы.ПС + "ВЫБРАТЬ
																										| " + ?(
			СодержитСтроку, "Выразить(вт_ЗначенияРеквизитов1С." + Реквизит.Имя + " КАК Строка(1024))",
			"вт_ЗначенияРеквизитов1С." + Реквизит.Имя) + " КАК Значение,
														 |	""" + СинонимРеквизита + """ КАК ИмяРеквизита1С,"
			+ Символы.ПС + "
						   | " + ?(СодержитСтроку, "вт_ЗначенияРеквизитов1С." + Реквизит.Имя, """""") + " КАК ТекстоваяСтрока 
																										| " + ?(
			ПервыйЗапрос, "ПОМЕСТИТЬ вт_таб2" + Символы.ПС, "") + "ИЗ
																  |	вт_ЗначенияРеквизитов1С КАК вт_ЗначенияРеквизитов1С"
			+ Символы.ПС + Символы.ПС;
		ПервыйЗапрос = Ложь;
	КонецЦикла;

	Запрос.Текст = Запрос.Текст + ";
								  |////////////////////////////////////////////////////////////////////////////////
								  |
								  |ВЫБРАТЬ
								  |	ТаблицаСоответствийЗначений.АтрибутАли КАК АтрибутАли,
								  |	ТаблицаСоответствийЗначений.ИС_АЛИ_АтрибутКод КАК ИС_АЛИ_АтрибутКод,
								  |	ТаблицаСоответствийЗначений.ЗначениеАтрибутаАли КАК ЗначениеАтрибутаАли,
								  |	ТаблицаСоответствийЗначений.ВидРеквизита1С КАК ВидРеквизита1С,
								  |	ТаблицаСоответствийЗначений.Реквизит1С КАК Реквизит1С,
								  |	ТаблицаСоответствийЗначений.ЗначениеВРегистре КАК ЗначениеВРегистре,
								  |	ТаблицаСоответствийЗначений.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
								  |	ТаблицаСоответствийЗначений.ТребуетсяСопоставление КАК ТребуетсяСопоставление
								  |ПОМЕСТИТЬ вт_СоответствиеЗначенийХарактеристик
								  |ИЗ
								  |	&ТаблицаСоответствийЗначений КАК ТаблицаСоответствийЗначений
								  |;
								  |
								  |////////////////////////////////////////////////////////////////////////////////
								  |
								  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
								  |	вт_СоответствиеЗначенийХарактеристик.АтрибутАли,
								  |	вт_СоответствиеЗначенийХарактеристик.ИС_АЛИ_АтрибутКод,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли,
								  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
								  |	РеквизитыХарактеристики.ТекстоваяСтрока КАК ТекстоваяСтрока,
								  |   вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |ИЗ
								  |	вт_таб2 КАК РеквизитыХарактеристики
								  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
								  |		ПО (РеквизитыХарактеристики.ИмяРеквизита1С = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
								  |			И (РеквизитыХарактеристики.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
								  |ГДЕ
								  |	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |
								  |ОБЪЕДИНИТЬ ВСЕ
								  |
								  |ВЫБРАТЬ
								  |	вт_СоответствиеЗначенийХарактеристик.АтрибутАли,
								  |	вт_СоответствиеЗначенийХарактеристик.ИС_АЛИ_АтрибутКод,
								  |	РеквизитыХарактеристики.Значение,
								  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
								  |	РеквизитыХарактеристики.ТекстоваяСтрока,
								  |   вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |ИЗ
								  |	вт_таб2 КАК РеквизитыХарактеристики
								  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
								  |		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = РеквизитыХарактеристики.ИмяРеквизита1С)
								  |			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
								  |				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли ЕСТЬ NULL ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеАтрибутаАли = Неопределено)
								  |ГДЕ
								  |	НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление";

	Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", СтрокаТаблицы.ХарактеристикаНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначениеКолонки(Выборка, СтрокаТаблицы, РазделительФотографий, ИмяЗаполняемойКолонки);
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Процедура ЗаполнитьЗначениеКолонки(Выборка, СтрокаТаблицы, РазделительФотографий, ИмяЗаполняемойКолонки) Экспорт

	Если ЗначениеЗаполнено(Выборка.ИС_АЛИ_АтрибутКод) Тогда
		ИмяКолонки = "Атрибут_" + СтрЗаменить(Строка(Выборка.ИС_АЛИ_АтрибутКод), Символы.НПП, "");
	Иначе
		ИмяКолонки = Выборка.АтрибутАли;
	КонецЕсли;

	Если Не СтрокаТаблицы.Свойство(ИмяКолонки) Или (ЗначениеЗаполнено(ИмяЗаполняемойКолонки) И ИмяКолонки
		<> ИмяЗаполняемойКолонки) Тогда
		Возврат;
	КонецЕсли;

	Если Выборка.ВидРеквизита1С = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры") Тогда
		ЗначениеАтрибутаАли = СтрокаТаблицы.Штрихкод;
	ИначеЕсли ЗначениеЗаполнено(Выборка.ТекстоваяСтрока) И Не Выборка.ТребуетсяСопоставление Тогда
		ЗначениеАтрибутаАли = Выборка.ТекстоваяСтрока;
	Иначе
		//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71157
		//ЗначениеАтрибутаАли = Выборка.ЗначениеАтрибутаАли;
		Если Выборка.Множитель <> 0 Тогда
			ЗначениеАтрибутаАли = Выборка.ЗначениеАтрибутаАли * Выборка.Множитель;
		Иначе
			ЗначениеАтрибутаАли = Выборка.ЗначениеАтрибутаАли;
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 18.05.24 УА #71157
	КонецЕсли;

	Если ТипЗнч(СтрокаТаблицы[ИмяКолонки]) = Тип("СписокЗначений") Тогда
		//Если ИмяКолонки = "Изображения" Тогда
		//	Если ТипЗнч(ЗначениеАтрибутаАли) = Тип("Строка") И РазделительФотографий <> "" Тогда
		//		МассивЗначений = СтрРазделить(ЗначениеАтрибутаАли, РазделительФотографий, Ложь);
		//	Иначе
		//		Ozon_Константы = ПолучитьНастройкиСопоставления();
		//		РазделительФотографий = Ozon_Константы.РазделительФотографий;
		//		//Ozon_Константы = Ozon_КонстантыВызовСервера.ПрочитатьКонстанты();
		//		РасширенияДляВыгрузкиКартинок = Ozon_Константы.РасширенияДляВыгрузкиКартинок;
		//		Если ЗначениеЗаполнено(РасширенияДляВыгрузкиКартинок) Тогда

		//			//@skip-check wrong-string-literal-content
		//			Если (КраткоеНаименованиеОсновнойПодсистемы() = "УНФ"
		//				И ТипЗнч(ЗначениеАтрибутаАли) = Тип("СправочникСсылка.ХарактеристикиНоменклатурыПрисоединенныеФайлы")) Тогда
		//				ВладелецФайлов = СтрокаТаблицы.ХарактеристикаНоменклатуры;
		//			Иначе
		//				ВладелецФайлов = СтрокаТаблицы.Номенклатура;
		//			КонецЕсли;

		//			МассивЗначений = ПолучитьКартинкиПоВладельцу(ВладелецФайлов,
		//				РасширенияДляВыгрузкиКартинок);
		//		Иначе
		//			МассивЗначений = Новый Массив;
		//		КонецЕсли;

		//	КонецЕсли;
		//	МассивЗначений = ОбработатьСсылки(МассивЗначений);
		//Иначе
			Если ТипЗнч(ЗначениеАтрибутаАли) = Тип("Строка") И Выборка.ТребуетсяСопоставление Тогда
				МассивЗначений = ЗначенияАтрибутовАлиИзСтроки(
					ЗначениеАтрибутаАли);
			Иначе
				МассивЗначений = Новый Массив;
				МассивЗначений.Добавить(ЗначениеАтрибутаАли);
			КонецЕсли;
		//КонецЕсли;
		СтрокаТаблицы[ИмяКолонки].ЗагрузитьЗначения(МассивЗначений);
	Иначе

		Если ИмяКолонки = "main_image_urls_list" Тогда
			ЗначениеАтрибутаАли = ИС_Ozon_Сервер.ОбработатьСсылки(ЗначениеАтрибутаАли);
		КонецЕсли;

		Если ТипЗнч(СтрокаТаблицы[ИмяКолонки]) <> ТипЗнч(ЗначениеАтрибутаАли) Тогда

			Если Не ИС_Ozon_Сервер.ЭтоПримитивныйТип(ЗначениеАтрибутаАли) Тогда
				ЗначениеАтрибутаАли = Строка(ЗначениеАтрибутаАли);
			КонецЕсли;
			
			//@skip-check empty-except-statement
			Попытка
				Если ТипЗнч(СтрокаТаблицы[ИмяКолонки]) = Тип("Число") Тогда
					ЗначениеАтрибутаАли = Число(ЗначениеАтрибутаАли);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;

		СтрокаТаблицы[ИмяКолонки] = ЗначениеАтрибутаАли;

	КонецЕсли;	

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Функция АтрибутПоКоду(ИдСтрокой) Экспорт

	Атрибут = Справочники.ИС_АЛИ_Атрибут.НайтиПоКоду(Число(ИдСтрокой), Истина);

	Возврат Атрибут;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574 

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Процедура СозданиеКТ(Профиль, Тело) Экспорт  
	
	Событие = "ИС_АЛИ_СозданиеКТ";
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнен Профиль. Выгрузка остатков невозможна");
		Возврат;
	КонецЕсли;	
	
	ПараметрыСоединения = Неопределено;
	Если Не ПолучитьПараметрыСоединения(Профиль, ПараметрыСоединения) Тогда
		Возврат;
	КонецЕсли;
	
	Заголовки = Неопределено;
	Если Не CформироватьЗаголовкиЗапроса(Заголовки, ПараметрыСоединения) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	ПараметрыЗапроса.Сервер = ПараметрыСоединения.АдресСервиса;
	ПараметрыЗапроса.Порт = ПараметрыСоединения.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = ПараметрыСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.Заголовки.Вставить("x-auth-token", Заголовки["x-auth-token"]);  
			
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(Тело, 1000);
	Ошибка = Ложь;
	
	Для Каждого Элемент Из РазбитыйМассив Цикл
				
		products = Новый Структура;			
		products.Вставить("products", Элемент);
		
		ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(products);
		
		Результат = ИС_АЛИ_API.СоздатьКТ(Профиль, ПараметрыЗапроса);
		
		Если ЗначениеЗаполнено(Результат) Тогда	
			//+ ИнфоСофт Стояк Ю.К. 17.02.2025 УА #93751			
			//ОбщегоНазначения.СообщитьПользователю("Выгрузка прошла со следующим статусом:" + Результат.ok);	
			Если Результат.Количество() > 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Выгрузка прошла со следующим статусом:" + Результат[0].ok);	
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 17.02.2025 УА #93751
			//+ ИнфоСофт Заварин К.В. 16.04.25 УА #98617
			//ОбщегоНазначения.СообщитьПользователю("Номер задания на создание КТ:" + Результат.task_id); 
			ОбщегоНазначения.СообщитьПользователю("Номер задания на создание КТ:" + Результат[0].task_id);
			//- ИнфоСофт Заварин К.В. 16.04.25 УА #98617	
		Иначе			
			ЗаписьЖурналаРегистрации("Не удалось создать КТ!", УровеньЖурналаРегистрации.Ошибка);			
		КонецЕсли; 		
		
	КонецЦикла; 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

#КонецОбласти

#Область Склады 

#КонецОбласти

#Область ЦеныИОстатки 

//+ ИнфоСофт Стояк Ю.К. 04.03.2023 УА #54628
Функция ПолучитьЦеныТовара(Профиль) Экспорт
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Загрузка товаров невозможна");
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыСоединения = Неопределено;
	Если Не ПолучитьПараметрыСоединения(Профиль, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Заголовки = Неопределено;
	Если Не CформироватьЗаголовкиЗапроса(Заголовки, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	ПараметрыЗапроса.Сервер = ПараметрыСоединения.АдресСервиса;
	ПараметрыЗапроса.Порт = ПараметрыСоединения.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = ПараметрыСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.Заголовки.Вставить("x-auth-token", Заголовки["x-auth-token"]);		
	
	СписокТоваров = Неопределено;
	
	КоличествоЭлементовНаСтранице = 50;
	last_id = Неопределено;
	
	ТаблицаЦен = Новый ТаблицаЗначений;  
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(20);
	
	ТаблицаЦен.Колонки.Добавить("id", Новый ОписаниеТипов("Строка",КвалификаторыСтроки));
	ТаблицаЦен.Колонки.Добавить("price", Новый ОписаниеТипов("Число",КвалификаторыЧисла));
	ТаблицаЦен.Колонки.Добавить("discount_price", Новый ОписаниеТипов("Число",КвалификаторыЧисла));
	
	Пока Истина Цикл	
		
		rawData = Новый Структура;		
		Если ЗначениеЗаполнено(last_id) Тогда
			rawData.Вставить("last_product_id", last_id);  
		Иначе
			last_id = 0;
		КонецЕсли;                                     		
		rawData.Вставить("limit", КоличествоЭлементовНаСтранице);
		
		СписокТоваров = ИС_АЛИ_API.ЗагрузитьКарточкиТоваров(Профиль, ПараметрыЗапроса, rawData); 
		
		Если Не ЗначениеЗаполнено(СписокТоваров) Тогда
			Возврат Неопределено;
		КонецЕсли;               
		
		Если Не СписокТоваров.Количество() > 0 Тогда
			Прервать;
		КонецЕсли;
		
		Для Каждого Элемент Из СписокТоваров Цикл 
			
			rawData = Новый Структура;                                  
			rawData.Вставить("product_id", Элемент.id);
			
			ИнформацияОТоваре = ИС_АЛИ_API.ПолучитьДанныеОТоваре(Профиль, ПараметрыЗапроса, rawData);						
			
			Если Не ЗначениеЗаполнено(ИнформацияОТоваре) Тогда
				Продолжить;
			КонецЕсли;  
			
			Для Каждого Вариация Из ИнформацияОТоваре.sku Цикл
				
				НоваяСтрока = ТаблицаЦен.Добавить();
				НоваяСтрока.id = Вариация.sku_id;			
				НоваяСтрока.price = Вариация.price;
				НоваяСтрока.discount_price = Вариация.discount_price;			
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаЦен;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

//+ ИнфоСофт Стояк Ю.К. 06.02.2023 УА #54628
Функция ПолучитьОстаткиТовара(Профиль) Экспорт
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнен Личный кабинет. Загрузка товаров невозможна");
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыСоединения = Неопределено;
	Если Не ПолучитьПараметрыСоединения(Профиль, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Заголовки = Неопределено;
	Если Не CформироватьЗаголовкиЗапроса(Заголовки, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	ПараметрыЗапроса.Сервер = ПараметрыСоединения.АдресСервиса;
	ПараметрыЗапроса.Порт = ПараметрыСоединения.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = ПараметрыСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.Заголовки.Вставить("x-auth-token", Заголовки["x-auth-token"]); 
	
	data = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_АЛИ_Вариации.sku_id КАК sku_id
	|ИЗ
	|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
	|ГДЕ
	|	ИС_АЛИ_Вариации.Профиль = &Профиль
	|	И НЕ ИС_АЛИ_Вариации.sku_id ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		sku = Новый Структура;
		sku.Вставить("sku", Строка(ВыборкаДетальныеЗаписи.sku_id));
		data.Добавить(sku); 
		
	КонецЦикла;
	
	ТаблицаОстатков = Новый ТаблицаЗначений;  
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(20);
	
	ТаблицаОстатков.Колонки.Добавить("id", Новый ОписаниеТипов("Строка",КвалификаторыСтроки));
	ТаблицаОстатков.Колонки.Добавить("stock", Новый ОписаниеТипов("Число",КвалификаторыЧисла));
	
	Результат = ИС_АЛИ_API.ПолучитьОстаткиТовара(Профиль, ПараметрыЗапроса, data); 
	
	Если ЗначениеЗаполнено(Результат) Тогда  
		
		Для Каждого Элемент Из Результат.skus_info Цикл
			
			НоваяСтрока = ТаблицаОстатков.Добавить();
			НоваяСтрока.id = Элемент.sku;
			НоваяСтрока.stock = Элемент.max_sellable_quantity;				
			
		КонецЦикла; 		
		
	КонецЕсли;
	
	Возврат ТаблицаОстатков;
	
КонецФункции //+ ИнфоСофт Стояк Ю.К. 06.02.2023 УА #54628

//+ ИнфоСофт Ивонин К.А. 04.03.24 УА #66733
Функция ПолучитьТекстЗапросаОстатков() Экспорт
	
	Текст =
	"ВЫБРАТЬ
	|	ИС_АЛИ_Вариации.Ссылка КАК ПолеСопоставления,
	|	ИС_АЛИ_Вариации.Владелец КАК НоменклатураАЛИ,
	|	ИС_АЛИ_Вариации.Владелец.Код КАК product_id,
	|	ИС_АЛИ_Вариации.КодВариации КАК КодВариации,
	|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_АЛИ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_АЛИ_СоответствиеХарактеристик.Упаковка, &ПустаяУпаковка) КАК Упаковка,
	|	ИС_MP_ОграничениеОстатков.Остаток КАК СкрываемыйОстаток,
	|	НЕ ИС_MP_ОграничениеОстатков.Остаток ЕСТЬ NULL КАК ЕстьСкрываемыйОстаток,
	|	ИС_MP_РучныеОстатки.Остаток КАК РучнойОстаток,
	|	НЕ ИС_АЛИ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL КАК ЕстьСопоставление,
	|	НЕ ИС_MP_РучныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьРучнойОстаток,
	|	ЕСТЬNULL(ИС_АЛИ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
	|	ВЫБОР
	|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель, 1)
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель, 1)
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	ЕСТЬNULL(ИС_MP_ПоследниеВыгруженныеОстатки.Остаток, 0) КАК ПоследнийВыгруженныйОстаток,
	|	НЕ ИС_MP_ПоследниеВыгруженныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьПоследнийВыгруженныйОстаток
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеХарактеристик КАК ИС_АЛИ_СоответствиеХарактеристик
	|		ПО (ИС_АЛИ_СоответствиеХарактеристик.Профиль = &Профиль)
	|			И (ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ = ИС_АЛИ_Вариации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ОграничениеОстатков КАК ИС_MP_ОграничениеОстатков
	|		ПО (ИС_MP_ОграничениеОстатков.Профиль = &Профиль)
	|			И (ИС_MP_ОграничениеОстатков.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ОграничениеОстатков.Склад КАК Справочник.ИС_Али_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ОграничениеОстатков.КарточкаМП КАК Справочник.ИС_АЛИ_Вариации)) = ИС_АЛИ_Вариации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_РучныеОстатки КАК ИС_MP_РучныеОстатки
	|		ПО (ИС_MP_РучныеОстатки.Профиль = &Профиль)
	|			И (ИС_MP_РучныеОстатки.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_РучныеОстатки.Склад КАК Справочник.ИС_Али_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_РучныеОстатки.КарточкаМП КАК Справочник.ИС_АЛИ_Вариации)) = ИС_АЛИ_Вариации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ПоследниеВыгруженныеОстатки КАК ИС_MP_ПоследниеВыгруженныеОстатки
	|		ПО (ИС_MP_ПоследниеВыгруженныеОстатки.Профиль = &Профиль)
	|			И (ИС_MP_ПоследниеВыгруженныеОстатки.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ПоследниеВыгруженныеОстатки.Склад КАК Справочник.ИС_Али_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ПоследниеВыгруженныеОстатки.КарточкаМП КАК Справочник.ИС_АЛИ_Вариации)) = ИС_АЛИ_Вариации.Ссылка)
	|ГДЕ
	|	ИС_АЛИ_Вариации.Профиль = &Профиль
	|	И НЕ ИС_АЛИ_Вариации.ПометкаУдаления";
	
	Текст = Текст + ";";
		
	Текст = Текст + ИС_МП_УправлениеОстатками.ТекстЗапросаОстатков();
	
	Текст = Текст +
	"ВЫБРАТЬ
	|	ВТ_Сопоставление.ПолеСопоставления КАК ВариацияAli,
	|	ВТ_Сопоставление.НоменклатураАЛИ КАК НоменклатураAli,
	|	ВТ_Сопоставление.product_id КАК product_id,
	|	ВТ_Сопоставление.КодВариации КАК КодВариации,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка,
	|	ВТ_Остатки.Свободно КАК Свободно,
	|	ВТ_Остатки.Резерв КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВТ_Сопоставление.СкрываемыйОстаток ЕСТЬ NULL
	|			ТОГДА &КоличествоСкрываемогоОстатка
	|		ИНАЧЕ ВТ_Сопоставление.СкрываемыйОстаток
	|	КОНЕЦ КАК СкрываемыйОстаток,
	|	ВТ_Сопоставление.ЕстьСкрываемыйОстаток КАК ЕстьСкрываемыйОстаток,
	|	ВТ_Сопоставление.РучнойОстаток КАК РучнойОстаток,
	|	ВТ_Сопоставление.ЕстьСопоставление КАК ЕстьСопоставление,
	|	ВТ_Сопоставление.ЕстьРучнойОстаток КАК ЕстьРучнойОстаток,
	|	ВТ_Сопоставление.ПоследнийВыгруженныйОстаток КАК ПоследнийВыгруженныйОстаток,
	|	ВТ_Сопоставление.ЕстьПоследнийВыгруженныйОстаток КАК ЕстьПоследнийВыгруженныйОстаток
	|ИЗ
	|	ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_Остатки.ПолеСопоставления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Сопоставление.ЕстьСопоставление УБЫВ";
	
	Возврат Текст;		
	
КонецФункции //- ИнфоСофт Ивонин К.А. 04.03.24 УА #66733

//+ ИнфоСофт Ивонин К.А. 04.03.24 УА #66733
Процедура УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад) Экспорт
	
	Событие = ПолучитьИмяСобытия("УстановитьПараметрыЗапросаОстатков");
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "Организация");
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Али; 
	
	МассивПараметров = ИС_МП_УправлениеОстатками.МассивНастроекОстатков(ПеречислениеМП);
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивПараметров); 
	
	РассчитыватьНесобранныеКомплекты = Ложь;
	ВыгружатьОстаткиВРазрезеОрганизации = Ложь;
	СкрываемыйОстаток = 0;

	Если Настройки.РассчитыватьНесобранныеКомплекты <> Неопределено Тогда
		РассчитыватьНесобранныеКомплекты = Настройки.РассчитыватьНесобранныеКомплекты;	
	КонецЕсли; 

	Если Настройки.ВыгружатьОстаткиВРазрезеОрганизации <> Неопределено Тогда
		ВыгружатьОстаткиВРазрезеОрганизации = Настройки.ВыгружатьОстаткиВРазрезеОрганизации;	
	КонецЕсли;

	Если Настройки.СкрываемыйОстаток <> Неопределено Тогда
		СкрываемыйОстаток = Настройки.СкрываемыйОстаток;	
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Маркетплейс", ПеречислениеМП);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("КоличествоСкрываемогоОстатка", СкрываемыйОстаток);
	Запрос.УстановитьПараметр("РассчитыватьНесобранныеКомплекты", РассчитыватьНесобранныеКомплекты);
	Запрос.УстановитьПараметр("ВыгружатьОстаткиВРазрезеОрганизации", ВыгружатьОстаткиВРазрезеОрганизации);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПустаяУпаковка", ИС_МП_СерверЛокализация.ПустаяСсылкаУпаковка());
	
	Заменитель = "ИЕРАРХИИ";
	ПараметрСклад = Неопределено;
	
	ЗапросНазначений = Новый Запрос;
	ЗапросНазначений.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
	|ИЗ
	|	Справочник.ИС_Али_Склады.НаправленияДеятельности КАК ИС_Али_СкладыНаправленияДеятельности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ИС_Али_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности
	|			И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|ГДЕ
	|	ИС_Али_СкладыНаправленияДеятельности.Ссылка = &Ссылка";
	
	ЗапросНазначений.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
	
	Назначения = Новый Массив;
	
	ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
	
	Пока ВыборкаНазначения.Следующий() Цикл	
		Назначения.Добавить(ВыборкаНазначения.Назначение);
	КонецЦикла;
	
	Если Назначения.Количество() = 0 Тогда		
		Назначения = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;

	Запрос.УстановитьПараметр("Назначение", Назначения);

	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
	"ВЫБРАТЬ
	|	ИС_Али_Склады.Ссылка КАК Ссылка,
	|	ИС_Али_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_Али_Склады.Склад КАК Склад,
	|	ИС_Али_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_Али_СкладыГруппаСкладов.Склад КАК СкладГруппы
	|ИЗ
	|	Справочник.ИС_Али_Склады КАК ИС_Али_Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Али_Склады.ГруппаСкладов КАК ИС_Али_СкладыГруппаСкладов
	|		ПО ИС_Али_Склады.Ссылка = ИС_Али_СкладыГруппаСкладов.Ссылка
	|ГДЕ
	|	ИС_Али_Склады.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка";

	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСклад.Следующий() Цикл
						
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
		    
		    ПараметрСклад = Новый Массив;
		    
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
		
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
			
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда
			    	ПараметрСклад.Добавить(ВыборкаГруппаСкладов.СкладГруппы);
			    КонецЕсли;
			    
			КонецЦикла;				
		
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			Заменитель = "";
			ПараметрСклад = ВыборкаСклад.ОбщаяГруппаСкладов;
		Иначе
			ПараметрСклад = ВыборкаСклад.Склад;
		КонецЕсли;
	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Заменитель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, Заменитель, "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрСклад) Тогда
		Текст = СтрШаблон("Не заполнено сопоставление склада %1 (%2)", ПараметрСклад, Профиль);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст); 
	КонецЕсли;
	 
	Запрос.УстановитьПараметр("Склад1С", ПараметрСклад);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.03.24 УА #66733

//+ ИнфоСофт Ивонин К.А. 09.03.24 УА #66733
Процедура ВыгрузитьОстатки(Профиль, Склад, ТаблицаВыгрузки = Неопределено) Экспорт  
	
	Событие = ПолучитьИмяСобытия("ВыгрузитьОстатки");
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);  
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Али;
	
	МассивНастроек = ИС_МП_УправлениеОстатками.МассивПараметровВыгрузкиОстатков();	
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивНастроек);
		
	ИспользоватьПоследниеОстатки = Ложь;
	
	Если Настройки.ИспользоватьПоследниеОстатки <> Неопределено Тогда
		ИспользоватьПоследниеОстатки = Настройки.ИспользоватьПоследниеОстатки;
	КонецЕсли;
		
	Если ТаблицаВыгрузки = Неопределено Тогда		
		ТаблицаВыгрузки = ИС_МП_УправлениеОстатками.СформироватьТаблицуВыгрузки(Профиль, Склад, ПеречислениеМП, Настройки);		
	КонецЕсли;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;  	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ.product_id КАК product_id,
	|	ВТ.КодВариации КАК КодВариации,
	|	ВТ.Остаток КАК Остаток
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	&ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.product_id КАК product_id,
	|	ВТ_Остатки.КодВариации КАК КодВариации,
	|	ВТ_Остатки.Остаток КАК Остаток
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|ИТОГИ ПО
	|	product_id";
	
	Запрос.УстановитьПараметр("ВТ", ТаблицаВыгрузки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборкаproduct_id = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
    МассивProducts = Новый Массив;
	
	Пока Выборкаproduct_id.Следующий() Цикл

		СтруктураProduct = Новый Структура;
		СтруктураProduct.Вставить("product_id", Выборкаproduct_id.product_id);
	
		ВыборкаОстатки = Выборкаproduct_id.Выбрать();
	    
	    skus = Новый Массив;
	    
		Пока ВыборкаОстатки.Следующий() Цикл
			
			СтруктураSku = Новый Структура;
			СтруктураSku.Вставить("sku_code", ВыборкаОстатки.КодВариации);
			СтруктураSku.Вставить("inventory", Формат(ВыборкаОстатки.Остаток, "ЧН=0; ЧГ=0"));
			
			skus.Добавить(СтруктураSku);
			
		КонецЦикла;
		
		СтруктураProduct.Вставить("skus", skus);
		
		МассивProducts.Добавить(СтруктураProduct); 
		
	КонецЦикла;	
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивProducts, 1000);
	
	БылиОшибкиВыгрузки = Ложь;
	
	Для Каждого Элемент Из РазбитыйМассив Цикл	
		
		Результат = ИС_АЛИ_API.ВыгрузитьОстатки(Профиль, ПараметрыЗапроса, Элемент);
		
		Если Результат = Неопределено Тогда
			БылиОшибкиВыгрузки = Истина;
			Продолжить;				
		КонецЕсли; 		

		ОбщегоНазначения.СообщитьПользователю("Выгрузка завершилась со следующим статусом:" + Результат);
		
	КонецЦикла;
	
	Если Не ИспользоватьПоследниеОстатки Тогда
		Возврат;
	КонецЕсли;
	
	Если Не БылиОшибкиВыгрузки Тогда 
	
		Для Каждого Строка Из ТаблицаВыгрузки Цикл
			ИС_МП_УправлениеОстатками.ЗаписатьПоследнийВыгруженныйОстаток(Профиль, 
				Перечисления.ИС_МП_Маркетплейсы.Али, Склад, Строка.ВариацияAli, Строка.Остаток);
		КонецЦикла;

	КонецЕсли;	 
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.03.24 УА #66733  

//+ ИнфоСофт Мурсалимов Д.Р. 13.05.24 УА #66901
Процедура ВыгрузитьЦены(Профиль, ТаблицаВыгрузки = Неопределено) Экспорт

	Событие = ПолучитьИмяСобытия("ВыгрузитьЦены");
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Али;
	
	МассивПараметров = ПолучитьСписокПараметровЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.Али, МассивПараметров);
	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
	
	РежимОкругленияЦен = СтруктураЦен.РежимОкругленияЦен;
	ИспользоватьПоследниеЦены = СтруктураЦен.ИспользоватьПоследниеЦены;
	
	Если ТаблицаВыгрузки = Неопределено Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = ПолучитьТекстЗапросаЦен(); 
		
		УстановитьПараметрыЗапросаЦен(Запрос, Профиль);                                                       
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		ТаблицаВыгрузки = Новый ТаблицаЗначений;	
		
		ИС_МП_УправлениеЦенами.ЗаполнитьКолонкиТаблицыВыгрузкиЦен(ПеречислениеМП, ТаблицаВыгрузки);
		
		МассивПолей = ИС_МП_УправлениеЦенами.ПолучитьПоляДляВыгрузки(ПеречислениеМП);
		
		Пока Выборка.Следующий() Цикл
		
			Если Не Выборка.ЕстьСопоставление И Не Выборка.ЕстьРучнаяЦена И Не Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
		
			Для Каждого Элемент Из МассивПолей Цикл
				НоваяСтрока[Элемент] = Выборка[Элемент];
			КонецЦикла;
			
			ЭтоНабор = Выборка.ЭтоНабор;
			
			Если Выборка.ЕстьРучнаяЦена Тогда
				Цена = Выборка.РучнаяЦена;
			Иначе  
				Цена = Выборка.Цена;	
			КонецЕсли;
			
			Цена = Окр(Цена, 0, РежимОкругленияЦен);
			
			НоваяСтрока.Цена = Цена;
			
			Если Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
				ЦенаСоСкидкой = Выборка.РучнаяЦенаСоСкидкой;
			Иначе
				ЦенаСоСкидкой = Выборка.ЦенаСоСкидкой;	
			КонецЕсли;
				
			ЦенаСоСкидкой = Окр(ЦенаСоСкидкой, 0, РежимОкругленияЦен);
			
			НоваяСтрока.ЦенаСоСкидкой = ЦенаСоСкидкой;
			
			Если НоваяСтрока.Цена = 0 И НоваяСтрока.ЦенаСоСкидкой = 0 Тогда 
				ТаблицаВыгрузки.Удалить(НоваяСтрока);
			КонецЕсли;
			
			Если Не ИспользоватьПоследниеЦены Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не Выборка.ЕстьРучнаяЦена И Не Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
			
				Если Не ИС_МП_УправлениеЦенами.ПроверитьПоследниеЦены(ПеречислениеМП, Выборка, НоваяСтрока) Тогда
					ТаблицаВыгрузки.Удалить(НоваяСтрока);
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;  	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ.product_id КАК product_id,
	|	ВТ.КодВариации КАК КодВариации,
	|	ВТ.Цена КАК Цена,
	|	ВТ.ЦенаСоСкидкой КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	&ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Цены.product_id КАК product_id,
	|	ВТ_Цены.КодВариации КАК КодВариации,
	|	ВТ_Цены.Цена КАК Цена,
	|	ВТ_Цены.ЦенаСоСкидкой КАК ЦенаСоСкидкой
	|ИЗ
	|	ВТ_Цены КАК ВТ_Цены
	|ИТОГИ ПО
	|	product_id";
	
	Запрос.УстановитьПараметр("ВТ", ТаблицаВыгрузки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборкаproduct_id = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
    МассивProducts = Новый Массив;
	
	Пока Выборкаproduct_id.Следующий() Цикл

		СтруктураProduct = Новый Структура;
		СтруктураProduct.Вставить("product_id", Выборкаproduct_id.product_id);
	
		ВыборкаЦены = Выборкаproduct_id.Выбрать();
	    
	    skus = Новый Массив;
	    
		Пока ВыборкаЦены.Следующий() Цикл
			
			СтруктураSku = Новый Структура;
			СтруктураSku.Вставить("sku_code", 		ВыборкаЦены.КодВариации);
			СтруктураSku.Вставить("price", 			Формат(ВыборкаЦены.Цена, "ЧН=0; ЧГ=0"));
			СтруктураSku.Вставить("discount_price", Формат(ВыборкаЦены.ЦенаСоСкидкой, "ЧН=0; ЧГ=0"));
			
			skus.Добавить(СтруктураSku);
			
		КонецЦикла;
		
		СтруктураProduct.Вставить("skus", skus);
		
		МассивProducts.Добавить(СтруктураProduct); 
		
	КонецЦикла;	
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивProducts, 1000);
	
	БылиОшибкиВыгрузки = Ложь;
	
	Для Каждого Элемент Из РазбитыйМассив Цикл	
		
		Результат = ИС_АЛИ_API.ВыгрузитьЦены(Профиль, ПараметрыЗапроса, Элемент);
		
		Если Результат = Неопределено Тогда
			БылиОшибкиВыгрузки = Истина;
			Продолжить;				
		КонецЕсли; 		

		ОбщегоНазначения.СообщитьПользователю("Выгрузка завершилась со следующим статусом:" + Результат);
		
	КонецЦикла;
	
	Если Не БылиОшибкиВыгрузки И ИспользоватьПоследниеЦены Тогда
		
		Для Каждого Строка Из ТаблицаВыгрузки Цикл	
			
			ИС_МП_УправлениеЦенами.ЗаписатьПоследнююВыгруженнуюЦену(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы.Али, Строка.ВариацияAli, Строка.Цена, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦены);
			
			ИС_МП_УправлениеЦенами.ЗаписатьПоследнююВыгруженнуюЦену(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы.Али, Строка.ВариацияAli, Строка.ЦенаСоСкидкой, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой);                
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 13.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901
Функция ПолучитьТекстЗапросаЦен() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	ИС_АЛИ_Вариации.Ссылка КАК ПолеСопоставления,
	|	ИС_МП_РучныеЦены.Цена КАК Цена,
	|	NULL КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_РучныеЦеныОбъединение
	|ИЗ
	|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_РучныеЦены КАК ИС_МП_РучныеЦены
	|		ПО (ИС_МП_РучныеЦены.Профиль = &Профиль)
	|			И (ИС_МП_РучныеЦены.Маркетплейс = &Маркетплейс)
	|			И (ИС_АЛИ_Вариации.Ссылка = (ВЫРАЗИТЬ(ИС_МП_РучныеЦены.КарточкаМП КАК Справочник.ИС_АЛИ_Вариации)))
	|			И (ИС_МП_РучныеЦены.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦены))
	|ГДЕ
	|	ИС_МП_РучныеЦены.Профиль = &Профиль
	|	И ИС_МП_РучныеЦены.Маркетплейс = &Маркетплейс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_АЛИ_Вариации.Ссылка,
	|	NULL,
	|	ИС_МП_РучныеЦеныСоСкидкой.Цена
	|ИЗ
	|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_РучныеЦены КАК ИС_МП_РучныеЦеныСоСкидкой
	|		ПО (ИС_МП_РучныеЦеныСоСкидкой.Профиль = &Профиль)
	|			И (ИС_МП_РучныеЦеныСоСкидкой.Маркетплейс = &Маркетплейс)
	|			И (ИС_АЛИ_Вариации.Ссылка = (ВЫРАЗИТЬ(ИС_МП_РучныеЦеныСоСкидкой.КарточкаМП КАК Справочник.ИС_АЛИ_Вариации)))
	|			И (ИС_МП_РучныеЦеныСоСкидкой.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой))
	|ГДЕ
	|	ИС_МП_РучныеЦеныСоСкидкой.Профиль = &Профиль
	|	И ИС_МП_РучныеЦеныСоСкидкой.Маркетплейс = &Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_АЛИ_Вариации.Ссылка КАК ПолеСопоставления,
	|	ИС_МП_ПоследниеЦены.Цена КАК Цена,
	|	NULL КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_ПоследниеЦеныОбъединение
	|ИЗ
	|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_ПоследниеВыгруженныеЦены КАК ИС_МП_ПоследниеЦены
	|		ПО (ИС_МП_ПоследниеЦены.Профиль = &Профиль)
	|			И (ИС_МП_ПоследниеЦены.Маркетплейс = &Маркетплейс)
	|			И (ИС_АЛИ_Вариации.Ссылка = (ВЫРАЗИТЬ(ИС_МП_ПоследниеЦены.КарточкаМП КАК Справочник.ИС_АЛИ_Вариации)))
	|			И (ИС_МП_ПоследниеЦены.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦены))
	|ГДЕ
	|	ИС_МП_ПоследниеЦены.Профиль = &Профиль
	|	И ИС_МП_ПоследниеЦены.Маркетплейс = &Маркетплейс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_АЛИ_Вариации.Ссылка,
	|	NULL,
	|	ИС_МП_ПоследниеЦеныСоСкидкой.Цена
	|ИЗ
	|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_ПоследниеВыгруженныеЦены КАК ИС_МП_ПоследниеЦеныСоСкидкой
	|		ПО (ИС_МП_ПоследниеЦеныСоСкидкой.Профиль = &Профиль)
	|			И (ИС_МП_ПоследниеЦеныСоСкидкой.Маркетплейс = &Маркетплейс)
	|			И (ИС_АЛИ_Вариации.Ссылка = (ВЫРАЗИТЬ(ИС_МП_ПоследниеЦеныСоСкидкой.КарточкаМП КАК Справочник.ИС_АЛИ_Вариации)))
	|			И (ИС_МП_ПоследниеЦеныСоСкидкой.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой))
	|ГДЕ
	|	ИС_МП_ПоследниеЦеныСоСкидкой.Профиль = &Профиль
	|	И ИС_МП_ПоследниеЦеныСоСкидкой.Маркетплейс = &Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РучныеЦеныОбъединение.ПолеСопоставления КАК ПолеСопоставления,
	|	СУММА(ВТ_РучныеЦеныОбъединение.Цена) КАК Цена,
	|	СУММА(ВТ_РучныеЦеныОбъединение.ЦенаСоСкидкой) КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_РучныеЦены
	|ИЗ
	|	ВТ_РучныеЦеныОбъединение КАК ВТ_РучныеЦеныОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РучныеЦеныОбъединение.ПолеСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеЦеныОбъединение.ПолеСопоставления КАК ПолеСопоставления,
	|	СУММА(ВТ_ПоследниеЦеныОбъединение.Цена) КАК Цена,
	|	СУММА(ВТ_ПоследниеЦеныОбъединение.ЦенаСоСкидкой) КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_ПоследниеЦены
	|ИЗ
	|	ВТ_ПоследниеЦеныОбъединение КАК ВТ_ПоследниеЦеныОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоследниеЦеныОбъединение.ПолеСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_АЛИ_Вариации.Ссылка КАК ПолеСопоставления,
	|	ИС_АЛИ_Вариации.Владелец КАК НоменклатураАЛИ,
	|	ИС_АЛИ_Вариации.Владелец.Код КАК product_id,
	|	ИС_АЛИ_Вариации.КодВариации КАК КодВариации,
	|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_АЛИ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_АЛИ_СоответствиеХарактеристик.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)) КАК ХарактеристикаЦО,
	|	ЕСТЬNULL(ИС_АЛИ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
	|	ЕСТЬNULL(ИС_АЛИ_СоответствиеХарактеристик.Упаковка, &ПустаяУпаковка) КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель, 1)
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель, 1)
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	НЕ ИС_АЛИ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL КАК ЕстьСопоставление,
	|	ВТ_РучныеЦены.Цена КАК РучнаяЦена,
	|	НЕ ВТ_РучныеЦены.Цена ЕСТЬ NULL КАК ЕстьРучнаяЦена,
	|	ВТ_РучныеЦены.ЦенаСоСкидкой КАК РучнаяЦенаСоСкидкой,
	|	НЕ ВТ_РучныеЦены.ЦенаСоСкидкой ЕСТЬ NULL КАК ЕстьРучнаяЦенаСоСкидкой,
	|	ЕСТЬNULL(ВТ_ПоследниеЦены.Цена, 0) КАК ПоследняяВыгруженнаяЦена,
	|	НЕ ВТ_ПоследниеЦены.Цена ЕСТЬ NULL КАК ЕстьПоследняяВыгруженнаяЦена,
	|	ЕСТЬNULL(ВТ_ПоследниеЦены.ЦенаСоСкидкой, 0) КАК ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	НЕ ВТ_ПоследниеЦены.ЦенаСоСкидкой ЕСТЬ NULL КАК ЕстьПоследняяВыгруженнаяЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеХарактеристик КАК ИС_АЛИ_СоответствиеХарактеристик
	|		ПО (ИС_АЛИ_СоответствиеХарактеристик.Профиль = &Профиль)
	|			И (ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ = ИС_АЛИ_Вариации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РучныеЦены КАК ВТ_РучныеЦены
	|		ПО (ВТ_РучныеЦены.ПолеСопоставления = ИС_АЛИ_Вариации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследниеЦены КАК ВТ_ПоследниеЦены
	|		ПО (ВТ_ПоследниеЦены.ПолеСопоставления = ИС_АЛИ_Вариации.Ссылка)
	|ГДЕ
	|	ИС_АЛИ_Вариации.Профиль = &Профиль
	|	И НЕ ИС_АЛИ_Вариации.ПометкаУдаления";	
	
	Текст = Текст + ";";
	
	Текст = Текст + ИС_МП_УправлениеЦенами.ТекстЗапросаЦен();
	
	Текст = Текст +	
	
	"ВЫБРАТЬ
	|	ВТ_Сопоставление.ПолеСопоставления КАК ВариацияAli,
	|	ВТ_Сопоставление.НоменклатураАЛИ КАК НоменклатураAli,
	|	ВТ_Сопоставление.product_id КАК product_id,
	|	ВТ_Сопоставление.КодВариации КАК КодВариации,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка,
	|	ВТ_Сопоставление.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Сопоставление.ЕстьСопоставление КАК ЕстьСопоставление,
	|	ВТ_Сопоставление.РучнаяЦена КАК РучнаяЦена,
	|	ВТ_Сопоставление.РучнаяЦенаСоСкидкой КАК РучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьРучнаяЦена КАК ЕстьРучнаяЦена,
	|	ВТ_Сопоставление.ЕстьРучнаяЦенаСоСкидкой КАК ЕстьРучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦена КАК ПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦенаСоСкидкой КАК ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦена КАК ЕстьПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой КАК ЕстьПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Цены.Цена КАК Цена,
	|	ВТ_Цены.ЦенаСоСкидкой КАК ЦенаСоСкидкой
	|ИЗ
	|	ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_Цены.ПолеСопоставления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Сопоставление.ЕстьСопоставление УБЫВ,
	|	ВТ_Сопоставление.РучнаяЦена УБЫВ";
	
	Возврат Текст;
		
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
Функция ПолучитьСкладПоУмолчанию(Профиль) Экспорт

	Результат = Справочники.ИС_Али_Склады.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ИС_Али_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_Али_Склады КАК ИС_Али_Склады
	|ГДЕ
	|	ИС_Али_Склады.Профиль = &Профиль
	|	И НЕ ИС_Али_Склады.ПометкаУдаления";

	Запрос.УстановитьПараметр("Профиль", Профиль);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
Функция ПолучитьОстаткиFBS(Профиль, Склад) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_АЛИ_Вариации.Ссылка КАК Ссылка,
	|	ИС_АЛИ_Вариации.sku_id КАК sku_id
	|ИЗ
	|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
	|ГДЕ
	|	ИС_АЛИ_Вариации.Профиль = &Профиль
	|	И НЕ ИС_АЛИ_Вариации.ПометкаУдаления
	|	И НЕ ИС_АЛИ_Вариации.sku_id = """"";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаSku = РезультатЗапроса.Выбрать();
	
	МассивSku = Новый Массив;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВариацияAli");
	Результат.Колонки.Добавить("sku_id");
	Результат.Колонки.Добавить("Остаток");
	
	Пока ВыборкаSku.Следующий() Цикл
	
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ВариацияAli = ВыборкаSku.Ссылка;
		НоваяСтрока.sku_id = ВыборкаSku.sku_id;
		
		МассивSku.Добавить(Новый Структура("sku", ВыборкаSku.sku_id));
	
	КонецЦикла;
				
	ОстаткиТоваров = ИС_АЛИ_API.ПолучитьОстаткиТовара(Профиль, ПараметрыЗапроса, МассивSku);
	
	Если ОстаткиТоваров = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
				
	Для Каждого Элемент Из ОстаткиТоваров.skus_info Цикл
	    	    
    	НайденныеСтроки = Результат.НайтиСтроки(Новый Структура("sku_id", Элемент.sku));
		НайденныеСтроки[0].Остаток = Число(Элемент.max_sellable_quantity);
	    	
	КонецЦикла;	
                							
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 01.04.24 УА #71892
Функция ПолучитьИнформациюОСкладе(Склад) Экспорт

	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
	"ВЫБРАТЬ
	|	ИС_Али_Склады.Ссылка КАК Ссылка,
	|	ИС_Али_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_Али_Склады.Склад КАК Склад,
	|	ИС_Али_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_Али_СкладыГруппаСкладов.Склад КАК СкладГруппы
	|ИЗ
	|	Справочник.ИС_Али_Склады КАК ИС_Али_Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Али_Склады.ГруппаСкладов КАК ИС_Али_СкладыГруппаСкладов
	|		ПО ИС_Али_Склады.Ссылка = ИС_Али_СкладыГруппаСкладов.Ссылка
	|ГДЕ
	|	ИС_Али_Склады.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Результат = "";
		
	Пока ВыборкаСклад.Следующий() Цикл				
				
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
		    
		    Результат = Результат + "Группа складов: " + Символы.ПС;
		    
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
		
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
			
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда
			    	Результат = Результат + Символы.Таб + " - " + ВыборкаГруппаСкладов.СкладГруппы + Символы.ПС;
			    КонецЕсли;
			    
			КонецЦикла;				
		
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			Результат = Результат + "Общая группа складов: " + ВыборкаСклад.ОбщаяГруппаСкладов + Символы.ПС;
		Иначе
			Результат = Результат + "Склад: " + ВыборкаСклад.Склад + Символы.ПС;		
		КонецЕсли;
	
	КонецЦикла;
    
    Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 01.04.24 УА #71892

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
Функция ПолучитьЦеныFBS(Профиль) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_АЛИ_Вариации.Ссылка КАК Ссылка,
	|	ИС_АЛИ_Вариации.Владелец.Код КАК product_id,
	|	ИС_АЛИ_Вариации.sku_id КАК sku_id
	|ИЗ
	|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
	|ГДЕ
	|	ИС_АЛИ_Вариации.Профиль = &Профиль
	|	И НЕ ИС_АЛИ_Вариации.sku_id = """"
	|	И НЕ ИС_АЛИ_Вариации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаProductId = РезультатЗапроса.Выбрать();
	
	МассивProductId = Новый Массив;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВариацияAli");
	Результат.Колонки.Добавить("product_id");
	Результат.Колонки.Добавить("sku_id");
	Результат.Колонки.Добавить("Цена");
	Результат.Колонки.Добавить("ЦенаСоСкидкой");
	
	Пока ВыборкаProductId.Следующий() Цикл
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ВариацияAli = ВыборкаProductId.Ссылка;
		НоваяСтрока.product_id = ВыборкаProductId.product_id;
		НоваяСтрока.sku_id = ВыборкаProductId.sku_id;
		
		МассивProductId.Добавить(Новый Структура("product_id", ВыборкаProductId.product_id));
		
	КонецЦикла;
	
	Для Каждого Элемент Из МассивProductId Цикл
		
		ЦеныТоваров = ИС_АЛИ_API.ПолучитьДанныеОТоваре(Профиль, ПараметрыЗапроса, Элемент);
		
		Если ЦеныТоваров = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Элемент Из ЦеныТоваров.sku Цикл
			
			НайденныеСтроки = Результат.НайтиСтроки(Новый Структура("sku_id", Элемент.sku_id));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				НайденныеСтроки[0].Цена 			= Элемент.price;
				НайденныеСтроки[0].ЦенаСоСкидкой 	= Элемент.discount_price;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901
Процедура УстановитьПараметрыЗапросаЦен(Запрос, Профиль) Экспорт
	
	Событие = ПолучитьИмяСобытия("УстановитьПараметрыЗапросаЦен");
		
	МассивПараметров = ПолучитьСписокПараметровЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.Али, МассивПараметров);
	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
		
	Запрос.УстановитьПараметр("Маркетплейс"			, Перечисления.ИС_МП_Маркетплейсы.Али);
	Запрос.УстановитьПараметр("ВидЦены"				, СтруктураЦен.ВидЦены); 
	Запрос.УстановитьПараметр("ВидЦеныСоСкидкой"	, СтруктураЦен.ВидЦеныСоСкидкой);
	Запрос.УстановитьПараметр("ВидЦеныМинимальный"	, Справочники.ВидыЦен.ПустаяСсылка()); 
	//+ ИнфоСофт Заварин К.В. 03.09.24 УА #72696
	Запрос.УстановитьПараметр("ВидЦеныFBO"			, Справочники.ВидыЦен.ПустаяСсылка());
	//- ИнфоСофт Заварин К.В. 03.09.24 УА #72696
	Запрос.УстановитьПараметр("Профиль"				, Профиль); 
	Запрос.УстановитьПараметр("ПустаяУпаковка"		, ИС_MP_СерверЛокализация.ПустаяСсылкаУпаковка());
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьСписокПараметровЦен() Экспорт

	Результат = Новый Массив;
	
	Результат.Добавить("ВидЦены");
	Результат.Добавить("ВидЦеныСоСкидкой");
	Результат.Добавить("РежимОкругленияЦен");
	Результат.Добавить("ИспользоватьПоследниеЦены"); 

    Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьСтруктуруПараметровЦен() Экспорт

	Результат = Новый Структура;
	
	Результат.Вставить("ВидЦены"					, Справочники.ВидыЦен.ПустаяСсылка());
	Результат.Вставить("ВидЦеныСоСкидкой"			, Справочники.ВидыЦен.ПустаяСсылка());
	Результат.Вставить("РежимОкругленияЦен"			, 0);
	Результат.Вставить("ИспользоватьПоследниеЦены"	, Ложь); 

    Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

#КонецОбласти

#Область Заказы

//+ ИнфоСофт Стояк Ю.К. 28.02.2024 УА #56408
Функция ПолучитьСписокЗаказов(Профиль, ДатаПоследнегоОтправления) Экспорт                        
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Загрузка товаров невозможна");
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыСоединения = Неопределено;
	Если Не ПолучитьПараметрыСоединения(Профиль, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Заголовки = Неопределено;
	Если Не CформироватьЗаголовкиЗапроса(Заголовки, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	ПараметрыЗапроса.Сервер = ПараметрыСоединения.АдресСервиса;
	ПараметрыЗапроса.Порт = ПараметрыСоединения.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = ПараметрыСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.Заголовки = Заголовки;
	
	КодСтраницы = 1;
	КоличествоЭлементовНаСтранице = 50;
	ПределОшибок = 10;
	КоличествоОшибок = 0;   
	ОсталосьЭлементов = Неопределено; 
	
	rawData = Новый Структура;
	rawData.Вставить("date_start", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ДатаПоследнегоОтправления, ФорматДатыJSON.ISO
		, ВариантЗаписиДатыJSON.УниверсальнаяДата));
	rawData.Вставить("page_size", КоличествоЭлементовНаСтранице);
	rawData.Вставить("page", КодСтраницы);
	rawData.Вставить("trade_order_info", "LogisticInfo");
	
	МассивЗагруженныхЗаданий = Новый Массив;
	
	Пока Истина Цикл	                                         
				
		Если КоличествоОшибок >= ПределОшибок Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Результат = ИС_АЛИ_API.ПолучитьСписокЗаказов(Профиль, ПараметрыЗапроса, rawData); 
		
		Если Результат = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОсталосьЭлементов) Тогда
			ОсталосьЭлементов = Результат["total_count"];
		КонецЕсли;
		
		Для Каждого Элемент Из Результат["orders"] Цикл
			СсылкаЗадания = СоздатьИлиОбновитьЗаказ(Профиль, Элемент, ДатаПоследнегоОтправления);	
			
			Если Не СсылкаЗадания.Пустая() Тогда
				МассивЗагруженныхЗаданий.Добавить(СсылкаЗадания);	
				ОбновитьСтатусыЗаказов(Профиль, СсылкаЗадания, Элемент); 
			КонецЕсли;
		КонецЦикла;    
		
		ОсталосьЭлементов = ОсталосьЭлементов - КоличествоЭлементовНаСтранице;
		
		Если ОсталосьЭлементов <= 0 Тогда
			Прервать;
		КонецЕсли;
				
	КонецЦикла;
	
	ПроверитьФункциональныеОпцииОтправлений(Профиль, МассивЗагруженныхЗаданий);
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 28.02.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 28.02.2024 УА #56408
Функция СоздатьИлиОбновитьЗаказ(Профиль, Данные, ДатаПоследнегоОтправления)

    Событие = ПолучитьИмяСобытия("СоздатьИлиОбновитьЗаказ");
	
	Заказ = Документы.ИС_АЛИ_Заказ.НайтиПоНомеру(Данные["id"]);
	
	Если Заказ.Пустая() Тогда
		Заказ = Документы.ИС_АЛИ_Заказ.СоздатьДокумент();			
	Иначе
		Заказ = Заказ.ПолучитьОбъект();
	КонецЕсли;		
	
	Заказ.Профиль = Профиль;
	Заказ.Номер = Данные["id"];
		
	Заказ.Дата = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные["created_at"], ФорматДатыJSON.ISO);			
	
	Заказ.total_amount = Данные["total_amount"] / 100;
	Заказ.delivery_address = Данные["delivery_address"];
	
	Заказ.buyer_country_code = Данные["buyer_country_code"];
	Заказ.buyer_name = Данные["buyer_name"];
	Заказ.buyer_phone = Данные["buyer_phone"];
		
	Заказ.order_lines.Очистить();
		
	Для Каждого Элемент Из Данные["order_lines"] Цикл	
		
		НоваяСтрока = Заказ.order_lines.Добавить();  
		
		НоваяСтрока.id = Элемент["id"];
		НоваяСтрока.item_id = Элемент["item_id"];
		НоваяСтрока.product_source_id = Элемент["product_source_id"];
		НоваяСтрока.sku_id = Элемент["sku_id"];
		НоваяСтрока.sku_code = Элемент["sku_code"];
		НоваяСтрока.quantity = Элемент["quantity"];
		
		НоваяСтрока.total_amount = Элемент["total_amount"] / 100;
		НоваяСтрока.item_price = Элемент["item_price"] / 100;
		
		НоваяСтрока.buyer_comment = Элемент["buyer_comment"];
		НоваяСтрока.discount_currency = Элемент["discount_currency"];
		НоваяСтрока.original_discount = Элемент["original_discount"];
						
		НоваяСтрока.ВариацияАли = Справочники.ИС_АЛИ_Вариации.НайтиПоРеквизиту("sku_id", Элемент["sku_id"]); 
		
		Если ЗначениеЗаполнено(НоваяСтрока.ВариацияАли) Тогда
			НоваяСтрока.НоменклатураАли = НоваяСтрока.ВариацияАли.Владелец;
		КонецЕсли;
				
	КонецЦикла; 
	
	Если Данные["pre_split_postings"] <> Неопределено Тогда 
		
		Заказ.pre_split_postings.Очистить();
			
		Для Каждого Отправление Из Данные["pre_split_postings"] Цикл
						
			Для Каждого Элемент Из Отправление["posting_lines"] Цикл  
				
				НоваяСтрока = Заказ.pre_split_postings.Добавить(); 
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
				
				НоваяСтрока.id = Отправление["id"];
				НоваяСтрока.item_id = Элемент["item_id"];
				НоваяСтрока.product_source_id = Элемент["product_source_id"];
				НоваяСтрока.sku_id = Элемент["sku_id"];
				НоваяСтрока.num_id = Элемент["id"];
				НоваяСтрока.quantity = Элемент["quantity"];
				НоваяСтрока.order_line_id = Элемент["order_line_id"];
				НоваяСтрока.item_price = Элемент["item_price"] / 100;
				НоваяСтрока.logistics_type = Отправление["logistics_type"];
				
				НоваяСтрока.weight = Элемент["weight"];
				НоваяСтрока.height = Элемент["height"];
				НоваяСтрока.width = Элемент["width"];
				НоваяСтрока.length = Элемент["length"];
				
				НоваяСтрока.ВариацияАли = Справочники.ИС_АЛИ_Вариации.НайтиПоРеквизиту("sku_id", Элемент["sku_id"]); 
				
				Если ЗначениеЗаполнено(НоваяСтрока.ВариацияАли) Тогда
					НоваяСтрока.НоменклатураАли = НоваяСтрока.ВариацияАли.Владелец;
				КонецЕсли;  
				
			КонецЦикла;
			
		КонецЦикла;

	КонецЕсли;
		
	Попытка	      
		
		Заказ.Записать(РежимЗаписиДокумента.Запись);
		ДатаПоследнегоОтправления = Заказ.Дата;
		
		Возврат Заказ.Ссылка;		
		
	Исключение
		
		ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Текст = СтрШаблон("Произошла ошибка при записи элемента Заказ Aliexpress: %1",	ИнформацияОбОшибке);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		
	КонецПопытки;
	
	Возврат Документы.ИС_АЛИ_Заказ.ПустаяСсылка();
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 28.02.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 28.02.2024 УА #56408
Процедура ОбновитьСтатусыЗаказов(Профиль, Заказ, Данные)
	
	Событие = ПолучитьИмяСобытия("СоздатьИлиОбновитьСтатус");
	
	Если Заказ = Документы.ИС_АЛИ_Заказ.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли; 
	
	МенеджерЗаписи = РегистрыСведений.ИС_АЛИ_СтатусыСборочныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Заказ = Заказ;
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Заказ = Заказ;
	
	МенеджерЗаписи.status = Перечисления.ИС_АЛИ_СтатусыЗаказов[Данные["status"]];
	МенеджерЗаписи.payment_status = Перечисления.ИС_АЛИ_СтатусыОплаты[Данные["payment_status"]];
	МенеджерЗаписи.delivery_status = Перечисления.ИС_АЛИ_СтатусыДоставки[Данные["delivery_status"]];
	МенеджерЗаписи.order_display_status = Перечисления.ИС_АЛИ_СтатусыЗаказовПродавца[Данные["order_display_status"]]; 
	
	Если ЗначениеЗаполнено(Данные["cut_off_date"]) Тогда
		МенеджерЗаписи.cut_off_date = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные["cut_off_date"], ФорматДатыJSON.ISO);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные["shipping_deadline"]) Тогда
		МенеджерЗаписи.shipping_deadline = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные["shipping_deadline"], ФорматДатыJSON.ISO);
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи.Записать(Истина);	
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 28.02.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 28.02.2024 УА #56408
Процедура ПолучитьСтатусы(Профиль) Экспорт                        
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Загрузка товаров невозможна");
		Возврат;
	КонецЕсли;
	
	ПараметрыСоединения = Неопределено;
	Если Не ПолучитьПараметрыСоединения(Профиль, ПараметрыСоединения) Тогда
		Возврат;
	КонецЕсли;
	
	Заголовки = Неопределено;
	Если Не CформироватьЗаголовкиЗапроса(Заголовки, ПараметрыСоединения) Тогда
		Возврат;
	КонецЕсли;  
	
	//МассивСтатусов = Новый Массив;
	//МассивСтатусов.Добавить(Перечисления.ИС_АЛИ_СтатусыЗаказов.Created);
	//МассивСтатусов.Добавить(Перечисления.ИС_АЛИ_СтатусыЗаказов.InProgress); 
	//МассивСтатусов.Добавить(Перечисления.ИС_АЛИ_СтатусыЗаказов.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ИС_АЛИ_Заказ.Ссылка КАК Ссылка,
	|	ИС_АЛИ_Заказ.Номер КАК Номер,
	|	ЕСТЬNULL(ИС_АЛИ_СтатусыСборочныхЗаданий.status, ЗНАЧЕНИЕ(Перечисление.ИС_АЛИ_СтатусыЗаказов.ПустаяСсылка)) КАК status
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ИС_АЛИ_Заказ КАК ИС_АЛИ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СтатусыСборочныхЗаданий КАК ИС_АЛИ_СтатусыСборочныхЗаданий
	|		ПО (ИС_АЛИ_Заказ.Ссылка = ИС_АЛИ_СтатусыСборочныхЗаданий.Заказ)
	|ГДЕ
	|	ИС_АЛИ_Заказ.Профиль = &Профиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка КАК Ссылка,
	|	ВТ_Заказы.Номер КАК Номер
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|ГДЕ
	|	ВТ_Заказы.status <> ЗНАЧЕНИЕ(Перечисление.ИС_АЛИ_СтатусыЗаказов.Cancelled)
	|	И ВТ_Заказы.status <> ЗНАЧЕНИЕ(Перечисление.ИС_АЛИ_СтатусыЗаказов.Finished)";
	
	//Запрос.УстановитьПараметр("status", МассивСтатусов);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Отправления = РезультатЗапроса.Выгрузить();
	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	ПараметрыЗапроса.Сервер = ПараметрыСоединения.АдресСервиса;
	ПараметрыЗапроса.Порт = ПараметрыСоединения.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = ПараметрыСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.Заголовки = Заголовки;
	
	КодСтраницы = 1;
	КоличествоЭлементовНаСтранице = 50;
	ПределОшибок = 10;
	КоличествоОшибок = 0;   
	ОсталосьЭлементов = Неопределено; 
	
	rawData = Новый Структура;
	rawData.Вставить("page_size", КоличествоЭлементовНаСтранице);
	rawData.Вставить("page", КодСтраницы);
	rawData.Вставить("order_ids", Отправления.ВыгрузитьКолонку("Номер"));
	rawData.Вставить("trade_order_info", "LogisticInfo");
	
	СтруктураПоиска = Новый Структура("Номер", "0");
	
	Пока Истина Цикл	                                         
				
		Если КоличествоОшибок >= ПределОшибок Тогда
			Возврат;
		КонецЕсли;
		
		Результат = ИС_АЛИ_API.ПолучитьСписокЗаказов(Профиль, ПараметрыЗапроса, rawData); 
		
		Если Результат = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОсталосьЭлементов) Тогда
			ОсталосьЭлементов = Результат["total_count"];
		КонецЕсли;
		
		Для Каждого Элемент Из Результат["orders"] Цикл
			
			СтруктураПоиска.Номер = Элемент["id"];
			НайденныеСтроки = Отправления.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;           
			
			ОбновитьСтатусыЗаказов(Профиль, НайденныеСтроки[0].Ссылка, Элемент); 
			
		КонецЦикла;    
		
		ОсталосьЭлементов = ОсталосьЭлементов - КоличествоЭлементовНаСтранице;
		
		Если ОсталосьЭлементов <= 0 Тогда
			Прервать;
		КонецЕсли;
				
	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 28.02.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
Процедура СоздатьЗаказы(Профиль, МассивЗаданий) Экспорт  
	
	Событие = ПолучитьИмяСобытия("СоздатьЗаказы");
                                                    
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_АЛИ_Заказ.Ссылка КАК Ссылка,
	|	ИС_АЛИ_Заказ.Номер КАК Номер,
	|	ИС_АЛИ_Заказ.Дата КАК Дата,
	|	ИС_АЛИ_СтатусыСборочныхЗаданий.cut_off_date КАК ДатаОтгрузки,
	|	ИС_Али_Склады.Ссылка КАК СкладМП,
	|	ИС_Али_Склады.Склад КАК Склад,
	|	ИС_Али_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_Али_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_Али_Склады.АдресДоставки КАК АдресДоставки,
	|	ИС_Али_Склады.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ИС_Али_Склады.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	ИС_Али_Склады.СпособДоставки КАК СпособДоставки,
	|	ИС_Али_Склады.ЗонаДоставки КАК ЗонаДоставки,
	|	ИС_Али_Склады.Грузополучатель КАК Грузополучатель,
	|	ИС_Али_Склады.Грузоотправитель КАК Грузоотправитель,
	|	ИС_Али_Склады.ПеревозчикПартнер КАК ПеревозчикПартнер
	|ИЗ
	|	Документ.ИС_АЛИ_Заказ КАК ИС_АЛИ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СтатусыСборочныхЗаданий КАК ИС_АЛИ_СтатусыСборочныхЗаданий
	|		ПО (ИС_АЛИ_СтатусыСборочныхЗаданий.Заказ = ИС_АЛИ_Заказ.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Али_Склады КАК ИС_Али_Склады
	|		ПО (ИС_Али_Склады.Профиль = &Профиль)
	|ГДЕ
	|	ИС_АЛИ_Заказ.Ссылка В(&МассивСсылок)
	|	И ИС_АЛИ_Заказ.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий); 
	Запрос.УстановитьПараметр("Заказ", ИС_MP_СерверЛокализация.ПустаяСсылкаЗаказа()); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаШапка = РезультатЗапроса.Выбрать();
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗаданий(Профиль);
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если МассивЗаданий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ФукнциональныеОпции.РежимСозданияЗаказов = 0 Тогда // Один к одному
		
		Пока ВыборкаШапка.Следующий() Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
			|	ИС_АЛИ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
			|	ИС_АЛИ_Заказorder_lines.quantity КАК Количество,
			|	ИС_АЛИ_Заказorder_lines.item_price КАК Цена,
			|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,			
			//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			|	ИС_АЛИ_СоответствиеХарактеристик.Упаковка КАК Упаковка,
			|	ВЫБОР
			|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель = 0
			|			ТОГДА 1
			|		ИНАЧЕ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель
			|	КОНЕЦ / ВЫБОР
			|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
			|			ТОГДА 1
			|		ИНАЧЕ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель
			|	КОНЕЦ КАК КоэффициентУпаковки
			//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			|ИЗ
			|	Документ.ИС_АЛИ_Заказ.order_lines КАК ИС_АЛИ_Заказorder_lines
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеХарактеристик КАК ИС_АЛИ_СоответствиеХарактеристик
			|		ПО (ИС_АЛИ_Заказorder_lines.ВариацияАли = ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ)
			|			И (ИС_АЛИ_СоответствиеХарактеристик.Профиль = &Профиль)
			|ГДЕ
			|	ИС_АЛИ_Заказorder_lines.Ссылка = &Ссылка
			|	И НЕ ИС_АЛИ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL";
			
			Запрос.УстановитьПараметр("Профиль", Профиль);
			Запрос.УстановитьПараметр("Ссылка", ВыборкаШапка.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаТовары = РезультатЗапроса.Выгрузить();
			
			Если РезультатЗапроса.Пустой() Тогда
				ОбщегоНазначения.СообщитьПользователю("Проверьте сопоставление по заказу " + ВыборкаШапка.Ссылка);
				Продолжить;
			КонецЕсли;  
			
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #7408			
			Назначения = ПолучитьНазначения(ВыборкаШапка.Склад);
			
			Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Али, , Назначения);
			//Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Али);
			//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
			
			Если Не Заказ.Пустая() Тогда
				
				ДокОбъект = ВыборкаШапка.Ссылка.ПолучитьОбъект();
				ДокОбъект.Заказ = Заказ;
				
				Попытка
					ДокОбъект.Записать();
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;
				
			КонецЕсли; 	
			
		КонецЦикла;
		
		Возврат;
		
	ИначеЕсли ФукнциональныеОпции.РежимСозданияЗаказов = 1 Тогда // Пакетный режим
		
		Заказ = Неопределено;
		
		Пока ВыборкаШапка.Следующий() Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
			|	ИС_АЛИ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
			|	ИС_АЛИ_Заказorder_lines.quantity КАК Количество,
			|	ИС_АЛИ_Заказorder_lines.item_price КАК Цена,
			|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,			
			//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			|	ИС_АЛИ_СоответствиеХарактеристик.Упаковка КАК Упаковка,
			|	ВЫБОР
			|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель = 0
			|			ТОГДА 1
			|		ИНАЧЕ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель
			|	КОНЕЦ / ВЫБОР
			|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
			|			ТОГДА 1
			|		ИНАЧЕ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель
			|	КОНЕЦ КАК КоэффициентУпаковки
			//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			|ИЗ
			|	Документ.ИС_АЛИ_Заказ.order_lines КАК ИС_АЛИ_Заказorder_lines
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеХарактеристик КАК ИС_АЛИ_СоответствиеХарактеристик
			|		ПО (ИС_АЛИ_Заказorder_lines.ВариацияАли = ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ)
			|			И (ИС_АЛИ_СоответствиеХарактеристик.Профиль = &Профиль)
			|ГДЕ
			|	ИС_АЛИ_Заказorder_lines.Ссылка = &Ссылка
			|	И НЕ ИС_АЛИ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL";
			
			Запрос.УстановитьПараметр("Профиль", Профиль);
			Запрос.УстановитьПараметр("Ссылка", ВыборкаШапка.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаТовары = РезультатЗапроса.Выгрузить(); 
			
			Если РезультатЗапроса.Пустой() Тогда
				ОбщегоНазначения.СообщитьПользователю("Проверьте сопоставление по заказу " + ВыборкаШапка.Ссылка);
				Продолжить;
			КонецЕсли;
			
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #7408			
			Назначения = ПолучитьНазначения(ВыборкаШапка.Склад);
			
			Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Али, Заказ, Назначения);
			//Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Али, Заказ);
			//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083			
			
			Если Не Заказ.Пустая() И Заказ <> Неопределено Тогда
				
				ДокОбъект = ВыборкаШапка.Ссылка.ПолучитьОбъект();
				ДокОбъект.Заказ = Заказ;
				
				Попытка
					ДокОбъект.Записать();
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;
				
			КонецЕсли; 	
			
		КонецЦикла;
		
		Возврат;
	
	ИначеЕсли ФукнциональныеОпции.РежимСозданияЗаказов = 2 Тогда // Формирование в течение дня  
		
		Если ФукнциональныеОпции.ФормироватьЕдиныйЗаказБезРазбиения Тогда  
			
			Если Не ФукнциональныеОпции.Свойство("АктивныйЗаказКлиента") Или 
				ФукнциональныеОпции.Свойство("АктивныйЗаказКлиента") И ФукнциональныеОпции.АктивныйЗаказКлиента.Пустая() Тогда
				
				ВыборкаШапка.Следующий();
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
				|	ИС_АЛИ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
				|	ИС_АЛИ_Заказorder_lines.quantity КАК Количество,
				|	ИС_АЛИ_Заказorder_lines.item_price КАК Цена,
				|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,				
				//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
				|	ИС_АЛИ_СоответствиеХарактеристик.Упаковка КАК Упаковка,
				|	ВЫБОР
				|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель = 0
				|			ТОГДА 1
				|		ИНАЧЕ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель
				|	КОНЕЦ / ВЫБОР
				|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
				|			ТОГДА 1
				|		ИНАЧЕ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель
				|	КОНЕЦ КАК КоэффициентУпаковки
				//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
				|ИЗ
				|	Документ.ИС_АЛИ_Заказ.order_lines КАК ИС_АЛИ_Заказorder_lines
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеХарактеристик КАК ИС_АЛИ_СоответствиеХарактеристик
				|		ПО (ИС_АЛИ_Заказorder_lines.ВариацияАли = ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ)
				|			И (ИС_АЛИ_СоответствиеХарактеристик.Профиль = &Профиль)
				|ГДЕ
				|	ИС_АЛИ_Заказorder_lines.Ссылка = &Ссылка
				|	И НЕ ИС_АЛИ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL";
				
				Запрос.УстановитьПараметр("Профиль", Профиль);
				Запрос.УстановитьПараметр("Ссылка", ВыборкаШапка.Ссылка);  
								
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаТовары = РезультатЗапроса.Выгрузить();
				
				Если РезультатЗапроса.Пустой() Тогда
					ОбщегоНазначения.СообщитьПользователю("Проверьте сопоставление по заказу " + ВыборкаШапка.Ссылка);
					Возврат;
				КонецЕсли;
								
				//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #7408			
				Назначения = ПолучитьНазначения(ВыборкаШапка.Склад);
				
				Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Али, , Назначения);
				//Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Али);
				//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
				
				Если Не Заказ.Пустая() Тогда
					
					ДокОбъект = ВыборкаШапка.Ссылка.ПолучитьОбъект();
					ДокОбъект.Заказ = Заказ;
					
					Попытка
						ДокОбъект.Записать();
					Исключение
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
					КонецПопытки;
					
				КонецЕсли;
				
				СоответствиеПараметров = Новый Соответствие;
				СоответствиеПараметров.Вставить("АктивныйЗаказКлиентаАли", Заказ);
				
				ИС_MP_Сервер.ЗаписатьНастройкиСправочника(Профиль, СоответствиеПараметров); 
				
			Иначе
				Заказ = ФукнциональныеОпции.АктивныйЗаказКлиента;
			КонецЕсли;
			
			Пока ВыборкаШапка.Следующий() Цикл
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
				|	ИС_АЛИ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
				|	ИС_АЛИ_Заказorder_lines.quantity КАК Количество,
				|	ИС_АЛИ_Заказorder_lines.item_price КАК Цена,
				|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
				//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
				|	ИС_АЛИ_СоответствиеХарактеристик.Упаковка КАК Упаковка,
				|	ВЫБОР
				|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель = 0
				|			ТОГДА 1
				|		ИНАЧЕ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель
				|	КОНЕЦ / ВЫБОР
				|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
				|			ТОГДА 1
				|		ИНАЧЕ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель
				|	КОНЕЦ КАК КоэффициентУпаковки
				//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
				|ИЗ
				|	Документ.ИС_АЛИ_Заказ.order_lines КАК ИС_АЛИ_Заказorder_lines
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеХарактеристик КАК ИС_АЛИ_СоответствиеХарактеристик
				|		ПО ИС_АЛИ_Заказorder_lines.ВариацияАли = ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ
				|			И (ИС_АЛИ_СоответствиеХарактеристик.Профиль = &Профиль)
				|ГДЕ
				|	ИС_АЛИ_Заказorder_lines.Ссылка = &Ссылка
				|	И НЕ ИС_АЛИ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL";
				
				Запрос.УстановитьПараметр("Профиль", Профиль);
				Запрос.УстановитьПараметр("Ссылка", ВыборкаШапка.Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаТовары = РезультатЗапроса.Выгрузить(); 
				
				Если РезультатЗапроса.Пустой() Тогда
					ОбщегоНазначения.СообщитьПользователю("Проверьте сопоставление по заказу " + ВыборкаШапка.Ссылка);
					Продолжить;
				КонецЕсли;
				
				
				//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #7408			
				Назначения = ПолучитьНазначения(ВыборкаШапка.Склад);
				
				Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Али, Заказ, Назначения);
				//Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Али, Заказ);
				//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083				
				
				ДокОбъект = ВыборкаШапка.Ссылка.ПолучитьОбъект();
				ДокОбъект.Заказ = Заказ;
				
				Попытка
					ДокОбъект.Записать();
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;
				
			КонецЦикла;	
			
			Возврат;
			
		КонецЕсли;   
		
		Пока ВыборкаШапка.Следующий() Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
			|	ИС_АЛИ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
			|	ИС_АЛИ_Заказorder_lines.quantity КАК Количество,
			|	ИС_АЛИ_Заказorder_lines.item_price КАК Цена,
			|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
			//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			|	ИС_АЛИ_СоответствиеХарактеристик.Упаковка КАК Упаковка,
			|	ВЫБОР
			|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель = 0
			|			ТОГДА 1
			|		ИНАЧЕ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Числитель
			|	КОНЕЦ / ВЫБОР
			|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
			|			ТОГДА 1
			|		ИНАЧЕ ИС_АЛИ_СоответствиеХарактеристик.Упаковка.Знаменатель
			|	КОНЕЦ КАК КоэффициентУпаковки
			//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			|ИЗ
			|	Документ.ИС_АЛИ_Заказ.order_lines КАК ИС_АЛИ_Заказorder_lines
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеХарактеристик КАК ИС_АЛИ_СоответствиеХарактеристик
			|		ПО (ИС_АЛИ_Заказorder_lines.ВариацияАли = ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ)
			|			И (ИС_АЛИ_СоответствиеХарактеристик.Профиль = &Профиль)
			|ГДЕ
			|	ИС_АЛИ_Заказorder_lines.Ссылка = &Ссылка
			|	И НЕ ИС_АЛИ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL";
			
			Запрос.УстановитьПараметр("Профиль", Профиль);
			Запрос.УстановитьПараметр("Ссылка", ВыборкаШапка.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаТовары = РезультатЗапроса.Выгрузить(); 
			
			Если РезультатЗапроса.Пустой() Тогда
				ОбщегоНазначения.СообщитьПользователю("Проверьте сопоставление по заказу " + ВыборкаШапка.Ссылка);
				Продолжить;
			КонецЕсли;				
			
			ДобавитьЗапись = Ложь;
			
			АктивныйЗаказ = ПолучитьАктивныйЗаказКлиента(ВыборкаШапка.Ссылка, ВыборкаШапка.ДатаОтгрузки);
			
			Если АктивныйЗаказ = Неопределено Тогда
				ДобавитьЗапись = Истина;	
			КонецЕсли;
			
			Заказ = ИС_MP_РаботаСЗаказами.СоздатьИлиДополнитьЗаказ(ВыборкаШапка, ВыборкаТовары, ФукнциональныеОпции, Перечисления.ИС_МП_Маркетплейсы.Али, АктивныйЗаказ);
			
			Если ДобавитьЗапись Тогда
				ДобавитьЗаписьВРегистрЗаказов(Заказ, ВыборкаШапка.Ссылка, ВыборкаШапка.ДатаОтгрузки);	
			КонецЕсли;
			
			ДокОбъект = ВыборкаШапка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Заказ = Заказ;
			
			Попытка
				ДокОбъект.Записать();
			Исключение
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			КонецПопытки;
			
		КонецЦикла; 
		
	Иначе
		ВызватьИсключение("Неизвестный режим формирования заказов");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408 

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
Процедура СоздатьРеализации(Профиль, МассивОтправлений) Экспорт
	
	Событие = ПолучитьИмяСобытия("СоздатьРеализации");
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗаданий(Профиль);
	
	Если ФукнциональныеОпции = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_АЛИ_Заказ.Заказ КАК Заказ,
	//+ ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754	
	//|	ИС_АЛИ_СтатусыСборочныхЗаданий.cut_off_date КАК ДатаОтгрузки
	|	МАКСИМУМ(ИС_АЛИ_СтатусыСборочныхЗаданий.cut_off_date) КАК ДатаОтгрузки
	//- ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ИС_АЛИ_Заказ КАК ИС_АЛИ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СтатусыСборочныхЗаданий КАК ИС_АЛИ_СтатусыСборочныхЗаданий
	|		ПО (ИС_АЛИ_СтатусыСборочныхЗаданий.Заказ = ИС_АЛИ_Заказ.Ссылка)
	|ГДЕ
	|	ИС_АЛИ_Заказ.Ссылка В(&МассивСсылок)
	|	И НЕ ИС_АЛИ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_АЛИ_Заказ.Заказ
	//+ ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754	
	//|	ИС_АЛИ_СтатусыСборочныхЗаданий.cut_off_date
	//- ИнфоСофт Стояк Ю.К. 12.03.2025 УА #95754
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	ВТ_Заказы.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Реализация
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Заказы.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ,
	|	ВТ_Заказы.ДатаОтгрузки,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_Заказы.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ,
	|	ВТ_Заказы.ДатаОтгрузки,
	|	ВЫБОР
	|		КОГДА ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителю
	|		ПО ВТ_Заказы.Заказ = ПередачаТоваровХранителю.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ,
	|	ВТ_Заказы.ДатаОтгрузки,
	|	ВЫБОР
	|		КОГДА ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО ВТ_Заказы.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПолучениеРеализаций.Заказ КАК Заказ,
	|	ВТ_ПолучениеРеализаций.ДатаОтгрузки КАК ДатаОтгрузки,
	|	СУММА(ВТ_ПолучениеРеализаций.Реализация) КАК КоличествоРеализаций
	|ПОМЕСТИТЬ ВТ_КоличествоРеализаций
	|ИЗ
	|	ВТ_Реализации КАК ВТ_ПолучениеРеализаций
	|ГДЕ
	|	НЕ ВТ_ПолучениеРеализаций.Реализация ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПолучениеРеализаций.Заказ,
	|	ВТ_ПолучениеРеализаций.ДатаОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КоличествоРеализаций.Заказ КАК Заказ,
	|	ВТ_КоличествоРеализаций.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВТ_КоличествоРеализаций.Заказ.Комментарий КАК Комментарий,
	|	ИС_Али_Склады.СтатусРасходногоОрдера КАК СтатусРасходногоОрдера,
	|	ИС_Али_Склады.СтатусСтрокиРасходногоОрдера КАК СтатусСтрокиРасходногоОрдера
	|ИЗ
	|	ВТ_КоличествоРеализаций КАК ВТ_КоличествоРеализаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Али_Склады КАК ИС_Али_Склады
	|		ПО (ИС_Али_Склады.Профиль = &Профиль)
	|ГДЕ
	|	ВТ_КоличествоРеализаций.КоличествоРеализаций = 0";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("МассивСсылок", МассивОтправлений);
	Запрос.УстановитьПараметр("Заказ", ИС_MP_СерверЛокализация.ПустаяСсылкаЗаказа());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
		
	Комиссия25 = ФукнциональныеОпции.Договор.КомиссионныеПродажи25;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
	ПорядокОформленияНакладныхРасходныхОрдеров = Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить();
	//- ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
	
	Пока Выборка.Следующий() Цикл
		
		//+ ИнфоСофт Мурсалимов Д.Р. 10.06.24 УА #77595
		Если ПорядокОформленияНакладныхРасходныхОрдеров 
			= Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные Тогда
			
			СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25);
			
			//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
			Если ФукнциональныеОпции.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.Заказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
				ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
															, Выборка.СтатусРасходногоОрдера
															, Выборка.СтатусСтрокиРасходногоОрдера);		
			КонецЕсли;	                                   
			//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
			
		Иначе
			
			//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
			Если ФукнциональныеОпции.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.Заказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
				ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
															, Выборка.СтатусРасходногоОрдера
															, Выборка.СтатусСтрокиРасходногоОрдера);		
			КонецЕсли;		                               
			//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
			
			СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25);
			
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 10.06.24 УА #77595				
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
Функция ПолучитьТекстЗапросаСборочныхЗаданий() Экспорт
		
	Текст =  	
	"ВЫБРАТЬ
	|	ИС_АЛИ_Заказ.Ссылка КАК Ссылка,
	//+ ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	ИС_АЛИ_Заказ.Заказ КАК Заказ1C,
	//- ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	ПередачаТоваровХранителю.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	Документ.ИС_АЛИ_Заказ КАК ИС_АЛИ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ИС_АЛИ_Заказ.Заказ = ПередачаТоваровХранителю.ЗаказКлиента
	|			И (НЕ ИС_АЛИ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ИС_АЛИ_Заказ.Профиль = &Профиль
	|	И НЕ ИС_АЛИ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИС_АЛИ_Заказ.Ссылка,
	//+ ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	ИС_АЛИ_Заказ.Заказ КАК Заказ1C,
	//- ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	ПередачаТоваровХранителюТовары.Ссылка
	|ИЗ
	|	Документ.ИС_АЛИ_Заказ КАК ИС_АЛИ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО ИС_АЛИ_Заказ.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента
	|			И (НЕ ИС_АЛИ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ИС_АЛИ_Заказ.Профиль = &Профиль
	|	И НЕ ИС_АЛИ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
    |
	|ВЫБРАТЬ
	|	ИС_АЛИ_Заказ.Ссылка,
	//+ ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	ИС_АЛИ_Заказ.Заказ КАК Заказ1C,
	//- ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.ИС_АЛИ_Заказ КАК ИС_АЛИ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ИС_АЛИ_Заказ.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
	|		И (НЕ ИС_АЛИ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ИС_АЛИ_Заказ.Профиль = &Профиль
	|	И НЕ ИС_АЛИ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ                                 
	|	ИС_АЛИ_Заказ.Ссылка,
	//+ ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	ИС_АЛИ_Заказ.Заказ КАК Заказ1C,
	//- ИнфоСофт Конышев А.Е. 11.12.24 УА #77940
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	Документ.ИС_АЛИ_Заказ КАК ИС_АЛИ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ИС_АЛИ_Заказ.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
	|		И (НЕ ИС_АЛИ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ИС_АЛИ_Заказ.Профиль = &Профиль
	|	И НЕ ИС_АЛИ_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВТ_Реализации.Реализация) КАК Реализация,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_КоличествоРеализаций
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//+ ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ВТ_РасходныеОрдера
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
    |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|		ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = ВТ_Реализации.Заказ1C
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//- ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ВТ_РасходныеОрдера.Ссылка) КАК Ссылка,
	|	ВТ_РасходныеОрдера.Распоряжение КАК Распоряжение,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_РасходныеОрдераКоличество
	|ИЗ
	|	ВТ_РасходныеОрдера КАК ВТ_РасходныеОрдера
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасходныеОрдера.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|ВЫБРАТЬ
	|	ДокументИС_АЛИ_Заказ.Ссылка КАК Ссылка,	
	|	ДокументИС_АЛИ_Заказ.Номер КАК Номер,
	|	ДокументИС_АЛИ_Заказ.Дата КАК Дата,	
	|	ДокументИС_АЛИ_Заказ.total_amount КАК total_amount,
	|	ДокументИС_АЛИ_Заказ.Профиль КАК Профиль,
	|	ДокументИС_АЛИ_Заказ.Заказ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВТ_КоличествоРеализаций.Количество > 1
	|			ТОГДА ""РТУ несколько""
	|		ИНАЧЕ ВТ_КоличествоРеализаций.Реализация
	|	КОНЕЦ КАК Реализация,
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|	ВЫБОР
	|		КОГДА ВТ_РасходныеОрдераКоличество.Ссылка ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ВТ_РасходныеОрдераКоличество.Количество = 1
	|			ТОГДА ВТ_РасходныеОрдераКоличество.Ссылка
	|		ИНАЧЕ ""Список ордеров""
	|	КОНЕЦ КАК РасходныйОрдер,
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|	ИС_АЛИ_СтатусыСборочныхЗаданий.status КАК status,
	|	ИС_АЛИ_СтатусыСборочныхЗаданий.payment_status КАК payment_status,
	|	ИС_АЛИ_СтатусыСборочныхЗаданий.delivery_status КАК delivery_status,
	|	ИС_АЛИ_СтатусыСборочныхЗаданий.cut_off_date КАК cut_off_date,
	|	ИС_АЛИ_СтатусыСборочныхЗаданий.shipping_deadline КАК shipping_deadline,
	|	ИС_АЛИ_СтатусыСборочныхЗаданий.order_display_status КАК order_display_status,
	//+ ИнфоСофт Тимофеева А.А. 04.09.2025 УА #79192 
	|	ВЫБОР        
	|		КОГДА ДокументИС_АЛИ_Заказ.Заказ.Проведен
	|			ТОГДА 3
	|		КОГДА НЕ ДокументИС_АЛИ_Заказ.Заказ.Проведен
	|			ТОГДА 1
	|       ИНАЧЕ 4
	|	КОНЕЦ КАК СтатусПроведенияЗаказа
	//- ИнфоСофт Тимофеева А.А. 04.09.2025 УА #79192
	|ИЗ
	|	Документ.ИС_АЛИ_Заказ КАК ДокументИС_АЛИ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоРеализаций КАК ВТ_КоличествоРеализаций
	|		ПО ДокументИС_АЛИ_Заказ.Ссылка = ВТ_КоличествоРеализаций.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СтатусыСборочныхЗаданий КАК ИС_АЛИ_СтатусыСборочныхЗаданий
	|		ПО ДокументИС_АЛИ_Заказ.Ссылка = ИС_АЛИ_СтатусыСборочныхЗаданий.Заказ
	|			И ДокументИС_АЛИ_Заказ.Профиль = ИС_АЛИ_СтатусыСборочныхЗаданий.Профиль
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныеОрдераКоличество КАК ВТ_РасходныеОрдераКоличество
	|		ПО ДокументИС_АЛИ_Заказ.Заказ = ВТ_РасходныеОрдераКоличество.Распоряжение
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|ГДЕ
	|	ДокументИС_АЛИ_Заказ.Профиль = &Профиль
	|	И (&ВсеОтправления ИЛИ  ИС_АЛИ_СтатусыСборочныхЗаданий.status В (&Статусы))";
	
	Возврат Текст;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
Функция ПолучитьДатуПоследнегоЗаказа(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_АЛИ_Заказ.Дата КАК Дата
	|ИЗ
	|	Документ.ИС_АЛИ_Заказ КАК ИС_АЛИ_Заказ
	|ГДЕ
	|	ИС_АЛИ_Заказ.Профиль = &Профиль
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Дата;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573
Функция ПолучитьСписокОтправлений(Профиль, МассивID) Экспорт

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Загрузка товаров невозможна");
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыСоединения = Неопределено;
	Если Не ПолучитьПараметрыСоединения(Профиль, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Заголовки = Неопределено;
	Если Не CформироватьЗаголовкиЗапроса(Заголовки, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	ПараметрыЗапроса.Сервер = ПараметрыСоединения.АдресСервиса;
	ПараметрыЗапроса.Порт = ПараметрыСоединения.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = ПараметрыСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.Заголовки = Заголовки;
	
	КодСтраницы = 1;
	КоличествоЭлементовНаСтранице = 50;
	ПределОшибок = 10;
	КоличествоОшибок = 0;   
	ОсталосьЭлементов = Неопределено; 
	
	rawData = Новый Структура;
	rawData.Вставить("trade_order_ids", МассивID);
	rawData.Вставить("page_size", КоличествоЭлементовНаСтранице);
	rawData.Вставить("page", КодСтраницы);
	rawData.Вставить("logistic_order_info", "PackageItems");
	
	ТЗ_Отправления = Новый ТаблицаЗначений; 
	
	КвалификаторыЧислаОтправлений = Новый КвалификаторыЧисла(30, 0, ДопустимыйЗнак.Неотрицательный);	
		
	ТЗ_Отправления.Колонки.Добавить("logistic_order_id", Новый ОписаниеТипов("Число", КвалификаторыЧислаОтправлений));
	ТЗ_Отправления.Колонки.Добавить("trade_order_id", Новый ОписаниеТипов("Число", КвалификаторыЧислаОтправлений));
	ТЗ_Отправления.Колонки.Добавить("sku_id", Новый ОписаниеТипов("Число", КвалификаторыЧислаОтправлений));
	ТЗ_Отправления.Колонки.Добавить("quantity", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)));
	
	Пока Истина Цикл	                                         
				
		Если КоличествоОшибок >= ПределОшибок Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Результат = ИС_АЛИ_API.ПолучитьСписокОтправлений(Профиль, ПараметрыЗапроса, rawData); 
		
		Если Результат = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОсталосьЭлементов) Тогда
			ОсталосьЭлементов = Результат["page_info"]["total"];
		КонецЕсли;
		
		Для Каждого Элемент Из Результат["logistic_orders"] Цикл 
			
			Для Каждого item Из Элемент["items"] Цикл
				
				НСтр = ТЗ_Отправления.Добавить();				
				
				НСтр.logistic_order_id = Элемент["logistic_order_id"];
				НСтр.trade_order_id = Элемент["trade_order_id"];
				НСтр.sku_id = item["sku_id"];
				НСтр.quantity = item["quantity"];
						
			КонецЦикла; 				
			
		КонецЦикла;    
		
		ОсталосьЭлементов = ОсталосьЭлементов - КоличествоЭлементовНаСтранице;
		
		Если ОсталосьЭлементов <= 0 Тогда
			Прервать;
		КонецЕсли;
				
	КонецЦикла;
	
	Возврат ТЗ_Отправления;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573

//+ ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573
Функция ВыгрузитьКиЗ(Профиль, ТелоВыгрузки) Экспорт

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль. Загрузка товаров невозможна");
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыСоединения = Неопределено;
	Если Не ПолучитьПараметрыСоединения(Профиль, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Заголовки = Неопределено;
	Если Не CформироватьЗаголовкиЗапроса(Заголовки, ПараметрыСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	ПараметрыЗапроса.Сервер = ПараметрыСоединения.АдресСервиса;
	ПараметрыЗапроса.Порт = ПараметрыСоединения.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = ПараметрыСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.Заголовки = Заголовки;
	
	МассивЗагруженныхЗаданий = Новый Массив;
		
	//+ ИнфоСофт Ивонин К.А. 03.02.25 УА #92887
	//Результат = ИС_АЛИ_API.ВыгрузитьКиЗ(Профиль, ТелоВыгрузки);
	Результат = ИС_АЛИ_API.ВыгрузитьКиЗ(Профиль, ПараметрыЗапроса, ТелоВыгрузки);
	//- ИнфоСофт Ивонин К.А. 03.02.25 УА #92406 
		
	Если Результат = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если Результат.marking_errors.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого Элемент Из Результат.marking_errors Цикл 
		ОбщегоНазначения.СообщитьПользователю("Произошла ошибка при выгрузке маркировки по заказу " + Элемент.sku_id + " по номенклатуре с артикулом "
		+ Элемент.product_source_id + ". Текст ошибки: " + Элемент.message);
	КонецЦикла;    
		
КонецФункции //- ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 09.03.24 УА #66733
Функция ПолучитьНастройкиСоединенияПрофиля(Профиль)
	
	МассивНастроек = Новый Массив;
	МассивНастроек.Добавить("АлиАдресСервисаAPI");
	МассивНастроек.Добавить("АлиТокен");
	
	Результат = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНастроек);
	
	Если Результат.Количество() = 0 Тогда
		ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 09.03.24 УА #66733

//+ ИнфоСофт Ивонин К.А. 09.03.24 УА #66733
Функция ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения)
    
   	Если Не ЗначениеЗаполнено(НастройкиСоединения["АлиАдресСервисаAPI"]) Тогда
		ВызватьИсключение("Для данного профиля не заполнен ""Адрес Сервиса API"" Алиэкспресс, проверьте настройки авторизации");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения["АлиТокен"]) Тогда
		ВызватьИсключение("Для данного профиля не заполнен ""Токен"" Алиэкспресс, проверьте настройки авторизации");
	КонецЕсли;

	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
		
	ПараметрыЗапроса.Сервер = НастройкиСоединения["АлиАдресСервисаAPI"];
	
	//ПараметрыЗапроса.Порт = НастройкиСоединения.Порт;
	//ПараметрыЗапроса.ЗащищенноеСоединение = НастройкиСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.Порт = 443;
	ПараметрыЗапроса.ЗащищенноеСоединение = Истина;
	
	ПараметрыЗапроса.Заголовки.Вставить("x-auth-token", НастройкиСоединения["АлиТокен"]);
	ПараметрыЗапроса.Заголовки.Вставить("x-request-locale", "ru_RU");
	
	Возврат ПараметрыЗапроса;

КонецФункции //- ИнфоСофт Ивонин К.А. 09.03.24 УА #66733

//+ ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524
Функция ПолучитьПараметрыСоединения(Профиль, ПараметрыСоединения)

	Событие = "ПолучитьПараметрыСоединенияАли";
	
	МассивНаименованийПараметров = Новый Массив;  
		
	МассивНаименованийПараметров.Добавить("АлиТокен");
	МассивНаименованийПараметров.Добавить("АлиАдресСервисаAPI");
	
	ПараметрыСоединения = Новый Структура;
	
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);
	
	Если Настройки = Неопределено Тогда
		
		Текст = "Параметры соединения не установлены";
		ЗаписьЖурналаРегистрации("ИС.АЛИ." + Событие, УровеньЖурналаРегистрации.Ошибка, , , Текст);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Ложь;
		
	КонецЕсли;
					
	Если Настройки["АлиАдресСервисаAPI"] <> Неопределено Тогда
		ПараметрыСоединения.Вставить("АдресСервиса", Настройки["АлиАдресСервисаAPI"]);
	Иначе
		
		Текст = "Значение параметра настроек ""Адрес сервиса"" не заполнено";
		ЗаписьЖурналаРегистрации("ИС.АЛИ." + Событие, УровеньЖурналаРегистрации.Ошибка, , , Текст);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Ложь;

	КонецЕсли;
		
	ПараметрыСоединения.Вставить("Порт", 443);
	
	ПараметрыСоединения.Вставить("ЗащищенноеСоединение", Истина);
	
	Если Настройки["АлиТокен"] <> Неопределено Тогда
		ПараметрыСоединения.Вставить("ТокенАли", Настройки["АлиТокен"]);
	Иначе
		
		Текст = "Значение параметра настроек ""Токен поставщика"" не заполнено";
		ЗаписьЖурналаРегистрации("ИС.АЛИ." + Событие, УровеньЖурналаРегистрации.Ошибка, , , Текст);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Ложь;

	КонецЕсли; 
					
	Возврат Истина;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

//+ ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524
Функция CформироватьЗаголовкиЗапроса(Заголовки, ПараметрыСоединения)
	
	Заголовки = Новый Соответствие;
	
	Токен = ПараметрыСоединения.ТокенАли;
	
	Если ЗначениеЗаполнено(Токен) Тогда	
		
		Заголовки.Вставить("x-auth-token", Токен);
		Заголовки.Вставить("x-request-locale", "ru_RU");
	Иначе
		
		Текст = НСтр("ru = 'Значение параметра Токен не заполнено.'");
		ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка,,,);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Ложь;
		
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Функция ПолучитьИмяСобытия(Имя)
	Возврат СтрШаблон("ИС.МП.ИС_АЛИ_Сервер.%1", Имя);
КонецФункции //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

//+ ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #62628
Процедура ДобавитьСоответствиеНоменклатуры(Профиль, ВариацияАЛИ, Номенклатура, 
		Характеристика, Упаковка, ТекНоменклатура = Неопределено, ТекХарактеристика = Неопределено) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_АЛИ_СоответствиеХарактеристик.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Профиль.Установить(Профиль);
	НаборЗаписей.Отбор.ВариацияАЛИ.Установить(ВариацияАли);
		
	НаборЗаписей.Прочитать(); 
	
	ТребуетсяНоваяЗапись = Истина;	
	Если НаборЗаписей.Количество() > 0 Тогда 
		
		Для Каждого Запись Из НаборЗаписей Цикл
		
			Если Запись.Номенклатура = ТекНоменклатура И Запись.Характеристика = ТекХарактеристика Тогда
			
				Запись.Номенклатура = Номенклатура;
				Запись.Характеристика = Характеристика;
				Запись.Упаковка = Упаковка;
        		ТребуетсяНоваяЗапись = Ложь;
        		Прервать;
			
			КонецЕсли;
		
		КонецЦикла; 	
	
	КонецЕсли;
   
    Если ТребуетсяНоваяЗапись Тогда
	
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Профиль = Профиль; 
		НоваяЗапись.ВариацияАЛИ = ВариацияАЛИ;
		НоваяЗапись.Номенклатура = Номенклатура; 
		НоваяЗапись.Характеристика = Характеристика;
		НоваяЗапись.Упаковка = Упаковка;
		
	КонецЕсли;
				
	НаборЗаписей.Записывать = Истина; 
	
	НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #62628

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
Функция ПолучитьНастройкиФункциональностиСборочныхЗаданий(Профиль) Экспорт
	
	Событие = ПолучитьИмяСобытия("ПолучитьНастройкиФункциональностиСборочныхЗаданий");
	Параметры = Новый Структура;
	
	МассивНаименованийПараметров = Новый Массив;  
		
	МассивНаименованийПараметров.Добавить("АвтоматическиСоздаватьЗаказыАли");
	МассивНаименованийПараметров.Добавить("РежимСозданияЗаказовАли");
	МассивНаименованийПараметров.Добавить("АктивныйЗаказКлиентаАли");
	МассивНаименованийПараметров.Добавить("АвтоматическиСоздаватьРеализацииАли");
	
	МассивНаименованийПараметров.Добавить("КонтрагентАли");
	МассивНаименованийПараметров.Добавить("ДоговорАли");
	МассивНаименованийПараметров.Добавить("ПодразделениеАли");
	МассивНаименованийПараметров.Добавить("AliexpressВидЦеныСоСкидкой");
	МассивНаименованийПараметров.Добавить("Организация"); 
	
	МассивНаименованийПараметров.Добавить("ФормироватьЕдиныйЗаказБезРазбиенияАли");
	МассивНаименованийПараметров.Добавить("ПроводитьЗаказыАли");
	МассивНаименованийПараметров.Добавить("ПроводитьРеализацииАли");
	
	МассивНаименованийПараметров.Добавить("ДатаОтгрузкиИлиТекущаяДатаВРеализациюАли"); 
	
	МассивНаименованийПараметров.Добавить("ПартнерАли");
	МассивНаименованийПараметров.Добавить("СоглашениеАли");
	МассивНаименованийПараметров.Добавить("ПриоритетЗаказаАли");
	МассивНаименованийПараметров.Добавить("ВариантОбеспеченияАли"); 
	МассивНаименованийПараметров.Добавить("СтатусЗаказаАли");
	//+ ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
	МассивНаименованийПараметров.Добавить("ВариантОбеспеченияПриНехваткеАли");	
	//- ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
	
	//+ ИнфоСофт Мурсалимов Д.Р. 22.03.24 УА #71529
	МассивНаименованийПараметров.Добавить("АлиСоздатьЗаказНаСборку");
	МассивНаименованийПараметров.Добавить("АлиРассчитатьНесобранныеКомплекты");
	//- ИнфоСофт Мурсалимов Д.Р. 22.03.24 УА #71529 
	
	//+ ИнфоСофт Сумин Д.В. 16.04.2024 УА #67384 
	МассивНаименованийПараметров.Добавить("ЦенаЛотаВЗаказ");
	//- ИнфоСофт Сумин Д.В. 16.04.2024 УА #67384
	
	//+ ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	МассивНаименованийПараметров.Добавить("AliexpressОтделятьТоварыПриНехватке");
	//- ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	
	ПараметрыСоединения = Новый Структура;
	
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);
	
	Если Настройки = Неопределено Тогда
		
		Текст = "Параметры создания заказов не установлены";
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		Возврат Ложь;
		
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
	Если Настройки["ВариантОбеспеченияПриНехваткеАли"] <> Неопределено Тогда
		Параметры.Вставить("ВариантОбеспеченияПриНехватке", Настройки["ВариантОбеспеченияПриНехваткеАли"]);
	Иначе
		Параметры.Вставить("ВариантОбеспеченияПриНехватке", Неопределено);
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
	
	
	Если Настройки["ДатаОтгрузкиИлиТекущаяДатаВРеализациюАли"] <> Неопределено Тогда
		Параметры.Вставить("ДатаОтгрузкиИлиТекущаяДатаВРеализацию", Настройки["ДатаОтгрузкиИлиТекущаяДатаВРеализациюАли"]);
	Иначе
		Параметры.Вставить("ДатаОтгрузкиИлиТекущаяДатаВРеализацию", Ложь);
	КонецЕсли; 
	
	Если Настройки["ФормироватьЕдиныйЗаказБезРазбиенияАли"] <> Неопределено Тогда
		Параметры.Вставить("ФормироватьЕдиныйЗаказБезРазбиения", Настройки["ФормироватьЕдиныйЗаказБезРазбиенияАли"]);
	Иначе
		Параметры.Вставить("ФормироватьЕдиныйЗаказБезРазбиения", Ложь);
	КонецЕсли;
	
	Если Настройки["ПартнерАли"] <> Неопределено Тогда
		Параметры.Вставить("Партнер", Настройки["ПартнерАли"]);
	Иначе
		Параметры.Вставить("Партнер", Неопределено);
	КонецЕсли;
	
	Если Настройки["СоглашениеАли"] <> Неопределено Тогда
		Параметры.Вставить("Соглашение", Настройки["СоглашениеАли"]); 
	Иначе
		Параметры.Вставить("Соглашение", Неопределено);
	КонецЕсли;  
	
	Если Настройки["ВариантОбеспеченияАли"] <> Неопределено Тогда
		Параметры.Вставить("ВариантОбеспечения", Настройки["ВариантОбеспеченияАли"]);
	Иначе
		Параметры.Вставить("ВариантОбеспечения", Неопределено);
	КонецЕсли;
	
	Если Настройки["АвтоматическиСоздаватьЗаказыАли"] <> Неопределено Тогда
		Параметры.Вставить("АвтоматическиСоздаватьЗаказы", Настройки["АвтоматическиСоздаватьЗаказыАли"]);
	Иначе
		Параметры.Вставить("АвтоматическиСоздаватьЗаказы", Ложь);
	КонецЕсли;
	
	Если Настройки["РежимСозданияЗаказовАли"] <> Неопределено Тогда
		Параметры.Вставить("РежимСозданияЗаказов", Настройки["РежимСозданияЗаказовАли"]);
	Иначе
		Параметры.Вставить("РежимСозданияЗаказов", 0);
	КонецЕсли;
	
	Если Настройки["АктивныйЗаказКлиентаАли"] <> Неопределено Тогда
		Параметры.Вставить("АктивныйЗаказКлиента", Настройки["АктивныйЗаказКлиентаАли"]);
	Иначе
		Параметры.Вставить("АктивныйЗаказКлиента", Неопределено);
	КонецЕсли;
		
	Если Настройки["АвтоматическиСоздаватьРеализацииАли"] <> Неопределено Тогда
		Параметры.Вставить("АвтоматическиСоздаватьРеализации", Настройки["АвтоматическиСоздаватьРеализацииАли"]);
	Иначе
		Параметры.Вставить("АвтоматическиСоздаватьРеализации", Ложь);
	КонецЕсли;
			
	Если Настройки["КонтрагентАли"] <> Неопределено Тогда
		Параметры.Вставить("Контрагент", Настройки["КонтрагентАли"]);
	Иначе
		Параметры.Вставить("Контрагент", Неопределено);
	КонецЕсли;
		
	Если Настройки["ДоговорАли"] <> Неопределено Тогда
		Параметры.Вставить("Договор", Настройки["ДоговорАли"]);
	Иначе
		Параметры.Вставить("Договор", Неопределено);
	КонецЕсли;
	
	Если Настройки["ПодразделениеАли"] <> Неопределено Тогда
		Параметры.Вставить("Подразделение", Настройки["ПодразделениеАли"]);
	Иначе
		Параметры.Вставить("Подразделение", Неопределено);
	КонецЕсли;
	
	Если Настройки["ПриоритетЗаказаАли"] <> Неопределено Тогда
		Параметры.Вставить("ПриоритетЗаказа", Настройки["ПриоритетЗаказаАли"]); 
	Иначе
		Параметры.Вставить("ПриоритетЗаказа", Неопределено);
	КонецЕсли;
	
	Если Настройки["AliexpressВидЦеныСоСкидкой"] <> Неопределено Тогда
		Параметры.Вставить("ВидЦены", Настройки["AliexpressВидЦеныСоСкидкой"]); 
	Иначе
		Параметры.Вставить("ВидЦены", Неопределено);
	КонецЕсли;
	
	Если Настройки["СтатусЗаказаАли"] <> Неопределено Тогда
		Параметры.Вставить("СтатусЗаказаКлиента", Настройки["СтатусЗаказаАли"]);
	Иначе
		Параметры.Вставить("СтатусЗаказаКлиента", Неопределено);
	КонецЕсли;
	
	Если Настройки["ПроводитьЗаказыАли"] <> Неопределено Тогда
		Параметры.Вставить("ПроводитьЗаказы", Настройки["ПроводитьЗаказыАли"]);
	Иначе
		Параметры.Вставить("ПроводитьЗаказы", Ложь);
	КонецЕсли;
	
	Если Настройки["ПроводитьРеализацииАли"] <> Неопределено Тогда
		Параметры.Вставить("ПроводитьРеализации", Настройки["ПроводитьРеализацииАли"]);
	Иначе
		Параметры.Вставить("ПроводитьРеализации", Ложь);
	КонецЕсли;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 22.03.24 УА #71529
	Если Настройки["АлиСоздатьЗаказНаСборку"] <> Неопределено Тогда
		Параметры.Вставить("АлиСоздатьЗаказНаСборку", Настройки["АлиСоздатьЗаказНаСборку"]);
	Иначе
		Параметры.Вставить("АлиСоздатьЗаказНаСборку", Ложь);
	КонецЕсли;
	
	Если Настройки["АлиРассчитатьНесобранныеКомплекты"] <> Неопределено Тогда
		Параметры.Вставить("АлиРассчитатьНесобранныеКомплекты", Настройки["АлиРассчитатьНесобранныеКомплекты"]);
	Иначе
		Параметры.Вставить("АлиРассчитатьНесобранныеКомплекты", Ложь);
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 22.03.24 УА #71529
	
	//+ ИнфоСофт Заварин К.В. 13.02.25 УА #93503 
	Если Настройки["AliexpressОтделятьТоварыПриНехватке"] <> Неопределено Тогда
		Параметры.Вставить("ОтделятьТоварыПриНехватке", Настройки["AliexpressОтделятьТоварыПриНехватке"]);
	Иначе
		Параметры.Вставить("ОтделятьТоварыПриНехватке", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	
	////+ ИнфоСофт Сумин Д.В. 16.04.2024 УА #67384
	//Если Настройки["ЦенаЛотаВЗаказ"] <> Неопределено Тогда
	//	Параметры.Вставить("ЦенаЛотаВЗаказ", Настройки["ЦенаЛотаВЗаказ"]);
	//Иначе
	//	Параметры.Вставить("ЦенаЛотаВЗаказ", Ложь);
	//КонецЕсли;
	////- ИнфоСофт Сумин Д.В. 16.04.2024 УА #67384
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_Профили.Организация КАК Организация
		|ИЗ
		|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
		|ГДЕ
		|	ИС_WB_Профили.Ссылка = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Параметры.Вставить("Организация", ВыборкаДетальныеЗаписи.Организация);
	КонецЦикла;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Али_Склады.АвтоматическиСоздаватьОрдерНаОтгрузку КАК АвтоматическиСоздаватьОрдерНаОтгрузку
	|ИЗ
	|	Справочник.ИС_Али_Склады КАК ИС_Али_Склады
	|ГДЕ
	|	ИС_Али_Склады.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Параметры.Вставить("АвтоматическиСоздаватьОрдерНаОтгрузку", ВыборкаДетальныеЗаписи.АвтоматическиСоздаватьОрдерНаОтгрузку);
	Иначе
		Параметры.Вставить("АвтоматическиСоздаватьОрдерНаОтгрузку", Ложь);
	КонецЕсли;;
	//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
		
	Возврат Параметры;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
Функция ПолучитьАктивныйЗаказКлиента(СборочноеЗадание, ДатаОтгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_АЛИ_ЗаказыВТеченииДня.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	РегистрСведений.ИС_АЛИ_ЗаказыВТеченииДня КАК ИС_АЛИ_ЗаказыВТеченииДня
	|ГДЕ
	|	ИС_АЛИ_ЗаказыВТеченииДня.ЗаказОткрыт
	|	И ИС_АЛИ_ЗаказыВТеченииДня.ДатаОтгрузки = &ДатаОтгрузки
	|	И ИС_АЛИ_ЗаказыВТеченииДня.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
	Запрос.УстановитьПараметр("Профиль", СборочноеЗадание.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	КонецЕсли; 	
	
	ВыборкаДетальныеЗаписи.Следующий();	
	
	Возврат ВыборкаДетальныеЗаписи.ЗаказКлиента;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
Процедура ДобавитьЗаписьВРегистрЗаказов(Заказ, СборочноеЗадание, ДатаОтгрузки)
	
	МенеджерЗаписи = РегистрыСведений.ИС_АЛИ_ЗаказыВТеченииДня.СоздатьМенеджерЗаписи(); 
	
	МенеджерЗаписи.ДатаОтгрузки = ДатаОтгрузки;
	МенеджерЗаписи.ЗаказКлиента = Заказ; 
	МенеджерЗаписи.Профиль = СборочноеЗадание.Профиль;
	МенеджерЗаписи.ЗаказОткрыт = Истина;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408 

//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408                
Процедура ПроверитьФункциональныеОпцииОтправлений(Профиль, МассивОтправлений)
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗаданий(Профиль);
	
	Если ФукнциональныеОпции = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ФукнциональныеОпции.АвтоматическиСоздаватьЗаказы Тогда	
		СоздатьЗаказы(Профиль, МассивОтправлений);		
	КонецЕсли;
	
	Если ФукнциональныеОпции.АвтоматическиСоздаватьРеализации 
		И ФукнциональныеОпции.РежимСозданияЗаказов <> 2 Тогда	
		СоздатьРеализации(Профиль, МассивОтправлений);		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 07.03.2024 УА #56408
Процедура ВыполнитьЗакрытиеЗаказов(Профиль)
	
	Событие = ПолучитьИмяСобытия("ВыполнитьЗакрытиеЗаказов");
		
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗаданий(Профиль);
	
	Если ФукнциональныеОпции.ФормироватьЕдиныйЗаказБезРазбиения Тогда
		
		Если Не ЗначениеЗаполнено(ФукнциональныеОпции.АктивныйЗаказКлиента) Тогда
			Возврат;
		КонецЕсли;
		
		МассивЗаданий = Новый Массив;
		МассивЗаданий.Добавить(ФукнциональныеОпции.АктивныйЗаказКлиента);
		
		Если ФукнциональныеОпции.АвтоматическиСоздаватьРеализации Тогда
			СоздатьРеализации(Профиль, МассивЗаданий);  
		КонецЕсли;
		
		СоответствиеПараметровЗаписи = Новый Соответствие;
		СоответствиеПараметровЗаписи.Вставить("АктивныйЗаказКлиентаАли", Документы.ЗаказКлиента.ПустаяСсылка());
		ИС_MP_Сервер.ЗаписатьНастройкиСправочника(Профиль.Ссылка, СоответствиеПараметровЗаписи); 
		
		Возврат;  
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_АЛИ_ЗаказыВТеченииДня.Профиль КАК Профиль,
	|	ИС_АЛИ_ЗаказыВТеченииДня.ЗаказКлиента КАК ЗаказКлиента,
	|	ИС_АЛИ_ЗаказыВТеченииДня.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ИС_АЛИ_ЗаказыВТеченииДня.ЗаказКлиента.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ИС_АЛИ_ЗаказыВТеченииДня КАК ИС_АЛИ_ЗаказыВТеченииДня
	|ГДЕ
	|	ИС_АЛИ_ЗаказыВТеченииДня.Профиль = &Профиль
	|	И ИС_АЛИ_ЗаказыВТеченииДня.ЗаказОткрыт";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Комиссия25 = ФукнциональныеОпции.Договор.КомиссионныеПродажи25;
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ИС_АЛИ_ЗаказыВТеченииДня.СоздатьМенеджерЗаписи(); 
		
		МенеджерЗаписи.Профиль = Выборка.Профиль;
		МенеджерЗаписи.ЗаказКлиента = Выборка.ЗаказКлиента;
		МенеджерЗаписи.ДатаОтгрузки = Выборка.ДатаОтгрузки;
		
		МенеджерЗаписи.ЗаказОткрыт = Ложь;
		
		МенеджерЗаписи.Записать();
		
		Если Комиссия25 Тогда
			ДокументРеализация = Документы.ПередачаТоваровХранителю.СоздатьДокумент();	
		Иначе
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		КонецЕсли;	
		
		Попытка
			//+ ИнфоСофт Стояк Ю.К. 24.06.2024 УА #78102			
			//ДокументРеализация.Заполнить(Выборка.Заказ); 
			ДокументРеализация.Заполнить(Выборка.ЗаказКлиента); 
		Исключение
			//Продолжить;
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			//- ИнфоСофт Стояк Ю.К. 24.06.2024 УА #78102
		КонецПопытки;
		
		ДокументРеализация.Дата = Выборка.ДатаОтгрузки;
		ДокументРеализация.Комментарий = Выборка.Комментарий;
		
		Если ЗначениеЗаполнено(ФукнциональныеОпции.Подразделение) Тогда  
			ДокументРеализация.Подразделение = ФукнциональныеОпции.Подразделение;
		КонецЕсли;
		
		Если Не Комиссия25 Тогда
			ДокументРеализация.СкидкиРассчитаны = Истина;	
		КонецЕсли;
		
		ЗаписыватьДокумент = Ложь;
		Если ФукнциональныеОпции.ПроводитьРеализации Тогда
			
			Попытка
				ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ЗаписыватьДокумент = Истина;
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			КонецПопытки;
			
		Иначе
			ЗаписыватьДокумент = Истина;	
		КонецЕсли;
		
		Если ЗаписыватьДокумент Тогда	
			
			Попытка
				ДокументРеализация.Записать();			
			Исключение
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			КонецПопытки;
		
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 07.03.2024 УА #56408

//+ ИнфоСофт Стояк Ю.К. 10.04.2024 УА #62574
Функция ПолучитьMD5Хэш(СтруктураJSON)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураJSON);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
    Хеш.Добавить(СтрокаJSON);
    
    Возврат СтрЗаменить(Строка(Хеш.ХешСумма), " ", ""); 	
	 
КонецФункции //- ИнфоСофт Стояк Ю.К. 10.04.2024 УА #62574

//+ ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
Процедура СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25)
	
	Событие = ПолучитьИмяСобытия("СоздатьРеализации1С");
	
	Если Комиссия25 Тогда
		ДокументРеализация = Документы.ПередачаТоваровХранителю.СоздатьДокумент();	
	Иначе
		ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	КонецЕсли;
	
	Попытка
		ДокументРеализация.Заполнить(Выборка.Заказ); 
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	КонецПопытки;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 04.03.25 УА #95186
	Если ДокументРеализация.Товары.Количество() = 0 Тогда
		
		ДокументРеализация.ЗаказКлиента 	= Неопределено;
		ДокументРеализация.ПометкаУдаления 	= Истина;
		 
		Попытка
			ДокументРеализация.Записать(РежимЗаписиДокумента.Запись);			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
			
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 04.03.25 УА #95186
	
	Если Не ФукнциональныеОпции.ДатаОтгрузкиИлиТекущаяДатаВРеализацию Тогда
		Если ЗначениеЗаполнено(Выборка.ДатаОтгрузки) Тогда
			ДокументРеализация.Дата = Выборка.ДатаОтгрузки;		
		Иначе                                                 
			ДокументРеализация.Дата = ТекущаяДатаСеанса();
		КонецЕсли;	
	Иначе
		ДокументРеализация.Дата = ТекущаяДатаСеанса();	
	КонецЕсли;
	
	ДокументРеализация.Комментарий = Выборка.Комментарий;
	
	Если Не Комиссия25 Тогда
		ДокументРеализация.СкидкиРассчитаны = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФукнциональныеОпции.Подразделение) Тогда  
		ДокументРеализация.Подразделение = ФукнциональныеОпции.Подразделение;
	КонецЕсли;		
	
	ЗаписыватьДокумент = Ложь;
	
	Если ФукнциональныеОпции.ПроводитьРеализации Тогда
		
		Попытка
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписыватьДокумент = Истина;
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст); 
		КонецПопытки;
		
	Иначе
		ЗаписыватьДокумент = Истина;	
	КонецЕсли;
	
	Если ЗаписыватьДокумент Тогда	
		
		Попытка
			ДокументРеализация.Записать();			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595

//+ ИнфоСофт Стояк Ю.К. 28.06.2023 УА #59330
Функция СуммуСКопейкамиАли(Сумма)
	Возврат	"" + СтрЗаменить(Строка(Цел(Сумма)), Символы.НПП, "") + "." + (Сумма - Цел(Сумма)) * 100;
КонецФункции //- ИнфоСофт Стояк Ю.К. 28.06.2023 УА #59330

//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
Функция ПолучитьНазначения(Склад)
	
	Если Метаданные.Перечисления.Найти("ТипыОбъектовНазначений") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗапросНазначений = Новый Запрос;
	ЗапросНазначений.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
	|ИЗ
	|	Справочник.ИС_Али_Склады.НаправленияДеятельности КАК ИС_Али_СкладыНаправленияДеятельности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ИС_Али_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности
	|			И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|ГДЕ
	|	ИС_Али_СкладыНаправленияДеятельности.Ссылка = &Ссылка 
	|	И Назначения.ТипОбъектаНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовНазначений.НаправлениеДеятельности)";
	
	ЗапросНазначений.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
	
	Назначения = Новый Массив;
	
	ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
	
	Пока ВыборкаНазначения.Следующий() Цикл	
		Назначения.Добавить(ВыборкаНазначения.Назначение);
	КонецЦикла;
	
	Если Назначения.Количество() = 0 Тогда		
		Назначения.Добавить(Справочники.Назначения.ПустаяСсылка());
	КонецЕсли;
	
	Возврат Назначения;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083

#КонецОбласти
