
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 20.01.2023 УА #5252
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстанавливатьОтбор = Истина;

	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		УстанавливатьОтбор = Ложь;
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

//- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524
&НаКлиенте
Процедура ПриОткрытии(Отказ)	

	Если УстанавливатьОтбор Тогда
		УстановитьОтборЛКДинамическогоСписка();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

//- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524
&НаКлиенте
Процедура ЛичныйКабинетПриИзменении(Элемент)
	УстановитьОтборЛКДинамическогоСписка();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524
&НаСервере
Процедура УстановитьОтборЛКДинамическогоСписка()
	
	Список.Отбор.Элементы.Очистить();
	
	Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Профиль;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Профиль");
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	Отбор.Использование = Истина;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

#КонецОбласти
