
#Область ОбработчикиКомандФормы  

//+ ИнфоСофт Сумин Д.В. 15.05.23 УА #56286
&НаКлиенте
Процедура СгенерироватьШтрихкод(Команда) 
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьВопросГенерацииЗавершение", ЭтотОбъект);
	ТекстВопроса = "Сгенерировать новый штрихкод коробки?";
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры // ИнфоСофт Сумин Д.В. 15.05.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 16.05.23 УА #56286
&НаКлиенте
Процедура СформироватьФайлПервыйЭтап(Команда)
	
	Табличныйдокумент = СформироватьТабличныйДокументПервыйЭтап(); 
	
	Табличныйдокумент.Показать();
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.05.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 16.05.23 УА #56286
&НаКлиенте
Процедура СформироватьФайлВторойЭтап(Команда)     
	
	Табличныйдокумент = СформироватьТабличныйДокументВторойЭтап(); 
	
	Если Табличныйдокумент <> Неопределено Тогда
		Табличныйдокумент.Показать(); 
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.05.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 19.02.2024 УА #62253
&НаКлиенте
Процедура АктивныйШтрихкодКоробкиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ПоказатьВопросВводаШкЗавершение", ЭтотОбъект);
	ТекстВопроса = "Сгенерировать новый штрихкод коробки?";
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);

КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.02.2024 УА #62253

//+ ИнфоСофт Сумин Д.В. 16.05.23 УА #56286
&НаКлиенте
Процедура УстановитьАктивныйШкКоробки(Команда)
	Оповещение = Новый ОписаниеОповещения("ПоказатьВопросУстановкиШКЗавершение", ЭтотОбъект);
	ТекстВопроса = "Сделать ""Активным"" штрихкод коробки " + Элементы.Товары.ТекущиеДанные.ШтрихкодКоробки + "?";
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.05.23 УА #56286

//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
&НаКлиенте
Процедура Печать(Команда)
	ТабДок = ПечатьШтрихкодаКоробки();
	ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254

//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
&НаКлиенте
Процедура ПечатьУниверсальныхШтрихкодовНажатие(Элемент)
	ОткрытьФорму("Справочник.ИС_MP_Баркоды.ФормаСписка");
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254

//+ ИнфоСофт Сумин Д.В. 15.11.2023 УА #60080
&НаКлиенте
Процедура СоздатьДокументОтгрузки(Команда)
	
	Комиссия25 = ИспользуетсяСхемаКомиссии25();
	
	Если Комиссия25 Тогда
		ФормаНовогоДокумента = ПолучитьФорму("Документ.ПередачаТоваровХранителю.Форма.ФормаДокумента");			
	Иначе	
		ФормаНовогоДокумента = ПолучитьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента");   
		//+ ИнфоСофт Стояк Ю.К. 18.03.2025 УА #96367
		ФормаНовогоДокумента.Элементы.ГруппаДоговор.Видимость = Истина;
		//- ИнфоСофт Стояк Ю.К. 18.03.2025 УА #96367
	КонецЕсли;     
	
	//+ ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95592	
	ФормаНовогоДокумента.Элементы.Договор.Доступность = Истина;   
	//+ ИнфоСофт Стояк Ю.К. 18.03.2025 УА #96367	
	//ФормаНовогоДокумента.Элементы.ГруппаДоговор.Видимость = Истина;
	//- ИнфоСофт Стояк Ю.К. 18.03.2025 УА #96367
	//- ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95592
	
	ДанныеФормы = ФормаНовогоДокумента.Объект;
	
	ЗаполнитьДанныеНаСервере(ДанныеФормы, Комиссия25);
	
	//+ ИнфоСофт Ивонин К.А. 29.01.25 УА #90505
	Для Каждого Строка Из ДанныеФормы.Товары Цикл
		Строка.ХарактеристикиИспользуются = ЗначениеЗаполнено(Строка.Характеристика);
	КонецЦикла;
	//- ИнфоСофт Ивонин К.А. 29.01.25 УА #90505
	
	КопироватьДанныеФормы(ДанныеФормы, ФормаНовогоДокумента.Объект);

    ФормаНовогоДокумента.Модифицированность = Истина;   
	
    ФормаНовогоДокумента.Открыть();  
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 15.11.2023 УА #60080

//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340
&НаКлиенте
Процедура ВвестиШтрихкодВручную(Команда)

	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #93336	
	//ШтрихкодированиеИСКлиент.ПоказатьВводШтрихкода(Оповещение);
	ИС_MP_МаркировкаКлиент.ПоказатьВводШтрихкода(Оповещение);
	//- ИнфоСофт Власова И.С. 13.02.25 УА #93336
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340

#КонецОбласти

#Область ОбработчикиСобытийФормы
//+ ИнфоСофт Сумин Д.В. 15.05.23 УА #56286
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные) 
	
	Если Не ЗначениеЗаполнено(Объект.Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.АктивныйШтрихкод) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Штрихкод", , , "АктивныйШтрихкод");
		Возврат;
	КонецЕсли;
	
	ШкПринадлежитКоробке = ПолучитьРезультатАктивизацииСтроки(Данные); 
	
	Если ШкПринадлежитКоробке Тогда
		Возврат;	
	КонецЕсли;
	
	ДанныеШтрихкода = Новый Структура; 
	
	ДанныеШтрихкода.Вставить("ФорматBase64", Ложь); 
	ДанныеШтрихкода.Вставить("Штрихкод", СокрЛП(Данные));
	ДанныеШтрихкода.Вставить("Количество", 1);

	//+ ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842
	ИС_MP_МаркировкаКлиентСервер.ЗакодироватьШтрихкодДанныхBase64(ДанныеШтрихкода); 
	
	ПараметрыСканирования = ИС_MP_МаркировкаКлиент.ПараметрыСканирования(ЭтаФорма);  
	
	РезультатОбработкиШтрихкода = ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования);
	
	ОбработатьШтрихкодыЗавершение(РезультатОбработкиШтрихкода.ДанныеШтрихкода, Неопределено);
			                                                  
	//ИС_MP_МаркировкаКлиент.ОбработатьДанныеШтрихкода("ОбработатьШтрихкодыЗавершение", ЭтаФорма, ДанныеШтрихкода);
	//- ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842

КонецПроцедуры //- ИнфоСофт Сумин Д.В. 15.05.23 УА #56286 

//+ ИнфоСофт Сумин Д.В. 15.05.23 УА #56286
&НаКлиенте
Процедура ПриОткрытии(Отказ)     
	
	Префикс = ПолучитьПрефиксНаСервере();
	
	ТребуетсяГенерацияШК = ПолучитьРезультатПроверкиЗаполненияШК();
	
	Если ТребуетсяГенерацияШК Тогда                
		//+ ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163		
		НСтр = Коробки.Добавить();
		НСтр.ШтрихкодКоробки = ""; 
		//- ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163
		СгенерироватьШтрихкодКоробки();	
	КонецЕсли;	
	
	ЭтаФорма.ИспользоватьПодключаемоеОборудование = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода"); 
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 15.05.23 УА #56286 

//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
&НаКлиенте
Процедура КоробкиПриАктивизацииСтроки(Элемент)          
	
	ВыделенныеСтроки = Элементы.Коробки.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элементы.Коробки.ДанныеСтроки(ВыделенныеСтроки[0]);
	
	ШККоробки = ДанныеСтроки.ШтрихкодКоробки;
	
	Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("ШтрихкодКоробки", ШККоробки);
	
	УстановитьАктивныйШкНаСервере(ШККоробки);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489

//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Результат = ТоварыНоменклатураПриИзмененииНаСервере(ТекущиеДанные.Номенклатура, ТекущиеДанные.Характеристика);
	ТекущиеДанные.ШтрихкодКоробки = Объект.АктивныйШтрихкод;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат);		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489

//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340
&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Результат = ТоварыНоменклатураПриИзмененииНаСервере(ТекущиеДанные.Номенклатура, ТекущиеДанные.Характеристика);
	ТекущиеДанные.ШтрихкодКоробки = Объект.АктивныйШтрихкод;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат);		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340

//+ ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ЗначениеЗаполнено(Объект.Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.АктивныйШтрихкод) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Штрихкод", , , "АктивныйШтрихкод");
		Отказ = Истина;
		Возврат;
	КонецЕсли;  
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163

//+ ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163
&НаКлиенте
Процедура КоробкиПередУдалением(Элемент, Отказ)
	
	//в рамках фичи в будущем нужно сделать нормальную обработку удаления, сейчас можно удалять непосредственно сами товары из коробки
	// удаление в списке коробок фиктивно
	Отказ = Истина;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163

//+ ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163
&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ШтрихкодКоробки", Объект.АктивныйШтрихкод));
			
	Если НайденныеСтроки.Количество() = 0 Тогда
		ПолучитьРезультатПроверкиЗаполненияШК();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Мурсалимов Д.Р. 09.07.24 УА #79189
&НаКлиенте
Процедура Подключаемый_ОткрытьФормуУточненияДанных() Экспорт		
	ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка штрихкода завершилось с ошибкой! Данные не найдены по штрихкоду!");
	Возврат;		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 09.07.24 УА #79189     

//+ ИнфоСофт Мурсалимов Д.Р. 09.07.24 УА #79189
&НаКлиенте
Функция ОписаниеОповещенияОбработкиКодаМаркировки()	
	Возврат Новый ОписаниеОповещения("ОбработатьШтрихкодыЗавершение", ЭтотОбъект);	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 09.07.24 УА #79189

//+ ИнфоСофт Мурсалимов Д.Р. 09.07.24 УА #79189
&НаКлиенте
Процедура ОбработатьШтрихкодыЗавершение(Результат, Параметры) Экспорт 	
	
	ДанныеШтрихкода = Результат;
		
	Если ДанныеШтрихкода.ДанныеРазбора <> Неопределено И 
			ДанныеШтрихкода.ДанныеРазбора.ТипШтрихкода = ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.GS1_DataMatrix") Тогда 	
		ПолучитьТоварыПоQrКоду(ДанныеШтрихкода);			
	Иначе
		
		Тип = НайтиПроверочныйШК(ДанныеШтрихкода.Штрихкод);		

		Если ЗначениеЗаполнено(Тип) Тогда        
						
			Если Тип = ПредопределенноеЗначение("Перечисление.ИС_MP_ТипУниверсальногоШтрихкода.ДляСозданияНовойКоробки") Тогда		       
				СгенерироватьШтрихкодКоробки();	
			КонецЕсли; 
			
			ТабДок = ПечатьШтрихкодаКоробки();
			ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);			
			
		Иначе                                           
			
			ПолучитьТоварыПоШтрихкоду(ДанныеШтрихкода.Штрихкод);

		КонецЕсли;                                  
	
	КонецЕсли;
	
	КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();
	
	//Найдем строку с активным ШК коробки
	ИдентификаторСтроки = Неопределено;
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		Если Строка.ШтрихкодКоробки = Объект.АктивныйШтрихкод Тогда
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();	
		КонецЕсли;	
	КонецЦикла;	
	
	Элементы.Товары.Развернуть(ИдентификаторСтроки);
	
	Если АвтоПечать И ДанныеНайдены Тогда
		ТабДок = ПечатьШтрихкода(ПоследнийШтрихкод);
		ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 09.07.24 УА #79189

//+ ИнфоСофт Сумин Д.В. 18.08.23 УА #56286
&НаСервере
Функция ПолучитьРезультатПроверкиЗаполненияШК() 
	
	Если Объект.Товары.Количество() < 1 Тогда
		Возврат Истина;	      
	Иначе 
		ШККоробок = Объект.Товары.Выгрузить(,"ШтрихкодКоробки").ВыгрузитьКолонку("ШтрихкодКоробки"); 
		//+ ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163
		ШККоробок.Добавить("");
		Коробки.Очистить();
		//- ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163
		Для Каждого ШК Из ШККоробок Цикл 
			
			НайденныеСтроки = Коробки.НайтиСтроки(Новый Структура("ШтрихкодКоробки", ШК));
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				НСтр = Коробки.Добавить();
				НСтр.ШтрихкодКоробки = ШК;
			КонецЕсли;
			
		КонецЦикла;
			
		Коробки.Сортировать("ШтрихкодКоробки"); 
		
		ШККоробки = Коробки[0].ШтрихкодКоробки;
		
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("ШтрихкодКоробки", ШККоробки);
		
		УстановитьАктивныйШкНаСервере(ШККоробки);
		
		//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	Товары.Номенклатура КАК Номенклатура,
		//|	Товары.Характеристика КАК Характеристика,
		//|	Товары.Количество КАК Количество,
		//|	Товары.ШтрихкодКоробки КАК ШтрихкодКоробки,
		//|	Товары.МаркированныйТовар КАК МаркированныйТовар,
		//|	Товары.ИсходныйНомерСтроки КАК ИсходныйНомерСтроки,
		//|	Товары.Штрихкод КАК Штрихкод
		//|ПОМЕСТИТЬ ВТ_Товары
		//|ИЗ
		//|	&Товары КАК Товары
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_Товары.Номенклатура КАК Номенклатура,
		//|	ВТ_Товары.Характеристика КАК Характеристика,
		//|	ВТ_Товары.Количество КАК Количество,
		//|	ВТ_Товары.ШтрихкодКоробки КАК ШтрихкодКоробки,
		//|	ВТ_Товары.Штрихкод КАК Штрихкод,
		//|	ВТ_Товары.ИсходныйНомерСтроки КАК ИсходныйНомерСтроки,
		//|	ВТ_Товары.МаркированныйТовар КАК МаркированныйТовар
		//|ИЗ
		//|	ВТ_Товары КАК ВТ_Товары
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	ИсходныйНомерСтроки
		//|ИТОГИ ПО
		//|	ШтрихкодКоробки";
		//
		//Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить()); 
		//		
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
		//
		//ДеревоРек = РеквизитФормыВЗначение("Товары"); 
		//	
		//Пока Выборка.Следующий() Цикл
									
			//КорневаяСтрока = ДеревоРек.Строки.Добавить();
			//КорневаяСтрока.ШтрихкодКоробки = Выборка.ШтрихкодКоробки;		
		
			//ВыборкаДетальныеЗаписи = Выборка.Выбрать(); 
			//
			//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//	ПодчиненнаяСтрока = КорневаяСтрока.Строки.Добавить();				
			//	ПодчиненнаяСтрока.ШтрихкодКоробки = Выборка.ШтрихкодКоробки;
			//	ПодчиненнаяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			//    ПодчиненнаяСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
			//    ПодчиненнаяСтрока.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
			//    ПодчиненнаяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество; 
			//	ПодчиненнаяСтрока.МаркированныйТовар = ВыборкаДетальныеЗаписи.МаркированныйТовар;
			//	
			//КонецЦикла;	                                   			
		//	
		//КонецЦикла;	
		//
		//ЗначениеВРеквизитФормы(ДеревоРек,"Товары");            
		//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
		
		Возврат Ложь;
		
	КонецЕсли; 
	
КонецФункции //- ИнфоСофт Сумин Д.В. 18.08.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 18.08.23 УА #56286
&НаКлиенте
Функция ПолучитьРезультатАктивизацииСтроки(Данные)
	
	//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
	Отбор = Новый Структура("ШтрихкодКоробки", СокрЛП(Данные));
	НайденныеСтроки = Объект.Товары.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;    
	
	Возврат Истина;
	//КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();
	//
	//ИдентификаторСтрокиШК = Неопределено;
	//ШкКоробки = Неопределено;
	////Найдем ШК коробки в строках
	//Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
	//	Если Строка.ШтрихкодКоробки = СокрЛП(Данные) Тогда
	//		ИдентификаторСтрокиШК = Строка.ПолучитьИдентификатор();
	//		ШкКоробки = Строка.ШтрихкодКоробки;
	//	КонецЕсли;	
	//КонецЦикла;	
	//
	//Если ИдентификаторСтрокиШК <> Неопределено И ШкКоробки <> Неопределено Тогда
	//	//Свернем все строки и откроем активную
	//	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
	//		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
	//		Элементы.Товары.Свернуть(ИдентификаторСтроки); 
	//	КонецЦикла;
	//	
	//	Элементы.Товары.Развернуть(ИдентификаторСтрокиШК);
	//	
	//	Объект.АктивныйШтрихкод = ШкКоробки;
	//	
	//	Возврат Истина;  
	//	
	//КонецЕсли;
	//
	//Возврат Ложь;
	//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
	
КонецФункции //- ИнфоСофт Сумин Д.В. 18.08.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 15.08.23 УА #56286
&НаСервере
Функция ПолучитьТипGS1_DataMatrixНаСервере()
	Возврат Перечисления.ТипыШтрихкодов.GS1_DataMatrix;  
КонецФункции //- ИнфоСофт Сумин Д.В. 15.08.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 15.05.23 УА #56286
&НаКлиенте
Процедура ПоказатьВопросУстановкиШКЗавершение(Результат, Объект) Экспорт  
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		
		ШкКоробки = Элементы.Товары.ТекущиеДанные.ШтрихкодКоробки;
		
		УстановитьАктивныйШкНасервере(ШкКоробки);
		
		Результат = ПолучитьРезультатАктивизацииСтроки(ШкКоробки);
		
	Иначе
		Возврат;
		
	КонецЕсли; 		
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 15.05.23 УА #56286 

//+ ИнфоСофт Сумин Д.В. 15.05.23 УА #56286
&НаСервере
Процедура УстановитьАктивныйШкНаСервере(ШкКоробки)
	Объект.АктивныйШтрихкод = ШкКоробки;	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 15.05.23 УА #56286	

//+ ИнфоСофт Сумин Д.В. 15.05.23 УА #56286
&НаКлиенте
Процедура ПоказатьВопросГенерацииЗавершение(Результат, Объект) Экспорт	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СгенерироватьШтрихкодКоробки(); 
		//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
		Если АвтоПечать Тогда
			ТабДок = ПечатьШтрихкодаКоробки();
			ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
		КонецЕсли;
		//- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
	Иначе
		Возврат;			
	КонецЕсли; 	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 15.05.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 19.02.2024 УА #62253
&НаСервере
Процедура СгенерироватьШтрихкодКоробки()  
	
	Номер = НомерПоследнейКоробкиПлюсОдин();
	
	//+ ИнфоСофт Заварин К.В. 10.03.25 УА #95725
	//НомерСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Строка(Номер), 6, "0");

	//Объект.АктивныйШтрихкод =  "WB_" + Префикс + НомерСтрока;
	
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96598
	//НомерСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Формат(Строка(Номер), "ЧГ=0"), 6, "0");
	НомерСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Формат(Номер, "ЧГ=0"), 6, "0");
    //- ИнфоСофт Заварин К.В. 19.03.25 УА #96598
	
	Объект.АктивныйШтрихкод = Префикс + НомерСтрока;
	//- ИнфоСофт Заварин К.В. 10.03.25 УА #95725
	
	ЗаписатьШтрихкодКоробки(Номер);
	
	//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489	
	//ДобавитьКорневойЭлемент();                  
	НСтр = Коробки.Добавить();
	НСтр.ШтрихкодКоробки = Объект.АктивныйШтрихкод;
	
	Коробки.Сортировать("ШтрихкодКоробки");
	//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.02.2024 УА #62253 

//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
////+ ИнфоСофт Сумин Д.В. 15.05.23 УА #56286
//&НаСервере
//Процедура ДобавитьКорневойЭлемент()
//	ДеревоРек = РеквизитФормыВЗначение("Товары"); 
//	НоваяГруппа = ДеревоРек.Строки.Добавить();
//	НоваяГруппа.ШтрихкодКоробки = Объект.АктивныйШтрихкод;
//	
//	ЗначениеВРеквизитФормы(ДеревоРек,"Товары");
//КонецПроцедуры // ИнфоСофт Сумин Д.В. 15.05.23 УА #56286
//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489

//+ ИнфоСофт Сумин Д.В. 18.05.23 УА #56286
&НаСервере
Процедура ПолучитьТоварыПоQrКоду(ДанныеШтрихкода) 
	
	//+ ИнфоСофт Сумин Д.В. 14.02.2024 УА #62253
	qrКод = ДанныеШтрихкода.Штрихкод; 
	//- ИнфоСофт Сумин Д.В. 14.02.2024 УА #62253 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкода
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыУпаковокТоваров.Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_НоменклатураГруппировка
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоменклатураГруппировка.Номенклатура КАК Номенклатура,
	|	ВТ_НоменклатураГруппировка.Характеристика КАК Характеристика,
	|	Истина КАК МаркированныйТовар,
	|	ИС_WB_ШтрихкодыРазмеров.Штрихкод КАК Штрихкод
	|ИЗ
	|	ВТ_НоменклатураГруппировка КАК ВТ_НоменклатураГруппировка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|			ПО ИС_WB_СоответствиеРазмеров.РазмерWB = ИС_WB_ШтрихкодыРазмеров.Размер
	|		ПО ВТ_НоменклатураГруппировка.Номенклатура = ИС_WB_СоответствиеРазмеров.Номенклатура
	|			И ВТ_НоменклатураГруппировка.Характеристика = ИС_WB_СоответствиеРазмеров.Характеристика
	|ГДЕ
	|	ИС_WB_СоответствиеРазмеров.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("ЗначениеШтрихкода", qrКод);
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не найдены данные по qr коду " + qrКод); 
		//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254		
		ДанныеНайдены = Ложь;                       
		//- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
		Возврат;		
	КонецЕсли;	
	
	//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
	ДанныеНайдены = Истина;
	//- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254	
	
	//+ ИнфоСофт Сумин Д.В. 14.02.2024 УА #62253
	НайденныеТовары = Новый ТаблицаЗначений;
	НайденныеТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	НайденныеТовары.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	НайденныеТовары.Колонки.Добавить("МаркированныйТовар", Новый ОписаниеТипов("Булево"));
	НайденныеТовары.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = НайденныеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
	КонецЦикла;	
	
	ДобавитьТоварыПоШтрихкоду(НайденныеТовары);
	//ДобавитьТоварыПоШтрихкоду(РезультатЗапроса.Выгрузить());
	//+ ИнфоСофт Сумин Д.В. 14.02.2024 УА #62253 
	
	//+ ИнфоСофт Сумин Д.В. 14.02.2024 УА #62253
	Если АвтоПроверкаМаркированногоТовара Тогда
		Если НайденныеТовары.Количество() < 1 Тогда
			Возврат;	
		КонецЕсли;	
		ВыполнитьПроверкуКодаМаркировки(qrКод, НайденныеТовары[0].Номенклатура);		
	КонецЕсли;	
	//- ИнфоСофт Сумин Д.В. 14.02.2024 УА #62253
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.05.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 15.05.23 УА #56286
&НаСервере
Процедура ПолучитьТоварыПоШтрихкоду(Данные)  
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_WB_ШтрихкодыРазмеров.Размер КАК Размер,
	|	ИС_WB_ШтрихкодыРазмеров.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВТ_Размер
	|ИЗ
	|	РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|ГДЕ
	|	ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль
	|	И ИС_WB_ШтрихкодыРазмеров.Штрихкод = &Штрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
	|	ЛОЖЬ КАК МаркированныйТовар,
	|	ВТ_Размер.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_Размер КАК ВТ_Размер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ВТ_Размер.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
	//+ ИнфоСофт Стояк Ю.К. 21.06.2024 УА #77969	
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика,
	|	ЛОЖЬ,
	|	ШтрихкодыНоменклатуры.Штрихкод
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.Характеристика КАК Характеристика,
	|	ВТ_Данные.МаркированныйТовар КАК МаркированныйТовар,
	|	ВТ_Данные.Штрихкод КАК Штрихкод
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ГДЕ
	|	ВТ_Данные.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	//- ИнфоСофт Стояк Ю.К. 21.06.2024 УА #77969

	
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);  
	Запрос.УстановитьПараметр("Штрихкод", Данные); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не найдены данные по штрихкоду: " + Данные); 
		//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254		
		ДанныеНайдены = Ложь;                       
		//- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
		Возврат;		
	КонецЕсли;	
	
	//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
	ДанныеНайдены = Истина;
	//- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254	
	
	ДобавитьТоварыПоШтрихкоду(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 15.05.23 УА #56286 

//+ ИнфоСофт Сумин Д.В. 15.05.23 УА #56286
&НаСервере
Процедура ДобавитьТоварыПоШтрихкоду(ТоварыДляДобавления) 
			
	//Выполним проверку на уникальность уже отсканированных позиций
	Отбор = Новый Структура;
	Отбор.Вставить("ШтрихкодКоробки", Объект.АктивныйШтрихкод);
	Отбор.Вставить("Номенклатура", ТоварыДляДобавления[0].Номенклатура);
	Отбор.Вставить("Характеристика", ТоварыДляДобавления[0].Характеристика); 
	Отбор.Вставить("Штрихкод", ТоварыДляДобавления[0].Штрихкод);
	
	//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489	
	//МассивНайденныхСтрок = ДеревоРек.Строки.НайтиСтроки(Отбор, Истина);
	МассивНайденныхСтрок = Объект.Товары.НайтиСтроки(Отбор);
	//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
	
	Если МассивНайденныхСтрок.Количество() > 0 Тогда
		МассивНайденныхСтрок[0].Количество = МассивНайденныхСтрок[0].Количество + 1;
		//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489		
		//ЗначениеВРеквизитФормы(ДеревоРек,"Товары"); 
		//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
		Возврат;
	КонецЕсли;	
	
	//Если ранее таких позиций не было, добавим их в дерево		
	//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489		
	//КорневаяСтрокаДереваЗначений = ДеревоРек.Строки.Найти(Объект.АктивныйШтрихкод, "ШтрихкодКоробки");  
	//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489		
	
	Для Каждого Элемент Из ТоварыДляДобавления Цикл
		//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489		
		//СтрокаДереваЗначений = КорневаяСтрокаДереваЗначений.Строки.Добавить();
		//
		//СтрокаДереваЗначений.ШтрихкодКоробки = Объект.АктивныйШтрихкод; 
		//
		//СтрокаДереваЗначений.Номенклатура = Элемент.Номенклатура;
		//СтрокаДереваЗначений.Характеристика = Элемент.Характеристика; 
		//СтрокаДереваЗначений.Штрихкод = Элемент.Штрихкод; 
		//СтрокаДереваЗначений.МаркированныйТовар = Элемент.МаркированныйТовар;
		//СтрокаДереваЗначений.Количество = 1;
		
		Строка = Объект.Товары.Добавить();
		
		Строка.ШтрихкодКоробки = Объект.АктивныйШтрихкод; 		
		Строка.Номенклатура = Элемент.Номенклатура;
		Строка.Характеристика = Элемент.Характеристика; 
		Строка.Штрихкод = Элемент.Штрихкод; 
		Строка.МаркированныйТовар = Элемент.МаркированныйТовар;
		Строка.Количество = 1;
		//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
		
	КонецЦикла;   
	
	//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489	
	//ЗначениеВРеквизитФормы(ДеревоРек,"Товары"); 
	//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
	//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254	
	ПоследнийШтрихкод = ТоварыДляДобавления[0].Штрихкод;
	//- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 15.05.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 19.02.2024 УА #62253
&НаКлиенте
Процедура ПоказатьВопросВводаШкЗавершение(Результат, Объект) Экспорт	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ЭтотОбъект.Объект.АктивныйШтрихкод = "";
	Иначе
		СгенерироватьШтрихкодКоробки();
	КонецЕсли; 	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.02.2024 УА #62253

//+ ИнфоСофт Сумин Д.В. 16.05.23 УА #56286  
&НаСервере
Функция СформироватьТабличныйДокументПервыйЭтап()
	ТаблицаВыгрузки = Новый ТаблицаЗначений;
	
	ТаблицаВыгрузки.Колонки.Добавить("баркод", Новый ОписаниеТипов("Строка"));
	ТаблицаВыгрузки.Колонки.Добавить("количество", Новый ОписаниеТипов("Число"));
	
	//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489	
	//ДеревоРек = РеквизитФормыВЗначение("Товары");
	
	//Если ДеревоРек.Строки.Количество() < 1 Тогда
	Если Объект.Товары.Количество() < 1 Тогда
		ОбщегоНазначения.СообщитьПользователю("Сначала необходимо заполнить таблицу товаров.");
		Возврат Неопределено;	
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
	
	//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489	
	//Для Каждого Корень Из ДеревоРек.Строки Цикл
	//	Для Каждого Строка Из Корень.Строки Цикл
	//		СтрокаТЗ = ТаблицаВыгрузки.Добавить();
	//		СтрокаТЗ.баркод = Строка.Штрихкод;
	//		СтрокаТЗ.количество = Строка.Количество;	
	//	КонецЦикла;	
	//КонецЦикла;	
	
	Для Каждого Строка Из Объект.Товары Цикл
		СтрокаТЗ = ТаблицаВыгрузки.Добавить();
		СтрокаТЗ.баркод = Строка.Штрихкод;
		СтрокаТЗ.количество = Строка.Количество;	
	КонецЦикла;	
	//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
	
	ТаблицаВыгрузки.Свернуть("баркод", "количество");
		
	ТабДок = СформироватьТабличныйДокумент(ТаблицаВыгрузки);
	
	Возврат ТабДок
	
КонецФункции //- ИнфоСофт Сумин Д.В. 16.05.23 УА #56286	

//+ ИнфоСофт Сумин Д.В. 16.05.23 УА #56286
&НаСервере
Функция СформироватьТабличныйДокумент(ТаблицаВыгрузки)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаВыгрузки); 
	Построитель.ВыводитьЗаголовокОтчета = Ложь;
	Построитель.Вывести(ТабличныйДокумент);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.УдалитьОбласть(ТабличныйДокумент.Область("R1C1:R100C1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	ТабличныйДокумент.Область("R1C1:R100C1").ШиринаКолонки = 20;
	ТабличныйДокумент.Область("R1C2:R100C2").ШиринаКолонки = 20;
	
	Возврат ТабличныйДокумент;
КонецФункции //- ИнфоСофт Сумин Д.В. 16.05.23 УА #56286

//+ ИнфоСофт Сумин Д.В. 16.05.23 УА #56286 
&НаСервере
Функция СформироватьТабличныйДокументВторойЭтап()
	ТаблицаВыгрузки = Новый ТаблицаЗначений;
	
	ТаблицаВыгрузки.Колонки.Добавить("баркод", Новый ОписаниеТипов("Строка"));
	ТаблицаВыгрузки.Колонки.Добавить("количество", Новый ОписаниеТипов("Число")); 
	ТаблицаВыгрузки.Колонки.Добавить("шк_короба", Новый ОписаниеТипов("Строка"));
	ТаблицаВыгрузки.Колонки.Добавить("товар_с_кизом", Новый ОписаниеТипов("Строка")); 
	ТаблицаВыгрузки.Колонки.Добавить("срок_годности", Новый ОписаниеТипов("Строка"));
	
	//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489	
	//ДеревоРек = РеквизитФормыВЗначение("Товары");
	
	//Если ДеревоРек.Строки.Количество() < 1 Тогда
	Если Объект.Товары.Количество() < 1 Тогда
		ОбщегоНазначения.СообщитьПользователю("Сначала необходимо заполнить таблицу товаров.");
		Возврат Неопределено;	
	КонецЕсли;	
	
	//Для Каждого Корень Из ДеревоРек.Строки Цикл
	//	Для Каждого Строка Из Корень.Строки Цикл
	//		СтрокаТЗ = ТаблицаВыгрузки.Добавить();
	//		СтрокаТЗ.баркод = Строка.Штрихкод;
	//		СтрокаТЗ.количество = Строка.Количество;
	//		СтрокаТЗ.шк_короба = Строка.ШтрихкодКоробки; 
	//		СтрокаТЗ.товар_с_кизом = Строка.МаркированныйТовар;
	//        СтрокаТЗ.срок_годности = "";
	//	КонецЦикла;	
	//КонецЦикла;
	
	Для Каждого Строка Из Объект.Товары Цикл
		СтрокаТЗ = ТаблицаВыгрузки.Добавить();
		СтрокаТЗ.баркод = Строка.Штрихкод;
		СтрокаТЗ.количество = Строка.Количество;
		СтрокаТЗ.шк_короба = Строка.ШтрихкодКоробки; 
		СтрокаТЗ.товар_с_кизом = Строка.МаркированныйТовар;
		СтрокаТЗ.срок_годности = "";
	КонецЦикла;		
	//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
			
	ТабДок = СформироватьТабличныйДокумент(ТаблицаВыгрузки);
	
	Возврат ТабДок
	
КонецФункции //- ИнфоСофт Сумин Д.В. 16.05.23 УА #56286	

//+ ИнфоСофт Сумин Д.В. 18.05.23 УА #56286 
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)   
	
	//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489	
	//ТекущийОбъект.Товары.Очистить();            
	//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
	
	ТекущийОбъект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	
	//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489	
	//ДеревоРек = РеквизитФормыВЗначение("Товары");   
	
	//+ ИнфоСофт Сумин Д.В. 17.10.2023 УА #64647
	//ИтогоКоробок = 0;
	//ИтогоНоменклатуры = 0;
	////- ИнфоСофт Сумин Д.В. 17.10.2023 УА #64647
	//Для Каждого КорневаяСтрока Из ДеревоРек.Строки Цикл 
	//	//+ ИнфоСофт Сумин Д.В. 17.10.2023 УА #64647
	//	ИтогоКоробок = ИтогоКоробок + 1;	        
	//	//- ИнфоСофт Сумин Д.В. 17.10.2023 УА #64647
	//	Для Каждого ПодчиненнаяСтрока Из КорневаяСтрока.Строки Цикл
	//		СтрокаТЧ = ТекущийОбъект.Товары.Добавить();
	//		СтрокаТЧ.Номенклатура = ПодчиненнаяСтрока.Номенклатура;
	//		СтрокаТЧ.Характеристика = ПодчиненнаяСтрока.Характеристика;
	//		СтрокаТЧ.Количество = ПодчиненнаяСтрока.Количество;
	//		СтрокаТЧ.МаркированныйТовар = ПодчиненнаяСтрока.МаркированныйТовар;
	//		СтрокаТЧ.ШтрихкодКоробки = ПодчиненнаяСтрока.ШтрихкодКоробки;
	//		СтрокаТЧ.Штрихкод = ПодчиненнаяСтрока.Штрихкод;
	//		//+ ИнфоСофт Сумин Д.В. 17.10.2023 УА #64647
	//		ИтогоНоменклатуры = ИтогоНоменклатуры + 1;  
	//		//- ИнфоСофт Сумин Д.В. 17.10.2023 УА #64647
	//	КонецЦикла;	
	//	
	//КонецЦикла;	
	////+ ИнфоСофт Сумин Д.В. 17.10.2023 УА #64647
	//ТекущийОбъект.ИтогоКоробок 	 	= ИтогоКоробок; 
	//ТекущийОбъект.ИтогоНоменклатуры = ИтогоНоменклатуры;
	//- ИнфоСофт Сумин Д.В. 17.10.2023 УА #64647 
	//+ ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97260	
	//ТекущийОбъект.ИтогоКоробок 	 	= Коробки.Количество(); 
	ТекущийОбъект.ИтогоКоробок 	 	= Коробки.Количество() - 1; 
	//- ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97260
	ТекущийОбъект.ИтогоНоменклатуры = Объект.Товары.Количество();
	//- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76489
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 18.05.23 УА #56286 

//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
&НаСервере
Функция ПечатьШтрихкода(Штрихкод)
	
	Данные = ПолучитьДанныеДляФормированияЭтикетки(Штрихкод);
	
	Макет = ПолучитьОбщийМакет("ЭтикеткаТовараFbo");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "Этикетка";		
	
	ОбластьМакетаОсновныеДанные = Макет.ПолучитьОбласть("ОсновныеДанные"); 
	
	ОбластьМакетаОсновныеДанные.Параметры.Состав = Данные.Состав;
	
	ОбластьМакетаОсновныеДанные.Параметры.Дата = Формат(ТекущаяДатаСеанса(), "ДЛФ=Д"); 
	
	ОбластьМакетаОсновныеДанные.Параметры.Бренд = Данные.Бренд;
	
	ОбластьМакетаОсновныеДанные.Параметры.Предмет = Данные.Предмет;
	
	ОбластьМакетаОсновныеДанные.Параметры.Цвет = Данные.Цвет;
	
	ОбластьМакетаОсновныеДанные.Параметры.Размер = Данные.Размер; 
	
	ОбластьМакетаОсновныеДанные.Параметры.Артикул = Данные.Артикул;
	
	ПараметрыШтрихкода = ПолучитьСтруктуруФормированияШтрихкода(Данные.Штрихкод);
	
	СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	
	Если СтруктураКартинки.Результат Тогда 
		ОбластьМакетаОсновныеДанные.Параметры.ШтрихкодКартинка = СтруктураКартинки.Картинка;
	КонецЕсли;

	ТабличныйДокумент.Вывести(ОбластьМакетаОсновныеДанные); 
	
	//+ ИнфоСофт Заварин К.В 15.02.24 УА #65734  
	ВыполнитьНастройкуТабличногоДокумента(ТабличныйДокумент,НастройкаПечатиШтрихкодов);
	 //- ИнфоСофт Заварин К.В 15.02.24 УА #65734
	
	Возврат ТабличныйДокумент;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254

//+ ИнфоСофт Заварин К.В 15.02.24 УА #65734 
&НаСервере
Процедура ВыполнитьНастройкуТабличногоДокумента(Этикетка, НастройкиПечати)
	
	Этикетка.ИмяПринтера = НастройкиПечати.ИмяПринтера; 
	Этикетка.ПолеСлева = НастройкиПечати.Слева;
	Этикетка.ПолеСправа = НастройкиПечати.Справа;
	Этикетка.ПолеСнизу = НастройкиПечати.Снизу;
	Этикетка.ПолеСверху = НастройкиПечати.Сверху;	
	Этикетка.РазмерКолонтитулаСверху = НастройкиПечати.КолонтитулыСверху;
	Этикетка.РазмерКолонтитулаСнизу = НастройкиПечати.КолонтитулыСнизу; 
	Этикетка.ЭкземпляровНаСтранице = НастройкиПечати.ЭкземпляровНаСтраницу; 	
	
	Если НастройкиПечати.ОриентацияСтраницы = 0 Тогда 
		Этикетка.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Иначе 
		Этикетка.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 03.12.24 УА #72698
	Если НастройкиПечати.Масштаб = 0 Тогда 
		Этикетка.АвтоМасштаб = Истина;
	Иначе 
		Этикетка.АвтоМасштаб = Ложь;
		Этикетка.МасштабПечати = НастройкиПечати.МасштабЗначение;	
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.12.24 УА #72698
	
КонецПроцедуры //- ИнфоСофт Заварин К.В 15.02.24 УА #65734 

//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
Функция ПолучитьСтруктуруФормированияШтрихкода(Штрихкод)
	
	СтруктураШтрихкода = Новый Структура;
	
	СтруктураШтрихкода.Вставить("Ширина", 280);
	СтруктураШтрихкода.Вставить("Высота", 100);
	СтруктураШтрихкода.Вставить("ТипКода", 2);
	СтруктураШтрихкода.Вставить("ОтображатьТекст", Истина);
	СтруктураШтрихкода.Вставить("Штрихкод", Штрихкод);
	
	Возврат СтруктураШтрихкода;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254

//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
Функция ПолучитьДанныеДляФормированияЭтикетки(Штрихкод) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ИС_WB_ШтрихкодыРазмеров.Размер, ЗНАЧЕНИЕ(Справочник.ИС_WB_РазмерыНоменклатур.ПустаяСсылка)) КАК Размер,
	|	ИС_WB_ШтрихкодыРазмеров.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ИС_WB_ШтрихкодыРазмеров.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
	|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
	|ГДЕ
	|	ИС_WB_ШтрихкодыРазмеров.Штрихкод = &Штрихкод
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_ШтрихкодыРазмеров.Размер,
	|	ИС_WB_ШтрихкодыРазмеров.Штрихкод
	//+ ИнфоСофт Стояк Ю.К. 25.06.2024 УА #77969
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.РазмерWB, ЗНАЧЕНИЕ(Справочник.ИС_WB_РазмерыНоменклатур.ПустаяСсылка)),
	|	ШтрихкодыНоменклатуры.Штрихкод
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ШтрихкодыНоменклатуры.Номенклатура = ИС_WB_СоответствиеРазмеров.Номенклатура
	|			И ШтрихкодыНоменклатуры.Характеристика = ИС_WB_СоответствиеРазмеров.Характеристика
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	|	И ИС_WB_СоответствиеРазмеров.Профиль = &Профиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.РазмерWB, ЗНАЧЕНИЕ(Справочник.ИС_WB_РазмерыНоменклатур.ПустаяСсылка)),
	|	ШтрихкодыНоменклатуры.Штрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_Данные.Размер КАК Размер,
	|	ВТ_Данные.Штрихкод КАК Штрихкод
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ГДЕ
	|	ВТ_Данные.Размер <> ЗНАЧЕНИЕ(Справочник.ИС_WB_РазмерыНоменклатур.ПустаяСсылка)";
	//- ИнфоСофт Стояк Ю.К. 25.06.2024 УА #77969
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат = Новый Структура;   
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		Результат.Вставить("Штрихкод", ВыборкаДетальныеЗаписи.Штрихкод);
		Результат.Вставить("Артикул", ВыборкаДетальныеЗаписи.Размер.Владелец.VendorCode); 
		Результат.Вставить("Предмет", ВыборкаДетальныеЗаписи.Размер.Владелец.object);
		Результат.Вставить("Размер", ВыборкаДетальныеЗаписи.Размер.techSize);
		Результат.Вставить("Состав", ПолучитьЗначенияПолейНоменклатурыВБ(ВыборкаДетальныеЗаписи.Размер.Владелец, "Состав")); 
		Результат.Вставить("Бренд", ПолучитьЗначенияПолейНоменклатурыВБ(ВыборкаДетальныеЗаписи.Размер.Владелец, "Бренд"));
        Результат.Вставить("Цвет", ПолучитьЗначенияПолейНоменклатурыВБ(ВыборкаДетальныеЗаписи.Размер.Владелец, "Цвет"));  
		
	КонецЦикла;  
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254

//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
&НаСервере
Функция ПолучитьЗначенияПолейНоменклатурыВБ(ОбъектДанных, Поле)
	
	Значение = ""; 
	
	Итератор = 0;
	
	Для Каждого Элемент Из ОбъектДанных.Характеристики Цикл 
		
		Если СокрЛП(Элемент.Поле) = Поле Тогда
			
			Если Итератор = 0 Тогда
				Значение = Элемент.Значение;
				Итератор = Итератор + 1;
			Иначе
				Значение = Значение + ", " + Элемент.Значение; 
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Значение;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254

//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
&НаСервере
Функция ПечатьШтрихкодаКоробки() 
	
	Макет = ПолучитьОбщийМакет("ПФ_MXL_ИС_MP_ШтрихкодКоробки");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "Штрихкод коробки";
	
	ОбластьМакетаОсновныеДанные = Макет.ПолучитьОбласть("ОсновныеДанные"); 
	
	ПараметрыШтрихкода = ПолучитьСтруктуруФормированияШтрихкода(Объект.АктивныйШтрихкод);
	
	СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	
	Если СтруктураКартинки.Результат Тогда 
		ОбластьМакетаОсновныеДанные.Параметры.ШтрихкодКартинка = СтруктураКартинки.Картинка;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьМакетаОсновныеДанные);
	
	//+ ИнфоСофт Заварин К.В 15.02.24 УА #65734  
	ВыполнитьНастройкуТабличногоДокумента(ТабличныйДокумент,НастройкаПечатиШтрихкодов);
	//- ИнфоСофт Заварин К.В 15.02.24 УА #65734
	
	Возврат ТабличныйДокумент;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254

//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
Функция НайтиПроверочныйШК(ШК)
 	Элемент = Справочники.ИС_MP_Баркоды.НайтиПоРеквизиту("Штрихкод", ШК); 
	Если ЗначениеЗаполнено(Элемент) Тогда
		Элемент = Элемент.ПолучитьОбъект();
		Возврат Элемент.Тип;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254

//+ ИнфоСофт Сумин Д.В. 15.11.2023 УА #60080
&НаСервере
Процедура ЗаполнитьДанныеНаСервере(ДанныеФормы, Комиссия25)
		
	УстановитьПривилегированныйРежим(Истина);

	Профиль = Объект.Профиль;
	
	Если Не ЗначениеЗаполнено(Профиль.Партнер) Тогда
		ТекстСообщения = СтрШаблон(
			"Не заполнен контрагент в настройках профиля для аккаунта: %1. Документ отчет комиссионера не создан.",
			Профиль);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");

		Если ЗначениеЗаполнено(Профиль.Договор) Тогда
			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(Профиль.Договор, "ХозяйственнаяОперация") = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию") Тогда
				ТекстСообщения = СтрШаблон(
					"В выбранный договор контрагента в настройках профиля для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли;
				ХозОперация = Профиль.Договор.ХозяйственнаяОперация;
		Иначе
			ТекстСообщения = СтрШаблон(
				"Не заполнен договор контрагента в настройках для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;

	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	Если ИспользоватьСоглашенияСКлиентами Тогда
		Если ЗначениеЗаполнено(Профиль.Соглашение) Тогда
			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(Профиль.Соглашение, "ХозяйственнаяОперация") = ХозОперация Тогда
				ТекстСообщения = СтрШаблон(
					"В выбранное соглашение с клиентом в настройках профиля для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли; 
			ХозОперация = Профиль.Соглашение.ХозяйственнаяОперация;
		Иначе
			ТекстСообщения = СтрШаблон(
				"Не заполнено соглашение с клиентом в настройках профиля для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;  
	
	Если Комиссия25 Тогда
		НовыйДокумент = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ПередачаТоваровХранителю"));	
	Иначе	
		НовыйДокумент = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.РеализацияТоваровУслуг"));	
	КонецЕсли;
	
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", Профиль.Организация);
	ДанныеЗаполнения.Вставить("Партнер", Профиль.Партнер);
	ДанныеЗаполнения.Вставить("Контрагент", Профиль.Контрагент);
	ДанныеЗаполнения.Вставить("Договор", Профиль.Договор);
	ДанныеЗаполнения.Вставить("Соглашение", Профиль.Соглашение);
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина);

	НовыйДокумент.Заполнить(ДанныеЗаполнения);
	
	НовыйДокумент.Партнер 				= Профиль.Партнер;
	НовыйДокумент.Контрагент 			= Профиль.Контрагент;
	НовыйДокумент.Договор 	 			= Профиль.Договор;
	НовыйДокумент.Соглашение 			= Профиль.Соглашение; 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 18.07.24 УА #79819
	Если Не Комиссия25 Тогда
		НовыйДокумент.ХозяйственнаяОперация = ХозОперация;
	Иначе
		НовыйДокумент.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;		
	КонецЕсли; 
	//- ИнфоСофт Мурсалимов Д.Р. 18.07.24 УА #79819
	
	ТаблицаТранзакций = ПолучитьСписокТоваров();
	
	ЗаполнитьТЧДокумента(НовыйДокумент, ТаблицаТранзакций);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц"); 
	
	Если Не Комиссия25 Тогда
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
			НовыйДокумент.Организация, НовыйДокумент.НалогообложениеНДС, НовыйДокумент.Дата));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
			ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент));
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
			НовыйДокумент.ЦенаВключаетНДС));
	КонецЕсли;
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйДокумент.Товары, СтруктураДействий, Неопределено);
	
	ЗначениеВДанныеФормы(НовыйДокумент, ДанныеФормы);
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры //- ИнфоСофт Сумин Д.В. 15.11.2023 УА #60080	

//+ ИнфоСофт Сумин Д.В. 16.11.2023 УА #60080
&НаСервере
Процедура ЗаполнитьТЧДокумента(НовыйДокумент, ТаблицаТранзакций)
	
	НовыйДокумент.Товары.Очистить();
	НовыйДокумент.ВидыЗапасов.Очистить();  
	
	ВидЦены = Объект.Профиль.ВидЦены;
	
	Для Каждого Транзакция Из ТаблицаТранзакций Цикл
		
		Если Транзакция.ЭтоНабор Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Транзакция.Номенклатура,
			"ТипНоменклатуры, ВидНоменклатуры");
			
			ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ПараметрыКомплектующих.Номенклатура   		= Транзакция.Номенклатура;
			ПараметрыКомплектующих.НоменклатураНабора   = Транзакция.Номенклатура;
			ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.Характеристика;				
			ПараметрыКомплектующих.КоличествоУпаковок	= Транзакция.Количество;
			ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
			ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
			ПараметрыКомплектующих.ЭтоТовар 			= Истина;
			ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
			
			Склады = Новый Массив;
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Дата", 		НовыйДокумент.Дата);
			ДополнительныеПараметры.Вставить("Валюта", 		НовыйДокумент.Валюта);
			ДополнительныеПараметры.Вставить("Склады", 		Склады);
			ДополнительныеПараметры.Вставить("Соглашение", 	НовыйДокумент.Соглашение);
			ДополнительныеПараметры.Вставить("Цена", 		Транзакция.Цена);
			ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.Цена);	
			ДополнительныеПараметры.Вставить("ВидЦены", ВидЦены); 
			//+ ИнфоСофт Стояк Ю.К. 28.02.2025 УА #93644
			ДополнительныеПараметры.Вставить("Комиссия", 0);			
						
			Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);			
			//Комплектующие = ИС_WB_Сервер.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);			
			//- ИнфоСофт Стояк Ю.К. 28.02.2025 УА #93644
			
			Для Каждого стрКомплекта Из Комплектующие Цикл
				НоваяСтрока = НовыйДокумент.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
				//+ ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95592				
				//НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
				//НоваяСтрока.КоличествоУпаковок 		= НоваяСтрока.КоличествоУпаковок;
				//- ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95592
				НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.Количество + стрКомплекта.Погрешность;
				НоваяСтрока.Склад 					= НовыйДокумент.Склад;
			КонецЦикла;						
		Иначе
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура 			= Транзакция.Номенклатура;
			НоваяСтрока.Характеристика 			= Транзакция.Характеристика;				
			НоваяСтрока.Количество			 	= Транзакция.Количество;
			НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
			НоваяСтрока.Цена 					= Транзакция.Цена;
			НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.Количество;
			НоваяСтрока.ВидЦены 				= ВидЦены;
			НоваяСтрока.Склад 					= НовыйДокумент.Склад;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 16.11.2023 УА #60080

//+ ИнфоСофт Сумин Д.В. 16.11.2023 УА #60080
&НаСервере
Функция ПолучитьСписокТоваров()
	
	Если ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование25") Тогда
		Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары             
		//+ ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163		
		|ГДЕ
		|	Товары.ШтрихкодКоробки <> """"          
		//- ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Количество КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатуры25СрезПоследних.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА
		|			ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|		ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|		КОНЕЦ КАК ЭтоНабор
		//+ ИнфоСофт Стояк Ю.К. 15.10.2024 УА #81510		
		//|ИЗ
		//|	ВТ_Товары КАК ВТ_Товары
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(, ) КАК ЦеныНоменклатуры25СрезПоследних
		//|			ПО (ВТ_Товары.Номенклатура = ЦеныНоменклатуры25СрезПоследних.Номенклатура)
		//|				И (ЦеныНоменклатуры25СрезПоследних.ВидЦены = &ВидЦены)";
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныНоменклатуры25СрезПоследних
		|			ПО (ВТ_Товары.Номенклатура = ЦеныНоменклатуры25СрезПоследних.Номенклатура)
		|				И (ВТ_Товары.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования = ЦеныНоменклатуры25СрезПоследних.ХарактеристикаЦО)";
		//- ИнфоСофт Стояк Ю.К. 15.10.2024 УА #81510
		
	Иначе
		Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		//+ ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163		
		|ГДЕ
		|	Товары.ШтрихкодКоробки <> """"          
		//- ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91163
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Количество КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА
		|			ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|		ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|		КОНЕЦ КАК ЭтоНабор
		//+ ИнфоСофт Стояк Ю.К. 15.10.2024 УА #81510		
		//|ИЗ
		//|	ВТ_Товары КАК ВТ_Товары
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
		//|			ПО (ВТ_Товары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
		//|				И (ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены)";
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ВТ_Товары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ВТ_Товары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика";
		//- ИнфоСофт Стояк Ю.К. 15.10.2024 УА #81510
	КонецЕсли;	
	
	
	Запрос = Новый Запрос(Текст);
	
	//+ ИнфоСофт Стояк Ю.К. 10.03.2025 УА #95748	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("ВидЦены");
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Объект.Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, МассивПараметров);
	
	//Запрос.УстановитьПараметр("ВидЦены", Объект.Профиль.ВидЦены);
	Запрос.УстановитьПараметр("ВидЦены", Результат.ВидЦены);       
	//- ИнфоСофт Стояк Ю.К. 10.03.2025 УА #95748
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Сумин Д.В. 16.11.2023 УА #60080	

//+ ИнфоСофт Сумин Д.В. 14.02.2024 УА #62253
&НаСервере   
Процедура ВыполнитьПроверкуКодаМаркировки(qrКод, Номенклатура) 
	
	МодульИнтерфейсИСМПКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсИСМПКлиентСервер");
	
	Если МодульИнтерфейсИСМПКлиентСервер = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Метод Api был изменен. Проверка не выполнена.");
		Возврат;
	КонецЕсли;
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(МодульИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии());
	
	Если КлючСессии = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Данные по коду не получены. Проверьте настройки интеграции ИС МП.");
		Возврат;
	КонецЕсли;	
	
	URLЗапроса = "api/v3/true-api/cises/info";
	
	ДанныеЗапроса = Новый Массив;
	ДанныеЗапроса.Добавить(qrКод);
	
	МодульИнтерфейсМОТПКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсМОТПКлиентСервер");
	
	Если МодульИнтерфейсМОТПКлиентСервер = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Метод Api был изменен. Проверка не выполнена.");
		Возврат;
	КонецЕсли;

	РезультатЗапроса = ИнтеграцияИСМП.ОтправитьДанныеВСервис(URLЗапроса, ДанныеЗапроса, КлючСессии, "POST",
		МодульИнтерфейсМОТПКлиентСервер.ПараметрыОтправкиHTTPЗапросов("", Истина));
	
	РезультатОтправкиЗапроса = ИнтерфейсМОТПСлужебный.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(РезультатОтправкиЗапроса.ТекстВходящегоСообщения);
	
	Если JSON[0].Свойство("cisInfo") Тогда
		Если JSON[0].cisInfo.status <> "INTRODUCED" Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Код маркировки не находится в обороте. Статус кода %1", JSON[0].cisInfo.status));	
		КонецЕсли;
		
		ИНН = JSON[0].cisInfo.ownerInn;
		
		ОрганизацияПоиска = Справочники.Организации.НайтиПоРеквизиту("ИНН", ИНН);
		
		Если ОрганизацияПоиска <> Объект.Профиль.Организация Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Отсканированный код принадлежит другой организации. Владелец %1, инн владельца: %2.", JSON[0].cisInfo.ownerName, ИНН)); 		
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Метод Api был изменен. Проверка не выполнена.");	
	КонецЕсли;	
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 14.02.2024 УА #62253	

//+ ИнфоСофт Сумин Д.В. 19.02.2024 УА #62253 
&НаСервере
Функция ПолучитьПрефиксНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_ПрефиксацияПоставкиFboСрезПоследних.Префикс КАК Префикс
	|ИЗ
	//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
	//|	РегистрСведений.ИС_WB_ПрефиксацияПоставкиFbo.СрезПоследних(&Период, ) КАК ИС_WB_ПрефиксацияПоставкиFboСрезПоследних";
	|	РегистрСведений.ИС_WB_ПрефиксацияПоставкиFbo.СрезПоследних(, ) КАК ИС_WB_ПрефиксацияПоставкиFboСрезПоследних";
	//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
	
	//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
	//Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";	
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий(); 
	
	Возврат ВыборкаДетальныеЗаписи.Префикс; 
	
КонецФункции //- ИнфоСофт Сумин Д.В. 19.02.2024 УА #62253

//+ ИнфоСофт Сумин Д.В. 19.02.2024 УА #62253 
&НаСервере
Функция НомерПоследнейКоробкиПлюсОдин()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_ШтрихкодыКоробокСрезПоследних.НомерКоробки КАК НомерКоробки
	|ИЗ
	//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
	//|	РегистрСведений.ИС_WB_ШтрихкодыКоробок.СрезПоследних(&Период, ) КАК ИС_WB_ШтрихкодыКоробокСрезПоследних";
	|	РегистрСведений.ИС_WB_ШтрихкодыКоробок.СрезПоследних(, ) КАК ИС_WB_ШтрихкодыКоробокСрезПоследних";
	//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
	
	//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
	//Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Номер = 1;
	Иначе	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();	
		Номер = ВыборкаДетальныеЗаписи.НомерКоробки + 1; 	
	КонецЕсли;
	
	Возврат Номер;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 19.02.2024 УА #62253

//+ ИнфоСофт Сумин Д.В. 19.02.2024 УА #62253
&НаСервере
Процедура ЗаписатьШтрихкодКоробки(АктивныйШтрихкод)
	
	МенеджерЗаписи = РегистрыСведений.ИС_WB_ШтрихкодыКоробок.СоздатьМенеджерЗаписи(); 
	
	МенеджерЗаписи.НомерКоробки = АктивныйШтрихкод;
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	
	МенеджерЗаписи.Записать();
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 19.02.2024 УА #62253

//+ ИнфоСофт Сумин Д.В. 16.11.2023 УА #60080 
&НаСервере
Функция ИспользуетсяСхемаКомиссии25()  
	
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	Профиль = Объект.Профиль;
	
	Если ИспользоватьДоговорыСКлиентами Тогда
		Если Не ЗначениеЗаполнено(Профиль.Договор) Тогда
			Возврат Ложь;
		Иначе
			Возврат Профиль.Договор.КомиссионныеПродажи25;	
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(Профиль.Соглашение) Тогда
			Возврат Ложь;
		Иначе
			Возврат Профиль.Соглашение.КомиссионныеПродажи25;	
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 16.11.2023 УА #60080

//+ ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842
&НаСервере
Функция ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения = Неопределено)

	Возврат ИС_MP_Маркировка.ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения, ЭтаФорма.УникальныйИдентификатор);	
			
КонецФункции //- ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842

//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340
&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Данные, ДополнительныеПараметры) Экспорт
	
	Если Данные.Штрихкод <> "" Тогда
		ШкПринадлежитКоробке = ПолучитьРезультатАктивизацииСтроки(СокрЛП(Данные.Штрихкод)); 
		
		Если ШкПринадлежитКоробке Тогда
			Возврат;	
		КонецЕсли;
		
		ДанныеШтрихкода = Новый Структура; 
		
		ДанныеШтрихкода.Вставить("ФорматBase64", Ложь); 
		ДанныеШтрихкода.Вставить("Штрихкод", СокрЛП(Данные.Штрихкод));
		ДанныеШтрихкода.Вставить("Количество", 1);
				
		ИС_MP_МаркировкаКлиентСервер.ЗакодироватьШтрихкодДанныхBase64(ДанныеШтрихкода); 
		
		ПараметрыСканирования = ИС_MP_МаркировкаКлиент.ПараметрыСканирования(ЭтаФорма);  
		
		РезультатОбработкиШтрихкода = ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования);
		
		ОбработатьШтрихкодыЗавершение(РезультатОбработкиШтрихкода.ДанныеШтрихкода, Неопределено);		
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340

//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340
&НаСервере
Функция ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура = Неопределено, Характеристика = Неопределено)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Характеристика) Тогда
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛОЖЬ КАК МаркированныйТовар,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ИС_WB_ШтрихкодыРазмеров.Штрихкод) КАК Штрихкод
	|ИЗ
	|	РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО ИС_WB_СоответствиеРазмеров.РазмерWB = ИС_WB_ШтрихкодыРазмеров.Размер
	|ГДЕ
	|	ИС_WB_СоответствиеРазмеров.Номенклатура = &Номенклатура
	|	И ИС_WB_СоответствиеРазмеров.Характеристика = &Характеристика
	|	И ИС_WB_СоответствиеРазмеров.Профиль = &Профиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_СоответствиеРазмеров.Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика";
	
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);  
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура); 
	Запрос.УстановитьПараметр("Характеристика", Характеристика); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда		
		ОбщегоНазначения.СообщитьПользователю("Не найдены данные по указанной позиции"); 		
		ДанныеНайдены = Ложь;                       
		Возврат Неопределено;		
	КонецЕсли;
	
	ТЗ = РезультатЗапроса.Выгрузить(); 
	Структура = Новый Структура;
	
	Для Каждого ИмяКолонки Из ТЗ.Колонки Цикл		
		Структура.Вставить(ИмяКолонки.Имя, ТЗ[0][ИмяКолонки.Имя]);
	КонецЦикла;
		
	ДанныеНайдены = Истина;	
	
	Возврат Структура;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340

#КонецОбласти
