#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ЭтоДобавлениеТоваров", ЭтоДобавлениеТоваров);
	Параметры.Свойство("Категория", Категория);
	//ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.НастройкиАккаунта)
	Аккаунт = Параметры.Аккаунт;  
	
	ИС_Ozon_Сервер.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Аккаунт);
	
	МассивПараметров = Новый Массив;
	
	МассивПараметров.Добавить("OzonВидЦеныСоСкидкой");
	МассивПараметров.Добавить("OzonВидЦены");
	МассивПараметров.Добавить("OzonВидЦеныМинимальный"); 
	
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Аккаунт, МассивПараметров);
	
	Если Настройки <> Неопределено Тогда	
		Price = Настройки["OzonВидЦеныСоСкидкой"];
		Min_price = Настройки["OzonВидЦеныМинимальный"];	
		Old_price = Настройки["OzonВидЦены"];
	Иначе
		Price = Справочники.ВидыЦен.ПустаяСсылка();			
		Min_price = Справочники.ВидыЦен.ПустаяСсылка();
		Old_price = Справочники.ВидыЦен.ПустаяСсылка();
	КонецЕсли;
	
	Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Price, "ВалютаЦены");
	ЗагрузитьЛимитыСозданияИОбновленияТоваров();
	
	ИС_Ozon_Сервер.УстановитьСвязиПараметровВыбораХарактеристикиИУпаковки(ЭтотОбъект);

	СписокОбязательныхХарактеристик = Новый ФиксированныйМассив(Новый Массив);

	ИнициализироватьХарактеристики();

	Если Не ЭтоДобавлениеТоваров Тогда
		Заголовок = "Редактирование товаров";
		Элементы.Категория.Доступность 						= Ложь;
		Элементы.Товары.КоманднаяПанель.Видимость 			= Ложь;
		Элементы.ДекорацияПодвал.Видимость					= Ложь;
		Элементы.ОбновлятьСопоставленныеТовары.Видимость 	= Ложь;
		Элементы.Номенклатура.Доступность 					= Ложь;
		Элементы.ХарактеристикаНоменклатуры.Доступность 	= Ложь;
		Элементы.Упаковка.Доступность 						= Ложь;
		Элементы.Артикул.ТолькоПросмотр						= Истина;
		ЗаполнитьТовары(Параметры.МассивРедактируемыхТоваров);
		ЗаполнитьАтрибутыТоваров();
	КонецЕсли;

	НеЗагруженыХарактеристики = Новый ФорматированнаяСтрока("Для данной категории товара отсутствуют характеристики.");
	
	//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
	Элементы.СопоставитьНоменклатуруАвтоматически.Видимость = СоздатьКарточкиПослеВыгрузки;
	//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	ПроверяемыеРеквизиты.Очистить();
	ПроверяемыеРеквизиты.Добавить("Номенклатура");
	ПроверяемыеРеквизиты.Добавить("Цена");
	ПроверяемыеРеквизиты.Добавить("СтавкаНДС");
	ПроверяемыеРеквизиты.Добавить("ВесУпаковки");
	ПроверяемыеРеквизиты.Добавить("ДлинаУпаковки");
	ПроверяемыеРеквизиты.Добавить("ШиринаУпаковки");
	ПроверяемыеРеквизиты.Добавить("ВысотаУпаковки");
	ПроверяемыеРеквизиты.Добавить("СсылкаНаГлавноеФото");
	ПроверяемыеРеквизиты.Добавить("Категория");
	ПроверяемыеРеквизиты.Добавить("Название");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПроверяемыеРеквизиты, СписокОбязательныхХарактеристик);

	РеквизитыТаблицы = ПолучитьРеквизиты("Товары");

	НомерСтроки = 1;
	Для Каждого стр Из Товары Цикл

		Если ЭтоДобавлениеТоваров И стр.product_id > 0 И Не ОбновлятьСопоставленныеТовары Тогда
			Продолжить;
		КонецЕсли;

		ИндексСтрокой = Формат(Товары.Индекс(стр), "ЧН=0; ЧГ=");
		Для Каждого реквизит Из РеквизитыТаблицы Цикл
			Если Не ПроверяемыеРеквизиты.Найти(реквизит.Имя) = Неопределено И Не ЗначениеЗаполнено(стр[реквизит.Имя])
				И Не (ТипЗнч(стр[реквизит.Имя]) = Тип("Число") И СтрНайти(Реквизит.Имя, "Атрибут_") > 1) Тогда

				ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон("В строке: %1  не заполнена колонка: %2", НомерСтроки, реквизит.Заголовок), , СтрШаблон(
					"Товары[%1].%2", ИндексСтрокой, реквизит.Имя));

				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		//Проверим Поле "Название" на наличие недопустимых символов
		Если ЗначениеЗаполнено(Стр.Название) И ИС_Ozon_Сервер.ЕстьНедопустимыеСимволыВСтроке(
			Стр.Название) Тогда

			ДопустимыеСимволы = "a-z A-Z а-я А-Я ёЁ 0-9 () "" ' & ; , : . / ? ! % * # № @ < > _ + -"
				+ " и символ ПРОБЕЛА";
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон("В строке: %1 колонка 'Название' содержит недопустимые символы!
						  |	Разрешены к использованию только: %2", НомерСтроки, ДопустимыеСимволы), , СтрШаблон(
				"Товары[%1].%2", ИндексСтрокой, "Название"));

			Отказ = Истина;

		КонецЕсли;

		МассивОшибок = Новый Массив;
		Если Не ПроверитьЦеныПередОбновлением(стр.Цена, стр.ЦенаДоСкидки, стр.ЦенаМинимальная,
			МассивОшибок) Тогда

			Если ЗначениеЗаполнено(МассивОшибок) Тогда

				Отказ = Истина;

				Для Каждого СтрокаОшибки Из МассивОшибок Цикл
					Если СтрокаОшибки.Свойство("ЦенаСтарая") Тогда
						ИмяКолонки = "ЦенаДоСкидки";
						Сообщение = СтрокаОшибки.ЦенаСтарая;
					ИначеЕсли СтрокаОшибки.Свойство("ЦенаМинимальная") Тогда
						ИмяКолонки = "ЦенаМинимальная";
						Сообщение = СтрокаОшибки.ЦенаМинимальная;
					Иначе
						Продолжить;
					КонецЕсли;

					ОбщегоНазначения.СообщитьПользователю(
						СтрШаблон("В строке: %1 %2", НомерСтроки, Сообщение), , СтрШаблон("Товары[%1].%2",
						ИндексСтрокой, ИмяКолонки));

				КонецЦикла;

			КонецЕсли;

		КонецЕсли;

		НомерСтроки = НомерСтроки + 1;

	КонецЦикла;
	
	Если Не КолонкаОбъединитьНаОднойКарточке = "" Тогда
		Для счПроверяемаяСтрока = 0 По Товары.Количество() - 1 Цикл 
			Если ЗначениеЗаполнено(Товары[счПроверяемаяСтрока][КолонкаОбъединитьНаОднойКарточке]) Тогда
						
				Для счСравниваемаяСтрока = счПроверяемаяСтрока + 1 По Товары.Количество() - 1 Цикл
					
					Если Не Товары[счПроверяемаяСтрока][КолонкаОбъединитьНаОднойКарточке] = Товары[счСравниваемаяСтрока][КолонкаОбъединитьНаОднойКарточке] Тогда
						Продолжить;
					КонецЕсли;
						
					КоличествоСовпадающихАспектныхХарактеристик = 0;
						
					Для Каждого колонка Из СписокАспектныхХарактеристик Цикл
						
						Если ЗначенияРавны(Товары[счПроверяемаяСтрока][колонка], Товары[счСравниваемаяСтрока][колонка]) Тогда
							
							КоличествоСовпадающихАспектныхХарактеристик = КоличествоСовпадающихАспектныхХарактеристик + 1;
						
						КонецЕсли;
					
					КонецЦикла;
						
					Если СписокАспектныхХарактеристик.Количество() = КоличествоСовпадающихАспектныхХарактеристик Тогда
						
						Отказ = Истина;
						ОбщегоНазначения.СообщитьПользователю(
							СтрШаблон("В строках: %1 и %2 значения всех аспектных атрибутов совпадают при объединении на одной карточке", счПроверяемаяСтрока + 1, счСравниваемаяСтрока + 1), , СтрШаблон("Товары[%1][%2]",
							счПроверяемаяСтрока, КолонкаОбъединитьНаОднойКарточке));
								
					КонецЕсли;
						
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)

	ИнициализироватьХарактеристики();

КонецПроцедуры

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
&НаКлиенте
Процедура СоздатьКарточкиПослеВыгрузкиПриИзменении(Элемент)
	
	Элементы.СопоставитьНоменклатуруАвтоматически.Видимость = СоздатьКарточкиПослеВыгрузки;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Не КатегорияЗаполнена() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если Копирование = Истина Тогда
		ИДСтроки = Элементы.Товары.ТекущаяСтрока;
		ТекущаяСтрока = Товары.НайтиПоИдентификатору(ИДСтроки);
		ТекущаяСтрока.Артикул = "";
		ЗаполнитьЗависимыРеквизиты(ИДСтроки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзображенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ВыбранныеЗначения = ТекущаяСтрока[Элемент.Имя].ВыгрузитьЗначения();

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВыбранныеЗначения", ВыбранныеЗначения);

	ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаМножественногоВыбораАтрибута", СтруктураПараметров, Элемент, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ИДстрокой = СтрРазделить(Элемент.Имя, "_")[1];
	Характеристика = ХарактеристикаПоКоду(ИДстрокой);
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Категория", Категория);
	СтруктураПараметров.Вставить("Характеристика", Характеристика);

	ОткрытьФорму("Справочник.ИС_Ozon_ЗначенияХарактеристик.ФормаВыбора", СтруктураПараметров, Элемент, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.ИзменилсяТовар = Истина;

КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ХарактеристикаНачалоМножественногоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ИДстрокой = СтрРазделить(Элемент.Имя, "_")[1];
	Характеристика = ХарактеристикаПоКоду(ИДстрокой);
	ВыбранныеЗначения = ТекущаяСтрока[Элемент.Имя].ВыгрузитьЗначения();

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВыбранныеЗначения", ВыбранныеЗначения);
	СтруктураПараметров.Вставить("Категория", Категория);
	СтруктураПараметров.Вставить("Характеристика", Характеристика);
	ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаМножественногоВыбораАтрибута", СтруктураПараметров, Элемент, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаОбработкаМножественногоВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока[Элемент.Имя].ЗагрузитьЗначения(ВыбранноеЗначение);
	ТекущаяСтрока.ИзменилсяТовар = Истина;

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Если ЭтоДобавлениеТоваров Тогда
		ИДСтроки = Элементы.Товары.ТекущаяСтрока;
		ЗаполнитьЗависимыРеквизиты(ИДСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЭтоДобавлениеТоваров Тогда
		СтандартнаяОбработка = Ложь;
		//ОбработатьВыбораСопоставленногоТовара(Элемент.Имя, ВыбранноеЗначение);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	Если ЭтоДобавлениеТоваров Тогда
		ИДСтроки = Элементы.Товары.ТекущаяСтрока;
		ЗаполнитьЗависимыРеквизиты(ИДСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЭтоДобавлениеТоваров Тогда
		СтандартнаяОбработка = Ложь;
		//ОбработатьВыбораСопоставленногоТовара(Элемент.Имя, ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	
	Если ЭтоДобавлениеТоваров Тогда
		ИДСтроки = Элементы.Товары.ТекущаяСтрока;
		ЗаполнитьЗависимыРеквизиты(ИДСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УпаковкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЭтоДобавлениеТоваров Тогда
		СтандартнаяОбработка = Ложь;
		//ОбработатьВыбораСопоставленногоТовара(Элемент.Имя, ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Штрихкод = ВыбранноеЗначение;
	ИзменениеОсновногоРеквизитаТовара();
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.ЗагрузитьЗначения(ШтрихкодыНоменклатуры(ТекущаяСтрока.Номенклатура,
		ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.Упаковка));
	
КонецПроцедуры

//&НаКлиенте
//Процедура FBSПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
//	Если Не ТекущаяСтрока.FBS Тогда
//		ВопросОбнулитьОстаткиНаOzon(ТекущаяСтрока, Ложь);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура RFBSПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
//	Если Не ТекущаяСтрока.RFBS Тогда
//		ВопросОбнулитьОстаткиНаOzon(ТекущаяСтрока, Истина);
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура АртикулПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

&НаКлиенте
Процедура НазваниеПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаДоСкидкиПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаМинимальнаяПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыШтрихкодПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

&НаКлиенте
Процедура ВесУпаковкиПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

&НаКлиенте
Процедура ДлинаУпаковкиПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаУпаковкиПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

&НаКлиенте
Процедура ВысотаУпаковкиПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаГлавноеФотоПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

&НаКлиенте
Процедура ИзображенияПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

&НаКлиенте
Процедура МаркетинговыйЦветПриИзменении(Элемент)
	ИзменениеОсновногоРеквизитаТовара();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПодбор(Команда)

	Если Не ЗначениеЗаполнено(Категория) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена Категория товаров", , "Категория");
		Возврат;
	КонецЕсли;

	ПараметрыФормыПодбораТоваров = ПараметрыФормыПодбораТоваров(Аккаунт, Валюта,
		УникальныйИдентификатор, Price);

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПодбора", ЭтотОбъект);
	ОткрытьФорму(ПараметрыФормыПодбораТоваров.ИмяФормы, ПараметрыФормыПодбораТоваров.ПараметрыФормы, ЭтотОбъект, , , ,
		Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКолонкуТекущимЗначением(Команда)

	ТекущиеДанные 	= Элементы.Товары.ТекущиеДанные;
	ИмяКолонки 		= Элементы.Товары.ТекущийЭлемент.Имя;

	ЭтоСписок = ТипЗнч(ТекущиеДанные[ИмяКолонки]) = Тип("СписокЗначений");
	Если ЭтоСписок Тогда
		Значение = ТекущиеДанные[ИмяКолонки].ВыгрузитьЗначения();
	Иначе
		Значение = ТекущиеДанные[ИмяКолонки];
	КонецЕсли;

	Для Каждого стр Из Товары Цикл

		Если ЭтоСписок Тогда
			стр[ИмяКолонки].ЗагрузитьЗначения(Значение);
		Иначе
			стр[ИмяКолонки] = Значение;
		КонецЕсли;

		Если Не (ИмяКолонки = "FBO" Или ИмяКолонки = "FBS" Или ИмяКолонки = "RFBS" Или ИмяКолонки = "ОУД") Тогда
			стр.ИзменилсяТовар 	= Истина;
		КонецЕсли;

	КонецЦикла;

	//Если (ИмяКолонки = "FBS" Или ИмяКолонки = "RFBS") И Значение = Ложь Тогда
	//	ВопросОбнулитьОстаткиНаOzon( , ИмяКолонки = "RFBS");
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКолонкуСопоставленнымиЗначениями(Команда)

	ИмяКолонки = Элементы.Товары.ТекущийЭлемент.Имя;
	Если Не ЭтоДобавлениеТоваров И ИмяКолонки = "Артикул" Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьКолонкуСопоставленнымиЗначениямиНаСервере(ИмяКолонки);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьТовары(Команда)

	Если ПроверитьЗаполнение() Тогда
		СохранитьТоварыНаСервере();		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подсказка(Команда)

	ТекущаяКолонка = Элементы.Товары.ТекущийЭлемент;

	Если ТекущаяКолонка <> Неопределено Тогда
		ТекстПодсказки = Элементы.Товары.ТекущийЭлемент.РасширеннаяПодсказка.Заголовок;
		ПоказатьПредупреждение( , ТекстПодсказки, , ТекущаяКолонка.Заголовок);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция КатегорияЗаполнена()

	Результат = Истина;

	Если Не ЗначениеЗаполнено(Категория) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена Категория товаров", , "Категория");
		Результат = Ложь;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#Область ПроцедурыОповещения

&НаКлиенте
Процедура ПослеЗакрытияПодбора(Результат, СтруктураПараметров) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		Если Результат.Свойство("АдресТоваровВХранилище") Тогда
			ПослеЗакрытияПодбораНаСервере(Результат.АдресТоваровВХранилище);
		Иначе
			ПослеЗакрытияПодбораНаСервере(Результат.АдресКорзиныВХранилище);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗакрытияПодбораНаСервере(АдресТоваровВХранилище)

	ТаблицаПодбора = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);

	ТаблицаНоменклатуры = ТаблицаНоменклатурыПоТаблицеПодбора(ТаблицаПодбора);

	ТаблицаТоваров = ПолучитьДанныеПоНоменклатуре(ТаблицаНоменклатуры);
	ЕстьНастройкиОсновныхРеквизитовДляКатегории = ИС_Ozon_Сервер.ЕстьНастройкиОсновныхРеквизитовДляКатегории(
		Категория);
	ТаблицаСоответствийЗначений = ИС_Ozon_Сервер.ТаблицаСоответствийДопРеквизитов(Категория,
		ЕстьНастройкиОсновныхРеквизитовДляКатегории);
	СтруктураПараметровЗначенийРеквизитовНоменклатуры = ИС_Ozon_Сервер.СтруктураПараметровЗначенийРеквизитовНоменклатуры(
		Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории);
	СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры = ИС_Ozon_Сервер.СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры(
		Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории);

	Для Каждого ДанныеНоменклатуры Из ТаблицаТоваров Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьСтрокуТовара(НоваяСтрока, ДанныеНоменклатуры, ТаблицаСоответствийЗначений,
			СтруктураПараметровЗначенийРеквизитовНоменклатуры,
			СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры);
	КонецЦикла;

КонецПроцедуры

//&НаКлиенте
//Процедура ВопросОбнулитьОстаткиНаOzon(ТекущаяСтрока = Неопределено, СкладRFBS)

//	Режим = РежимДиалогаВопрос.ДаНет;
//	МассивТоваров = Новый Массив;
//	Если ТекущаяСтрока = Неопределено Тогда

//		Для Каждого стрТовара Из Товары Цикл

//			СтруктураТовара = Новый Структура;
//			СтруктураТовара.Вставить("product_id", стрТовара.product_id);
//			СтруктураТовара.Вставить("offer_id", стрТовара.Артикул);
//			МассивТоваров.Добавить(СтруктураТовара);

//		КонецЦикла;

//	Иначе

//		СтруктураТовара = Новый Структура;
//		СтруктураТовара.Вставить("product_id", ТекущаяСтрока.product_id);
//		СтруктураТовара.Вставить("offer_id", ТекущаяСтрока.Артикул);
//		МассивТоваров.Добавить(СтруктураТовара);

//	КонецЕсли;

//	ДопПараметры = Новый Структура;
//	ДопПараметры.Вставить("МассивТоваров", МассивТоваров);
//	ДопПараметры.Вставить("СкладRFBS", СкладRFBS);

//	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбнулитьОстаткиНаOzon", ЭтотОбъект, ДопПараметры);
//	ТекстВопроса = СтрШаблон("Обнулить остатки на складах %1 Ozon?", ?(СкладRFBS, "RFBS", "FBS"));
//	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);

//КонецПроцедуры

//&НаКлиенте
//Процедура ПослеЗакрытияВопросаОбнулитьОстаткиНаOzon(Результат, СтруктураПараметров) Экспорт

//	Если Результат = КодВозвратаДиалога.Нет Тогда
//		Возврат;
//	КонецЕсли;

//	ОбнулитьОстаткиНаСервере(Аккаунт, СтруктураПараметров.МассивТоваров, СтруктураПараметров.СкладRFBS);

//КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ИзменениеОсновногоРеквизитаТовара()

	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.ИзменилсяТовар = Истина;

КонецПроцедуры

//&НаКлиенте
//Процедура ОбработатьВыбораСопоставленногоТовара(ИмяЭлемента, ВыбранноеЗначение)
//	
//		ТекДанные = Элементы.Товары.ТекущиеДанные;
//		Ozon_РаботаСТоварамиВызовСервера.УдалитьСоответствиеТовара(Аккаунт, ТекДанные.Номенклатура,
//			ТекДанные.ХарактеристикаНоменклатуры, ТекДанные.Упаковка);
//		ТекДанные[ИмяЭлемента] = ВыбранноеЗначение;
//		Если ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
//			
//			СтруктураСоответствияТовара = Ozon_РаботаСТоварамиВызовСервера.СтруктураСоответствияТовара();
//			ЗаполнитьЗначенияСвойств(СтруктураСоответствияТовара, ТекДанные);
//			СтруктураСоответствияТовара.Аккаунт 		= Аккаунт;
//			СтруктураСоответствияТовара.Характеристика 	= ТекДанные.ХарактеристикаНоменклатуры;
//			СтруктураСоответствияТовара.offer_id 		= ТекДанные.Артикул;
//			СтруктураСоответствияТовара.Категория 		= Категория;
//			
//			Ozon_РаботаСТоварамиВызовСервера.ДобавитьСоответствиеТовара(СтруктураСоответствияТовара);
//			
//		КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары(МассивРедактируемыхТоваров)

	Для Каждого СтруктураТовара Из МассивРедактируемыхТоваров Цикл
		стрТовары = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(стрТовары, СтруктураТовара);
		Если ЗначениеЗаполнено(стрТовары.images) Тогда
			стрТовары.Изображения.ЗагрузитьЗначения(ПреобразоватьJSONВСоответствие(
				стрТовары.images));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗависимыРеквизиты(ИДСтроки)

	ТаблицаНоменклатуры = ТаблицаЗначенийНоменклатуры();

	ТекущаяСтрока = Товары.НайтиПоИдентификатору(ИДСтроки);

	СтрНоменклатуры = ТаблицаНоменклатуры.Добавить();
	СтрНоменклатуры.Номенклатура 	= ТекущаяСтрока.Номенклатура;
	СтрНоменклатуры.Характеристика 	= ТекущаяСтрока.ХарактеристикаНоменклатуры;
	СтрНоменклатуры.Упаковка 		= ТекущаяСтрока.Упаковка;

	ТаблицаТоваров = ПолучитьДанныеПоНоменклатуре(ТаблицаНоменклатуры);
	ЕстьНастройкиОсновныхРеквизитовДляКатегории = ИС_Ozon_Сервер.ЕстьНастройкиОсновныхРеквизитовДляКатегории(
		Категория);

	Если ТаблицаТоваров.Количество() Тогда
		ЗаполнитьСтрокуТовара(ТекущаяСтрока, ТаблицаТоваров[0],
			ИС_Ozon_Сервер.ТаблицаСоответствийДопРеквизитов(Категория,
			ЕстьНастройкиОсновныхРеквизитовДляКатегории),
			ИС_Ozon_Сервер.СтруктураПараметровЗначенийРеквизитовНоменклатуры(Категория,
			ЕстьНастройкиОсновныхРеквизитовДляКатегории),
			ИС_Ozon_Сервер.СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры(Категория,
			ЕстьНастройкиОсновныхРеквизитовДляКатегории));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоНоменклатуре(ТаблицаНоменклатуры)

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	СтруктураПараметров.Вставить("Price", Price);
	СтруктураПараметров.Вставить("Old_price", Old_price);
	СтруктураПараметров.Вставить("Min_price", Min_price);
	СтруктураПараметров.Вставить("Аккаунт", Аккаунт);
	СтруктураПараметров.Вставить("Категория", Категория);
	СтруктураПараметров.Вставить("ВалютаПродажиНаOzon", ВалютаПродажиНаOzon);

	ТаблицаТоваров = ЗависимыеРеквизитыНоменклатуры(СтруктураПараметров);

	Возврат ТаблицаТоваров;

КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокуТовара(СтрокаТаблицы, ДанныеЗаполнения, ТаблицаСоответствийЗначений,
	
	СтруктураПараметровЗначенийРеквизитовНоменклатуры, СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры)
	
	Ozon_Константы = ИС_Ozon_Сервер.ПолучитьНастройкиСопоставления();
	РазделительФотографий = Ozon_Константы.РазделительФотографий;
	
	//Ozon_Константы = Ozon_КонстантыВызовСервера.ПрочитатьКонстанты();
	//РазделительФотографий = Ozon_Константы.ЗначенияПоИменам.РазделительФотографий;

	СоответствиеСтавокНДС = ИС_Ozon_Сервер.СоответствиеСтавокНДС();

	СтрокаТаблицы.Номенклатура 					= ДанныеЗаполнения.Номенклатура;
	СтрокаТаблицы.Упаковка 						= ДанныеЗаполнения.Упаковка;
	СтрокаТаблицы.ХарактеристикаНоменклатуры 	= ДанныеЗаполнения.Характеристика;
	СтрокаТаблицы.Артикул						= "";
	СтрокаТаблицы.Штрихкод 						= ДанныеЗаполнения.Штрихкод;
	СтрокаТаблицы.СтавкаНДС 					= СоответствиеСтавокНДС.Получить(ДанныеЗаполнения.СтавкаНДС);
	СтрокаТаблицы.product_id 					= ДанныеЗаполнения.product_id;
	СтрокаТаблицы.Цена							= ДанныеЗаполнения.Цена;
	СтрокаТаблицы.ЦенаДоСкидки					= ДанныеЗаполнения.ЦенаДоСкидки;
	СтрокаТаблицы.ЦенаМинимальная 				= ДанныеЗаполнения.ЦенаМинимальная;
	СтрокаТаблицы.ДлинаУпаковки 				= Макс(ДанныеЗаполнения.Высота, ДанныеЗаполнения.Глубина,
		ДанныеЗаполнения.Ширина);
	СтрокаТаблицы.ВысотаУпаковки 				= Мин(ДанныеЗаполнения.Высота, ДанныеЗаполнения.Глубина,
		ДанныеЗаполнения.Ширина);
	СтрокаТаблицы.ШиринаУпаковки 				= (ДанныеЗаполнения.Высота + ДанныеЗаполнения.Глубина
		+ ДанныеЗаполнения.Ширина) - (СтрокаТаблицы.ДлинаУпаковки + СтрокаТаблицы.ВысотаУпаковки);
	СтрокаТаблицы.ВесУпаковки 					= ДанныеЗаполнения.ВесУпаковки;
	СтрокаТаблицы.ИспользоватьХарактеристики 	= ДанныеЗаполнения.ИспользоватьХарактеристики;
	СтрокаТаблицы.ИспользоватьУпаковки 			= ДанныеЗаполнения.ИспользоватьУпаковки;
	СтрокаТаблицы.FBO 							= СхемаПродажFBO;
	СтрокаТаблицы.FBS 							= СхемаПродажFBS;
	СтрокаТаблицы.RFBS 							= СхемаПродажRFBS;

	Если ДанныеЗаполнения.product_id = 0 Тогда
		ИС_Ozon_Сервер.ЗаполнитьЗначенияПоДопРеквизитам(СтрокаТаблицы, ТаблицаСоответствийЗначений,
			РазделительФотографий);
		ИС_Ozon_Сервер.ЗаполнитьЗначенияПоРеквизитамНоменклатуры(СтрокаТаблицы,
			СтруктураПараметровЗначенийРеквизитовНоменклатуры, РазделительФотографий);
		ИС_Ozon_Сервер.ЗаполнитьЗначенияПоРеквизитамХарактеристикиНоменклатуры(СтрокаТаблицы,
			СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры, РазделительФотографий);
	Иначе
		СтрокаТаблицы.Артикул = ДанныеЗаполнения.offer_id;
		ЗаполнитьАтрибутыСтрокиПоДаннымOzon(ДанныеЗаполнения.product_id);
	КонецЕсли;

	Если СтрокаТаблицы.Артикул = "" Тогда
		СтрокаТаблицы.Артикул = ИС_Ozon_Сервер.Артикул(ДанныеЗаполнения.Номенклатура,
			ДанныеЗаполнения.Характеристика, ДанныеЗаполнения.Упаковка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАтрибутыТоваров()

	МассивProduct_id = Товары.Выгрузить().ВыгрузитьКолонку("product_id");
	//НастройкиАккаунта = Ozon_ОбщегоНазначенияВызовСервера.НастройкиАккаунта(Аккаунт);
	НастройкиСоединения = ИС_Ozon_СерверПовтИсп.ПолучитьНастройкиСоединения(Аккаунт);
		
	Если НастройкиСоединения = Неопределено Тогда
		ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	КонецЕсли;  
		
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапроса(ПараметрыЗапроса, НастройкиСоединения);
	
	СоответствиеАтрибутов = Новый Соответствие();
	СоответствиеЗначенийАтрибутов = Новый Соответствие();	
	
	// Заполняем за раз по 50 товаров, при разовом заполнении 100 товаров переполняется стек от объема информации
	// из-за ошибки в методе API не возвращается last_id и не работает limit.
	НомерЗапроса = 1;
	Пока Истина Цикл
		
		СрезПоТоварам = ИС_Ozon_Сервер.СрезМассива(МассивProduct_id, НомерЗапроса);
		Если Не ЗначениеЗаполнено(СрезПоТоварам) Тогда
			Прервать;
		КонецЕсли;
		
		Атрибуты = ИС_Ozon_API.ПолучитьАтрибутыТоваров(ПараметрыЗапроса, , СрезПоТоварам);
		Для Каждого Атрибут Из Атрибуты Цикл
	
			стрТовары = Товары.НайтиСтроки(Новый Структура("product_id", Атрибут.id))[0];
	
			стрТовары.ВесУпаковки			= Атрибут.weight;
			стрТовары.ДлинаУпаковки			= Атрибут.depth;
			стрТовары.ШиринаУпаковки		= Атрибут.width;
			стрТовары.ВысотаУпаковки		= Атрибут.height;
			стрТовары.МаркетинговыйЦвет		= Атрибут.color_image;
	
			ЗаполнитьЗначенияАтрибутов(стрТовары, Атрибут.attributes, Атрибут.complex_attributes,
				СоответствиеАтрибутов, СоответствиеЗначенийАтрибутов);
	
		КонецЦикла;
		
		НомерЗапроса = НомерЗапроса + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАтрибутыСтрокиПоДаннымOzon(product_id)

	МассивProduct_id = Новый Массив;
	МассивProduct_id.Добавить(product_id);

	//НастройкиАккаунта = Ozon_ОбщегоНазначенияВызовСервера.НастройкиАккаунта(Аккаунт);
	НастройкиСоединения = ИС_Ozon_СерверПовтИсп.ПолучитьНастройкиСоединения(Аккаунт);
		
	Если НастройкиСоединения = Неопределено Тогда
		ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	КонецЕсли;  
		
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапроса(ПараметрыЗапроса, НастройкиСоединения);

	СоответствиеСтавокНДС 	= ИС_Ozon_Сервер.СоответствиеСтавокНДС();

	стрТовары = Товары.НайтиСтроки(Новый Структура("product_id", product_id))[0]; 

	ДанныеПоТовару = ИС_Ozon_API.ПолучитьСписокТоваров(Аккаунт, ПараметрыЗапроса, Новый Структура("product_id", МассивProduct_id));
	Для Каждого Товар Из ДанныеПоТовару.Получить("items") Цикл

		стрТовары.Название 			= Товар.Получить("name");
		стрТовары.Штрихкод 			= Товар.Получить("barcode");
		стрТовары.Цена 				= Товар.Получить("price");
		стрТовары.ЦенаДоСкидки 		= Товар.Получить("old_price");
		стрТовары.СтавкаНДС 		= СоответствиеСтавокНДС.Получить(Товар.Получить("vat"));
		стрТовары.СсылкаНаГлавноеФото	= Товар.Получить("primary_image");
		стрТовары.МаркетинговыйЦвет		= Товар.Получить("color_image");
		стрТовары.images 				= ПреобразоватьДанныеВJSON(Товар.Получить(
			"images"));
		стрТовары.Изображения.ЗагрузитьЗначения(ПреобразоватьJSONВСоответствие(
			стрТовары.images));

	КонецЦикла;

	СоответствиеАтрибутов = Новый Соответствие();
	СоответствиеЗначенийАтрибутов = Новый Соответствие();
		
	Атрибуты = ИС_Ozon_API.ПолучитьАтрибутыТоваров(ПараметрыЗапроса, , МассивProduct_id);
	Для Каждого Атрибут Из Атрибуты Цикл

		стрТовары.ВесУпаковки			= Атрибут.Получить("weight");
		стрТовары.ДлинаУпаковки			= Атрибут.Получить("depth");
		стрТовары.ШиринаУпаковки		= Атрибут.Получить("width");
		стрТовары.ВысотаУпаковки		= Атрибут.Получить("height");

		ЗаполнитьЗначенияАтрибутов(стрТовары, Атрибут.Получить("attributes"), Атрибут.Получить("complex_attributes"),
			СоответствиеАтрибутов, СоответствиеЗначенийАтрибутов);

	КонецЦикла;

КонецПроцедуры

//&НаСервереБезКонтекста
//Процедура ОбнулитьОстаткиНаСервере(Аккаунт, МассивТоваров, СкладRFBS)

//	Ozon_РаботаСОстатками.ОбнулитьОстаткиНаOzon(Аккаунт, МассивТоваров, СкладRFBS);

//КонецПроцедуры

&НаСервере
Процедура ИнициализироватьХарактеристики()

	УдалитьХарактеристики();

	Элементы.ГруппаШапкаПредупреждение.Видимость = Ложь;

	Если ЗначениеЗаполнено(Категория) Тогда

		Если ИС_Ozon_Сервер.ХарактеристикиКатегорииНеЗагружены(Категория) Тогда

			Элементы.ГруппаШапкаПредупреждение.Видимость 	= Истина;
			Элементы.ГруппаТаблица.Доступность 				= Ложь;
			Элементы.СохранитьТовары.Доступность 			= Ложь;

		Иначе

			Элементы.ГруппаТаблица.Доступность 		= Истина;
			Элементы.СохранитьТовары.Доступность 	= Истина;
			ИмяТабличнойЧасти = "Товары";

			ОбязательныеХарактеристики 	= Новый Массив;
			АспектныеХарактеристики 	= Новый Массив;

			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Ozon_Характеристики.Наименование КАК Наименование,
			|	Ozon_Характеристики.Описание КАК Описание,
			|	Ozon_Характеристики.ИДСправочникаЗначенийХарактеристики КАК ИДСправочникаЗначенийХарактеристики,
			|	Ozon_Характеристики.НаборЗначений КАК НаборЗначений,
			|	Ozon_Характеристики.ТипХарактеристики КАК ТипХарактеристики,
			|	Ozon_КатегорииТоваровХарактеристики.Обязательная КАК Обязательная,
			|	Ozon_Характеристики.Код КАК Код,
			|	Ozon_КатегорииТоваровХарактеристики.Аспектная
			|ИЗ
			|	Справочник.ИС_Ozon_КатегорииТоваров.Характеристики КАК Ozon_КатегорииТоваровХарактеристики
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Характеристики КАК Ozon_Характеристики
			|		ПО Ozon_КатегорииТоваровХарактеристики.Характеристика = Ozon_Характеристики.Ссылка
			|ГДЕ
			|	Ozon_КатегорииТоваровХарактеристики.Ссылка = &Категория
			|	И НЕ Ozon_КатегорииТоваровХарактеристики.НеИспользовать
			|
			|УПОРЯДОЧИТЬ ПО
			|	Обязательная УБЫВ";

			Запрос.УстановитьПараметр("Категория", Категория);

			РезультатЗапроса = Запрос.Выполнить();

			Выборка = РезультатЗапроса.Выбрать();
			//@skip-check new-color
			ЦветФона = Новый Цвет(255, 255, 255);
			//@skip-check new-color
			ЦветФонаАспектный = Новый Цвет(0, 150, 70);
			
			Пока Выборка.Следующий() Цикл

				ИмяРеквизита 		= "Атрибут_" + Формат(Выборка.Код, "ЧГ=0");
				МножественныйВыбор  = Выборка.НаборЗначений;
				ТипРеквизита 		= ИС_Ozon_Сервер.ТипРеквизита(Выборка.ТипХарактеристики,
					МножественныйВыбор, Выборка.ИДСправочникаЗначенийХарактеристики > 0);
				ПутьКДанным  		= ?(ИмяТабличнойЧасти = "", ИмяРеквизита, ИмяТабличнойЧасти + "." + ИмяРеквизита);
				СоздатьРеквизитФормы(ИмяРеквизита, ТипРеквизита, Выборка.Наименование, ИмяТабличнойЧасти);

				Если Выборка.Обязательная Тогда
					ОбязательныеХарактеристики.Добавить(ИмяРеквизита);
				КонецЕсли;
				
				Если Выборка.Аспектная Тогда
					АспектныеХарактеристики.Добавить(ИмяРеквизита);
					СоздатьПолеФормы(Выборка, ИмяРеквизита, ПутьКДанным, МножественныйВыбор, ЦветФонаАспектный);
				Иначе
					СоздатьПолеФормы(Выборка, ИмяРеквизита, ПутьКДанным, МножественныйВыбор, ЦветФона);
				КонецЕсли;
				
				Если Выборка.Наименование = "Объединить на одной карточке" Тогда
					КолонкаОбъединитьНаОднойКарточке = ИмяРеквизита;	
				КонецЕсли;
				
			КонецЦикла;

			СписокОбязательныхХарактеристик = Новый ФиксированныйМассив(ОбязательныеХарактеристики);
			СписокАспектныхХарактеристик 	= Новый ФиксированныйМассив(АспектныеХарактеристики);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УдалитьХарактеристики()

	ЭлементыХарактеристик = Элементы.ГруппаХарактеристики.ПодчиненныеЭлементы;

	УдаляемыеПоля = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;

	Для Каждого Элемент Из ЭлементыХарактеристик Цикл
		УдаляемыеПоля.Добавить(Элемент);
		УдаляемыеРеквизиты.Добавить(Элемент.ПутьКДанным);
	КонецЦикла;

	Для Каждого Элемент Из УдаляемыеПоля Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;

	ИзменитьРеквизиты( , УдаляемыеРеквизиты);

КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитФормы(ИмяРеквизита, Тип, ЗаголовокПоля = "", ИмяТабличнойЧасти = "")

	ДобавляемыеРеквизиты = Новый Массив;

	ИмяРеквизита = ИмяРеквизита;
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Тип, ИмяТабличнойЧасти, ЗаголовокПоля);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);

	ИзменитьРеквизиты(ДобавляемыеРеквизиты);

КонецПроцедуры


&НаСервере
Процедура СоздатьПолеФормы(Выборка, ИмяРеквизита, ПутьКДанным, МножественныйВыбор, ЦветФона)

	ГруппаФормы = Элементы.ГруппаХарактеристики;
	type 		= НРег(Выборка.ТипХарактеристики);
	ВидПоля		= ВидПоля(type);
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), ГруппаФормы);
	НовыйЭлемент.ПутьКДанным 	= ПутьКДанным;
	НовыйЭлемент.Вид 			= ВидПоля;
	НовыйЭлемент.Заголовок		= Выборка.Наименование + ?(Выборка.Обязательная, "*", "");
	
	// Оформление
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	Подсказка = Новый ФорматированнаяСтрока(Выборка.Описание, Новый Шрифт(, 10, Истина));
	НовыйЭлемент.РасширеннаяПодсказка.Заголовок = Подсказка;
	НовыйЭлемент.ОтображениеПодсказки 			= ОтображениеПодсказки.Кнопка;
	НовыйЭлемент.ЦветФонаЗаголовка 				= ЦветФона;
	Если type = "multiline" Тогда
		НовыйЭлемент.МногострочныйРежим 	= Истина;
		НовыйЭлемент.Высота 				= 1;
		НовыйЭлемент.РастягиватьПоВертикали = Ложь;
	КонецЕсли;

	Если Не НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка Тогда
		НовыйЭлемент.РастягиватьПоГоризонтали 	= Истина;
		НовыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
		НовыйЭлемент.АвтоОтметкаНезаполненного 	= Выборка.Обязательная;
		НовыйЭлемент.КнопкаОчистки 	= Истина;
	КонецЕсли;
	
	// Выбор из списка
	Если Выборка.ИДСправочникаЗначенийХарактеристики > 0 И Не МножественныйВыбор И Не type = "boolean" Тогда
		НовыйЭлемент.КнопкаВыбора 				= Истина;
		НовыйЭлемент.ОтображениеКнопкиВыбора 	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		НовыйЭлемент.ИсторияВыбораПриВводе  	= ИсторияВыбораПриВводе.НеИспользовать;
		НовыйЭлемент.КнопкаВыпадающегоСписка 	= Ложь;
		НовыйЭлемент.КнопкаСоздания 			= Ложь;
		НовыйЭлемент.КнопкаОткрытия 			= Ложь;
		НовыйЭлемент.РедактированиеТекста 		= Ложь;
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ХарактеристикаНачалоВыбора");
	КонецЕсли;

	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ХарактеристикаПриИзменении");

	Если МножественныйВыбор Тогда
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ХарактеристикаНачалоМножественногоВыбора");
		НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", "ХарактеристикаОбработкаМножественногоВыбора");
		НовыйЭлемент.КнопкаВыбора 	= Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияАтрибутов(ОбъектЗаполнения, Атрибуты, КомплексныеАтрибуты, СоответствиеАтрибутов, СоответствиеЗначенийАтрибутов)

	Если ЗначениеЗаполнено(Атрибуты) Тогда
//		ЗначенияАтрибутов = Ozon_ИнтернетЗапросыВызовСервера.ПреобразоватьJSONВСоответствие(Атрибуты);
		ЗаполнитьАтрибуты(ОбъектЗаполнения, Атрибуты, СоответствиеАтрибутов, СоответствиеЗначенийАтрибутов);
	КонецЕсли;

	Если ЗначениеЗаполнено(КомплексныеАтрибуты) Тогда
//		ЗначенияКомплексныхАтрибутов = Ozon_ИнтернетЗапросыВызовСервера.ПреобразоватьJSONВСоответствие(КомплексныеАтрибуты);
		ЗаполнитьКомплексныеАтрибуты(ОбъектЗаполнения, КомплексныеАтрибуты, СоответствиеАтрибутов, СоответствиеЗначенийАтрибутов);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАтрибуты(ОбъектЗаполнения, ЗначенияАтрибутов, СоответствиеАтрибутов, СоответствиеЗначенийАтрибутов)

	Для Каждого Атрибут Из ЗначенияАтрибутов Цикл

		Значения = Атрибут.Получить("values");
		Если Значения.Количество() Тогда

			ИмяРеквизита = "Атрибут_" + Формат(Атрибут.Получить("attribute_id"), "ЧГ=0");
			Попытка

				Если ТипЗнч(ОбъектЗаполнения[ИмяРеквизита]) = Тип("СписокЗначений") Тогда
					ОбъектЗаполнения[ИмяРеквизита].ЗагрузитьЗначения(ЗначениеАтрибута(Атрибут, СоответствиеАтрибутов, СоответствиеЗначенийАтрибутов));
				Иначе
					Значение = ЗначениеАтрибута(Атрибут, СоответствиеАтрибутов, СоответствиеЗначенийАтрибутов);
					УстанавливаемоеЗначение = Значение[0];
					Если ТипЗнч(УстанавливаемоеЗначение) = Тип("Строка") И (СтрНайти(НРег(УстанавливаемоеЗначение),
						"<br>") > 0 Или СтрНайти(НРег(УстанавливаемоеЗначение), "<br/>") > 0 Или СтрНайти(НРег(
						УстанавливаемоеЗначение), "</br>") > 0) Тогда
						УстанавливаемоеЗначение = ИС_Ozon_Сервер.ПреобразоватьHTMLВМногострочныйТекст(
							УстанавливаемоеЗначение);
					КонецЕсли;
					ОбъектЗаполнения[ИмяРеквизита] = УстанавливаемоеЗначение;
				КонецЕсли;

			Исключение

				Продолжить;

			КонецПопытки;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомплексныеАтрибуты(ОбъектЗаполнения, ЗначенияКомплексныхАтрибутов, СоответствиеАтрибутов, СоответствиеЗначенийАтрибутов)

	Для Каждого МассивАтрибутов Из ЗначенияКомплексныхАтрибутов Цикл
		ЗначенияАтрибутов = МассивАтрибутов.Получить("attributes");
		ЗаполнитьАтрибуты(ОбъектЗаполнения, ЗначенияАтрибутов, СоответствиеАтрибутов, СоответствиеЗначенийАтрибутов);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЗначениеАтрибута(Атрибут, СоответствиеАтрибутов, СоответствиеЗначенийАтрибутов)

	Характеристика = СоответствиеАтрибутов.Получить(Атрибут.Получить("attribute_id"));
	Если Характеристика = Неопределено Тогда
		Характеристика = Справочники.ИС_Ozon_Характеристики.НайтиПоКоду(Атрибут.Получить("attribute_id"));
		СоответствиеАтрибутов.Вставить(Атрибут.Получить("attribute_id"), Характеристика);
	КонецЕсли;
	
	Результат = Новый Массив;

	Значения = Атрибут.Получить("values");
	Для Каждого Значение Из Значения Цикл
		ЗначениеСправочника = Неопределено;
		
		Если Значение.Получить("dictionary_value_id") > 0 Тогда
			
			ЗначенияАтрибутовХарактеристики = СоответствиеЗначенийАтрибутов.Получить(Характеристика);
			Если ЗначенияАтрибутовХарактеристики <> Неопределено Тогда
				ЗначениеСправочника = ЗначенияАтрибутовХарактеристики.Получить(Значение.Получить("dictionary_value_id"));	
			Иначе
				СоответствиеЗначенийАтрибутов.Вставить(Характеристика, Новый Соответствие);
			КонецЕсли;
			
			Если ЗначениеСправочника = Неопределено Тогда	
				
				ЗначениеСправочника = Справочники.ИС_Ozon_ЗначенияХарактеристик.НайтиПоКоду(Значение.Получить(
					"dictionary_value_id"), , , Характеристика);
				
				СоответствиеЗначенийАтрибутов.Получить(Характеристика)
					.Вставить(Значение.Получить("dictionary_value_id"), ЗначениеСправочника);
				
			КонецЕсли;
		КонецЕсли;

		Если ЗначениеЗаполнено(ЗначениеСправочника) Тогда
			Результат.Добавить(ЗначениеСправочника);
		Иначе
			Результат.Добавить(Значение.Получить("value"));
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗаполнитьКолонкуСопоставленнымиЗначениямиНаСервере(ИмяКолонки)

	ЕстьНастройкиОсновныхРеквизитовДляКатегории = ИС_Ozon_Сервер.ЕстьНастройкиОсновныхРеквизитовДляКатегории(
		Категория);
	ТаблицаСоответствийЗначений = ИС_Ozon_Сервер.ТаблицаСоответствийДопРеквизитов(Категория,
		ЕстьНастройкиОсновныхРеквизитовДляКатегории);
	СтруктураПараметровЗначенийРеквизитовНоменклатуры = ИС_Ozon_Сервер.СтруктураПараметровЗначенийРеквизитовНоменклатуры(
		Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории);
	СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры = ИС_Ozon_Сервер.СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры(
		Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории);
		
	Ozon_Константы = ИС_Ozon_Сервер.ПолучитьНастройкиСопоставления();
	РазделительФотографий = Ozon_Константы.РазделительФотографий;
	//Ozon_Константы = Ozon_КонстантыВызовСервера.ПрочитатьКонстанты();
	//РазделительФотографий = Ozon_Константы.ЗначенияПоИменам.РазделительФотографий;

	Для Каждого СтрокаТаблицы Из Товары Цикл

		ИС_Ozon_Сервер.ЗаполнитьЗначенияПоДопРеквизитам(СтрокаТаблицы, ТаблицаСоответствийЗначений,
			РазделительФотографий, ИмяКолонки);
		ИС_Ozon_Сервер.ЗаполнитьЗначенияПоРеквизитамНоменклатуры(СтрокаТаблицы,
			СтруктураПараметровЗначенийРеквизитовНоменклатуры, РазделительФотографий, ИмяКолонки);
		ИС_Ozon_Сервер.ЗаполнитьЗначенияПоРеквизитамХарактеристикиНоменклатуры(СтрокаТаблицы,
			СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры, РазделительФотографий, ИмяКолонки);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СохранитьТоварыНаСервере()

	МассивТоваров = Новый Массив;
	ПоляАтрибутов = Элементы.ГруппаХарактеристики.ПодчиненныеЭлементы;
	Для Каждого стр Из Товары Цикл

		Если (Не ЭтоДобавлениеТоваров И Не стр.ИзменилсяТовар) Или (ЭтоДобавлениеТоваров И стр.product_id > 0
			И Не ОбновлятьСопоставленныеТовары) Тогда
			Продолжить;
		КонецЕсли;

		Если стр.Артикул = "" Тогда
			стр.Артикул = ИС_Ozon_Сервер.Артикул(стр.Номенклатура, стр.ХарактеристикаНоменклатуры,
				стр.Упаковка);
		КонецЕсли;

		СтруктураТовара = ИС_Ozon_Сервер.ЗаполнитьСтруктуруДобавленияТовара(стр, ПоляАтрибутов,
			Категория.Родитель);
			
		//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
		Если СопоставитьНоменклатуруАвтоматически Тогда
				
			ДанныеСопоставления = СтруктураСопоставленияТовара();
			ЗаполнитьЗначенияСвойств(ДанныеСопоставления, стр);
				
			СтруктураТовара.Вставить("ДанныеСопоставления", ДанныеСопоставления);
				
		КонецЕсли;
		//- ИнфоСофт Власова И.С. 02.12.24 УА #62619	
			
		МассивТоваров.Добавить(СтруктураТовара);

	КонецЦикла;

	ТЧТовары = Товары.Выгрузить( ,
		"Номенклатура, ХарактеристикаНоменклатуры, Упаковка, Артикул, product_id, FBO, FBS, RFBS, ОУД");

	НомерЗапроса = 1;	
	НастройкиСоединения = ИС_Ozon_СерверПовтИсп.ПолучитьНастройкиСоединения(Аккаунт);
		
	Если НастройкиСоединения = Неопределено Тогда
		ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	КонецЕсли;  
		
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапроса(ПараметрыЗапроса, НастройкиСоединения);
	Пока Истина Цикл

		СрезТовары = ИС_Ozon_Сервер.СрезМассива(МассивТоваров, НомерЗапроса, 100);
		Если Не ЗначениеЗаполнено(СрезТовары) Тогда
			Прервать;
		КонецЕсли;

		task_id = ИС_Ozon_API.ЗагрузитьТоварыНаOzon(ПараметрыЗапроса, СрезТовары);
		Если ЗначениеЗаполнено(task_id) Тогда
			ОбщегоНазначения.СообщитьПользователю("Создана задача по выгрузке товаров с id " + Строка(task_id));
			
			//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
			Если СоздатьКарточкиПослеВыгрузки Тогда
				СоздатьСопоставитьНоменклатуру(task_id, СрезТовары);
			КонецЕсли;
			//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
		КонецЕсли;

		НомерЗапроса = НомерЗапроса + 1;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЗначенияРавны(Знач1, Знач2) 
		
	Если ТипЗнч(Знач1) = Тип("СписокЗначений") Тогда
	
		Если Знач1.Количество() = Знач2.Количество() Тогда
			Результат = Истина;
			Для Каждого элем Из Знач1 Цикл
				Если знач2.НайтиПоЗначению(элем.Значение) = Неопределено Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;		
			КонецЦикла;	
		Иначе
			Результат = Ложь;	
		КонецЕсли;
		
	Иначе	
		Результат = Знач1 = Знач2;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьЛимитыСозданияИОбновленияТоваров()
	
	Лимиты = ИС_Ozon_Сервер.ЗагрузитьЛимитыСозданияИОбновленияТоваров(Аккаунт);
	
	Если Лимиты.Количество() Тогда
		Если ЭтоДобавлениеТоваров Тогда
			ЛимитОстаток = Лимиты.Получить("daily_create").Получить("limit") - Лимиты.Получить("daily_create").Получить("usage");
			Текст = "Лимит на создание товаров";		
		Иначе
			ЛимитОстаток = Лимиты.Получить("daily_update").Получить("limit") - Лимиты.Получить("daily_update").Получить("usage");
			Текст = "Лимит на обновление товаров";
		КонецЕсли;
		Элементы.ДекорацияЛимит.Заголовок = СтрШаблон("%1 - %2;", Текст, ЛимитОстаток);
	КонецЕсли;
	
КонецПроцедуры 

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
&НаСервере
Функция СтруктураСопоставленияТовара()
	
	СтруктураСопоставления = Новый Структура;
	
	СтруктураСопоставления.Вставить("Номенклатура");
	СтруктураСопоставления.Вставить("ХарактеристикаНоменклатуры");
	СтруктураСопоставления.Вставить("Упаковка");
	
	Возврат СтруктураСопоставления;
	
КонецФункции //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
&НаСервере
Процедура СоздатьСопоставитьНоменклатуру(НомерЗадания, МассивТоваров)
	
	Перезаполнять = Истина;
	
	МассивИдентификаторов = Новый Массив;
	
	Для Каждого Товар Из МассивТоваров Цикл
		МассивИдентификаторов.Добавить(Товар.Артикул);
	КонецЦикла;	
	
	МассивНоменклатуры = ИС_Ozon_Сервер.СоздатьИзменитьНоменклатуруПоИдентификаторам(Аккаунт, МассивИдентификаторов, Перезаполнять);
	
	Если МассивНоменклатуры.Количество() > 0 Тогда
		
		Если СопоставитьНоменклатуруАвтоматически Тогда
			
			Для Каждого Элемент Из МассивНоменклатуры Цикл
				
				НайденныеСтроки = МассивТоваров.НайтиСтроки(Новый Структура("Артикул", Элемент.offer_id));
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					
					ДанныеСопоставления = НайденныеСтроки[0].ДанныеСопоставления;
					
					Если Не ЗначениеЗаполнено(ДанныеСопоставления.Упаковка) Тогда			
						ДанныеСопоставления.Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСопоставления.Номенклатура, "ЕдиницаИзмерения");		
					КонецЕсли;
					
					ИС_Ozon_Сервер.ДобавитьСоответствиеНоменклатуры(Аккаунт, Элемент.НоменклатураОзон, 
						ДанныеСопоставления.Номенклатура, ДанныеСопоставления.ХарактеристикаНоменклатуры, ДанныеСопоставления.Упаковка);
					
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе	
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'По задаче №%1 не удалось создать номенклатуру Ozon, сопоставление не будет выполнено'"), НомерЗадания));
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

//----------------------------------------------------------

&НаСервереБезКонтекста
Функция ПроверитьЦеныПередОбновлением(ЦенаТекущая, ЦенаСтарая, ЦенаМинимальная, МассивОшибок = Неопределено) Экспорт

	Результат = Истина;

	ВыводитьОшибкиСразу = Ложь;
	Если МассивОшибок = Неопределено Тогда
		ВыводитьОшибкиСразу = Истина;
		МассивОшибок = Новый Массив;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЦенаТекущая) Тогда
		МассивОшибок.Добавить(Новый Структура("ЦенаТекущая",
			"Основная цена не может быть равна нулю! Цены по товару не установлены!"));
		Результат = Ложь;
	КонецЕсли;

	Если ЗначениеЗаполнено(ЦенаМинимальная) Тогда 
		// Цена до скидки должна быть выше текущей цены.
		Если ЦенаМинимальная > ЦенаТекущая Тогда
			МассивОшибок.Добавить(Новый Структура("ЦенаМинимальная",
				"Минимальная цена должна быть меньше или равна текущей цене! Цены по товару не установлены!"));
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ЦенаСтарая) Тогда 
		// Цена до скидки должна быть выше текущей цены.
		Если Не (ЦенаСтарая > ЦенаТекущая) Тогда
			МассивОшибок.Добавить(Новый Структура("ЦенаСтарая",
				"Цена до скидки должна быть выше текущей цены! Цены по товару не установлены!"));
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если ВыводитьОшибкиСразу Тогда
		Для Каждого СтрокаОшибки Из МассивОшибок Цикл
			Если СтрокаОшибки.Свойство("ЦенаСтарая") Тогда
				Сообщение = СтрокаОшибки.ЦенаСтарая;
			ИначеЕсли СтрокаОшибки.Свойство("ЦенаМинимальная") Тогда
				Сообщение = СтрокаОшибки.ЦенаМинимальная;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Результат;

КонецФункции 

&НаСервереБезКонтекста
Функция ХарактеристикаПоКоду(ИДстрокой)
	Возврат ИС_Ozon_Сервер.ХарактеристикаПоКоду(ИДстрокой);	
КонецФункции

&НаСервере
Функция ПреобразоватьJSONВСоответствие(JSONСтрокой, ИменаСвойствСоЗначениямиДата = Неопределено,
	ОжидаемыйФорматДаты = Неопределено, ИмяФункцииВосстановления = Неопределено,
	МодульФункцииВосстановления = Неопределено, ИменаСвойствДляОбработкиВосстановления = Неопределено) Экспорт

	ИспользуемыйФорматДаты = ?(ОжидаемыйФорматДаты = Неопределено, ФорматДатыJSON.ISO, ОжидаемыйФорматДаты);

	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(JSONСтрокой);
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Истина, ИменаСвойствСоЗначениямиДата, ИспользуемыйФорматДаты,
			ИмяФункцииВосстановления, МодульФункцииВосстановления, , ИменаСвойствДляОбработкиВосстановления);
		ЧтениеJSON.Закрыть();
	Исключение
		ИмяСобытия 	= "ПреобразоватьJSONВСоответствие";
		Комментарий = "Не удалось прочитать JSON: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДанныеJSON = Новый Соответствие;
	КонецПопытки;

	Возврат ДанныеJSON;

КонецФункции 

&НаСервереБезКонтекста
Функция ВидПоля(type) Экспорт

	ВидПоля = ВидПоляФормы.ПолеВвода;

	Если НРег(type) = "boolean" Тогда
		ВидПоля = ВидПоляФормы.ПолеФлажка;
	КонецЕсли;

	Возврат ВидПоля;

КонецФункции 

&НаСервереБезКонтекста
Функция ПроверитьИЗаполнитьПараметрыЗапроса(ПараметрыЗапроса, НастройкиСоединения)
      
    Если Не ЗначениеЗаполнено(НастройкиСоединения["OzonАдресСервисаAPI"]) Тогда
   		ОбщегоНазначения.СообщитьПользователю(
   			"Для данного профиля не заполнен ""Адрес Сервиса Ozon"", проверьте настройки авторизации");
   		Возврат Ложь;
   	КонецЕсли;
   	
   	Если Не ЗначениеЗаполнено(НастройкиСоединения["OzonApiKey"]) Тогда
   		ОбщегоНазначения.СообщитьПользователю(
   			"Для данного профиля не заполнен ""Ozon Api Key"", проверьте настройки авторизации");
   		Возврат Ложь;
   	КонецЕсли;
   	
   	Если Не ЗначениеЗаполнено(НастройкиСоединения["OzonClientID"]) Тогда
   		ОбщегоНазначения.СообщитьПользователю(
   			"Для данного профиля не заполнен ""Ozon Client ID"", проверьте настройки авторизации");
   		Возврат Ложь;
   	КонецЕсли;
    
	ПараметрыЗапроса.Сервер = НастройкиСоединения["OzonАдресСервисаAPI"];
	ПараметрыЗапроса.Порт = 443;
	ПараметрыЗапроса.ЗащищенноеСоединение = Истина;
	ПараметрыЗапроса.Заголовки.Вставить("Client-Id", НастройкиСоединения["OzonClientID"]);
	ПараметрыЗапроса.Заголовки.Вставить("Api-Key", НастройкиСоединения["OzonApiKey"]);
	
	Возврат Истина;	

КонецФункции 

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
&НаСервереБезКонтекста
Функция ПреобразоватьДанныеВJSON(Данные, Знач ВариантЗаписиДаты = Неопределено) Экспорт

	Результат = "";
	Если ВариантЗаписиДаты = Неопределено Тогда
		ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	КонецЕсли;

	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);
		НастройкиСериализации = Новый НастройкиСериализацииJSON;
		НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДаты;
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, Данные, НастройкиСериализации);
		Результат = ЗаписьJSON.Закрыть();
	Исключение
		ИмяСобытия 	= "ПреобразоватьДанныеВJSON";
		Комментарий = "Не удалось записать JSON: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//Ozon_ЖурналСобытийВызовСервера.Ошибка(ИмяСобытия, Комментарий);
		//Ozon_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ИмяСобытия + "; " + Комментарий);
	КонецПопытки;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

&НаКлиенте
Процедура ИсторияОбновлений(Команда)
	ПерейтиПоНавигационнойСсылке("https://seller.ozon.ru/app/products/import-history/file");
КонецПроцедуры

// УНИКАЛЬНЫЕ УТ --------------------------------------------  

//+ ИнфоСофт Заварин К.В. 11.10.24 УА #74324
&НаСервере
Функция ШтрихкодыНоменклатуры(Номенклатура, Характеристика, Упаковка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	|	И ШтрихкодыНоменклатуры.Характеристика = &Характеристика
	|	И (ШтрихкодыНоменклатуры.Упаковка = &Упаковка
	|			ИЛИ ШтрихкодыНоменклатуры.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Упаковка", 		Упаковка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Штрихкод");
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Заварин К.В. 11.10.24 УА #74324  

&НаСервере
Функция ПараметрыФормыПодбораТоваров(Аккаунт, Валюта, УникальныйИдентификатор, ВидЦены) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Соглашение", Неопределено);
	ПараметрыФормы.Вставить("Организация", Аккаунт.Организация);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Ложь);
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки", Ложь);
	ПараметрыФормы.Вставить("Валюта", Валюта);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Подбор товаров';"));
	ПараметрыФормы.Вставить("Дата", ТекущаяДатаСеанса());
	ПараметрыФормы.Вставить("Документ", ПредопределенноеЗначение("Документ.ЗаказКлиента.ПустаяСсылка"));
	ПараметрыФормы.Вставить("ПодборВариантовОбеспечения", Ложь);
	ПараметрыФормы.Вставить("ОстаткиПоВсемСкладам", Истина);
	ПараметрыФормы.Вставить("ВидЦены", ВидЦены);
	ПараметрыФормы.Вставить("РежимПодбораБезСоглашенийСКлиентами", Истина);

	Результат = Новый Структура;
	Результат.Вставить("ИмяФормы", "Обработка.ПодборТоваровВДокументПродажи.Форма");
	Результат.Вставить("ПараметрыФормы", ПараметрыФормы);

	Возврат Результат;

КонецФункции 

&НаСервереБезКонтекста
Функция ТаблицаНоменклатурыПоТаблицеПодбора(ТаблицаПодбора) Экспорт

	Результат = ТаблицаПодбора.Скопировать( , "Номенклатура, Упаковка, Характеристика");

	Возврат Результат;

КонецФункции 

&НаСервереБезКонтекста
Функция ТаблицаЗначенийНоменклатуры() Экспорт

	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатуры.Колонки.Добавить("Характеристика",
		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаНоменклатуры.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));

	Возврат ТаблицаНоменклатуры;

КонецФункции 

&НаСервере
Функция ЗависимыеРеквизитыНоменклатуры(СтруктураПараметров) Экспорт

	ИспользуетсяЦенообразование25 = Не Метаданные.ФункциональныеОпции.Найти("ИспользуетсяЦенообразование25")
		= Неопределено И ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование25");

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ТаблицаНоменклатуры.Упаковка КАК Упаковка,
		|	ТаблицаНоменклатуры.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ вт_ТаблицаНоменклатуры
		|ИЗ
		|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	НаборыУпаковок.Ссылка КАК НаборУпаковок,
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка
		|ПОМЕСТИТЬ вт_Упаковки
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыУпаковок КАК НаборыУпаковок
		|		ПО Номенклатура.НаборУпаковок = НаборыУпаковок.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО (НаборыУпаковок.Ссылка = УпаковкиЕдиницыИзмерения.Владелец)
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И Номенклатура.ИспользоватьУпаковки
		|	И НЕ Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
		|	И Номенклатура.Ссылка В
		|			(ВЫБРАТЬ
		|				вт_ТаблицаНоменклатуры.Номенклатура
		|			ИЗ
		|				вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	НаборыУпаковок.Ссылка,
		|	УпаковкиЕдиницыИзмерения.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыУпаковок КАК НаборыУпаковок
		|		ПО Номенклатура.НаборУпаковок = НаборыУпаковок.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО Номенклатура.Ссылка = УпаковкиЕдиницыИзмерения.Владелец
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И Номенклатура.ИспользоватьУпаковки
		|	И Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
		|	И Номенклатура.Ссылка В
		|			(ВЫБРАТЬ
		|				вт_ТаблицаНоменклатуры.Номенклатура
		|			ИЗ
		|				вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Упаковки.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_Упаковки.Упаковка) КАК Упаковка
		|ПОМЕСТИТЬ вт_КоличествоУпаковок
		|ИЗ
		|	вт_Упаковки КАК вт_Упаковки
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_Упаковки.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_Упаковки.Упаковка) = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_КоличествоУпаковок.Номенклатура КАК Номенклатура,
		|	вт_Упаковки.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ вт_УпаковкаПоУмолчанию
		|ИЗ
		|	вт_КоличествоУпаковок КАК вт_КоличествоУпаковок
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Упаковки КАК вт_Упаковки
		|		ПО вт_КоличествоУпаковок.Номенклатура = вт_Упаковки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА вт_ТаблицаНоменклатуры.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				И НЕ вт_УпаковкаПоУмолчанию.Упаковка ЕСТЬ NULL
		|			ТОГДА вт_УпаковкаПоУмолчанию.Упаковка
		|		ИНАЧЕ вт_ТаблицаНоменклатуры.Упаковка
		|	КОНЕЦ КАК Упаковка,
		|	вт_ТаблицаНоменклатуры.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ вт_ТаблицаНоменклатурыДополненная
		|ИЗ
		|	вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_УпаковкаПоУмолчанию КАК вт_УпаковкаПоУмолчанию
		|		ПО вт_ТаблицаНоменклатуры.Номенклатура = вт_УпаковкаПоУмолчанию.Номенклатура
		|;" 
		
		+ ?(ИспользуетсяЦенообразование25,
		
		"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|	КОНЕЦ КАК Числитель,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|	КОНЕЦ КАК Знаменатель,
		|	ЦеныНоменклатурыСрезПоследних.Период КАК ДатаУстановкиЦены,
		|	ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) / ЕСТЬNULL(КурсВалютВалютаOzon.Курс, 1) * ЕСТЬNULL(КурсВалютВалютаOzon.Кратность, 1) КАК ЧИСЛО(15, 2)) КАК Цена
		|ПОМЕСТИТЬ вт_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		//|			&Период,
		|			,
		//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		|			(Номенклатура, ХарактеристикаЦО) В
		|				(ВЫБРАТЬ
		|					вт_ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|					ВЫБОР
		|						КОГДА вт_ТаблицаНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|							ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
		|						ИНАЧЕ вт_ТаблицаНоменклатуры.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования
		|					КОНЕЦ
		|				ИЗ
		|					вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО ЦеныНоменклатурыСрезПоследних.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка
		//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
		//|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаOzon) КАК КурсВалютВалютаOzon
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &ВалютаOzon) КАК КурсВалютВалютаOzon
		//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		|		ПО (ИСТИНА)
		|;"
		
		,
		
		"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|	КОНЕЦ КАК Числитель,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|	КОНЕЦ КАК Знаменатель,
		|	ЦеныНоменклатурыСрезПоследних.Период КАК ДатаУстановкиЦены,
		|	ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) / ЕСТЬNULL(КурсВалютВалютаOzon.Курс, 1) * ЕСТЬNULL(КурсВалютВалютаOzon.Кратность, 1) КАК ЧИСЛО(15, 2)) КАК Цена
		|ПОМЕСТИТЬ вт_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		//|			&Период,
		|			,
		//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		|			(Номенклатура, Характеристика) В
		|				(ВЫБРАТЬ
		|					вт_ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|					вт_ТаблицаНоменклатуры.Характеристика КАК Характеристика
		|				ИЗ
		|					вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО (ЦеныНоменклатурыСрезПоследних.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка)
		//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
		//|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаOzon) КАК КурсВалютВалютаOzon
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &ВалютаOzon) КАК КурсВалютВалютаOzon
		//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		|		ПО (ИСТИНА)
		|;") 
		
		+ 
		
		"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вт_ТаблицаНоменклатурыДополненная.Номенклатура КАК Номенклатура,
		|	вт_ТаблицаНоменклатурыДополненная.Характеристика КАК Характеристика,
		|	вт_ТаблицаНоменклатурыДополненная.Упаковка КАК Упаковка,
		|	СпрНоменклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	СпрНоменклатура.СтавкаНДС КАК СтавкаНДС,
		|	ВЫБОР
		|		КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ИспользоватьХарактеристики,
		|	СпрНоменклатура.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
		|	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод,
		|	ВЫБОР
		|		КОГДА СпрНоменклатура.ИспользоватьУпаковки
		|				И НЕ УпаковкиЕдиницыИзмерения.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА УпаковкиЕдиницыИзмерения.ВесЕдиницаИзмерения.МеждународноеСокращение = ""KGM""
		|						ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0) * 1000
		|					ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СпрНоменклатура.ВесИспользовать
		|						И СпрНоменклатура.ВесЗнаменатель > 0
		|					ТОГДА ВЫБОР
		|							КОГДА СпрНоменклатура.ВесЕдиницаИзмерения.МеждународноеСокращение = ""KGM""
		|								ТОГДА СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель * 1000
		|							ИНАЧЕ СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК ВесУпаковки,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 10
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 1000
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0)
		|	КОНЕЦ КАК Высота,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 10
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 1000
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0)
		|	КОНЕЦ КАК Глубина,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 10
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 1000
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0)
		|	КОНЕЦ КАК Ширина,
		|	ВЫБОР
		|		КОГДА вт_цены_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_цены_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_цены_price.Цена, 0) * ЕСТЬNULL(вт_цены_price.Знаменатель, 1) / ЕСТЬNULL(вт_цены_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА вт_цены_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_Цены_old_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_Цены_old_price.Цена, 0) * ЕСТЬNULL(вт_Цены_old_price.Знаменатель, 1) / ЕСТЬNULL(вт_Цены_old_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаДоСкидки,
		|	ВЫБОР
		|		КОГДА вт_Цены_min_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_Цены_min_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_Цены_min_price.Цена, 0) * ЕСТЬNULL(вт_Цены_min_price.Знаменатель, 1) / ЕСТЬNULL(вт_Цены_min_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаМинимальная,
		|	ЕСТЬNULL(Ozon_СоответствиеТоваров.НоменклатураOzon.product_id, 0) КАК product_id,
		|	ЕСТЬNULL(Ozon_СоответствиеТоваров.НоменклатураOzon.offer_id, """") КАК offer_id
		|ИЗ
		|	вт_ТаблицаНоменклатурыДополненная КАК вт_ТаблицаНоменклатурыДополненная
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Упаковка = ШтрихкодыНоменклатуры.Упаковка)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = ШтрихкодыНоменклатуры.Характеристика)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = СпрНоменклатура.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_цены_price"
		
		+ ?(ИспользуетсяЦенообразование25, 
		
		"
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_цены_price.Номенклатура)
		|			И (ВЫБОР
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка) = вт_цены_price.Характеристика
		|				ИНАЧЕ вт_ТаблицаНоменклатурыДополненная.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования = вт_цены_price.Характеристика
		|			КОНЕЦ)
		|			И (ВЫБОР 
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке =  Значение(Перечисление.ВариантОтбораДляКлючаЦен.Использовать) 
		|					ТОГДА вт_ТаблицаНоменклатурыДополненная.Упаковка =  вт_цены_price.Упаковка
		|				ИНАЧЕ
		|					Истина
		|				КОНЕЦ)
		|			И (вт_цены_price.ВидЦены = &price)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_Цены_old_price
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_Цены_old_price.Номенклатура)
		|			И (ВЫБОР
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка) = вт_Цены_old_price.Характеристика
		|				ИНАЧЕ вт_ТаблицаНоменклатурыДополненная.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования = вт_Цены_old_price.Характеристика
		|			КОНЕЦ)
		|			И (ВЫБОР 
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке =  Значение(Перечисление.ВариантОтбораДляКлючаЦен.Использовать) 
		|					ТОГДА вт_ТаблицаНоменклатурыДополненная.Упаковка =  вт_Цены_old_price.Упаковка
		|				ИНАЧЕ
		|					Истина
		|				КОНЕЦ)
		|			И (вт_Цены_old_price.ВидЦены = &old_price)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_Цены_min_price
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_Цены_min_price.Номенклатура)
		|			И (ВЫБОР
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка) = вт_Цены_min_price.Характеристика
		|				ИНАЧЕ вт_ТаблицаНоменклатурыДополненная.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования = вт_Цены_min_price.Характеристика
		|			КОНЕЦ)
		|			И (ВЫБОР 
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке =  Значение(Перечисление.ВариантОтбораДляКлючаЦен.Использовать) 
		|					ТОГДА вт_ТаблицаНоменклатурыДополненная.Упаковка =  вт_Цены_min_price.Упаковка
		|				ИНАЧЕ
		|					Истина
		|				КОНЕЦ)
		|			И (вт_Цены_min_price.ВидЦены = &min_price)"
		
		,
		
		"
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_цены_price.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = вт_цены_price.Характеристика)
		|			И (вт_цены_price.ВидЦены = &price)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_Цены_old_price
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_Цены_old_price.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = вт_Цены_old_price.Характеристика)
		|			И (вт_Цены_old_price.ВидЦены = &old_price)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_Цены_min_price
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_Цены_min_price.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = вт_Цены_min_price.Характеристика)
		|			И (вт_Цены_min_price.ВидЦены = &min_price)")
		
		+
		
		"
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК Ozon_СоответствиеТоваров
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = Ozon_СоответствиеТоваров.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = Ozon_СоответствиеТоваров.Характеристика)
		|			И (вт_ТаблицаНоменклатурыДополненная.Упаковка = Ozon_СоответствиеТоваров.Упаковка)
		|			И (Ozon_СоответствиеТоваров.НоменклатураOzon.Профиль = &Аккаунт)
		//|			И (Ozon_СоответствиеТоваров.Категория = &Категория)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ТаблицаНоменклатурыДополненная.Номенклатура,
		|	вт_ТаблицаНоменклатурыДополненная.Характеристика,
		|	вт_ТаблицаНоменклатурыДополненная.Упаковка,
		|	СпрНоменклатура.НаименованиеПолное,
		|	СпрНоменклатура.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ,
		|	СпрНоменклатура.ИспользоватьУпаковки,
		|	ВЫБОР
		|		КОГДА вт_цены_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_цены_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_цены_price.Цена, 0) * ЕСТЬNULL(вт_цены_price.Знаменатель, 1) / ЕСТЬNULL(вт_цены_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА вт_цены_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_Цены_old_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_Цены_old_price.Цена, 0) * ЕСТЬNULL(вт_Цены_old_price.Знаменатель, 1) / ЕСТЬNULL(вт_Цены_old_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА вт_Цены_min_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_Цены_min_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_Цены_min_price.Цена, 0) * ЕСТЬNULL(вт_Цены_min_price.Знаменатель, 1) / ЕСТЬNULL(вт_Цены_min_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 10
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 1000
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 10
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 1000
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 10
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 1000
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0)
		|	КОНЕЦ,
		|	ЕСТЬNULL(Ozon_СоответствиеТоваров.НоменклатураOzon.product_id, 0),
		|	ЕСТЬNULL(Ozon_СоответствиеТоваров.НоменклатураOzon.offer_id, """"),
		|	ВЫБОР
		|		КОГДА СпрНоменклатура.ИспользоватьУпаковки
		|				И НЕ УпаковкиЕдиницыИзмерения.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА УпаковкиЕдиницыИзмерения.ВесЕдиницаИзмерения.МеждународноеСокращение = ""KGM""
		|						ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0) * 1000
		|					ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СпрНоменклатура.ВесИспользовать
		|						И СпрНоменклатура.ВесЗнаменатель > 0
		|					ТОГДА ВЫБОР
		|							КОГДА СпрНоменклатура.ВесЕдиницаИзмерения.МеждународноеСокращение = ""KGM""
		|								ТОГДА СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель * 1000
		|							ИНАЧЕ СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", СтруктураПараметров.ТаблицаНоменклатуры);
	//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
	//Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
	Запрос.УстановитьПараметр("price", СтруктураПараметров.Price);
	Запрос.УстановитьПараметр("old_price", СтруктураПараметров.Old_price);
	Запрос.УстановитьПараметр("min_price", СтруктураПараметров.Min_price);
	Запрос.УстановитьПараметр("Аккаунт", СтруктураПараметров.Аккаунт);
	Запрос.УстановитьПараметр("Категория", СтруктураПараметров.Категория);
	Запрос.УстановитьПараметр("ВалютаOzon", СтруктураПараметров.ВалютаПродажиНаOzon);

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаТоваров = РезультатЗапроса.Выгрузить();

	Возврат ТаблицаТоваров;

КонецФункции

#КонецОбласти