                                           
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
Функция ПолучитьНастройкиСоединения(Профиль) Экспорт
		
	МассивНаименованийПараметров = Новый Массив;  
		
	МассивНаименованийПараметров.Добавить("ЯМТокен");
	МассивНаименованийПараметров.Добавить("ЯМКампанияID");
	МассивНаименованийПараметров.Добавить("ЯМАдресСервисаAPI");
	//+ ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869
	МассивНаименованийПараметров.Добавить("ЯМКодБизнеса");
	//- ИнфоСофт Стояк Ю.К. 08.08.2023 УА #61869
		
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_Профили.КоличествоОшибокЗапросов КАК КоличествоОшибокЗапросов,
	|	ИС_WB_Профили.КоличествоЭлементовНаЗапрос КАК КоличествоЭлементовНаЗапрос
	|ИЗ
	|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
	|ГДЕ
	|	ИС_WB_Профили.Ссылка = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Настройки = Неопределено Тогда
		Настройки = Новый Соответствие;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Если Выборка.Следующий() Тогда
	
		Для Каждого Элемент Из РезультатЗапроса.Колонки Цикл
			Настройки.Вставить(Элемент.Имя, Выборка[Элемент.Имя]);	
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат Настройки;		
	
КонецФункции //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127

#КонецОбласти
