#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИнициализироватьФорму(Параметры.МассивЗначений);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЗначений

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ТаблицаЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Элементы.ТаблицаЗначений.ТекущиеДанные.Значение);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Процедура ИнициализироватьФорму(МассивЗначений)

	Для Каждого Значение Из МассивЗначений Цикл
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.Значение = Значение;
		НоваяСтрока.Представление = Строка(Значение);
	КонецЦикла;
	ТаблицаЗначений.Сортировать("Значение");

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

#КонецОбласти