
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	//+ ИнфоСофт Мурсалимов Д.Р. 15.11.23 УА #65901
	Список.ТекстЗапроса = ИС_Ozon_Сервер.ПолучитьТекстЗапросаСборочныхЗаданий();
	Список.ОсновнаяТаблица = "Документ.ИС_Ozon_Заказ";
	//- ИнфоСофт Мурсалимов Д.Р. 15.11.23 УА #65901
	ОтборОтправлений = "Все";		
	
	//+ ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73236
	СортировкаПечати = "Номер";
	//- ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73236
	
	//+ ИнфоСофт Заварин К.В. 07.06.24 УА #70730
	СортировкаПечатиШтрихкодов = "58х40";
	//- ИнфоСофт Заварин К.В. 07.06.24 УА #70730
	
	//+ ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	ОтображатьРасходныеОрдера = ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныеСклады");	
	//- ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПрименитьНастройкиПрофиля();
	УстановитьОтборыОтправлений();
	
	//+ ИнфоСофт Мурсалимов Д.Р. 23.05.24 УА #70073
	УправлениеФормой();
	//- ИнфоСофт Мурсалимов Д.Р. 23.05.24 УА #70073
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Профиль) Тогда
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469		
		//ПолучитьДатуПоследнегоЗаказа(Профиль, ДатаПоследнегоОтправления);
		ПолучитьДатуПоследнегоЗаказа(Профиль, ДатаПоследнегоОтправления, ДатаПоследнегоОтправленияФБО);
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	КонецЕсли;
	
	ПрименитьНастройкиПрофиля();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные; 
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.Заказ Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Элемент.ТекущиеДанные.Заказ.Пустая() Тогда
			Возврат;
		КонецЕсли;
		
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Заказ);
	
	ИначеЕсли Поле = Элементы.Реализация Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Реализация) Тогда
			Возврат;
		ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ПоказатьЗначение(, Элемент.ТекущиеДанные.Реализация);
		Иначе
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заказ", Элемент.ТекущиеДанные.Заказ);
			//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
			ПараметрыФормы.Вставить("ДокументыРеализации", Истина);
			//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
			ОткрытьФорму("ОбщаяФорма.ИС_WB_ФормаРТУ", ПараметрыФормы);
		КонецЕсли
		
	//+ ИнфоСофт Конышев А.Е. 10.12.24 УА #77940
	ИначеЕсли Поле = Элементы.РасходныйОрдер Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.РасходныйОрдер) Тогда
			Возврат;
		ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.РасходныйОрдер) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
			ПоказатьЗначение(, Элемент.ТекущиеДанные.РасходныйОрдер);
		//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
		Иначе
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заказ", Элемент.ТекущиеДанные.Заказ);
			ПараметрыФормы.Вставить("ДокументыРеализации", Ложь);
			ОткрытьФорму("ОбщаяФорма.ИС_WB_ФормаРТУ", ПараметрыФормы);
		//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
		КонецЕсли
	
	//- ИнфоСофт Конышев А.Е. 10.12.24 УА #77940
	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура ОтображатьСоставЗаказовПриИзменении(Элемент)         
	
	Если ОтображатьСоставЗаказов Тогда
	
		Элементы.СоставЗаказов.Видимость = Истина;
		
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;

		Если ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		СформироватьСоставЗаказов(ВыделенныеСтроки);

	Иначе
		Элементы.СоставЗаказов.Видимость = Ложь; 
	КонецЕсли;                                                 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Ивонин К.А. 07.08.23 УА #61542
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Заказproducts.Ссылка КАК Ссылка,
	|	ИС_Ozon_Заказproducts.НоменклатураOzon.offer_id КАК offer_id,
	|	ИС_Ozon_Заказproducts.quantity КАК quantity
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка В(&Ссылка)
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Строки.ПолучитьКлючи());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказов.Следующий() Цикл
	
		ВыборкаТоваров = ВыборкаЗаказов.Выбрать();
	
		Пока ВыборкаТоваров.Следующий() Цикл
			СтрокаСписка = Строки[ВыборкаТоваров.Ссылка];
			Попытка
	    	СтрокаСписка.Данные["Состав"] = СтрокаСписка.Данные["Состав"] 
	    		+ ВыборкаТоваров.offer_id + " - " + ВыборкаТоваров.quantity + " шт." + Символы.ПС;
			Исключение
			КонецПопытки;	
	   	КонецЦикла;
	
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.08.23 УА #61542

//+ ИнфоСофт Ивонин К.А. 04.09.23 УА #62462
&НаКлиенте
Процедура ОтборОтправленийПриИзменении(Элемент)
	УстановитьОтборыОтправлений();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.09.23 УА #62462

//+ ИнфоСофт Сумин Д.В. 09.01.2023 УА #68183
&НаКлиенте
Процедура НайтиПоСоставу(Команда)
	Подсказка = "Введите символы состава.";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, "", Подсказка, 128);
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 09.01.2023 УА #68183

//+ ИнфоСофт Ивонин К.А. 29.09.23 УА #64020
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборСклада" Тогда
		Склад = Параметр.Склад; 
		//+ ИнфоСофт Заварин К.В. 11.04.25 УА #77376
		Грузоместа = Параметр.Грузоместа;
		//- ИнфоСофт Заварин К.В. 11.04.25 УА #77376
		Если Не ЗначениеЗаполнено(Склад) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Выберите корректный склад");
			Возврат;
		КонецЕсли;
		
		//+ ИнфоСофт Заварин К.В. 11.04.25 УА #77376
		//Файл = АктИНакладнаяНаСервере(Склад);
		Файл = АктИНакладнаяНаСервере(Склад, Грузоместа); 
		//- ИнфоСофт Заварин К.В. 11.04.25 УА #77376
		
		Если Не ЗначениеЗаполнено(Файл) Тогда
			Возврат;
		КонецЕсли;
		
		ИмяКаталогаВременныхФайлов = КаталогВременныхФайлов();  
		
		ИмяВременногоФайла = ИмяКаталогаВременныхФайлов + "ActFile.pdf";
		Файл.Записать(ИмяВременногоФайла);
		
		НачатьЗапускПриложения(Новый ОписаниеОповещения, ИмяВременногоФайла);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.09.23 УА #64020

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
&НаКлиенте
Процедура ДатаПоследнегоОтправленияПриИзменении(Элемент)
	ДатаПоследнегоОтправленияФБО = ДатаПоследнегоОтправления;
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

#КонецОбласти 

#Область ОбработчикиКомандФормы 

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ОтображатьСоставЗаказов Тогда		
		СформироватьСоставЗаказов(ВыделенныеСтроки);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура ЗагрузитьЗаказы(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	РеглРаботает = ПроверитьРегламетноеЗаданиеНаСервере(Профиль, "ПолучениеСборочныхЗаданийOzon");
	
	Если Не РеглРаботает Тогда    
		
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
		//ДлительнаяОперация = ЗагрузитьЗаказыНаСервере(Профиль, ДатаПоследнегоОтправления, УникальныйИдентификатор);
		ДлительнаяОперация = ЗагрузитьЗаказыНаСервере(Профиль, ДатаПоследнегоОтправления, ДатаПоследнегоОтправленияФБО,
			ВключенаРаботаСоСхемойФБО, УникальныйИдентификатор);
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469		
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучениеЗаказовЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
		
		Элементы["КартинкаОжидание"].Видимость = Истина;		
		
		//ЗагрузитьЗаказыНаСервере(Профиль, ДатаПоследнегоОтправления);	
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Уже выполняется регламентное задание по загрузке заказов, обновите форму чуть позже");
	КонецЕсли;                                                                         	
		 
	//ПолучитьДатуПоследнегоЗаказа(Профиль, ДатаПоследнегоОтправления); 
	
	//Элементы.Список.Обновить();                                                      
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628 

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура СоздатьЗаказы(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;

	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать отправления");
		Возврат;
	КонецЕсли; 
	
	СоздатьЗаказыНаСервере(ВыделенныеСтроки); 
	Элементы.Список.Обновить();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
&НаКлиенте
Процедура СоздатьРеализации(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;

	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать отправления");
		Возврат;
	КонецЕсли; 
	
	СоздатьРеализацииНаСервере(ВыделенныеСтроки); 
	Элементы.Список.Обновить();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	РеглРаботает = ПроверитьРегламетноеЗаданиеНаСервере(Профиль, "ОбновлениеСтатусовСборочныхЗаданийOzon");
	
	Если Не РеглРаботает Тогда    
		
		ДлительнаяОперация = ОбновитьСтатусыНаСервере();
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьСтатусыЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
		
		Элементы["КартинкаОжиданиеСтатусы"].Видимость = Истина;		
		
		//ОбновитьСтатусыНаСервере();		
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Уже выполняется регламентное задание по загрузке заказов, обновите форму чуть позже");
	КонецЕсли;                                      
	//Элементы.Список.Обновить();
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
&НаКлиенте
Процедура ПечатьЭтикеток(Команда)
		
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;

	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать отправления");
		Возврат;
	КонецЕсли;
	
	МассивФайлов = ПечатьЭтикетокНаСервере(ВыделенныеСтроки); 
	
	Если Не ЗначениеЗаполнено(МассивФайлов) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКаталогаВременныхФайлов = КаталогВременныхФайлов();  
	
	ИндексФайла = 1;
	
	Для Каждого Файл Из МассивФайлов Цикл                                                          
		
		Если Файл = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяВременногоФайла = ИмяКаталогаВременныхФайлов + Строка(ИндексФайла) + "stickersFile.pdf";
		ИндексФайла = ИндексФайла + 1;
		Файл.Записать(ИмяВременногоФайла);
		
		НачатьЗапускПриложения(Новый ОписаниеОповещения, ИмяВременногоФайла);
		
	КонецЦикла; 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Заварин К.В. 10.08.24 УА #76631
&НаКлиенте
Процедура ПечатьКомпактныхЭтикеток(Команда)
		
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;

	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать отправления");
		Возврат;
	КонецЕсли;
	
	МассивФайлов = ПечатьКомпактныхЭтикетокНаСервере(ВыделенныеСтроки); 
	
	Если Не ЗначениеЗаполнено(МассивФайлов) Тогда
		
		//+ ИнфоСофт Заварин К.В. 20.09.24 УА #84102
		ОбщегоНазначенияКлиент.СообщитьПользователю("Компактные этикетки не были найдены. Проверьте настройку подключения компактных этикеток."); 
		//- ИнфоСофт Заварин К.В. 20.09.24 УА #84102
		
		Возврат;
	КонецЕсли;
	
	Для Каждого Файл Из МассивФайлов Цикл 
		
		ПерейтиПоНавигационнойСсылке(Файл);	
		
	КонецЦикла; 
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 10.08.24 УА #76631

//+ ИнфоСофт Стояк Ю.К. 05.06.2023 УА #59330
&НаКлиенте
Процедура СобратьЗаказ(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;

	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать отправления");
		Возврат;
	КонецЕсли;
	
	СобратьЗаказНаСервере(ВыделенныеСтроки);
	
	//+ ИнфоСофт Заварин К.В. 17.10.24 УА #74581
	ОбновитьСтатусы(Команда);
	//- ИнфоСофт Заварин К.В. 17.10.24 УА #74581
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 05.06.2023 УА #59330

//+ ИнфоСофт Сумин Д.В. 26.01.2024 УА #62586
&НаКлиенте
Процедура ПрикрепитьКиз(Команда)
	
	ОчиститьСообщения();
    
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
	 	ОбщегоНазначенияКлиент.СообщитьПользователю(
	 		"Для прикрепления КиЗов нужно выделить необходимые заказы");
		Возврат;
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Профиль", Профиль);
	ПараметрыФормы.Вставить("СборочныеЗадания", ВыделенныеСтроки);
	
	ОткрытьФорму("Документ.ИС_Ozon_Заказ.Форма.ФормаКиЗов", ПараметрыФормы, ЭтотОбъект);	 
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.01.2024 УА #62586

//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
&НаКлиенте
Процедура АктИНакладная(Команда) 
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Профиль", Профиль);
	
	ОткрытьФорму("Документ.ИС_Ozon_Заказ.Форма.ФормаВыбораСклада", ПараметрыОткрытия, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585

//+ ИнфоСофт Заварин К.В. 20.03.24 УА #66299
&НаКлиенте
Процедура ПечатьЛистаПодбора(Команда)

	//+ ИнфоСофт Заварин К.В. 29.01.25 УА #79391
	//+ ИнфоСофт Конышев А.Е. 11.12.24 УА #79539
	//Если СортировкаПечати = "НомерЭтикетки" Тогда
	//	Сообщить("Сортировка печати по номеру этикетки недоступна для печати листа подбора");
	//	Возврат;
	//КонецЕсли;
	//- ИнфоСофт Конышев А.Е. 11.12.24 УА #79539
	//- ИнфоСофт Заварин К.В. 29.01.25 УА #79391
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
 	
	ТабДок = ПолучитьЛистПодбораНаСервере(ВыделенныеСтроки);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Лист Подбора Ozon");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Лист Подбора Ozon";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Заварин К.В. 20.03.24 УА #66299

//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
&НаКлиенте
Процедура ОткрытьФормуСборкиЗаказов(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Профиль", Профиль);
	
	Если ВыделенныеСтроки.Количество() <> 0 Тогда
		ПараметрыОткрытия.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	КонецЕсли;
	
	//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
	//Если в настройках маркетплейса Ozon установлен флаг РазнестиЗаказыНаКоличество, при создании документа "УпаковкаТоваров"
	//создается два документа, в один попадают заказы с единичным количеством позиций, в другой документ с множественным количеством.
	РазнестиЗаказыПоКоличеству = ПолучитьЗначениеПараметра();
	
	Если РазнестиЗаказыПоКоличеству Тогда
		СоздатьДокументыУпаковкиТоваровOzon(ПараметрыОткрытия);	
	Иначе
	   	ОткрытьФорму("Документ.ИС_Ozon_УпаковкаТоваров.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтотОбъект);
	КонецЕсли;                                    
	//ОткрытьФорму("Документ.ИС_Ozon_УпаковкаТоваров.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтотОбъект);
	//- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167

//+ ИнфоСофт Заварин К.В. 07.06.24 УА #70730
&НаКлиенте
Процедура ПечатьШтрихкода(Команда)

	//+ ИнфоСофт Конышев А.Е. 11.12.24 УА #79539
	Если СортировкаПечати = "НомерЭтикетки" Тогда
		Сообщить("Сортировка печати по номеру этикетки недоступна для печати штрихкода");
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Конышев А.Е. 11.12.24 УА #79539
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
 	
	ТабДок = ПолучитьШтрихкодовНаСервере(ВыделенныеСтроки);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Штрихкоды Ozon");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Штрихкоды Ozon";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Заварин К.В. 07.06.24 УА #70730

//+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
&НаКлиенте
Процедура ВыводПамяткиПоРедактированиюМакета(Команда)
	ТабДок = ВыводПамяткиПоРедактированиюМакетаНаСервере(); 
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Памятка редактирования макета");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Памятка редактирования макета";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816

//+ ИнфоСофт Заварин К.В. 13.11.24 УА #85881
&НаКлиенте
Процедура ПометитьНаУдалениеПривязанныеДокументы(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
	 	ОбщегоНазначенияКлиент.СообщитьПользователю(
	 		"Для пометки на удаление нужно выделить необходимые сборочные задания");
		Возврат;
	КонецЕсли;
	
	ПометитьНаУдалениеПривязанныеДокументыНаСервере();
	Элементы.Список.Обновить();	
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Документы успешно помечены на удаление");

	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.11.24 УА #85881

//+ ИнфоСофт Конышев А.Е. 05.12.24 УА #77791
&НаКлиенте
Процедура ПрисвоитьТрекНомер(Команда)

	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НомерОтправления", ТекущаяСтрока.Номер);
	СтруктураПараметров.Вставить("Заказ", Элементы.Список.ТекущаяСтрока);

	Оповещение = Новый ОписаниеОповещения("ПрисвоитьТрекНомерЗавершение", ЭтотОбъект, СтруктураПараметров);
	ПоказатьВводСтроки(Оповещение, "", "Укажите трек-номер отправления", , Ложь);
	
КонецПроцедуры //- ИнфоСофт Конышев А.Е. 05.12.24 УА #77791

//+ ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168
&НаКлиенте
Процедура ОткрытьФормуНастройкиЛистаПодбора(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Профиль", Профиль);
	ОткрытьФорму("Документ.ИС_Ozon_Заказ.Форма.ФормаНастройкиЛистаПодбора",ПараметрыФормы , , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Мурсалимов Д.Р. 23.05.24 УА #70073 
&НаКлиенте
Процедура УправлениеФормой()
	
	Элементы.СоставЗаказов.Видимость = ОтображатьСоставЗаказов;
	
	//+ ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	Если Не ОтображатьРасходныеОрдера Тогда	
		Элементы.РасходныйОрдер.Видимость = Ложь;	
	КонецЕсли;                               
	//- ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	СформироватьСоставЗаказов(ВыделенныеСтроки);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 23.05.24 УА #70073

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаКлиенте
Процедура ПрименитьНастройкиПрофиля()
	
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	ЕстьЗаказыПоСхемеФБС = Ложь;
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	
	Если ЗначениеЗаполнено(Профиль) Тогда
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469		
		//ПолучитьДатуПоследнегоЗаказа(Профиль, ДатаПоследнегоОтправления);
		ПолучитьДатуПоследнегоЗаказа(Профиль, ДатаПоследнегоОтправления, ДатаПоследнегоОтправленияФБО);
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469 
		ПолучитьОпциюРаботыСФБО(ВключенаРаботаСоСхемойФБО);
		ЕстьЗаказыПоСхемеФБС = ЕстьЗаказыПоСхемеФБС();
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	КонецЕсли;  
	
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469	
	Элементы.ЗаказФБО.Видимость = ВключенаРаботаСоСхемойФБО; 
	
	Если Не ЕстьЗаказыПоСхемеФБС Тогда
		Элементы.СписокСобратьЗаказ.Доступность			= Ложь;
		Элементы.СписокПрикрепитьКиз.Доступность 		= Ложь;
		Элементы.СписокАктИНакладная.Доступность 		= Ложь;
		Элементы.ОткрытьФормуСборкиЗаказов.Доступность 	= Ложь;
		Элементы.ПечатьЭтикеток.Доступность 			= Ложь;
		Элементы.ПечатьКомпактныхЭтикеток.Доступность 	= Ложь;
		Элементы.ПрисвоитьТрекНомер.Доступность 		= Ложь;
	Иначе
		Элементы.СписокСобратьЗаказ.Доступность 		= Истина;
		Элементы.СписокПрикрепитьКиз.Доступность 		= Истина;
		Элементы.СписокАктИНакладная.Доступность 		= Истина;
		Элементы.ОткрытьФормуСборкиЗаказов.Доступность 	= Истина;
		Элементы.ПечатьЭтикеток.Доступность 			= Истина;
		Элементы.ПечатьКомпактныхЭтикеток.Доступность 	= Истина;
		Элементы.ПрисвоитьТрекНомер.Доступность 		= Истина;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	
	Список.Параметры.УстановитьЗначениеПараметра("Профиль", Профиль);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаСервереБезКонтекста
Процедура ПолучитьДатуПоследнегоЗаказа(Профиль, Дата, ДатаФБО) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ИС_Ozon_Заказ.Дата КАК Дата
	//|ИЗ
	//|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	//|ГДЕ
	//|	ИС_Ozon_Заказ.Профиль = &Профиль
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Дата УБЫВ";	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_Ozon_Заказ.Дата КАК Дата,
	|	ИС_Ozon_Заказ.ЗаказФБО КАК ЗаказФБО
	|ИЗ
	|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|ГДЕ
	|	ИС_Ozon_Заказ.Профиль = &Профиль
	|	И НЕ ИС_Ozon_Заказ.ЗаказФБО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_Ozon_Заказ.Дата,
	|	ИС_Ozon_Заказ.ЗаказФБО
	|ИЗ
	|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|ГДЕ
	|	ИС_Ozon_Заказ.ЗаказФБО
	|	И ИС_Ozon_Заказ.Профиль = &Профиль
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
		//Дата = Выборка.Дата;
		Если Выборка.ЗаказФБО Тогда
			ДатаФБО = Выборка.Дата; 
		Иначе
			Дата = Выборка.Дата;
		КонецЕсли;                                  
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	КонецЦикла; 
	
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	Если Дата = Дата(1,1,1) Тогда
		Дата = ДатаФБО;
	ИначеЕсли ДатаФБО = Дата(1,1,1) Тогда
		ДатаФБО = Дата;
	Иначе
		Дата = НачалоДня(ТекущаяДатаСеанса());
		ДатаФБО = Дата;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	 
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469 
&НаСервере
Процедура ПолучитьОпциюРаботыСФБО(ВключенаРаботаСоСхемойФБО) 
		
	МассивНаименованийПараметров = Новый Массив;  		
	МассивНаименованийПараметров.Добавить("ЗагружатьЗаказыПоСхемеФБО");
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, МассивНаименованийПараметров);
	
	Если Настройки.ЗагружатьЗаказыПоСхемеФБО <> Неопределено Тогда
		ВключенаРаботаСоСхемойФБО = Настройки.ЗагружатьЗаказыПоСхемеФБО;
	Иначе
		ВключенаРаботаСоСхемойФБО = Ложь;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469 
&НаСервере
Функция ЕстьЗаказыПоСхемеФБС() 
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_Ozon_Заказ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
		|ГДЕ
		|	НЕ ИС_Ozon_Заказ.ЗаказФБО
		|	И ИС_Ozon_Заказ.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;         
	
	Возврат Ложь;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаСервере
Процедура СоздатьЗаказыНаСервере(ВыделенныеСтроки)	
	ИС_Ozon_Сервер.СоздатьЗаказы(Профиль, ВыделенныеСтроки);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535  

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаСервере
Процедура СоздатьРеализацииНаСервере(ВыделенныеСтроки)
	ИС_Ozon_Сервер.СоздатьРеализации(Профиль, ВыделенныеСтроки);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаСервереБезКонтекста                                                                                                     
//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
//Функция ЗагрузитьЗаказыНаСервере(Профиль, ДатаПоследнегоОтправления, УникальныйИдентификатор)
Функция ЗагрузитьЗаказыНаСервере(Профиль, ДатаПоследнегоОтправления, ДатаПоследнегоОтправленияФБО, ВключенаРаботаСФБО, УникальныйИдентификатор)
//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	
	Если ДатаПоследнегоОтправления = Дата(1, 1, 1) Тогда
		ДатаПоследнегоОтправления = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	Если ДатаПоследнегоОтправленияФБО = Дата(1, 1, 1) Тогда
		ДатаПоследнегоОтправленияФБО = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
		
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	//Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
	//"ИС_Ozon_Сервер.ПолучитьЗаказы", Профиль, ДатаПоследнегоОтправления); 
	Если ВключенаРаботаСФБО Тогда
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
		"ИС_Ozon_Сервер.ЗагрузитьЗаказыПоВсемСхемам", Профиль, ДатаПоследнегоОтправления, ДатаПоследнегоОтправленияФБО); 
	Иначе
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
		"ИС_Ozon_Сервер.ПолучитьЗаказы", Профиль, ДатаПоследнегоОтправления); 
	КонецЕсли;		
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	
	//ИС_Ozon_Сервер.ПолучитьЗаказы(Профиль, ДатаПоследнегоОтправления);
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
&НаСервере   
Процедура СформироватьСоставЗаказов(ВыделенныеСтроки)
	
	СоставЗаказов.Очистить();
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		Если ТипЗнч(Строка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Заказproducts.Ссылка КАК Ссылка,
	|	ИС_Ozon_Заказproducts.НоменклатураOzon КАК Номенклатура,
	|	ИС_Ozon_Заказproducts.ХарактеристикаOzon КАК Штрихкод,
	|	ИС_Ozon_Заказproducts.quantity КАК Количество,
	|	ИС_Ozon_Заказproducts.Сумма КАК Сумма,
	|	ИС_Ozon_Заказproducts.price КАК Цена
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка В(&ВыделенныеСтроки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИС_Ozon_Заказproducts.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ВыделенныеСтроки", ВыделенныеСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СоставЗаказов.Добавить();
		НоваяСтрока.Заказ = Выборка.Ссылка;
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;		
		НоваяСтрока.Штрихкод = Выборка.Штрихкод;
		НоваяСтрока.Количество = Выборка.Количество;		
		НоваяСтрока.Цена = Выборка.Цена;	
		НоваяСтрока.Сумма = Выборка.Сумма;	
	КонецЦикла;		
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
&НаСервере
Функция ОбновитьСтатусыНаСервере()
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800	
	ФункциональныеОпции = ИС_Ozon_Сервер.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	Если ЗначениеЗаполнено(ФункциональныеОпции) Тогда
		Период = ФункциональныеОпции.OzonКоличествоДнейОбновлениеСтатусов * 86400;
	Иначе
		Период = 604800;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469	
	//Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
	//"ИС_Ozon_Сервер.ОбновитьСтатусыСборочныхЗаданий", Профиль, Период);
	Если ВключенаРаботаСоСхемойФБО Тогда
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
		"ИС_Ozon_Сервер.ОбновитьСтатусыЗаказовПоВсемСхемам", Профиль, Период);	
	Иначе
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
		"ИС_Ozon_Сервер.ОбновитьСтатусыСборочныхЗаданий", Профиль, Период);
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	//ИС_Ozon_Сервер.ОбновитьСтатусыСборочныхЗаданий(Профиль);
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
КонецФункции //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Заварин К.В. 13.06.24 УА #72552
&НаСервере
Функция ПечатьЭтикетокНаСервере(ВыделенныеСтроки)
	
	СтруктураПараметровПечати = Новый Структура;
	СтруктураПараметровПечати.Вставить("СортировкаПечати", СортировкаПечати);
	
	Возврат ИС_Ozon_Сервер.НапечататьЭтикетки(Профиль, ВыделенныеСтроки, СтруктураПараметровПечати);
	
КонецФункции //- ИнфоСофт Заварин К.В. 13.06.24 УА #72552

//+ ИнфоСофт Заварин К.В. 13.06.24 УА #76631
&НаСервере
Функция ПечатьКомпактныхЭтикетокНаСервере(ВыделенныеСтроки)
	
	СтруктураПараметровПечати = Новый Структура;
	СтруктураПараметровПечати.Вставить("СортировкаПечати", СортировкаПечати);
	
	Возврат ИС_Ozon_Сервер.НапечататьКомпактныеЭтикетки(Профиль, ВыделенныеСтроки, СтруктураПараметровПечати);
	
КонецФункции //- ИнфоСофт Заварин К.В. 13.06.24 УА #76631

//+ ИнфоСофт Стояк Ю.К. 05.06.2023 УА #59330
&НаСервере
Процедура СобратьЗаказНаСервере(ВыделенныеСтроки)
	ИС_Ozon_Сервер.СобратьЗаказ(Профиль, ВыделенныеСтроки);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 05.06.2023 УА #59330

//+ ИнфоСофт Ивонин К.А. 04.09.23 УА #62462
&НаКлиенте
Процедура УстановитьОтборыОтправлений()
    
    ВсеОтправления = Ложь;
	ВидимостьСобратьЗаказы = Ложь;
	ВидимостьStatus = Ложь;
	ВидимостьПечатьЭтикеток = Ложь;
	//+ ИнфоСофт Заварин К.В. 10.08.24 УА #76631
	ВидимостьКомпактныхПечатьЭтикеток = Ложь;
	//- ИнфоСофт Заварин К.В. 10.08.24 УА #76631
	//+ ИнфоСофт Сумин Д.В. 26.01.2024 УА #62586
	ВидимостьПрикрепитьКИЗ = Ложь;
	//- ИнфоСофт Сумин Д.В. 26.01.2024 УА #62586
	//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
	ВидимостьАктыИНакладные = Ложь;
	//- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
	//+ ИнфоСофт Заварин К.В. 26.04.24 УА #71409
	Видимостьtpl_provider = Истина;
	//- ИнфоСофт Заварин К.В. 26.04.24 УА #71409
	//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
	ВидимостьУпаковкаТоваров = Ложь;
	//- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
	
	//+ ИнфоСофт Заварин К.В. 18.10.24 УА #74582
	Видимостьis_express = Истина;
	//- ИнфоСофт Заварин К.В. 18.10.24 УА #74582
	
	Статусы = Новый Массив;

	Если ОтборОтправлений = "Сборка" Тогда                                                  		

		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_СтатусыОтправлений.awaiting_packaging"));
				
		ВидимостьСобратьЗаказы = Истина;
	    //+ ИнфоСофт Сумин Д.В. 26.01.2024 УА #62586
		ВидимостьПрикрепитьКИЗ = Истина;
		//- ИнфоСофт Сумин Д.В. 26.01.2024 УА #62586
		
	ИначеЕсли ОтборОтправлений = "Отгрузка" Тогда
	
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_СтатусыОтправлений.awaiting_deliver"));
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_СтатусыОтправлений.awaiting_registration"));
		
		//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
		ВидимостьАктыИНакладные = Истина;
		//- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
		ВидимостьПечатьЭтикеток = Истина;
		//+ ИнфоСофт Заварин К.В. 10.08.24 УА #76631
		ВидимостьКомпактныхПечатьЭтикеток = Истина;
		//- ИнфоСофт Заварин К.В. 10.08.24 УА #76631
		//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
		ВидимостьУпаковкаТоваров = Истина;
		//- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
					
	ИначеЕсли ОтборОтправлений = "Спорные" Тогда
			
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_СтатусыОтправлений.arbitration"));
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_СтатусыОтправлений.not_accepted"));
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_СтатусыОтправлений.client_arbitration"));
			
	ИначеЕсли ОтборОтправлений = "Доставка" Тогда
			
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_СтатусыОтправлений.delivering"));
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_СтатусыОтправлений.driver_pickup"));
				
	ИначеЕсли ОтборОтправлений = "Доставлены" Тогда
			
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_СтатусыОтправлений.delivered"));
		
		Элементы.СписокСобратьЗаказ.Видимость = Ложь;
		
	ИначеЕсли ОтборОтправлений = "Отменены" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_СтатусыОтправлений.cancelled"));
				
	Иначе // Все
	
		ВсеОтправления = Истина;
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_СтатусыОтправлений.ПустаяСсылка")); 
		ВидимостьСобратьЗаказы = Истина;
		ВидимостьStatus = Истина;
		ВидимостьПечатьЭтикеток = Истина;
		//+ ИнфоСофт Заварин К.В. 10.08.24 УА #76631
		ВидимостьКомпактныхПечатьЭтикеток = Истина;
		//- ИнфоСофт Заварин К.В. 10.08.24 УА #76631
		//+ ИнфоСофт Сумин Д.В. 26.01.2024 УА #62586
		ВидимостьПрикрепитьКИЗ = Истина;
		//- ИнфоСофт Сумин Д.В. 26.01.2024 УА #62586 
		//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
		ВидимостьАктыИНакладные = Истина;
		//- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
		//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
		ВидимостьУпаковкаТоваров = Истина;
		//- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
		
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ВсеОтправления", ВсеОтправления); 
	Список.Параметры.УстановитьЗначениеПараметра("Статусы", Статусы);
	Элементы.СписокСобратьЗаказ.Видимость = ВидимостьСобратьЗаказы;
	Элементы.status.Видимость = ВидимостьStatus;
	Элементы.ПечатьЭтикеток.Видимость = ВидимостьПечатьЭтикеток;
	//+ ИнфоСофт Заварин К.В. 10.08.24 УА #76631
	Элементы.ПечатьКомпактныхЭтикеток.Видимость	= ВидимостьКомпактныхПечатьЭтикеток;
	//- ИнфоСофт Заварин К.В. 10.08.24 УА #76631
    //+ ИнфоСофт Сумин Д.В. 26.01.2024 УА #62586
	Элементы.СписокПрикрепитьКиз.Видимость = ВидимостьПрикрепитьКИЗ;
	//- ИнфоСофт Сумин Д.В. 26.01.2024 УА #62586
	//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
	Элементы.СписокАктИНакладная.Видимость = ВидимостьАктыИНакладные;
	//- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
	//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167	
	Элементы.ОткрытьФормуСборкиЗаказов.Видимость = ВидимостьУпаковкаТоваров;
	//- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.09.23 УА #62462

//+ ИнфоСофт Сумин Д.В. 09.01.2023 УА #68183
&НаСервере
Процедура ВыделитьЭлементыСписка(Состав)
	
	ИскомыеЗаказы = ПолучитьИскомыеЗаказы(Состав); 
	
	Элементы.Список.ВыделенныеСтроки.Очистить();
	
	Для Каждого Строка Из ИскомыеЗаказы Цикл
		Элементы.Список.ВыделенныеСтроки.Добавить(Строка.Заказ.Ссылка);	
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 09.01.2023 УА #68183 

//+ ИнфоСофт Сумин Д.В. 09.01.2023 УА #68183
&НаКлиенте
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт
	
	Если не ЗначениеЗаполнено(Строка) Тогда
		Возврат;	
	КонецЕсли;
	
	ВыделитьЭлементыСписка(Строка);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 09.01.2023 УА #68183	

//+ ИнфоСофт Сумин Д.В. 09.01.2023 УА #68183
&НаСервере
Функция ПолучитьИскомыеЗаказы(Состав)
	
	Статусы = Новый Массив;

	Если ОтборОтправлений = "Сборка" Тогда                                                  		

		Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_packaging);
					
	ИначеЕсли ОтборОтправлений = "Отгрузка" Тогда
	
		Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_deliver);
		Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_registration);
					
	ИначеЕсли ОтборОтправлений = "Спорные" Тогда
			
		Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.arbitration);
		Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.not_accepted);
		Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.client_arbitration);
			
	ИначеЕсли ОтборОтправлений = "Доставка" Тогда
			
		Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.delivering);
		Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.driver_pickup);
				
	ИначеЕсли ОтборОтправлений = "Доставлены" Тогда
			
		Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.delivered);
		
	ИначеЕсли ОтборОтправлений = "Отменены" Тогда
		
		Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.cancelled);
				
	Иначе // Все
	
		Для Каждого Элемент Из Перечисления.ИС_Ozon_СтатусыОтправлений Цикл
			Статусы.Добавить(Элемент);		
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Заказproducts.Ссылка КАК Ссылка,
	|	ИС_Ozon_Заказproducts.НоменклатураOzon.offer_id КАК offer_id,
	|	ИС_Ozon_Заказproducts.quantity КАК quantity
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|		ПО (ИС_Ozon_Заказproducts.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ)
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка.Профиль = &Профиль
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status В (&Статусы)
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Статусы", Статусы);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Заказы = Новый ТаблицаЗначений;
	
	Заказы.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ИС_Ozon_Заказ"));
	
	Пока Выборка.Следующий() Цикл
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		СоставСборка = "";
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СоставСборка = СоставСборка + ВыборкаДетальныеЗаписи.offer_id + " - " + ВыборкаДетальныеЗаписи.quantity + " шт." + Символы.ПС;			
		КонецЦикла; 
		
		Если СтрНайти(НРег(СоставСборка), Нрег(Состав)) > 0 Тогда
			НоваяСтрока = Заказы.Добавить();
			НоваяСтрока.Заказ = Выборка.Ссылка; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат Заказы;
	
КонецФункции//- ИнфоСофт Сумин Д.В. 09.01.2023 УА #68183

//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
&НаСервере
Функция АктИНакладнаяНаСервере(Склад
	//+ ИнфоСофт Заварин К.В. 11.04.25 УА #77376
	, Грузоместа)
	//Возврат ИС_Ozon_Сервер.АктИНакладная(Профиль, Склад);
	Возврат ИС_Ozon_Сервер.АктИНакладная(Профиль, Склад, Грузоместа);
	//- ИнфоСофт Заварин К.В. 11.04.25 УА #77376 
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585

//+ ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168
&НаСервере
Функция ПолучитьЛистПодбораНаСервере(ВыделенныеСтроки) 
	
	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_Ozon_ПечатьЛистаПодбора";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;  
	ТабДок.АвтоМасштаб = Истина;
	
	ТабДок.ПолеСправа = 7;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_Ozon_Заказ.ПФ_MXL_ЛистПодбора");
		
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить("ПечататьНомерСтроки");       	
	МассивЗначений.Добавить("ПечататьНомерСборочного");
	МассивЗначений.Добавить("ПечататьНомерЗаказа"); 	
	МассивЗначений.Добавить("ПечататьНомерРеализации");   		
	МассивЗначений.Добавить("ПечататьНазвание");	    
	МассивЗначений.Добавить("ПечататьРазмер");	
	МассивЗначений.Добавить("ПечататьАртикулОзон");
	МассивЗначений.Добавить("ПечататьАртикул1С");	
	МассивЗначений.Добавить("ПечататьШтрихкод");
	МассивЗначений.Добавить("ПечататьКоличество");   	
	МассивЗначений.Добавить("ПечататьФото");
	
	НастройкиПечати = ИС_МП_Печать.ПолучитьНастройкиПечатиЛистаПодбора(Профиль, МассивЗначений, Перечисления.ИС_МП_Маркетплейсы.Озон);	
	
	ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка|ОсновнойЛист");
	
	ОбластьШапка.Параметры.Дата = ТекущаяДатаСеанса();
	ОбластьШапка.Параметры.Профиль = Профиль;	
	
	Если ЗначениеЗаполнено(СортировкаПечати) Тогда	
		ОбластьШапка.Параметры.Сорт = Элементы.СортировкаПечати.СписокВыбора.НайтиПоЗначению(СортировкаПечати).Представление;
	Иначе
		СортировкаПечати = "НомерЗадания";
		ОбластьШапка.Параметры.Сорт = Элементы.СортировкаПечати.СписокВыбора.НайтиПоЗначению(СортировкаПечати).Представление;
	КонецЕсли;                                  	
	
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #9864	
	//Табдок.Вывести(ОбластьШапка); 
		
	//ИС_МП_Печать.ЗаполнитьШапкуТаблицыЛистаПодбора(Табдок, МакетОбработки, НастройкиПечати, МассивЗначений);	
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ИС_Ozon_Заказ.Ссылка КАК Ссылка,
	|	ПередачаТоваровХранителюТовары.Ссылка.Номер КАК НомерРеализации
	|ПОМЕСТИТЬ ВТ_РТУ
	|ИЗ
	|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО (ИС_Ozon_Заказ.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента)
	|			И (НЕ ИС_Ozon_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ИС_Ozon_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|	И ИС_Ozon_Заказ.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИС_Ozon_Заказ.Ссылка,
	|	РеализацияТоваровУслугТовары.Ссылка.Номер
	|ИЗ
	|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ИС_Ozon_Заказ.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
	|			И (НЕ ИС_Ozon_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ИС_Ozon_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|	И ИС_Ozon_Заказ.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Ozon_Заказproducts.Ссылка.Номер КАК НомерЗадания,
	|	ИС_Ozon_Заказproducts.Ссылка.Дата КАК Дата,
	|	ИС_Ozon_Заказproducts.НоменклатураOzon.Наименование КАК Наименование,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Размер,
	|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id, ""Отсутствует Сопоставление"") КАК Артикул,	
	|	Подстрока(ИС_Ozon_Заказproducts.Ссылка.Номер, СтрНайти(ИС_Ozon_Заказproducts.Ссылка.Номер, ""-"") - 4, 4) КАК НомерЭтикетки,	
	|	ЕСТЬNULL(ИС_Ozon_Заказproducts.НоменклатураOzon.Штрихкод, """""""") КАК Штрихкод,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ФайлКартинки КАК ФайлКартинки,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,	
	|	ИС_Ozon_Заказproducts.quantity КАК Количество,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура.Артикул КАК Артикул1С,
	|	ИС_Ozon_Заказproducts.Ссылка.Заказ.Номер КАК НомерЗаказа,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_Заказproducts.Ссылка.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ МИНИМУМ(ВТ_РТУ.НомерРеализации)
	|	КОНЕЦ КАК НомерРеализации               	
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|		ПО (ИС_Ozon_Заказproducts.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО (ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Ссылка = ИС_Ozon_Заказproducts.НоменклатураOzon.Ссылка)		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ КАК ВТ_РТУ
	|		ПО ИС_Ozon_Заказproducts.Ссылка = ВТ_РТУ.Ссылка
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка В (&МассивСсылок)
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status <> ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_СтатусыОтправлений.cancelled)
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status.Порядок <> ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_СтатусыОтправлений.cancelled_from_split_pending)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_Ozon_Заказproducts.Ссылка.Номер,
	|	ИС_Ozon_Заказproducts.Ссылка.Дата,
	|	ИС_Ozon_Заказproducts.НоменклатураOzon.Наименование,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ФайлКартинки,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура,	
	|	ИС_Ozon_Заказproducts.quantity,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура.Артикул,
	|	ИС_Ozon_Заказproducts.Ссылка.Заказ.Номер,
	|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id, ""Отсутствует Сопоставление""),
	|	ЕСТЬNULL(ИС_Ozon_Заказproducts.НоменклатураOzon.Штрихкод, """"""""),
	|	ИС_Ozon_Заказproducts.Ссылка.Заказ	
	|
	|УПОРЯДОЧИТЬ ПО
	|	%1";

	БуферСортировкаПечати = СортировкаПечати;  
	Если БуферСортировкаПечати = "Наименование" Тогда
		БуферСортировкаПечати = "Наименование, Размер";
	ИначеЕсли БуферСортировкаПечати = "offer_id" Тогда		
		БуферСортировкаПечати = "Артикул";
	КонецЕсли;
		
	Запрос.Текст = СтрШаблон(Запрос.Текст, БуферСортировкаПечати);
	
	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать лист подбора");
		Возврат Табдок;	
	КонецЕсли;
	
	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон");
	
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
					
	Выборка = РезультатЗапроса.Выбрать();
	
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	ОбластьШапка.Параметры.КоличествоЗаданий = Выборка.Количество();
	Табдок.Вывести(ОбластьШапка); 
	ИС_МП_Печать.ЗаполнитьШапкуТаблицыЛистаПодбора(Табдок, МакетОбработки, НастройкиПечати, МассивЗначений);	
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	
	ВысотаОбластей = Табдок.ВысотаТаблицы;
	
	Если ВыводитьКомплектующие Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ВТ.НомерЗадания КАК НомерЗадания,
		|	ВТ.Номенклатура КАК Номенклатура,		
		|	ВТ.Размер КАК Размер,
		|	ВТ.Штрихкод КАК Штрихкод		
		|	ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.НомерЗадания КАК НомерЗадания,
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,		
		|	ВТ_Номенклатура.Размер КАК Размер,
		|	ВТ_Номенклатура.Штрихкод КАК Штрихкод,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК НоменклатураНабора,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК ХарактеристикаНабора,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ФайлКартинки КАК ФайлКартинки,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	СоставНаборов.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ПО ВТ_Номенклатура.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
		|			И ВТ_Номенклатура.Размер = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.Наименование";     
		
		Запрос.УстановитьПараметр("ВТ", РезультатЗапроса.Выгрузить());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыгрузкаНаборы = РезультатЗапроса.Выгрузить(); 
		
	КонецЕсли; 
		
	НомерСтроки = 0; 
	
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	МассивВыведенныхЗаказов = Новый Массив;
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьВыведена = Ложь; 
		
		//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
		Если МассивВыведенныхЗаказов.Найти(Выборка.НомерЗадания) <> Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
		
		Для Каждого Параметр Из МассивЗначений Цикл
			
			Если НастройкиПечати[Параметр] Тогда
				
				ОбластьСтроки = МакетОбработки.ПолучитьОбласть("ДанныеСтроки|" + Сред(Параметр, 9));
				
				ЗаполнитьЗначенияСвойств(ОбластьСтроки.Параметры, Выборка);
								
				Если Параметр = "ПечататьНомерСтроки" Тогда             
					НомерСтроки = НомерСтроки + 1;
					ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;						
				КонецЕсли;				
				
				Если Параметр = "ПечататьНазвание" Тогда
					ОбластьСтроки.Параметры.Название = СтрШаблон("%1 %2", Выборка.Номенклатура, Выборка.Размер);	
				КонецЕсли; 
				
				Если Параметр = "ПечататьШтрихкод" Тогда
					
					ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
					
					ПараметрыШК.Ширина = Окр(ОбластьСтроки.Рисунки.КартинкаШК.Ширина / КоличествоМиллиметровВПикселе);
					ПараметрыШК.Высота = Окр(ОбластьСтроки.Рисунки.КартинкаШК.Высота / КоличествоМиллиметровВПикселе);
					ПараметрыШК.РазмерШрифта = 10;
					ПараметрыШК.Штрихкод = Выборка.Штрихкод;
					ПараметрыШК.Масштабировать = Истина;
					ПараметрыШК.СохранятьПропорции = Истина;
					ПараметрыШК.ВертикальноеВыравнивание = 2; 
					
					СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
					
					Если СтруктураКартинки.Результат Тогда	
						ОбластьСтроки.Рисунки.КартинкаШК.Картинка = СтруктураКартинки.Картинка;
					КонецЕсли; 
					
				КонецЕсли;
				
				Если Параметр = "ПечататьФото" И ЗначениеЗаполнено(Выборка.ФайлКартинки) Тогда
					ОбластьСтроки.Рисунки.КартинкаТовара.Картинка = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.ФайлКартинки));
				КонецЕсли;
				
				//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
				Если Не ТабДок.ПроверитьВывод(ОбластьСтроки) Тогда 					
					Табдок.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
				
				Если ОбластьВыведена Тогда
					ТабДок.Присоединить(ОбластьСтроки);	
				Иначе  
					ТабДок.Вывести(ОбластьСтроки);
					ВысотаОбластей = ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы;
					ОбластьВыведена = Истина;
				КонецЕсли; 
				
				//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648				
				//Если ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы >= 71 Тогда 					
				//	Табдок.ВывестиГоризонтальныйРазделительСтраниц();
				//	ВысотаОбластей = 0;
				//КонецЕсли;
				//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
				
			КонецЕсли;
			
		КонецЦикла;
		
		//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
		Если ДополнительноУпорядочитьПоНомеруСборочногоЗадания 
			И МассивВыведенныхЗаказов.Найти(Выборка.НомерЗадания) = Неопределено Тогда
			
			ВысотаСтроки = МакетОбработки.ПолучитьОбласть("ДанныеСтроки|НомерСборочного").ВысотаТаблицы;
			
			СтруктураПоиска = Новый Структура("НомерЗадания", Выборка.НомерЗадания);
			
			ВыборкаПоиска = Выборка;
			
			ВысотаОбластейДоВывода = ВысотаОбластей;
			КоличествоКолонокДоСборочногоЗадания = 0;
			КоличествоКолонокСборочноеЗадание = 0;
			КоличествоСтрок = 1;
			НомерСборочногоЗаданияПройден = Ложь;
			НужноОбъединить = Ложь;
			
			Пока ВыборкаПоиска.НайтиСледующий(СтруктураПоиска) Цикл
				
				ОбластьВыведена = Ложь;
				
				Для Каждого Параметр Из МассивЗначений Цикл
					
					Если НастройкиПечати[Параметр] Тогда
						
						ОбластьСтроки = МакетОбработки.ПолучитьОбласть("ДанныеСтроки|" + Сред(Параметр, 9));
						
						ЗаполнитьЗначенияСвойств(ОбластьСтроки.Параметры, Выборка);
						
						Если Параметр = "ПечататьНомерСтроки" Тогда             
							НомерСтроки = НомерСтроки + 1;
							ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;						
						КонецЕсли;				
						
						Если Параметр = "ПечататьНазвание" Тогда
							ОбластьСтроки.Параметры.Название = СтрШаблон("%1 %2", Выборка.Номенклатура, Выборка.Размер);	
						КонецЕсли; 
						
						Если Параметр = "ПечататьШтрихкод" Тогда
							
							ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
							
							ПараметрыШК.Ширина = Окр(ОбластьСтроки.Рисунки.КартинкаШК.Ширина / КоличествоМиллиметровВПикселе);
							ПараметрыШК.Высота = Окр(ОбластьСтроки.Рисунки.КартинкаШК.Высота / КоличествоМиллиметровВПикселе);
							ПараметрыШК.РазмерШрифта = 10;
							ПараметрыШК.Штрихкод = Выборка.Штрихкод;
							ПараметрыШК.Масштабировать = Истина;
							ПараметрыШК.СохранятьПропорции = Истина;
							ПараметрыШК.ВертикальноеВыравнивание = 2; 
							
							СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
							
							Если СтруктураКартинки.Результат Тогда	
								ОбластьСтроки.Рисунки.КартинкаШК.Картинка = СтруктураКартинки.Картинка;
							КонецЕсли; 
							
						КонецЕсли;
						
						Если Параметр = "ПечататьФото" И ЗначениеЗаполнено(Выборка.ФайлКартинки) Тогда
							ОбластьСтроки.Рисунки.КартинкаТовара.Картинка = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.ФайлКартинки));
						КонецЕсли;
												
						Если Не ТабДок.ПроверитьВывод(ОбластьСтроки) Тогда 					
							Табдок.ВывестиГоризонтальныйРазделительСтраниц();
						КонецЕсли;					
						
						Если ОбластьВыведена Тогда
							ТабДок.Присоединить(ОбластьСтроки);	
						Иначе  
							ТабДок.Вывести(ОбластьСтроки);
							ВысотаОбластей = ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы;
							ОбластьВыведена = Истина;
						КонецЕсли;
						
						Если Параметр = "ПечататьНомерСборочного" Тогда
							НомерСборочногоЗаданияПройден = Истина;
							КоличествоКолонокСборочноеЗадание = ОбластьСтроки.ШиринаТаблицы;
							НужноОбъединить = Истина;
						КонецЕсли;
						
						Если Не НомерСборочногоЗаданияПройден Тогда
							КоличествоКолонокДоСборочногоЗадания = КоличествоКолонокДоСборочногоЗадания + ОбластьСтроки.ШиринаТаблицы;	
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				КоличествоСтрок = КоличествоСтрок + 1;
				
			КонецЦикла;
			
			Если НужноОбъединить Тогда
				ТабДок.Область(ВысотаОбластейДоВывода + 1 - ВысотаСтроки, 
				КоличествоКолонокДоСборочногоЗадания + 1,
				ВысотаОбластей,
				КоличествоКолонокДоСборочногоЗадания + КоличествоКолонокСборочноеЗадание).Объединить();	
			КонецЕсли;
					
			МассивВыведенныхЗаказов.Добавить(Выборка.НомерЗадания);
			Выборка.Сбросить();
			
		КонецЕсли; 		
		//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
		
		Если ВыводитьКомплектующие И ВыгрузкаНаборы.Количество() > 0 Тогда                    
			
			НайденныеСтроки = ВыгрузкаНаборы.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Выборка.Номенклатура, Выборка.Размер));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Для Каждого Строка Из НайденныеСтроки Цикл
					
					Для Каждого Строка Из НайденныеСтроки Цикл
						
						ОбластьВыведена = Ложь; 
						
						Для Каждого Параметр Из МассивЗначений Цикл
							
							Если НастройкиПечати[Параметр] Тогда
								
								ОбластьСтроки = МакетОбработки.ПолучитьОбласть("ДанныеСтроки|" + Сред(Параметр, 9));
								
								ЗаполнитьЗначенияСвойств(ОбластьСтроки.Параметры, Строка);  
								
								Если Параметр = "ПечататьНазвание" Тогда
									ОбластьСтроки.Параметры.Название     = СтрШаблон("Комплектующая набора: %1 %2 в количестве %3", Строка.НоменклатураНабора, Строка.ХарактеристикаНабора, Строка.КоличествоУпаковок);
								КонецЕсли; 
								
								Если Параметр = "ПечататьФото" И ЗначениеЗаполнено(Строка.ФайлКартинки) Тогда								
									ОбластьСтроки.Рисунки.КартинкаТовараНабор.Картинка = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(Строка.ФайлКартинки));								
								КонецЕсли;
								
								//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
								Если Не ТабДок.ПроверитьВывод(ОбластьСтроки) Тогда 					
									Табдок.ВывестиГоризонтальныйРазделительСтраниц();
								КонецЕсли;
								//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
								
								Если ОбластьВыведена Тогда
									ТабДок.Присоединить(ОбластьСтроки);	
								Иначе  
									ТабДок.Вывести(ОбластьСтроки);
									ВысотаОбластей = ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы;
									ОбластьВыведена = Истина;
								КонецЕсли; 
								
								//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648								
								//Если ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы >= 71 Тогда 					
								//	Табдок.ВывестиГоризонтальныйРазделительСтраниц();
								//	ВысотаОбластей = 0;
								//КонецЕсли;
								//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
								
							КонецЕсли;
							
						КонецЦикла;
						
						ВыгрузкаНаборы.Удалить(Строка);
						
					КонецЦикла; 
					
				КонецЦикла;
				
			КонецЕсли; 	    
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Табдок;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168

//+ ИнфоСофт Заварин К.В. 07.06.24 УА #70730
&НаСервере
Функция ПолучитьШтрихкодовНаСервере(ВыделенныеСтроки)
	
	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_Ozon_ПечатьШтрихкодов";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	
	Если не ЗначениеЗаполнено(СортировкаПечатиШтрихкодов) Тогда
		СортировкаПечатиШтрихкодов = "58х40";	
	КонецЕсли;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_Ozon_Заказ.ПФ_MXL_Штрихкод" + СортировкаПечатиШтрихкодов);

	
	Запрос = Новый Запрос;
	//+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816	
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ИС_Ozon_Заказproducts.Ссылка.Номер КАК Номер,
	//|	ИС_Ozon_Заказproducts.НоменклатураOzon.Наименование КАК Наименование,
	//|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	//|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id,""Отсутствует Сопоставление"") КАК offer_id,
	//|	ЕСТЬNULL(ИС_Ozon_Заказproducts.НоменклатураOzon.Штрихкод, """") КАК Штрихкод,
	//|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ФайлКартинки КАК ФайлКартинки,
	//|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура
	//|ИЗ
	//|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	//|		ПО ИС_Ozon_Заказproducts.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	//|		ПО (ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Ссылка = ИС_Ozon_Заказproducts.НоменклатураOzon.Ссылка)
	//|ГДЕ
	//|	ИС_Ozon_Заказproducts.Ссылка В(&МассивСсылок)
	//|	И ИС_Ozon_СтатусыСборочныхЗаданий.status <> ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_СтатусыОтправлений.cancelled)
	//|	И ИС_Ozon_СтатусыСборочныхЗаданий.status.Порядок <> ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_СтатусыОтправлений.cancelled_from_split_pending)
	//|
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	%1";
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Заказproducts.Ссылка.Номер КАК НомерЗаказаСМаркетплейса,
	|	ИС_Ozon_Заказproducts.Ссылка.Дата КАК Дата,
	|	ИС_Ozon_Заказproducts.НоменклатураOzon.Наименование КАК НаименованиеНоменклатурыСМаркетплейса,
	|	ИС_Ozon_Заказproducts.НоменклатураOzon.Код КАК КодНоменклатурыСМаркетплейса,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика1С,
	|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id, ""Отсутствует Сопоставление"") КАК АртикулПоставщикаНоменклатурыСМаркетплейса,
	|	ЕСТЬNULL(ИС_Ozon_Заказproducts.НоменклатураOzon.Штрихкод, """") КАК ШтрихкодСМаркетплейса,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура1С,
	|	ИС_Ozon_Заказproducts.Ссылка.Заказ КАК Заказ,
	|	"""" КАК ЦветСВБ,
	|	"""" КАК РазмерСВБ
	|ПОМЕСТИТЬ ВТ_ДанныеМаркетплейса
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|		ПО ИС_Ozon_Заказproducts.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО (ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Ссылка = ИС_Ozon_Заказproducts.НоменклатураOzon.Ссылка)
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка В(&МассивСсылок)
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status <> ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_СтатусыОтправлений.cancelled)
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status.Порядок <> ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_СтатусыОтправлений.cancelled_from_split_pending)
	|;
	|" + ИС_МП_Печать.ТекстЗапросаПараметровПечатиШтрихкодов() + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	%1";
	
	//Метод деревянный. Используется пока что для быстрой обратной совместимости, чтобы в случае изменения/отката не переделывать вызовы печати
	//с сортировкой везде
	//+ ИнфоСофт Стояк Ю.К. 23.12.2024 УА #89956	
	КопияСортировкаПечати = СортировкаПечати;
	
	Если КопияСортировкаПечати = "Наименование" Тогда
		КопияСортировкаПечати = "НаименованиеНоменклатурыСМаркетплейса, Характеристика1С"; 
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93644	
	//ИначеЕсли КопияСортировкаПечати = "Номер" Тогда	
	ИначеЕсли КопияСортировкаПечати = "НомерЗадания" Тогда  
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93644
		КопияСортировкаПечати = "НомерЗаказаСМаркетплейса"; 
	ИначеЕсли КопияСортировкаПечати = "offer_id" Тогда                      
		КопияСортировкаПечати = "АртикулПоставщикаНоменклатурыСМаркетплейса";  
	КонецЕсли;
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, КопияСортировкаПечати);
	//- ИнфоСофт Стояк Ю.К. 23.12.2024 УА #89956
	//Запрос.Текст = СтрШаблон(Запрос.Текст, ?(СортировкаПечати = "Наименование", "Наименование, Характеристика", СортировкаПечати));
    //- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816

	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки);

	РезультатЗапроса = Запрос.Выполнить();

	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать штрихкоды Ozon");
		Возврат Табдок;	
	КонецЕсли;
		
	ОбластьЭтикетка = МакетОбработки.ПолучитьОбласть("Этикетка");
	
	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
					
	Выборка = РезультатЗапроса.Выбрать();
	
	Первый = Истина;	
	Пока Выборка.Следующий() Цикл
		
		//+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816		
		//Если СортировкаПечатиШтрихкодов = "58х40" Тогда
		//	
		//	ОбластьЭтикетка.Параметры.Наименование 	 = Выборка.Наименование;
		//	ОбластьЭтикетка.Параметры.Характеристика = Выборка.Характеристика;
		//	ОбластьЭтикетка.Параметры.Штрихкод       = Выборка.Штрихкод;
		//КонецЕсли;
		//
		//Если СортировкаПечатиШтрихкодов = "43х25" Тогда
		//	ОбластьЭтикетка.Параметры.Штрихкод      = Выборка.Штрихкод;
		//КонецЕсли;
		ЗаполнитьЗначенияСвойств(ОбластьЭтикетка.Параметры, Выборка);
		//- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816

		ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
				
		ПараметрыШК.Ширина = Окр(ОбластьЭтикетка.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе);
		ПараметрыШК.Высота = Окр(ОбластьЭтикетка.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе);
		ПараметрыШК.РазмерШрифта = 10;   
		
		//+ ИнфоСофт Заварин К.В. 10.12.24 УА #89316
		//ПараметрыШК.Штрихкод = Выборка.Штрихкод;
		ПараметрыШК.Штрихкод = Выборка.ШтрихкодСМаркетплейса;
		//- ИнфоСофт Заварин К.В. 10.12.24 УА #89316
		
		ПараметрыШК.Масштабировать = Истина;
		ПараметрыШК.СохранятьПропорции = Истина;
		ПараметрыШК.ВертикальноеВыравнивание = 2; 
		
		СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
		
		Если СтруктураКартинки.Результат Тогда	
			ОбластьЭтикетка.Рисунки.Штрихкод.Картинка = СтруктураКартинки.Картинка;
		КонецЕсли;  
		
		Если Не Первый Тогда
			Табдок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Первый = Ложь;
			
		Табдок.Вывести(ОбластьЭтикетка);
			
	КонецЦикла;    
			
	Возврат Табдок;
	
КонецФункции //- ИнфоСофт Заварин К.В. 07.06.24 УА #70730

//+ ИнфоСофт Сумин Д.В. 14.12.2023 УА #63115 
&НаСервере
Функция ВыполнитьПроверкуСкладаНаИспользованияЯчеек(ВыделенныеСтроки)
	
	Для Каждого Элемент Из ВыделенныеСтроки Цикл
		Если Элемент.Склад.Склад.ИспользоватьСкладскиеПомещения Тогда
			Возврат Истина;	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 14.12.2023 УА #63115

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Функция ПараметрыОжидания()

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);	
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	Возврат ПараметрыОжидания;

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Процедура ПолучениеЗаказовЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы["КартинкаОжидание"].Видимость = Ложь;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли; 
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469	
	//ПолучитьДатуПоследнегоЗаказа(Профиль, ДатаПоследнегоОтправления); 
	ПолучитьДатуПоследнегоЗаказа(Профиль, ДатаПоследнегоОтправления, ДатаПоследнегоОтправленияФБО); 
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	Элементы.Список.Обновить();
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Процедура ОбновитьСтатусыЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы["КартинкаОжиданиеСтатусы"].Видимость = Ложь;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаСервереБезКонтекста
Функция ПроверитьРегламетноеЗаданиеНаСервере(Профиль, ИмяКоманды)
	
	РеглАктивен = Ложь;
	
	Если Не РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		
		УникальныйИдентификатор = ИС_MP_РаботаСРегламентнымиЗаданиями.ПолучитьУникальныйИдентификаторРегламентогоЗадания(Профиль, ИмяКоманды);
		
		Если ЗначениеЗаполнено(УникальныйИдентификатор) Тогда
						
			Попытка
				УстановитьПривилегированныйРежим(Истина);
				РегламентноеЗадание = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(УникальныйИдентификатор);
				
				РеглАктивен = ИС_MP_РаботаСРегламентнымиЗаданиями.ФоновоеЗаданиеАктивно(РегламентноеЗадание);
				УстановитьПривилегированныйРежим(Ложь);	 
			Исключение
				РеглАктивен = Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РеглАктивен;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
&НаСервере
Функция ВыводПамяткиПоРедактированиюМакетаНаСервере()
	
	Табдок = Новый ТабличныйДокумент;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_ПамяткаПоРедактированиюМакета");
	ОбластьПамятка = МакетОбработки.ПолучитьОбласть("Памятка");
	
	Табдок.Вывести(ОбластьПамятка);   
	
	Возврат Табдок;   
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816

//+ ИнфоСофт Заварин К.В. 13.11.24 УА #85881
&НаСервере
Процедура ПометитьНаУдалениеПривязанныеДокументыНаСервере()
	
	Событие = "ИС_Ozon_Заказ.ПометитьНаУдалениеПривязанныеДокументыНаСервере";
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		
		ИС_MP_РаботаСЗаказами.ПометитьНаУдалениеПривязанныеДокументы(Строка.Заказ);
		
		СтрокаСборочноеЗадание = Строка.ПолучитьОбъект();
		
		СтрокаСборочноеЗадание.ПометкаУдаления = Истина; 			
		
		Попытка	
			СтрокаСборочноеЗадание.Записать();
		Исключение 
			
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			
		КонецПопытки;
		
	КонецЦикла;
			
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.11.24 УА #85881

//+ ИнфоСофт Конышев А.Е. 06.12.24 УА #77791
&НаСервере
Процедура ПрисвоитьТрекНомерЗавершение(ТрекНомер, СтруктураПараметров) Экспорт

	Если ЗначениеЗаполнено(ТрекНомер) Тогда
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("posting_number", СтруктураПараметров.НомерОтправления);
		СтруктураДанных.Вставить("tracking_number", СокрЛП(ТрекНомер));
			
		Результат = ИС_Ozon_Сервер.УстановитьТрекНомерОтправления(Профиль, СтруктураДанных);
		
		Если Результат = Неопределено Тогда
			Сообщить("Не удалось присвоить трек-номер");
		Иначе
			ЗаказОбъект = СтруктураПараметров.Заказ.ПолучитьОбъект();
			ЗаказОбъект.tracking_number = ТрекНомер;
			ЗаказОбъект.Записать();		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Конышев А.Е. 06.12.24 УА #77791

//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
&НаСервере
Функция ПолучитьЗначениеПараметра()
	
	МассивНаименованийПараметров = Новый Массив;  	
	МассивНаименованийПараметров.Добавить("РазнестиЗаказыПоКоличеству");
		
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, МассивНаименованийПараметров);
	
	Если Настройки.Свойство("РазнестиЗаказыПоКоличеству") И ТипЗнч(Настройки.РазнестиЗаказыПоКоличеству) = Тип("Булево") Тогда
		Возврат Настройки.РазнестиЗаказыПоКоличеству;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
&НаСервере
Функция ПреобразоватьДеревоВТаблицуЗначений(ДеревоЗначений, ТекущийОбъект)
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		
		Если Строка.Строки.Количество() = 0 Тогда
			
			НоваяСтрока = ТекущийОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
		ИначеЕсли Строка.Строки.Количество() > 0 Тогда
			
			ПреобразоватьДеревоВТаблицуЗначений(Строка, ТекущийОбъект);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТекущийОбъект;	
КонецФункции //- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
&НаСервере
Функция  ЗаполнитьДанныеЗаказаНаСервере(Количество)
	
	Запрос = Новый Запрос;	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_СборочныеЗадания
	|ИЗ
	|	РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|ГДЕ
	|	ИС_Ozon_СтатусыСборочныхЗаданий.Профиль = &Профиль
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_СтатусыОтправлений.awaiting_deliver)
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.shipment_date МЕЖДУ &ДатаОт И &ДатаДо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Ozon_Заказproducts.Ссылка КАК Заказ,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИС_Ozon_СоответствиеХарактеристик.Номенклатура) КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИС_Ozon_СоответствиеХарактеристик.Характеристика) КАК Характеристика,
	|	СУММА(ИС_Ozon_Заказproducts.quantity) КАК КоличествоЗаказ
	|ПОМЕСТИТЬ ВТ_ЗаказыПоКоличеству
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО ИС_Ozon_Заказproducts.НоменклатураOzon = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon
	|			И ИС_Ozon_Заказproducts.Ссылка.Профиль = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_СборочныеЗадания.Заказ КАК Ссылка
	|			ИЗ
	|				ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_Ozon_Заказproducts.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Ozon_Заказproducts.Ссылка КАК Заказ,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	СУММА(ИС_Ozon_Заказproducts.quantity) КАК КоличествоЗаказ
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО ИС_Ozon_Заказproducts.НоменклатураOzon = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon
	|			И ИС_Ozon_Заказproducts.Ссылка.Профиль = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ЗаказыПоКоличеству.Заказ КАК Заказ
	|			ИЗ
	|				ВТ_ЗаказыПоКоличеству КАК ВТ_ЗаказыПоКоличеству
	|			ГДЕ
	|				&УсловиеНаКоличество)  
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_Ozon_Заказproducts.Ссылка,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Заказ КАК Заказ,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.КоличествоЗаказ КАК КоличествоЗаказ,
	|	0 КАК КоличествоФакт,
	|	""Ложь"" КАК ЭтикеткаРаспечатана
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заказ
	|ИТОГИ
	|	СУММА(КоличествоЗаказ)
	|ПО
	|	Заказ";
	
	Если Количество = 0 Тогда
		УсловиеНаКоличество = " ВТ_ЗаказыПоКоличеству.КоличествоЗаказ = 1";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаКоличество", УсловиеНаКоличество);
	Иначе
		УсловиеНаКоличество = " ВТ_ЗаказыПоКоличеству.КоличествоЗаказ > 1";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаКоличество", УсловиеНаКоличество);
	КонецЕсли; 
	
	УсловиеОзонаПоПериоду = 24 * 60 * 60 *4; 
	Запрос.УстановитьПараметр("Профиль", ЭтотОбъект.Профиль);
	Запрос.УстановитьПараметр("ДатаОт", НачалоДня(ТекущаяДатаСеанса()) - УсловиеОзонаПоПериоду);
	Запрос.УстановитьПараметр("ДатаДо", КонецДня(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Возврат Результат;
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
&НаСервере
Процедура СоздатьДокументыУпаковкиТоваровOzon(ПараметрыОткрытия)
	
	Итератор = 0;
	
	Пока Итератор < 2 Цикл // два цикла так как один документ с кол-во 1 второй с кол-вом больше 2 
		
		РезультатЗапроса 						= ЗаполнитьДанныеЗаказаНаСервере(Итератор);
		
		Если РезультатЗапроса = Неопределено или РезультатЗапроса = Ложь Тогда
			Итератор = Итератор + 1;
			Текст = НСтр("ru='По заказам с количеством товара" + ?(Итератор < 2, " 1 ", " 2 и более ") + " документ не был создан.'");			
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Продолжить;
		Иначе
			ДокументУпаковки 					= Документы.ИС_Ozon_УпаковкаТоваров.СоздатьДокумент();
			ДокументУпаковки.Дата 				= ТекущаяДатаСеанса();
			ДокументУпаковки.Ответственный 		= Пользователи.ТекущийПользователь();
			ДокументУпаковки.Профиль            = ПараметрыОткрытия.Профиль;
			РезультатЗапроса 					= ПреобразоватьДеревоВТаблицуЗначений(РезультатЗапроса,ДокументУпаковки);
			
			ДокументУпаковки.Записать(РежимЗаписиДокумента.Запись);     
			Текст = НСтр("ru='По заказам с количеством товара" + ?(Итератор < 2, " 1 ", " 2 и более ") + " был сознад документ упаковки товаров.'");			
			ОбщегоНазначения.СообщитьПользователю(Текст);
		КонецЕсли;		
		
		Итератор = Итератор + 1;
		
	КонецЦикла;	   
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762

#КонецОбласти     

