                                           
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
Функция НастройкиСоединения(Профиль) Экспорт
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ;
	МассивПараметров = ИС_ВБ_Сервер.МассивНастроекПодключения();
	
	Результат = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров);
			
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
Функция ТокенДляСервиса(Профиль, Сервис) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_МП_Токены.Токен КАК Токен
	|ИЗ
	|	Справочник.ИС_МП_Токены.СвойстваТокенаВБ КАК ИС_МП_ТокеныСвойстваТокенаВБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_МП_Токены КАК ИС_МП_Токены
	|		ПО ИС_МП_ТокеныСвойстваТокенаВБ.Ссылка = ИС_МП_Токены.Ссылка
	|ГДЕ
	|	ИС_МП_Токены.Владелец = &Профиль
	|	И ИС_МП_Токены.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.ИС_МП_Маркетплейсы.ВБ)
	|	И НЕ ИС_МП_Токены.ПометкаУдаления
	|	И &Сервис
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИС_МП_ТокеныСвойстваТокенаВБ.ДатаОкончания УБЫВ";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Сервис", "ИС_МП_ТокеныСвойстваТокенаВБ." + Сервис);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаТокена = РезультатЗапроса.Выбрать();
	
	ВыборкаТокена.Следующий();

	Возврат ВыборкаТокена.Токен;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159

#КонецОбласти
