#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	ПрофильПриИзмененииНаСервере();
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628
&НаКлиенте
Процедура ВыбратьВсе(Команда)

	Для Каждого стр Из Объект.ДанныеДляСозданияНоменклатурыOzon Цикл
		стр.Создавать = Истина;
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628
&НаКлиенте
Процедура ИсключитьВсе(Команда)

	Для Каждого стр Из Объект.ДанныеДляСозданияНоменклатурыOzon Цикл
		стр.Создавать = Ложь;
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628
&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	ВыбранныеТовары = Объект.ДанныеДляСозданияНоменклатурыOzon.НайтиСтроки(Новый Структура("Создавать", Истина));
	Если ВыбранныеТовары.Количество() = 0 Или Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Для перехода к созданию номенклатуры, необходимо выбрать один или несколько товаров и выбрать вид номенклатуры");
		Возврат;
	КонецЕсли;
	СоздатьНоменклатуруНаСервере();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628
&НаСервере
Процедура ПрофильПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_Номенклатура.Ссылка КАК НоменклатураOzon,
		|	ИС_Ozon_Номенклатура.Наименование КАК Наименование,
		|	ИС_Ozon_Номенклатура.offer_id КАК Артикул,
		|	ИС_Ozon_Номенклатура.Код КАК product_id,
		|	ИС_Ozon_Штрихкоды.Наименование КАК Штрихкод
		|ИЗ
		|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Штрихкоды КАК ИС_Ozon_Штрихкоды
		|		ПО ИС_Ozon_Номенклатура.Ссылка = ИС_Ozon_Штрихкоды.Владелец
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
		|		ПО ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon = ИС_Ozon_Номенклатура.Ссылка
		|ГДЕ
		|	ИС_Ozon_Номенклатура.Профиль = &Профиль
		|	И ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Объект.ДанныеДляСозданияНоменклатурыOzon.Загрузить(ВыборкаДетальныеЗаписи);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628


//+ ИнфоСофт Сумин Д.В. 22.02.23 УА #55507
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
 			
	Если Константы.ИспользоватьХарактеристикиНоменклатуры.Получить() Тогда
		//Элементы.СоздаватьХарактеристики.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 22.02.23 УА #55507

//+ ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628
&НаСервере
Процедура СоздатьНоменклатуруНаСервере()
	ВыбранныеТовары = Объект.ДанныеДляСозданияНоменклатурыOzon.НайтиСтроки(Новый Структура("Создавать", Истина));
	ТаблицаТовары 	= Объект.ДанныеДляСозданияНоменклатурыOzon.Выгрузить(ВыбранныеТовары);
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("ВидНоменклатуры", ВидНоменклатуры);
	СтруктураСвойств.Вставить("ГруппаНоменклатуры", ГруппаНоменклатуры);
	СтруктураСвойств.Вставить("СтавкаНДС", СтавкаНДС);
	
	Таблица = ИС_Ozon_Сервер.СоздатьНоменклатуру(ТаблицаТовары, СтруктураСвойств); 
	
	Для Каждого Строка Из Объект.ДанныеДляСозданияНоменклатурыOzon Цикл
		
		НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура("НоменклатураOzon", Строка.НоменклатураOzon)); 
		
		Если НайденныеСтроки.Количество() > 0 Тогда
				Строка.Номенклатура = НайденныеСтроки[0].Номенклатура;
		КонецЕсли; 
			
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628

#КонецОбласти

