
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Профиль.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОформление();	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура ВыгружатьОстаткиИзГруппыСкладовПриИзменении(Элемент)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура ОбщаяГруппаСкладовПриИзменении(Элемент)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура УстановитьОформление()
		
	Если ЗначениеЗаполнено(Объект.ОбщаяГруппаСкладов) Тогда
		
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Ложь;
		Элементы.ГруппаСкладов.Видимость                   = Ложь;
		Объект.ВыгружатьОстаткиИзГруппыСкладов             = Ложь;
		
	Иначе
		
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Истина;
		Элементы.ГруппаСкладов.Видимость                   = Объект.ВыгружатьОстаткиИзГруппыСкладов;
		
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти
