
#Область ПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 24.10.24 УА #68001
Функция ПредставлениеМаркетплейса() Экспорт
	Возврат "М.Видео";
КонецФункции //- ИнфоСофт Ивонин К.А. 24.10.24 УА #68001

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Функция НастройкиСоединенияПоУмолчанию() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("МВМАдресСервисаAPI", "sellers.mvideoeldorado.ru");
	Результат.Вставить("МВМПорт", 443);
	Результат.Вставить("МВМЗащищенноеСоединение", Истина);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
Функция ПараметрыТестаПодключения(Форма) Экспорт
	
	ТекстОшибки = "";
	
	Результат = Новый Структура;
	Результат.Вставить("АдресСервисаAPI", Форма.МВМАдресСервисаAPI);
	Результат.Вставить("Порт", Форма.МВМПорт);
	Результат.Вставить("ЗащищенноеСоединение", Форма.МВМЗащищенноеСоединение);
	Результат.Вставить("ClientId", Форма.МВМClientId);
	Результат.Вставить("ApiKey", Форма.МВМApiKey);
	
	Если Не ЗначениеЗаполнено(Форма.МВМClientId) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен ""Client Id""" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.МВМApiKey) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен ""Api Key""" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.МВМАдресСервисаAPI) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен ""Адрес сервиса API""" + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.МВМПорт) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен ""Порт""" + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 25.10.24 УА #68001
Функция ИмяФункцииЗагрузкиТоваров() Экспорт
	Возврат "ИС_МВМ_Сервер.ЗагрузитьТовары";	
КонецФункции //- ИнфоСофт Ивонин К.А. 25.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 25.10.24 УА #68001
Функция ДопПараметрыЗагрузкиТоваров(Форма) Экспорт	
	
	Если Не ЗначениеЗаполнено(Форма.АдресВременногоХранилищаМВМ) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для начала необходимо выбрать файл с Товарами", , , "ПутьФайлаМВМ");
		Возврат Неопределено;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Адрес", Форма.АдресВременногоХранилищаМВМ);
	
	Возврат ДопПараметры;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 25.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 04.03.25 УА #92887
Функция ПолеСопоставленияОстатков() Экспорт
	Возврат "ТоварМВМ";	
КонецФункции //- ИнфоСофт Ивонин К.А. 04.03.25 УА #92887

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
