#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьУсловноеОформление();

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ЗагрузитьКатегориТоваровСOzon(Команда)
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли;

	ЗагрузитьСАли(Команда.Имя);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ЗагрузитьЗначенияХарактеристикСOzon(Команда)
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли;

	ЗагрузитьСАли(Команда.Имя);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ВыборИспользуемыхКатегорий(Команда)

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИспользуемыхКатегорий", ЭтотОбъект);

	ОткрытьФорму("Обработка.ИС_АЛИ_ВыгрузкаКарточекТоваров.Форма.ФормаВыбораКатегорийТоваров", , ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура СопоставитьЗначенияХарактеристик(Команда)

	ОткрытьФорму("Обработка.ИС_АЛИ_ВыгрузкаКарточекТоваров.Форма.ФормаСопоставленияПолейНоменклатуры", , ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура СопоставитьОсновныеРеквизитыТоваров(Команда)

	ОткрытьФорму("Обработка.ИС_АЛИ_ВыгрузкаКарточекТоваров.Форма.ФормаСопоставленияОсновныхРеквизитов", , ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ЗагрузитьСАли(ИмяКоманды)	

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяКоманды", ИмяКоманды);  
	
	ДлительнаяОперация = ЗагрузитьСАлиНаСервере(ИмяКоманды); 
		
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеЗавершенияЗагрузкиСАли", ЭтотОбъект, ДопПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция ЗагрузитьСАлиНаСервере(ИмяКоманды) 
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);

	Если ИмяКоманды = "ЗагрузитьКатегориТоваровСАли" Тогда		
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
		"ИС_АЛИ_Сервер.ЗагрузитьКатегорииТоваров",
		Профиль);
		
	ИначеЕсли ИмяКоманды = "ЗагрузитьЗначенияХарактеристикСАли" Тогда		
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
		"ИС_АЛИ_Сервер.ЗагрузитьЗнченияАтрибутов",
		Профиль);
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура УстановитьУсловноеОформление(ИзменилисьИспользуемыеКатегории = Ложь)

	ЕстьИспользуемыеКатегории = ЕстьИспользуемыеКатегории();
	Если ЕстьИспользуемыеКатегории() Тогда
		РезультатВыбораИспользуемыхКатегорий = 2;
		ВыбранныеКатегорииТоваров = "";
	Иначе
		РезультатВыбораИспользуемыхКатегорий = 1;
		ВыбранныеКатегорииТоваров = "Не выбраны категории!";
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ПослеЗавершенияЗагрузкиСАли(Результат, СтруктураПараметров) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	УстановитьУсловноеОформление();

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ПослеВыбораИспользуемыхКатегорий(Результат, СтруктураПараметров) Экспорт

	Если Результат = Истина Тогда
		ПоказатьПредупреждение( , "После изменения используемых категорий товаров необходимо загрузить значения характеристик для новых категорий!",
			, "Предупреждение.");
		УстановитьУсловноеОформление(Результат);
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервереБезКонтекста
Функция ЕстьИспользуемыеКатегории()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИС_АЛИ_КатегорииТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_АЛИ_КатегорииТоваров КАК ИС_АЛИ_КатегорииТоваров
	|ГДЕ
	|	ИС_АЛИ_КатегорииТоваров.Используется = ИСТИНА
	|	И НЕ ИС_АЛИ_КатегорииТоваров.ПометкаУдаления
	|	И НЕ ИС_АЛИ_КатегорииТоваров.ЭтоГруппа";

	РезультатЗапроса = Запрос.Выполнить();

	Возврат Не РезультатЗапроса.Пустой();

КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

&НаКлиенте
Процедура ВыгрузитьТовары(Команда) 
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли; 

	СтруктураПараметров = Новый Структура;	
	СтруктураПараметров.Вставить("Профиль", Профиль);

	ОткрытьФорму("Обработка.ИС_АЛИ_ВыгрузкаКарточекТоваров.Форма.ФормаДобавленияТоваров", СтруктураПараметров, ЭтотОбъект);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
&НаКлиенте
Функция ПараметрыОжидания()
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = "Идет процесс загрузки...";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Интервал = 5;
	ПараметрыОжидания.ПолучатьРезультат = Истина;     
	
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.НавигационнаяСсылка = "e1cib/app/Обработка.ИС_АЛИ_ВыгрузкаКарточекТоваров";
	
	Возврат ПараметрыОжидания;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983                               

#КонецОбласти