
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

//+ ИнфоСофт Ивонин К.А. 22.08.24 УА #80374
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт	 
	// ПФ с количеством и разбиением
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИС_ЭтикеткиСКоличеством";
	КомандаПечати.Представление = НСтр("ru = 'Этикетки и штрихкоды с разбиением'");
	КомандаПечати.МенеджерПечати = "Документ.ИС_WB_СборочноеЗадание";
	КомандаПечати.Картинка = БиблиотекаКартинок.ИС_MP_QR_ШК;

	Возврат;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.08.24 УА #80374

//+ ИнфоСофт Ивонин К.А. 22.08.24 УА #80374
// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
    
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИС_ЭтикеткиСКоличеством") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ИС_ЭтикеткиСКоличеством",
			НСтр("ru = 'Этикетки и штрихкоды WildBerries с разбиением'"),
			СформироватьПечатнуюФормуЭтикеткиСКоличеством(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.08.24 УА #80374

//+ ИнфоСофт Ивонин К.А. 22.08.24 УА #80374
Функция СформироватьПечатнуюФормуЭтикеткиСКоличеством(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.АвтоМасштаб = Истина;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ИС_ЭтикеткиСКоличеством";
    
    МакетСостав = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_СоставСборки58x40");
    МакетQR = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_QR58х40");
    МакетЭтикетка = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_ШтрихкодТовара58х40");
   	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон"); 
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100; 
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("КоличествоСоставов");
	МассивПараметров.Добавить("КоличествоЭтикеток");   
	МассивПараметров.Добавить("КоличествоШтрихкодов");
	
	Профиль = МассивОбъектов[0].Профиль;
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ; 
	
	НастройкиПечати = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров);
	
	Если НастройкиПечати["КоличествоСоставов"] = Неопределено Тогда
		НастройкиПечати.КоличествоСоставов = 1;	
	КонецЕсли;
	
	Если НастройкиПечати["КоличествоЭтикеток"] = Неопределено Тогда
		НастройкиПечати.КоличествоЭтикеток = 1;	
	КонецЕсли;
	
	Если НастройкиПечати["КоличествоШтрихкодов"] = Неопределено Тогда
		НастройкиПечати.КоличествоШтрихкодов = 2;	
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode КАК НоменклатураWBvendorCode,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Наименование КАК НоменклатураWBНаименование,
	|	ИС_WB_СборочноеЗадание.РазмерWB КАК РазмерWB,
	|	ИС_WB_СборочноеЗадание.Профиль.Организация КАК ПрофильОрганизация,
	|	ИС_WB_СборочноеЗадание.Профиль.Организация.ИНН КАК ПрофильОрганизацияИНН,
	|	МАКСИМУМ(ИС_WB_ШтрихкодыРазмеров.Штрихкод) КАК Штрихкод,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Наименование КАК НаименованиеН,
	|	ИС_WB_СборочноеЗадание.ТипДоставки КАК ТипДоставки
	|ПОМЕСТИТЬ ВТ_ДанныеСборочныхЗаданий
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_ШтрихкодыРазмеров.Размер
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_СборочноеЗадание.Ссылка,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Наименование,
	|	ИС_WB_СборочноеЗадание.РазмерWB,
	|	ИС_WB_СборочноеЗадание.Профиль.Организация,
	|	ИС_WB_СборочноеЗадание.Профиль.Организация.ИНН,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Наименование,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Артикул,
	|	ИС_WB_СборочноеЗадание.ТипДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеСборочныхЗаданий.Ссылка КАК Ссылка,
	|	ВТ_ДанныеСборочныхЗаданий.НоменклатураWBvendorCode КАК Артикул,
	|	ВТ_ДанныеСборочныхЗаданий.НоменклатураWBНаименование КАК Наименование,
	|	ВТ_ДанныеСборочныхЗаданий.РазмерWB КАК РазмерWB,
	|	ВТ_ДанныеСборочныхЗаданий.ПрофильОрганизация КАК Организация,
	|	ВТ_ДанныеСборочныхЗаданий.ПрофильОрганизацияИНН КАК ИНН,
	|	ВТ_ДанныеСборочныхЗаданий.Штрихкод КАК Штрихкод,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Этикетка КАК Этикетка,
	|	ВТ_ДанныеСборочныхЗаданий.НаименованиеН КАК НаименованиеН,
	|	ВТ_ДанныеСборочныхЗаданий.ТипДоставки КАК ТипДоставки
	|ИЗ
	|	ВТ_ДанныеСборочныхЗаданий КАК ВТ_ДанныеСборочныхЗаданий
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО ВТ_ДанныеСборочныхЗаданий.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|ИТОГИ ПО
	|	РазмерWB";

	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРазмерWB = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаРазмерWB.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
				
		Выборка = ВыборкаРазмерWB.Выбрать();
		
        ПерваяЭтикета = Истина;
		
		Пока Выборка.Следующий() Цикл
			
           	Если ПерваяЭтикета Тогда
           	    
           	 	Количество = Выборка.Количество();
           	    Если Количество > 4 И Количество < 21 Тогда
           	    	Сколенение = "ов";
           	    ИначеЕсли Количество % 10 = 1 Тогда
           	    	Склонение = "з";
           	    ИначеЕсли Количество % 10 > 1 И Количество % 10 < 5 Тогда
           	    	Сколнение = "а";
           	    Иначе
           	    	Сколенение = "ов";
           	    КонецЕсли; 
           	    
           	    МакетСостав.Параметры.Количество = СтрШаблон("по 1 товару в заказе (%1 шт. заказ%2)", Количество, Сколенение);
           		МакетСостав.Параметры.Наименование = Выборка.Наименование;
           		МакетСостав.Параметры.Артикул = Выборка.Артикул;

				Для Сч = 1 По НастройкиПечати.КоличествоСоставов Цикл				
					ТабличныйДокумент.Вывести(МакетСостав);
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
				КонецЦикла;
		
				ПерваяЭтикета = Ложь;
			
			КонецЕсли;
			
			Если Выборка.ТипДоставки <> Перечисления.ИС_ВБ_ТипыДоставки.CnC Тогда
			
				МакетQR.Рисунки.КартинкаQR.Картинка = Новый Картинка(Выборка.Этикетка.Получить());
				
				Для Сч = 1 По НастройкиПечати.КоличествоЭтикеток Цикл
					ТабличныйДокумент.Вывести(МакетQR);
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Выборка.Сбросить();
		
		Пока Выборка.Следующий() Цикл
		
			МакетЭтикетка.Параметры.Наименование  = Выборка.НаименованиеН;
		    МакетЭтикетка.Параметры.Артикул = Выборка.Артикул;
			МакетЭтикетка.Параметры.Поставщик = СтрШаблон("%1 ИНН %2", Выборка.Организация, Выборка.ИНН);
	        
			ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
				        								
			ПараметрыШК.Ширина = Окр(МакетЭтикетка.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе);
			ПараметрыШК.Высота = Окр(МакетЭтикетка.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе);
			ПараметрыШК.РазмерШрифта = 10;
			ПараметрыШК.Штрихкод = Выборка.Штрихкод;
			ПараметрыШК.Масштабировать = Истина;
			ПараметрыШК.СохранятьПропорции = Истина;
			ПараметрыШК.ВертикальноеВыравнивание = 2; 
			
			СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);		
			
			Если СтруктураКартинки.Результат Тогда	
				МакетЭтикетка.Рисунки.Штрихкод.Картинка = СтруктураКартинки.Картинка;
			КонецЕсли; 
			
			Для Счетчик = 1 По НастройкиПечати.КоличествоШтрихкодов  Цикл
				ТабличныйДокумент.Вывести(МакетЭтикетка);	
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
			КонецЦикла;		
		
		КонецЦикла;
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
    
КонецФункции //- ИнфоСофт Ивонин К.А. 22.08.24 УА #80374

#КонецОбласти

#Область Отчеты

//+ ИнфоСофт Ивонин К.А. 22.08.24 УА #80374
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	КомандаОтчет = Отчеты.ИС_WB_ЛистПодбора.ДобавитьКомандуОтчета(КомандыОтчетов);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.ВидимостьВФормах = "ФормаСписка";
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.08.24 УА #80374

#КонецОбласти

#КонецОбласти

#КонецЕсли
