
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Атрибут = Неопределено;	
	Параметры.Свойство("АтрибутАли", Атрибут);	
	
	Если ЗначениеЗаполнено(Атрибут) Тогда 
		
		НовЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец"); 
		НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;		
		НовЭлементОтбора.Использование = Истина;		
		НовЭлементОтбора.ПравоеЗначение = Атрибут;  
		
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

#КонецОбласти