
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Власова И.С. 21.08.24 УА #61503
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаУслугиРаспределения.Видимость = ИспользоватьРаспределениеРасходовПоАртикулам();	
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 21.08.24 УА #61503

//+ ИнфоСофт Власова И.С. 21.08.24 УА #61503
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	
	Элементы.ГруппаУслугиРаспределения.Видимость = ИспользоватьРаспределениеРасходовПоАртикулам();
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 21.08.24 УА #61503

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Власова И.С. 21.08.24 УА #61503
&НаСервере
Функция ИспользоватьРаспределениеРасходовПоАртикулам()
	
	Возврат Объект.Профиль.РаспределятьРасходыПоАртикулам;
	
КонецФункции //- ИнфоСофт Власова И.С. 21.08.24 УА #61503

#КонецОбласти
