#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Категория", Категория);
	Параметры.Свойство("СопоставлениеОсновныхРеквизитов", СопоставлениеОсновныхРеквизитов);

	Если СопоставлениеОсновныхРеквизитов Тогда
		ЗаполнитьОсновныеРеквизитыТовара();
		Элементы.ПредставлениеРеквизитаТовара.Видимость = Истина;
		Элементы.Характеристика.Видимость 				= Ложь;
		;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КатегорияИсточникПриИзменении(Элемент)

	КатегорияИсточникПриИзмененииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Скопировать(Команда)

	СкопироватьНаСервере();
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)

	УстановитьПризнак(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)

	УстановитьПризнак(Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КатегорияИсточникПриИзмененииНаСервере()

	Если Не СопоставлениеОсновныхРеквизитов Тогда

		//Ozon_Константы 	= Ozon_КонстантыВызовСервера.ПрочитатьКонстанты();
		ХарактеристикиOzonСИндивидуальнымиЗначениямиДляКатегории = Новый Массив;
		//ИС_Ozon_Сервер.СсылкиНаСправочникИзСтроки(
		//	Ozon_Константы.ЗначенияПоИменам.ХарактеристикиOzonСИндивидуальнымиЗначениямиДляКатегории, "ИС_Ozon_Характеристики");

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Ozon_КатегорииТоваровХарактеристики.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ вт_ХарактеристикиКатегории
		|ИЗ
		|	Справочник.ИС_Ozon_КатегорииТоваров.Характеристики КАК Ozon_КатегорииТоваровХарактеристики
		|ГДЕ
		|	НЕ Ozon_КатегорииТоваровХарактеристики.Характеристика В(&ХарактеристикиСИндивидуальнымЗначением)
		|	И Ozon_КатегорииТоваровХарактеристики.Ссылка = &Категория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ozon_КатегорииТоваровХарактеристики.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ вт_ХарактеристикиКатегорииИсточника
		|ИЗ
		|	Справочник.ИС_Ozon_КатегорииТоваров.Характеристики КАК Ozon_КатегорииТоваровХарактеристики
		|ГДЕ
		|	НЕ Ozon_КатегорииТоваровХарактеристики.Характеристика В(&ХарактеристикиСИндивидуальнымЗначением)
		|	И Ozon_КатегорииТоваровХарактеристики.Ссылка = &Категория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ХарактеристикиКатегории.Характеристика КАК Характеристика,
		|	ЛОЖЬ КАК Копировать
		|ИЗ
		|	вт_ХарактеристикиКатегории КАК вт_ХарактеристикиКатегории
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ХарактеристикиКатегорииИсточника КАК вт_ХарактеристикиКатегорииИсточника
		|		ПО вт_ХарактеристикиКатегории.Характеристика = вт_ХарактеристикиКатегорииИсточника.Характеристика";

		Запрос.УстановитьПараметр("Категория", Категория);
		Запрос.УстановитьПараметр("КатегорияИсточник", КатегорияИсточник);
		Запрос.УстановитьПараметр("ХарактеристикиСИндивидуальнымЗначением",
			ХарактеристикиOzonСИндивидуальнымиЗначениямиДляКатегории);

		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		КопируемыеСопоставленияХарактеристик.Загрузить(РезультатЗапроса);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПризнак(Признак)

	Для Каждого стр Из КопируемыеСопоставленияХарактеристик Цикл

		стр.Копировать = Признак;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсновныеРеквизитыТовара()

	ТЗ = КопируемыеСопоставленияХарактеристик.Выгрузить();
	ТаблицаРеквизитов = ИС_Ozon_Сервер.ЗаполнитьТаблицуОсновныхРеквизитов(ТЗ, КатегорияИсточник);

	КопируемыеСопоставленияХарактеристик.Загрузить(ТаблицаРеквизитов);

КонецПроцедуры

&НаСервере
Процедура СкопироватьНаСервере()

	Если СопоставлениеОсновныхРеквизитов Тогда
		РегистрСоответствия = РегистрыСведений.ИС_Ozon_СоответствиеОсновныхРеквизитовТовара;
		РеквизитОтбораРегистра = "РеквизитТовара";
		РеквизитТЧ = "РеквизитТовара";
	Иначе
		РегистрСоответствия = РегистрыСведений.ИС_Ozon_СоответствиеЗначенийХарактеристик;
		РеквизитОтбораРегистра = "ХарактеристикаOzon";
		РеквизитТЧ = "Характеристика";
	КонецЕсли;

	НаборЗаписейИсточник = РегистрСоответствия.СоздатьНаборЗаписей();
	НаборЗаписейИсточник.Отбор.Категория.Установить(КатегорияИсточник);

	НаборЗаписейПриемник = РегистрСоответствия.СоздатьНаборЗаписей();
	НаборЗаписейПриемник.Отбор.Категория.Установить(Категория);

	Для Каждого стр Из КопируемыеСопоставленияХарактеристик Цикл

		Если стр.Копировать Тогда

			НаборЗаписейИсточник.Отбор[РеквизитОтбораРегистра].Установить(стр[РеквизитТЧ]);
			НаборЗаписейИсточник.Прочитать();

			НаборЗаписейПриемник.Отбор[РеквизитОтбораРегистра].Установить(стр[РеквизитТЧ]);
			НаборЗаписейПриемник.Прочитать();
			НаборЗаписейПриемник.Очистить();

			Для Каждого ЗаписьИсточник Из НаборЗаписейИсточник Цикл
				НоваяЗапись = НаборЗаписейПриемник.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьИсточник);
				НоваяЗапись.Категория = Категория;
			КонецЦикла;

			НаборЗаписейПриемник.Записать(Истина);

		КонецЕсли;

	КонецЦикла;
КонецПроцедуры

#КонецОбласти