
#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 13.02.24 УА #70076
Функция ОбщийМодульПараметров() Экспорт	
	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль("ГенерацияШтрихкода");	
	Возврат ОбщийМодуль;	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.24 УА #70076

//+ ИнфоСофт Ивонин К.А. 13.02.24 УА #70076
Функция ОбщийМодульГенерации() Экспорт  	
	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль("ГенерацияШтрихкода");	
	Возврат ОбщийМодуль;	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.24 УА #70076

#КонецОбласти
