
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 14.04.22 УА #44857
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.04.22 УА #44857

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстрановитьОтборПоПрофилю();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	УстрановитьОтборПоПрофилю();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 28.03.23 УА #55822
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.23 УА #55822

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаКлиенте
Процедура УстрановитьОтборПоПрофилю()
	
	Отчет.Профиль = Профиль;
	
	Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Профиль");   
    Параметр.Использование = Истина;
    Параметр.Значение = Профиль;
    
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

#КонецОбласти
