//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
&НаКлиенте
Процедура ПечатьКонтрольногоШК(Команда)
	
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99493
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99493
	
	Элемент = Элементы.Список.ВыделенныеСтроки[0];
	
	ТабДок = ПечатьКонтрольногоШКНаСервере(Элемент);
	
	ТабДок.Показать();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254   

//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
&НаСервере
Функция ПечатьКонтрольногоШКНаСервере(ШК)  
	
	Штрихкод = ШК.ПолучитьОбъект();
	Штрихкод = Штрихкод.Штрихкод;
	
	Макет = ПолучитьОбщийМакет("ПФ_MXL_ИС_MP_ШтрихкодКоробки");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "Контрольный ШК";
	
	ОбластьМакетаОсновныеДанные = Макет.ПолучитьОбласть("ОсновныеДанные"); 
	
	ПараметрыШтрихкода = ПолучитьСтруктуруФормированияШтрихкода(Штрихкод);
	
	СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	
	Если СтруктураКартинки.Результат Тогда 
		ОбластьМакетаОсновныеДанные.Параметры.ШтрихкодКартинка = СтруктураКартинки.Картинка;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьМакетаОсновныеДанные);   	
	
	Возврат ТабличныйДокумент;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254

//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
Функция ПолучитьСтруктуруФормированияШтрихкода(Штрихкод)
	
	СтруктураШтрихкода = Новый Структура;
	
	СтруктураШтрихкода.Вставить("Ширина", 280);
	СтруктураШтрихкода.Вставить("Высота", 100);
	СтруктураШтрихкода.Вставить("ТипКода", 2);
	СтруктураШтрихкода.Вставить("ОтображатьТекст", Истина);
	СтруктураШтрихкода.Вставить("Штрихкод", Штрихкод);
	
	Возврат СтруктураШтрихкода;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254