                                           
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 19.01.23 УА #53535
Функция ПолучитьНастройкиСоединения(Профиль) Экспорт
       	
	Возврат Неопределено;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 19.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 27.06.22 УА #46999
Функция ПолучитьНастройкиФункциональностиЗаказов(Профиль) Экспорт
	
	МассивНаименований = Новый Массив;
		
	//Результат.Добавить("СберИдКабинета");
	//Результат.Добавить("СберТокен");
	//Результат.Добавить("СберАдресСервисаAPI");
	МассивНаименований.Добавить("СберВидЦены");
	//Результат.Добавить("СберСкрываемыйОстаток");
	//Результат.Добавить("СберСклад");
	//Результат.Добавить("СберРежимСокрытияОстатков");
	МассивНаименований.Добавить("СберПартнер");
	МассивНаименований.Добавить("СберКонтрагент");
	МассивНаименований.Добавить("СберСоглашение");
	МассивНаименований.Добавить("СберДоговор");
	МассивНаименований.Добавить("СберПодразделение");
	МассивНаименований.Добавить("СберПриоритетЗаказа");
	МассивНаименований.Добавить("СберСоздаватьЗаказы");
	МассивНаименований.Добавить("СберСтатусЗаказаКлиента");
	МассивНаименований.Добавить("СберВариантОбеспечения");
	МассивНаименований.Добавить("СберРежимСозданияЗаказов");
	МассивНаименований.Добавить("СберПроводитьЗаказы");
	МассивНаименований.Добавить("СберСоздаватьРеализации");
	МассивНаименований.Добавить("СберПроводитьРеализации");
	МассивНаименований.Добавить("СберАктивныйЗаказКлиента");
	//+ ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208
	МассивНаименований.Добавить("СберЦенаЛотаВЗаказ"); 
	//- ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208
	//+ ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	МассивНаименований.Добавить("СберДатаОтгрузкиИлиТекущаяДатаВРеализацию");
	//- ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	//+ ИнфоСофт Мурсалимов Д.Р. 13.03.24 УА #67173  
	МассивНаименований.Добавить("СберРассчитатьНесобранныеКомплекты");
	МассивНаименований.Добавить("СберСоздатьЗаказНаСборку");
	//- ИнфоСофт Мурсалимов Д.Р. 13.03.24 УА #67173
	//+ ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
	МассивНаименований.Добавить("СберВариантОбеспеченияПриНехватке");	
	//- ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801 
	//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643	
	МассивНаименований.Добавить("СберФормироватьЕдиныйЗаказБезРазбиения");
	//- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
	//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	МассивНаименований.Добавить("СберЗакрытиеЗаказаПоДатеОтгрузки");
	//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	
	//+ ИнфоСофт Заварин К.В. 26.09.24 УА #77549
	МассивНаименований.Добавить("СберУдалятьРТУ");
	МассивНаименований.Добавить("СберПроверятьДатуПередУдалением");
	МассивНаименований.Добавить("СберПричинаОтмены");	
	//- ИнфоСофт Заварин К.В. 26.09.24 УА #77549
	
	//+ ИнфоСофт Заварин К.В. 30.09.24 УА #72472
	МассивНаименований.Добавить("СберАвтоматическиПодтверждатьЗаказы");
	//- ИнфоСофт Заварин К.В. 30.09.24 УА #72472
	
	//+ ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	МассивНаименований.Добавить("СберОтделятьТоварыПриНехватке");
	//- ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Наименование КАК Наименование,
	|	ИС_MP_Настройки.Значение КАК Значение
	|ИЗ
	|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.ЛичныйКабинет = &Профиль
	|	И ИС_MP_Настройки.Наименование В (&Наименование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Организация"",
	|	ИС_WB_Профили.Организация
	|ИЗ
	|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
	|ГДЕ
	|	ИС_WB_Профили.Ссылка = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Наименование", МассивНаименований);
	
	РезульатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Структура;
	
	Выборка = РезульатЗапроса.Выбрать();
    
    Пока Выборка.Следующий() Цикл
       	
    	Если Выборка.Наименование = "СберВидЦены" Тогда
        	Наименование = "ВидЦены";
        Иначе
        	Наименование = СтрЗаменить(Выборка.Наименование, "Сбер", "");
        КонецЕсли;
        
    	Результат.Вставить(Наименование, Выборка.Значение);	
  
    КонецЦикла;
    	
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 27.06.22 УА #46999

#КонецОбласти
