
#Область ПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 18.12.23 УА #66879
&После("ПриОпределенииОбъектовСКомандамиПечати")
Процедура ИС_MP_ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов)
	СписокОбъектов.Добавить(Документы.ИС_WB_СборочноеЗадание);
	//+ ИнфоСофт Стояк Ю.К. 21.10.2024 УА #84967
	СписокОбъектов.Добавить(Документы.ИС_Ozon_Заказ);
	СписокОбъектов.Добавить(Документы.ИС_ЯМ_Заказ);
	СписокОбъектов.Добавить(Документы.ИС_Сбер_Отправление);
	СписокОбъектов.Добавить(Документы.ИС_АЛИ_Заказ);
	//- ИнфоСофт Стояк Ю.К. 21.10.2024 УА #84967
	//+ ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648
	СписокОбъектов.Добавить(Документы.ИС_Ozon_УпаковкаТоваров);
	//- ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 18.12.23 УА #66879

#КонецОбласти
