#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К. 03.05.2024 УА #62574
&НаКлиенте
Процедура ЗагрузитьКатегории(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация 	= ЗагрузитьКатегорииНаСервере();	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, , ПараметрыОжидания());

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 03.05.2024 УА #62574
&НаКлиенте
Процедура ЗагрузитьХарактеристики(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли;
	
	Категория = Элементы.Список.ТекущаяСтрока;

	Если Не ЗначениеЗаполнено(Категория) Тогда
		Возврат;
	КонецЕсли;

	Если Не Элементы.Список.ТекущиеДанные.Используется Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Категория товаров не используется. Для загрузки характеристик необходимо включить использование");
		Возврат;
	КонецЕсли;

	ДлительнаяОперация 	= ЗагрузитьХарактеристикиНаСервере(Категория);	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, , ПараметрыОжидания());

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.05.2024 УА #62574

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 03.05.2024 УА #62574
&НаСервере
Функция ЗагрузитьКатегорииНаСервере()

	Возврат ДлительныеОперации.ВыполнитьПроцедуру( ,
		"ИС_ЯМ_Сервер.ЗагрузитьКатегорииТоваров", Профиль);

КонецФункции //- ИнфоСофт Стояк Ю.К. 03.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 03.05.2024 УА #62574
&НаСервере
Функция ЗагрузитьХарактеристикиНаСервере(Категория)

	Возврат ДлительныеОперации.ВыполнитьПроцедуру( ,
		"ИС_ЯМ_Сервер.ЗагрузитьХарактеристики", Профиль, Категория);

КонецФункции //- ИнфоСофт Стояк Ю.К. 03.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
&НаКлиенте
Функция ПараметрыОжидания()
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = "Идет процесс загрузки...";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Интервал = 5;
	//ПараметрыОжидания.ПолучатьРезультат = Истина;     
	
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	//ПараметрыОжидания.ОповещениеПользователя.НавигационнаяСсылка = "e1cib/app/Обработка.ИС_Ozon_ВыгрузкаКарточек";
	
	Возврат ПараметрыОжидания;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

#КонецОбласти
