
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Функция НастройкиСоединенияПоУмолчанию() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("СберАдресСервисаAPI", "api.megamarket.tech");
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
Функция ПараметрыТестаПодключения(Форма) Экспорт
	
	ТекстОшибки = "";
	
	Результат = Новый Структура;

	//Результат.Вставить("АдресАналитика", Форма.ВБАдресАналитика);
	//Результат.Вставить("ПортАналитика", Форма.ВБПортАналитика);
	//Результат.Вставить("HTTPSАналитика", Форма.ВБHTTPSАналитика);
	//Результат.Вставить("РежимОтладки", Форма.ВБРежимОтладки);
	//Результат.Вставить("КоличествоЭлементовНаЗапрос", Форма.ВБКоличествоЭлементовНаЗапрос);
	//Результат.Вставить("КоличествоПопытокЗапроса", Форма.ВБКоличествоПопытокЗапроса);
	//
	//Если Не ЗначениеЗаполнено(Форма.ВБАдресАналитика) Тогда
	//	ТекстОшибки = ТекстОшибки + "Не заполнен адрес API аналитики, тест данного сервиса не будет проведен" + Символы.ПС;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 07.02.25 УА #92406
Функция ПредставлениеМаркетплейса() Экспорт
	Возврат "Мега Маркет";
КонецФункции //- ИнфоСофт Ивонин К.А. 07.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 07.02.25 УА #92406
Функция ИмяФункцииЗагрузкиТоваров() Экспорт
	Возврат "ИС_Сбер_Сервер.ЗагрузитьТовары";
КонецФункции //- ИнфоСофт Ивонин К.А. 07.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 07.02.25 УА #92406
Функция ДопПараметрыЗагрузкиТоваров(Форма) Экспорт
	
	Если Не ЗначениеЗаполнено(Форма.АдресВременногоХранилищаСбер) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для начала необходимо выбрать файл с Товарами", , , "ПутьФайлаСбер");
		Возврат Неопределено;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Адрес", Форма.АдресВременногоХранилищаСбер);
	
	Возврат ДопПараметры;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 07.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 04.03.25 УА #92887
Функция ПолеСопоставленияОстатков() Экспорт
	Возврат "НоменклатураСбер";	
КонецФункции //- ИнфоСофт Ивонин К.А. 04.03.25 УА #92887

#КонецОбласти
