#Область ОбработчикиСобытийФормы  

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВариантФормированияЦеныВозврата = 0;
	Элементы.ВидЦеныВозврата.Доступность = Ложь;
	
	ВариантФормированияСебестоимости = 1;
	Элементы.ВидЦеныСебестоимость.Доступность = Ложь; 
	
	//+ ИнфоСофт Заварин К.В. 25.06.24 УА #69434
	ВариантСозданияОтчета = Истина;
	//- ИнфоСофт Заварин К.В. 25.06.24 УА #69434
	
	ТекущийНомерСтраницы = 1;
	
	ПерваяСтраница = 1;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 03.03.25 УА #74987
	ПоследняяСтраница = 7;
	//- ИнфоСофт Мурсалимов Д.Р. 03.03.25 УА #74987
	
	УстановитьАктивнуюСтраницу();
	
	//+ ИнфоСофт Сумин Д.В. 14.03.2024 УА #71773
	НастройкаОтчета = 0;
	Элементы.ПутьИтоговыйФайл.Доступность = Истина;
	Элементы.НомерОтчета4.Доступность = Ложь;
	//- ИнфоСофт Сумин Д.В. 14.03.2024 УА #71773 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 19.09.24 УА #82106
	ВариантФормированияЦеныПродажи = 0;
	//- ИнфоСофт Мурсалимов Д.Р. 19.09.24 УА #82106
	
	//+ ИнфоСофт Мурсалимов Д.Р. 08.10.24 УА #84956
	ПолностьюРаспределятьЛогистику = Ложь;
	//- ИнфоСофт Мурсалимов Д.Р. 08.10.24 УА #84956 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 24.04.25 УА #99478
	ПерезаписатьИмеющийсяОК = Ложь;
	ОчиститьРегистрыОК  	= Ложь;
	//- ИнфоСофт Мурсалимов Д.Р. 24.04.25 УА #99478
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 28.02.2024 УА #71107
&НаКлиенте
Процедура НомерОтчетаПриИзменении(Элемент) 
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать профиль'"),,,"Профиль");
		Возврат;	
	КонецЕсли;	
	
	ОчиститьСообщения();
	
	СписокТранзакций.Очистить();
	
	ДлительнаяОперация = НомерОтчетаПриИзмененииНаСервере();
	
	Если ДлительнаяОперация <> Неопределено Тогда	 
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
		ПараметрыОжидания.ТекстСообщения = "Чтение данных...";
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьДанныеЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Повторите попытку позже'"));
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 28.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 01.03.2024 УА #71107
&НаКлиенте
Процедура ВариантФормированияЦеныВозвратаПриИзменении(Элемент)
	
	Если ВариантФормированияЦеныВозврата = 1 Тогда
		Элементы.ВидЦеныВозврата.Доступность = Истина;
	Иначе                                                
		Элементы.ВидЦеныВозврата.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 01.03.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 05.03.2024 УА #71107
&НаКлиенте
Процедура НомерОтчетаШаг3ПриИзменении(Элемент)
	ОтражениеУслугWildberries.Очистить();
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 05.03.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 06.03.2024 УА #71107
&НаКлиенте
Процедура ВариантФормированияСебестоимостиПриИзменении(Элемент)
	
	Если ВариантФормированияСебестоимости = 2 Тогда
		Элементы.ВидЦеныСебестоимость.Доступность = Истина;
	Иначе                                                
		Элементы.ВидЦеныСебестоимость.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 06.03.2024 УА #71107

#КонецОбласти

#Область ОбработчикиКомандФормы  

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ЗаголовокШаг1Нажатие(Элемент)
	УстановитьШаг(1);
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ЗаголовокШаг2Нажатие(Элемент)
	УстановитьШаг(2);
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ЗаголовокШаг3Нажатие(Элемент)
	УстановитьШаг(3);
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ЗаголовокШаг4Нажатие(Элемент)
	УстановитьШаг(4);
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ЗаголовокШаг5Нажатие(Элемент)
	УстановитьШаг(5);
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ЗаголовокШаг6Нажатие(Элемент)
	УстановитьШаг(6);
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

//+ ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987
&НаКлиенте
Процедура ЗаголовокШаг7Нажатие(Элемент)
	УстановитьШаг(7);
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ОбработатьДанные(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать профиль'"),,,"Профиль");
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Сумин Д.В. 14.03.2024 УА #71773
	Если НастройкаОтчета = 0 Тогда
		Если Не ЗначениеЗаполнено(ПутьИтоговыйФайл) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать файл excel'"),,,"ПутьИтоговыйФайл");
			Возврат;
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(НомерОтчета) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать обрабатываемый отчет'"),,,"НомерОтчета");
			Возврат;
		КонецЕсли;	
	КонецЕсли;    
	//- ИнфоСофт Сумин Д.В. 14.03.2024 УА #71773
	
	Если Не ЗначениеЗаполнено(ПутьДетализация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать файл excel'"),,,"ПутьДетализация");
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ОбработатьДанныеНаСервере();
	
	Если ДлительнаяОперация <> Неопределено Тогда	 
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
		ПараметрыОжидания.ТекстСообщения = "Чтение и обработка данных...";
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьДанныеЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Проверьте корректность выбранных excel файлов'"));
	КонецЕсли;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ПутьИтоговыйФайлНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	РасширениеИтоговогоФайлаZip = Ложь;
	
	ПоказатьДиалогВыбораФайла("РасширениеИтоговогоФайлаZip", "АдресИтоговогоФайлаВоВременномХранилище", "ПутьИтоговыйФайл");
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ПутьДетализацияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	РасширениеДетализацииФайлаZip = Ложь;
	
	ПоказатьДиалогВыбораФайла("РасширениеДетализацииФайлаZip", "АдресДетализацииФайлаВоВременномХранилище", "ПутьДетализация");
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107 

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ПоказатьДиалогВыбораФайла(РасширениеФайла, АдресВоВременномХранилище, ИмяРеквизита) 
	
	ОчиститьСообщения(); 
	  	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл отчета/уведомления о выкупе";
	ДиалогВыбораФайла.МножественныйВыбор =  Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.Фильтр = "Архив ZIP (*.zip)|*.zip|Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Реквизит", ИмяРеквизита);
	ДополнительныеПараметры.Вставить("Адрес", АдресВоВременномХранилище);  
	ДополнительныеПараметры.Вставить("ЭтоZip", РасширениеФайла);
	ДополнительныеПараметры.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ПутьИтоговыйФайлНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры));
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107	

//+ ИнфоСофт Сумин Д.В. 29.02.2024 УА #71107
&НаКлиенте
Процедура ПодобратьПоАртикулу(Команда)
	ПодобратьПоАртикулуНаСервере();
	ЭтаФорма.ОбновитьОтображениеДанных(Элементы.СписокТранзакций);
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 29.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 29.02.2024 УА #71107
&НаКлиенте
Процедура СоздатьОтчетКомиссионера(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать профиль'"),,,"Профиль");
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерОтчета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать обрабатываемый отчет. Вернитесь на страницу ""Данные продаж""'"));
		Возврат;	
	КонецЕсли;

	
	Если СписокТранзакций.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать обрабатываемый отчет и заполнить таблицу продаж. Вернитесь на пункт ""Данные продаж""'"));
		Возврат;	
	КонецЕсли;
	
	Если ВариантФормированияЦеныВозврата = 1 И Не ЗначениеЗаполнено(ВидЦеныВозврата) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать вид цены или выбрать другой вариант формирования стоимости передачи товара на комиссию'")
																	,,,"ВариантФормированияЦеныВозврата");
		Возврат;	
	КонецЕсли;	
	
	//+ ИнфоСофт Макарова Н.Е. 10.04.2025 УА #76491
	ДанныеНомераОтчета = ПолучитьДанныеНомераОтчета(НомерОтчета);
	
	Если ДанныеНомераОтчета.ПометкаУдаления Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать обрабатываемый отчет, который не помечен на удаление. Вернитесь на страницу ""Данные продаж""'"));
		Возврат;	
	КонецЕсли;
	
	Если ДанныеНомераОтчета.ЕстьОтчетКомиссионера И НЕ ПерезаписатьИмеющийсяОК Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Отчет комиссионера по данному номеру отчета уже создан. Чтобы перезаписать существующий документ, в настройках укажите ""Перезаписать имеющийся отчет комиссионера""'"));
		Возврат;	
	КонецЕсли;
	//- ИнфоСофт Макарова Н.Е. 10.04.2025 УА #76491
	
	ДлительнаяОперация = ПолучитьОтчетКомиссионераНаСервере(); 
	
	Если ДлительнаяОперация <> Неопределено Тогда	 
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
		ПараметрыОжидания.ТекстСообщения = "Чтение и обработка данных...";
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьДанныеЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	Иначе
		//+ ИнфоСофт Власова И.С. 26.08.24 УА #81190
		//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Произошла непредвиденная ошибка'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Произошла непредвиденная ошибка. Проверьте настройки профиля'"));
		//- ИнфоСофт Власова И.С. 26.08.24 УА #81190
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 29.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 04.03.2024 УА #71107
&НаКлиенте
Процедура ЗаполнитьУслугиПоОтчету(Команда)
	
	ОчиститьСообщения();
	
	//+ ИнфоСофт Власова И.С. 26.08.24 УА #81190
	ОтражениеУслугWildberries.Очистить();
	//- ИнфоСофт Власова И.С. 26.08.24 УА #81190
	
	Если Не ЗначениеЗаполнено(НомерОтчета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать обрабатываемый отчет'"),,,"НомерОтчета");
	    Возврат;
	КонецЕсли;	
	
	ЗаполнитьУслугиПоОтчетуНаСервере();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.03.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 04.03.2024 УА #71107
&НаКлиенте
Процедура СоздатьДокументПриобретения(Команда)   
	
	ОчиститьСообщения(); 
	
	Если ОтражениеУслугWildberries.Количество() < 1 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить услуги по отчету'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерОтчета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать обрабатываемый отчет'"),,,"НомерОтчета");
	    Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать профиль'"),,,"Профиль");
		Возврат;	
	КонецЕсли;
	
	СоздатьДокументПриобретенияНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Операция завершена'"));
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.03.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 06.03.2024 УА #71107
&НаКлиенте
Процедура СоздатьВзаимозачет(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(НомерОтчета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать обрабатываемый отчет'"),,,"НомерОтчета");
	    Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать профиль'"),,,"Профиль");
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументПриобретения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать документ приобретения'"),,,"ДокументПриобретения");
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтчетКомиссионера) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать документ отчет комиссионера'"),,,"ОтчетКомиссионера");
		Возврат;	
	КонецЕсли;
	
	СоздатьВзаимозачетНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Операция завершена'"));
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 06.03.2024 УА #71107 

//+ ИнфоСофт Сумин Д.В. 14.03.2024 УА #71773
&НаКлиенте
Процедура НастройкаОтчетаПриИзменении(Элемент) 
	
	Если НастройкаОтчета = 0 Тогда
		Элементы.ПутьИтоговыйФайл.Доступность = Истина;
		Элементы.НомерОтчета4.Доступность = Ложь;
	Иначе                                                
		Элементы.ПутьИтоговыйФайл.Доступность = Ложь;
		Элементы.НомерОтчета4.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 14.03.2024 УА #71773

//+ ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987
&НаКлиенте
Процедура ЗагрузитьДанныеОК(Команда)

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль.", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран период загрузки.", , , "ПериодДляЗагрузки");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьОтчетКомисисонераПоApiНаСервере();	

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции 

#Область Навигация
//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура УстановитьШаг(НомерШага) 
	
	ОчиститьСообщения();
	
	ТекущийНомерСтраницы = НомерШага;
	
	УстановитьАктивнуюСтраницу();
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура УстановитьАктивнуюСтраницу()
	
	СтрокаПоиска = "Шаг" + Строка(ТекущийНомерСтраницы);
	Элементы.Страницы.ТекущаяСтраница = Элементы.Найти(СтрокаПоиска);
	
	ЭтаФорма.Заголовок = СтрШаблон(НСтр("ru = 'Обработка отчетов о продажах Wildberries(Шаг %1/%2)'"), ТекущийНомерСтраницы,
		ПоследняяСтраница);
		
	УстановитьТекстПояснения();
	
	УстановитьАктивнуюСтраницуСервер();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура УстановитьТекстПояснения()
	
	Если ТекущийНомерСтраницы = 1 Тогда
		Элементы.ДекорацияПояснениеСледующегоДействия.Заголовок = НСтр(
			"ru = 'Укажите файлы excel и нажмите на кнопку ""Обработать данные""'");
	ИначеЕсли ТекущийНомерСтраницы = 2 Тогда
		Элементы.ДекорацияПояснениеСледующегоДействия.Заголовок = НСтр(
			"ru = 'Проверьте сопоставление и перейдите к операции создания документов'");
	ИначеЕсли ТекущийНомерСтраницы = 3 Тогда
		Элементы.ДекорацияПояснениеСледующегоДействия.Заголовок = НСтр(
			"ru = 'Нажмите кнопку ""Создать"" для создания документа ""Отчет комиссионера""'");
	ИначеЕсли ТекущийНомерСтраницы = 4 Тогда
		Элементы.ДекорацияПояснениеСледующегоДействия.Заголовок = НСтр(
			"ru = 'Нажмите кнопку ""Создать"" для создания документа ""Приобретение товаров и услуг""'");
	ИначеЕсли ТекущийНомерСтраницы = 5 Тогда
		Элементы.ДекорацияПояснениеСледующегоДействия.Заголовок = НСтр(
			"ru = 'Нажмите кнопку ""Создать"" для создания документа ""Взаимозачет задолженности""'");
	Иначе
		Элементы.ДекорацияПояснениеСледующегоДействия.Заголовок = "";	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107 

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаСервере
Процедура УстановитьАктивнуюСтраницуСервер()
	
	Для ии = ПерваяСтраница По ПоследняяСтраница Цикл
		Если ии=ТекущийНомерСтраницы Тогда
			Элементы["ЗаголовокШаг"+Строка(ии)].Шрифт = Новый Шрифт(Новый Шрифт,,, Истина);
			Элементы["ОтметкаШаг"+Строка(ии)].ЦветФона = ЦветаСтиля.ЦветФонаВыделения;
		Иначе
			Элементы["ЗаголовокШаг"+Строка(ии)].Шрифт = Новый Шрифт;
			Элементы["ОтметкаШаг"+Строка(ии)].ЦветФона = Новый Цвет;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

#КонецОбласти

#Область Шаг1
//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ПутьИтоговыйФайлНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеФайлы = ДиалогВыбораФайла.ВыбранныеФайлы;
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЭтотОбъект[ДополнительныеПараметры.Реквизит] = ВыбранныеФайлы[0];
		
		ВыбранныйФайл = Новый Файл(ВыбранныеФайлы[0]);
		Расширение = ВыбранныйФайл.Расширение;
		
		Если Расширение = ".zip" Тогда
			ЭтотОбъект[ДополнительныеПараметры.ЭтоZip] = Истина;			
		КонецЕсли;
		ПутьКФайлуВоВременномКаталоге = ВыбранныеФайлы[0];
		ПоместитьФайлНаСервер(ДополнительныеПараметры.Адрес);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ПоместитьФайлНаСервер(Адрес)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоместитьФайлНаСерверЗавершение", ЭтотОбъект, Новый Структура("Адрес", Адрес));
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , , , ПутьКФайлуВоВременномКаталоге, УникальныйИдентификатор);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107
&НаКлиенте
Процедура ПоместитьФайлНаСерверЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.ПомещениеФайлаОтменено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось поместить файл на сервер, попробуйте ещё раз...");
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[Параметры.Адрес] = Результат.Адрес;          
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 26.02.2024 УА #71107 

//+ ИнфоСофт Мурсалимов Д.Р. 30.05.24 УА #76699
&НаСервере
Функция ПолучитьТабДок(ТипФайла, АдресВоВременномХранилище)
	
	Если ТипФайла = "Отчет" Тогда
		
		Если РасширениеИтоговогоФайлаZip Тогда  
			
			ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
			Имя = ПолучитьИмяВременногоФайла("zip");
			ФайлВременногоХранилища.Записать(Имя);
			
			ВызватьОшибку = Истина;
			ТабличныйДокумент = ПрочитатьТабДокИзZIP(Имя, ВызватьОшибку);
			
			Если ВызватьОшибку Тогда
				ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе     
			
			ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
			Имя = ПолучитьИмяВременногоФайла("xlsx");
			ФайлВременногоХранилища.Записать(Имя);
			ТабличныйДокумент = Новый ТабличныйДокумент;
			ТабличныйДокумент.Прочитать(Имя);
			
		КонецЕсли;
		
		ТабличныйДокумент.Область().Разъединить();
		
		Попытка
			УдалитьФайлы(Имя);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
			ОтменитьТранзакцию();
		КонецПопытки;  
		
	КонецЕсли;
	
	Если ТипФайла = "Детализация" Тогда
		
		Если РасширениеДетализацииФайлаZip Тогда  
			
			ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
			Имя = ПолучитьИмяВременногоФайла("zip");
			ФайлВременногоХранилища.Записать(Имя);
			
			ВызватьОшибку = Истина;
			ТабличныйДокумент = ПрочитатьТабДокИзZIP(Имя, ВызватьОшибку);
			
			Если ВызватьОшибку Тогда
				ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе     
			
			ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
			Имя = ПолучитьИмяВременногоФайла("xlsx");
			ФайлВременногоХранилища.Записать(Имя);
			ТабличныйДокумент = Новый ТабличныйДокумент;
			ТабличныйДокумент.Прочитать(Имя);
			
		КонецЕсли;
		
		ТабличныйДокумент.Область().Разъединить();
		
		Попытка
			УдалитьФайлы(Имя);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
			ОтменитьТранзакцию();
		КонецПопытки;  
			
	КонецЕсли; 
	
	Возврат ТабличныйДокумент;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 30.05.24 УА #76699

//+ ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107
&НаСервере
Функция ПрочитатьТабДокИзZIP(ИмяФайла, Отказ)
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ЧтениеZip = Новый ЧтениеZipФайла(ИмяФайла, "");
	
	Отказ = Истина;
	
	Для Каждого Элемент Из ЧтениеZip.Элементы Цикл
		
		Если Элемент.Расширение = "xlsx" Тогда
			Отказ = Ложь;
			ПутьКФайлуВоВременномКаталоге = КаталогВременныхФайлов();
			ЧтениеZip.Извлечь(Элемент, ПутьКФайлуВоВременномКаталоге, , "");					
			ПутьКФайлуВоВременномКаталоге = ПутьКФайлуВоВременномКаталоге + Элемент.Имя; 
			ТабличныйДокумент.Прочитать(ПутьКФайлуВоВременномКаталоге);
		КонецЕсли;
		
	КонецЦикла; 
	
	ЧтениеZip.Закрыть();
	
	Возврат ТабличныйДокумент;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107 

//+ ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107
&НаСервере
Функция ОбработатьДанныеНаСервере()
	
	//+ ИнфоСофт Сумин Д.В. 14.03.2024 УА #71773
	Если НастройкаОтчета = 0 Тогда
		
		//Обработка итогового файла
		ИтоговыйФайлТабдок = ПолучитьТабДок("Отчет", АдресИтоговогоФайлаВоВременномХранилище);
		
		Если ИтоговыйФайлТабдок.НайтиТекст("Уведомление") <> Неопределено Тогда
			РоссийскиеПродажи = Ложь;
		ИначеЕсли ИтоговыйФайлТабдок.НайтиТекст("Отчет") <> Неопределено Тогда
			РоссийскиеПродажи = Истина;
		Иначе
			РоссийскиеПродажи = Неопределено;
		КонецЕсли;	
		
		Если РоссийскиеПродажи = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю("Выбран некорректный формат файла",,,"ПутьИтоговыйФайл");
			Возврат Неопределено;
		КонецЕсли;
		Если РоссийскиеПродажи Тогда		
			Комментарий = ИтоговыйФайлТабдок.Область("R5C6").Текст;
			НомерДата = ИтоговыйФайлТабдок.Область("R5C7").Текст;
			НачалоПериода = ИтоговыйФайлТабдок.Область("R7C12").Текст;
			КонецПериода = ИтоговыйФайлТабдок.Область("R7C14").Текст;  
			ИскомыйНомер = СтрНайти(НомерДата, "от");
			
			НомерОтчетаСтрока = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Лев(НомерДата, ИскомыйНомер - 1));
			Комментарий = Комментарий + НомерДата;      
			НачалоПериода = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрЗаменить(НачалоПериода, "-", ""));
			КонецПериода = КонецДня(СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрЗаменить(КонецПериода, "-", "")));
			ДанныеУслуг = ПолучитьДанныеПоУслугам(ИтоговыйФайлТабдок);
			
			Если ДанныеУслуг = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;	
		Иначе
			Комментарий = ИтоговыйФайлТабдок.Область("R3C1").Текст;
			
			ИскомыйНомерНачало = СтрНайти(Комментарий, "№");
			ИскомыйНомерКонец = СтрНайти(Комментарий, "от");
			
			НомерОтчетаСтрока = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Сред(Комментарий, ИскомыйНомерНачало + 1, СтрДлина(Комментарий) - ИскомыйНомерКонец - 3));
			НачалоПериода = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрЗаменить(СтрРазделить(Комментарий, " ")[5], ".", ""));
			КонецПериода = КонецДня(СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрЗаменить(СтрРазделить(Комментарий, " ")[5], ".", "")) + 3600 *24 * 7);
		КонецЕсли;
	Иначе
		НомерОтчетаСтрока = НомерОтчета.НомерОтчета;
		Комментарий = НомерОтчета.Наименование;
		НачалоПериода = НомерОтчета.ДатаНачала;
		КонецПериода = НомерОтчета.ДатаОкончания; 
		Если НомерОтчета.ВидОтчета = Перечисления.ИС_WB_ВидыОтчетов.Российский Тогда
			РоссийскиеПродажи = Истина;
		Иначе
			РоссийскиеПродажи = Ложь;
		КонецЕсли;
	КонецЕсли;
	//- ИнфоСофт Сумин Д.В. 14.03.2024 УА #71773
	ДанныеОтчета = Новый Структура;
	ДанныеОтчета.Вставить("НомерОтчета",        НомерОтчетаСтрока);
	ДанныеОтчета.Вставить("Комментарий",        Комментарий);
	ДанныеОтчета.Вставить("НачалоПериода",      НачалоПериода);
	ДанныеОтчета.Вставить("КонецПериода",       КонецПериода);
	ДанныеОтчета.Вставить("РоссийскиеПродажи",  РоссийскиеПродажи);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДанныеОтчета", ДанныеОтчета);
	
	//Обработка файла детализации
	ДетализацияТабдок = ПолучитьТабДок("Детализация", АдресДетализацииФайлаВоВременномХранилище);
	
	Если ДетализацияТабдок.Области.Количество() > 1 Тогда
		Если Не РоссийскиеПродажи Тогда
			ДанныеУслуг = ПолучитьДанныеПоУслугамИнПродаж(ДетализацияТабдок.ПолучитьОбласть("Сводный"));
			Если ДанныеУслуг = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;	
		КонецЕсли;
		
		ДетализацияТабдок = ДетализацияТабдок.ПолучитьОбласть("Sheet1");
		
	КонецЕсли;	
	
	ПоследняяСтрока = ДетализацияТабдок.ВысотаТаблицы;
	ПоследняяКолонка = ДетализацияТабдок.ШиринаТаблицы;
	
	ОбластьЯчеек = ДетализацияТабдок.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка);
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	
	Попытка
		ТаблицаЗначений = ПостроительОтчета.Результат.Выгрузить();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	СтруктураДанных.Вставить("Детализация", ТаблицаЗначений);
	СтруктураДанных.Вставить("Профиль", 	Профиль);
	СтруктураДанных.Вставить("ДанныеУслуг", ДанныеУслуг);
	
	//Обработать полученные данные в фоновом режиме
	ВыполняемыйМетод = "ИС_WB_Сервер.ОбработатьДанныеОПродажах";
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("СтруктураДанных", СтруктураДанных);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Чтение и обработка данных'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ВыполняемыйМетод, ПараметрыПроцедуры);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107 

//+ ИнфоСофт Сумин Д.В. 01.03.2024 УА #71107
&НаСервере
Функция ПолучитьДанныеПоУслугам(ТабличныйДокумент)
	
	МассивУслуг = Новый Массив;
	
	Для НомерСтроки = 21 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		Если ТабличныйДокумент.Область("R" + НомерСтроки + "C3").Текст = "" Тогда
			Прервать;	
		КонецЕсли;	
		
		СтруктураУслуг = Новый Структура;
		Попытка
			СтруктураУслуг.Вставить("Наименование", ТабличныйДокумент.Область("R" + НомерСтроки + "C3").Текст);
			СтруктураУслуг.Вставить("Сумма", Число(ТабличныйДокумент.Область("R" + НомерСтроки + "C13").Текст));
		Исключение
			Возврат Неопределено;	
		КонецПопытки;
		
		МассивУслуг.Добавить(СтруктураУслуг);
				
	КонецЦикла;
	
	Возврат МассивУслуг;

КонецФункции //- ИнфоСофт Сумин Д.В. 01.03.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 01.03.2024 УА #71107
&НаСервере
Функция ПолучитьДанныеПоУслугамИнПродаж(ТабличныйДокумент) 
	
	МассивУслуг = Новый Массив;
	
	Для НомерСтроки = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл	
		
		Если ТабличныйДокумент.Область("R" + НомерСтроки + "C3").Текст = "К клиенту при продаже" Тогда
			СтруктураУслуг = Новый Структура;
			Попытка
				СтруктураУслуг.Вставить("Наименование", "Услуги по доставке товара покупателю (Сумма)");
				СтруктураУслуг.Вставить("ОбоснованиеДляОплаты", "К клиенту при продаже");
				СуммаПродажи = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабличныйДокумент.Область("R" + НомерСтроки + "C5").Текст);
				Если СуммаПродажи = Неопределено Тогда
					СуммаПродажи = 0;	
				КонецЕсли;	
				СтруктураУслуг.Вставить("Сумма", СуммаПродажи);
			Исключение
				Возврат Неопределено;	
			КонецПопытки;
			
			МассивУслуг.Добавить(СтруктураУслуг);
		КонецЕсли;		
	КонецЦикла;
	
	Возврат МассивУслуг;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 01.03.2024 УА #71107

#КонецОбласти

#Область Шаг2 

//+ ИнфоСофт Сумин Д.В. 28.02.2024 УА #71107
&НаСервере
Функция НомерОтчетаПриИзмененииНаСервере()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("СписокТранзакций", СписокТранзакций.Выгрузить());
	СтруктураДанных.Вставить("Профиль", Профиль);
	СтруктураДанных.Вставить("НомерОтчета", НомерОтчета);
	СтруктураДанных.Вставить("ВидОтчета", НомерОтчета.ВидОтчета);
	
	//Обработать полученные данные в фоновом режиме
	ВыполняемыйМетод = "ИС_WB_СерверУТ11_5.ПодготовитьДанныеОПродажах";
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("СтруктураДанных", СтруктураДанных);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Чтение и обработка данных'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ВыполняемыйМетод, ПараметрыПроцедуры);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 28.02.2024 УА #71107

#Конецобласти

#Область Шаг3

//+ ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107
&НаКлиенте
Процедура ПрофильШаг3ПриИзменении(Элемент)
	СписокТранзакций.Очистить();
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107
&НаСервере
Функция ПолучитьОтчетКомиссионераНаСервере()
	
	//+ ИнфоСофт Власова И.С. 26.08.24 УА #81190
	РезультатПроверки = ИС_WB_Сервер.ПроверитьЗаполнениеНастроекКомиссии(Профиль);
	
	Если РезультатПроверки <> Неопределено И Не РезультатПроверки Тогда
		Возврат Неопределено;
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 26.08.24 УА #81190
	
	//+ ИнфоСофт Заварин К.В. 14.10.24 УА #85478
	МассивПараметров = Новый Массив;
	
	МассивПараметров.Добавить("WildBerriesСтатьяЗадолженности");
	
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивПараметров);
	
	СтатьяЗадолженности = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	
	Если Настройки <> Неопределено Тогда
		
		Если Настройки["WildBerriesСтатьяЗадолженности"] <> Неопределено Тогда
			СтатьяЗадолженности = Настройки["WildBerriesСтатьяЗадолженности"];       
		КонецЕсли;
		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 14.10.24 УА #85478
	
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
	НастройкиОтчетаКомиссионера = Новый Структура;
	НастройкиОтчетаКомиссионера.Вставить("СписыватьУтраченныеТовары", 	СписыватьУтраченныеТовары);
	НастройкиОтчетаКомиссионера.Вставить("ОприходоватьНайденныеТовары", ОприходоватьНайденныеТовары);
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("СтатьяПрочихДоходов");
	МассивПараметров.Добавить("СтатьяПрочихРасходов");
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров);
	
	НастройкиОтчетаКомиссионера.Вставить("СтатьяПрочихДоходов",  ?(Настройки.СтатьяПрочихДоходов = Неопределено,
																	ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка(),
																	Настройки.СтатьяПрочихДоходов));
	НастройкиОтчетаКомиссионера.Вставить("СтатьяПрочихРасходов", ?(Настройки.СтатьяПрочихРасходов = Неопределено,
																	ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка(),
																	Настройки.СтатьяПрочихРасходов));
	//- ИнфоСофт Власова И.С. 14.03.25 УА #83865
	
	Если НомерОтчета.ВидОтчета = Перечисления.ИС_WB_ВидыОтчетов.Российский Тогда 
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("СписокТранзакций", 					СписокТранзакций.Выгрузить());
		СтруктураДанных.Вставить("СгруппироватьПоНоменклатуре", 		СгруппироватьПоНоменклатуре);
		СтруктураДанных.Вставить("РассчитатьКомиссионноеВознаграждение",РассчитатьКомиссионноеВознаграждение);
		СтруктураДанных.Вставить("ВариантФормированияЦеныВозврата", 	ВариантФормированияЦеныВозврата);
		//+ ИнфоСофт Заварин К.В. 25.06.24 УА #69434
		СтруктураДанных.Вставить("ВариантСозданияОтчета", 				ВариантСозданияОтчета);
		//- ИнфоСофт Заварин К.В. 25.06.24 УА #69434
		СтруктураДанных.Вставить("ВидЦеныВозврата", 					ВидЦеныВозврата);
		СтруктураДанных.Вставить("НомерОтчета", 						НомерОтчета);
		//+ ИнфоСофт Заварин К.В. 02.04.24 УА #66208
		//СтруктураДанных.Вставить("Комментарий", 						НомерОтчета.Наименование);   
		СтруктураДанных.Вставить("Комментарий", 						Строка(НомерОтчета.Профиль) + " " + Строка(НомерОтчета.Наименование));
		СтруктураДанных.Вставить("НомерВходящегоДокумента", 			НомерОтчета.НомерОтчета);
		СтруктураДанных.Вставить("ДатаВходящегоДокумента", 				НомерОтчета.ДатаОкончания);
        //- ИнфоСофт Заварин К.В. 02.04.24 УА #66208
		
		//+ ИнфоСофт Заварин К.В. 14.10.24 УА #85478
		СтруктураДанных.Вставить("СтатьяЗадолженности", 				СтатьяЗадолженности);
		//- ИнфоСофт Заварин К.В. 14.10.24 УА #85478
		
		Если РассчитатьКомиссионноеВознаграждение Тогда
			СуммаУслугВБ = ПолучитьСуммуУслугПоОтчету(НомерОтчета);
			НастройкиУслугиВБ = ПолучитьНастройкиУслугиВБ();
			СтавкаНДСУслугиВБ = НастройкиУслугиВБ.СтавкаНДС;
			НоменклатураУслугиВБ = НастройкиУслугиВБ.Номенклатура;
		Иначе
			СуммаУслугВБ = 0;
			СтавкаНДСУслугиВБ = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
			НоменклатураУслугиВБ = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		
		СтруктураДанных.Вставить("СуммаУслугВБ", 						СуммаУслугВБ);
		СтруктураДанных.Вставить("СтавкаНДСУслугиВБ", 					СтавкаНДСУслугиВБ);
		СтруктураДанных.Вставить("НоменклатураУслугиВБ", 				НоменклатураУслугиВБ);
		СтруктураДанных.Вставить("Профиль", 							Профиль);
		СтруктураДанных.Вставить("Партнер", 							Профиль.Партнер); 
		СтруктураДанных.Вставить("Контрагент",							Профиль.Контрагент);
		СтруктураДанных.Вставить("Организация", 						Профиль.Организация);
		СтруктураДанных.Вставить("ДатаНачала", 							НомерОтчета.ДатаНачала);
		СтруктураДанных.Вставить("ДатаОкончания", 						НомерОтчета.ДатаОкончания);
		СтруктураДанных.Вставить("Соглашение", 							Профиль.Соглашение);
		СтруктураДанных.Вставить("Договор", 							Профиль.Договор);
		//+ ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78655
		СтруктураДанных.Вставить("Подразделение", 						Профиль.Подразделение);
		//- ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78655
		
		//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
		СтруктураДанных.Вставить("НастройкиОтчетаКомиссионера", 		НастройкиОтчетаКомиссионера);
		//- ИнфоСофт Власова И.С. 14.03.25 УА #83865
		
		//+ ИнфоСофт Макарова Н.Е. 10.04.2025 УА #76491
		Если НомерОтчета <> Неопределено Тогда
			
			Если ПерезаписатьИмеющийсяОК
				И НомерОтчета.Документы.Количество() > 0 Тогда
				
				Для Каждого ТекСтрока Из НомерОтчета.Документы Цикл
					
					Если ТипЗнч(ТекСтрока.Документ) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
						
						СтруктураДанных.Вставить("ОтчетКомиссионераСсылка", ТекСтрока.Документ);
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
			СтруктураДанных.Вставить("НомерОтчета", НомерОтчета);
			
		КонецЕсли;
		//- ИнфоСофт Макарова Н.Е. 10.04.2025 УА #76491
		
		//+ ИнфоСофт Мурсалимов Д.Р. 24.04.25 УА #99478
		СтруктураДанных.Вставить("ОчиститьРегистрыОК", 					ОчиститьРегистрыОК);	
		//- ИнфоСофт Мурсалимов Д.Р. 24.04.25 УА #99478
		
		//Обработать полученные данные в фоновом режиме
		ВыполняемыйМетод = "ИС_WB_СерверУТ11_5.СоздатьДокументОтчетКомиссионера";
		ПараметрыПроцедуры = Новый Структура;
		ПараметрыПроцедуры.Вставить("СтруктураДанных", СтруктураДанных);
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Создание документа'");
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 	
	Иначе
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("СписокТранзакций", 					СписокТранзакций.Выгрузить());  
		
		ПараметрыСебестоимости = Новый Структура;
		ПараметрыСебестоимости.Вставить("СпособРасчета", ВариантФормированияСебестоимости);
		ПараметрыСебестоимости.Вставить("ВидЦены", ВидЦеныСебестоимость);  
		
		СтруктураДанных.Вставить("ВариантФормированияСебестоимости", 	ПараметрыСебестоимости);
		СтруктураДанных.Вставить("НомерОтчета", 						НомерОтчета);
		//+ ИнфоСофт Заварин К.В. 02.04.24 УА #66208
		//СтруктураДанных.Вставить("Комментарий", 						НомерОтчета.Наименование);   
		СтруктураДанных.Вставить("Комментарий", 						Строка(НомерОтчета.Профиль) + " " + Строка(НомерОтчета.Наименование));
        //- ИнфоСофт Заварин К.В. 02.04.24 УА #66208
		СтруктураДанных.Вставить("НайтиОснованиеДляВозврата", 			НайтиОснованиеДляВозврата);
		
		//+ ИнфоСофт Мурсалимов Д.Р. 19.09.24 УА #82106
		СтруктураДанных.Вставить("ВариантФормированияЦеныПродажи", 		ВариантФормированияЦеныПродажи);
		//- ИнфоСофт Мурсалимов Д.Р. 19.09.24 УА #82106
		
		//+ ИнфоСофт Мурсалимов Д.Р. 08.10.24 УА #84956
		СтруктураДанных.Вставить("ПолностьюРаспределятьЛогистику", 		ПолностьюРаспределятьЛогистику);
		//- ИнфоСофт Мурсалимов Д.Р. 08.10.24 УА #84956
		
		СуммаУслугВБ = 0;
		СтавкаНДСУслугиВБ = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
		НоменклатураУслугиВБ = Справочники.Номенклатура.ПустаяСсылка();
	
		СтруктураДанных.Вставить("Профиль", 							Профиль);
		СтруктураДанных.Вставить("Партнер", 							Профиль.Партнер); 
		СтруктураДанных.Вставить("Контрагент",							Профиль.Контрагент);
		СтруктураДанных.Вставить("Организация", 						Профиль.Организация);
		СтруктураДанных.Вставить("ДатаНачала", 							НомерОтчета.ДатаНачала);
		СтруктураДанных.Вставить("ДатаОкончания", 						НомерОтчета.ДатаОкончания);
		СтруктураДанных.Вставить("Соглашение", 							Профиль.Соглашение);
		СтруктураДанных.Вставить("Договор", 							Профиль.Договор);
		//+ ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78655
		СтруктураДанных.Вставить("Подразделение", 						Профиль.Подразделение);
		//- ИнфоСофт Стояк Ю.К. 01.07.2024 УА #78655
		//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #85500
		СтруктураДанных.Вставить("ОснованиеДляПФ", 						Строка(НомерОтчета.Наименование));
		//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #85500		
		
		//Обработать полученные данные в фоновом режиме
		ВыполняемыйМетод = "ИС_WB_СерверУТ11_5.ОбработатьИностранныеПродажи";
		ПараметрыПроцедуры = Новый Структура;
		ПараметрыПроцедуры.Вставить("СтруктураДанных", СтруктураДанных);
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Создание документа'");
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 	
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ВыполняемыйМетод, ПараметрыПроцедуры);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107

//+ ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
&НаСервере
Процедура ПодобратьПоАртикулуНаСервере()
	
	ТЗРезультирующая = Новый ТаблицаЗначений;
	
	ТЗРезультирующая.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ТЗРезультирующая.Колонки.Добавить("Размер", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
		
	ТаблицаСопоставления = СписокТранзакций;  
		
	Для Каждого Строка Из ТаблицаСопоставления Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			НоваяСтрока = ТЗРезультирующая.Добавить();
			
			//+ ИнфоСофт Конышев А.Е. 21.11.24 УА #87938
			НоваяСтрока.Артикул = Строка.АртикулПоставщика;
			НоваяСтрока.Размер = Строка.Размер; 
			//- ИнфоСофт Конышев А.Е. 21.11.24 УА #87938
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ТЗРезультирующая.Свернуть("Артикул, Размер");
	
	Если ТЗРезультирующая.Количество() = 0 Тогда		
		ОбщегоНазначения.СообщитьПользователю("Нет данных для обработки!"); 
		Возврат;		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ДанныеТЗ.Артикул КАК Артикул,
	|	ДанныеТЗ.Размер КАК Размер
	|ПОМЕСТИТЬ ВТ_ДанныеТЗ
	|ИЗ
	|	&ТЗРезультирующая КАК ДанныеТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_Номенклатура.Ссылка КАК Ссылка,
	|	ВТ_ДанныеТЗ.Артикул КАК Артикул,
	|	ВТ_ДанныеТЗ.Размер КАК Размер
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.ИС_WB_Номенклатура КАК ИС_WB_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеТЗ КАК ВТ_ДанныеТЗ
	|		ПО ИС_WB_Номенклатура.vendorCode = ВТ_ДанныеТЗ.Артикул
	|ГДЕ
	|	ИС_WB_Номенклатура.Профиль = &Профиль
	|	И НЕ ВТ_ДанныеТЗ.Размер ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Ссылка КАК НоменклатураWB,
	|	ВТ_Номенклатура.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(ИС_WB_РазмерыНоменклатур.techSize) > 1
	|			ТОГДА ВТ_Номенклатура.Размер
	|		ИНАЧЕ ИС_WB_РазмерыНоменклатур.techSize
	|	КОНЕЦ КАК Размер
	|ПОМЕСТИТЬ ВТ_РазмерНоменклатуры
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|		ПО (ИС_WB_РазмерыНоменклатур.Владелец = ВТ_Номенклатура.Ссылка)
	|			И (ИС_WB_РазмерыНоменклатур.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Номенклатура.Ссылка,
	|	ИС_WB_РазмерыНоменклатур.techSize,
	|	ВТ_Номенклатура.Размер,
	|	ВТ_Номенклатура.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ВТ_РазмерНоменклатуры.Артикул КАК Артикул, 
	|	ВТ_РазмерНоменклатуры.Размер КАК Размер,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоНабор,
	|	ИС_WB_СоответствиеРазмеров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель
	|	КОНЕЦ КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВТ_Результирующая
	|ИЗ
	|	ВТ_РазмерНоменклатуры КАК ВТ_РазмерНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|		ПО ВТ_РазмерНоменклатуры.НоменклатураWB = ИС_WB_РазмерыНоменклатур.Владелец
	|			И ВТ_РазмерНоменклатуры.Размер = ИС_WB_РазмерыНоменклатур.techSize
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_РазмерыНоменклатур.Ссылка = ИС_WB_СоответствиеРазмеров.РазмерWB)
	|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
	|ГДЕ
	|	ИС_WB_РазмерыНоменклатур.Профиль = &Профиль
	|	И НЕ ИС_WB_РазмерыНоменклатур.ПометкаУдаления
	|	И НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результирующая.Номенклатура КАК Номенклатура,
	|	ВТ_Результирующая.Характеристика КАК Характеристика, 
	|	ВТ_Результирующая.Артикул КАК АртикулПоставщика,   
	|	ВТ_Результирующая.Размер КАК Размер,
	|	ВТ_Результирующая.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Результирующая.Упаковка КАК Упаковка,
	|	ВТ_Результирующая.КоэффициентУпаковки КАК КоэффициентУпаковки
	|ИЗ
	|	ВТ_Результирующая КАК ВТ_Результирующая";
	
	Запрос.УстановитьПараметр("Профиль", 			Профиль);
	Запрос.УстановитьПараметр("ТЗРезультирующая", 	ТЗРезультирующая);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = ТаблицаСопоставления.НайтиСтроки(Новый Структура("АртикулПоставщика", Выборка.АртикулПоставщика));
		
		Для Каждого Элемент Из НайденныеСтроки Цикл
			
			Если Не ЗначениеЗаполнено(Элемент.Номенклатура) Тогда
				
				ЗаполнитьЗначенияСвойств(Элемент, Выборка, "Номенклатура,Характеристика,Упаковка,КоэффициентУпаковки,ЭтоНабор,Размер");   
					
				Элемент.КоэффициентУпаковки = Выборка.КоэффициентУпаковки; 
					
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	СписокТранзакций.Сортировать("Номенклатура");
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005

//+ ИнфоСофт Сумин Д.В. 04.03.2024 УА #71107
&НаСервере
Функция ПолучитьСуммуУслугПоОтчету(НомерОтчета)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Сумма) КАК Сумма
	|ИЗ
	|	Справочник.ИС_WB_НомерацияОтчетовОПродажах.ДополнительнаяИнформация КАК ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_НаименованиеУслугИзОтчетаWildberries КАК ИС_WB_НаименованиеУслугИзОтчетаWildberries
	//+ ИнфоСофт Мурсалимов Д.Р. 27.05.24 УА #76549
	//|		ПО ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Наименование = ИС_WB_НаименованиеУслугИзОтчетаWildberries.НаименованиеУслугиИзОтчета
	|		ПО ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ИС_WB_НаименованиеУслугИзОтчетаWildberries.НаименованиеУслугиИзОтчета
	//- ИнфоСофт Мурсалимов Д.Р. 27.05.24 УА #76549
	|ГДЕ
	|	ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Ссылка = &Ссылка
	|	И НЕ ИС_WB_НаименованиеУслугИзОтчетаWildberries.ПометкаУдаления
	//+ ИнфоСофт Мурсалимов Д.Р. 27.05.24 УА #76549
	//|	И (ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Наименование = ""Сумма вознаграждения Вайлдберриз за текущий период (ВВ), без НДС""
	//|			ИЛИ ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Наименование = ""Стоимость услуг Вайлдберриз по организации международной перевозки""
	//|			ИЛИ ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Наименование = ""Возмещение расходов поверенного""
	//|			ИЛИ ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Наименование = ""Штрафы согласно договору"")";
	|	И (ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ""Сумма вознаграждения Вайлдберриз за текущий период (ВВ), без НДС""
	|			ИЛИ ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ""Стоимость услуг Вайлдберриз по организации международной перевозки""
	|			ИЛИ ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ""Возмещение расходов поверенного""
	|			ИЛИ ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ""Возмещение издержек по эквайрингу""
	|			ИЛИ ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ""Штрафы""
	//+ ИнфоСофт Стояк Ю.К. 24.06.2024 УА #78086	
	|			ИЛИ ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ""НДС с вознаграждения Вайлдберриз"" 
	//- ИнфоСофт Стояк Ю.К. 24.06.2024 УА #78086
	|			ИЛИ ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ""Прочие удержания""
	|			ИЛИ ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ""Штрафы согласно договору"")";
	//- ИнфоСофт Мурсалимов Д.Р. 27.05.24 УА #76549
	
	Запрос.УстановитьПараметр("Ссылка", НомерОтчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СуммаУслуг = 0;
	
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.Сумма) И Выборка.Сумма > 0 Тогда
		СуммаУслуг = Выборка.Сумма;	
	КонецЕсли;	
	
	Возврат СуммаУслуг;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 04.03.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 04.03.2024 УА #71107
&НаСервере
Функция ПолучитьНастройкиУслугиВБ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.Номенклатура КАК Номенклатура
	|ИЗ
	|	Справочник.ИС_WB_НаименованиеУслугИзОтчетаWildberries КАК ИС_WB_НаименованиеУслугИзОтчетаWildberries
	|ГДЕ
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.НаименованиеУслугиИзОтчета = ""Сумма вознаграждения Вайлдберриз за текущий период (ВВ), без НДС""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Структура;
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат.Вставить("СтавкаНДС", Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС"));
		Результат.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
		Возврат Результат;	
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Результат.Вставить("СтавкаНДС", Выборка.СтавкаНДС);
	Результат.Вставить("Номенклатура", Выборка.Номенклатура);
	
	Возврат Результат;
		
КонецФункции //- ИнфоСофт Сумин Д.В. 04.03.2024 УА #71107 

//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
&НаСервере
Процедура ЗаполнениеРегистраЗаказовНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|  ИС_WB_СборочноеЗадание.Ссылка КАК ЗаказМП,
	|  ИС_WB_СборочноеЗадание.rid КАК ИдентификаторМП,
	|  ИС_WB_СборочноеЗадание.Заказ КАК Заказ1С
	|ИЗ
	|  Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|  ИС_WB_СборочноеЗадание.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода",   '20240101000000');
	Запрос.УстановитьПараметр("КонецПериода",  '20241231000000');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ИС_MP_ЗаказыОтчетаКомиссионера.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Профиль         			= Профиль;
		МенеджерЗаписи.Маркетплейс     			= Перечисления.ИС_МП_Маркетплейсы.ВБ;
		МенеджерЗаписи.ИдентификаторМП 		 	= Выборка.ИдентификаторМП;
		МенеджерЗаписи.ЗаказМП         			= Выборка.ЗаказМП;
		МенеджерЗаписи.Заказ1С         			= Выборка.Заказ1С;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 01.11.24 УА #86746

//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
&НаКлиенте
Процедура ЗаполнениеРегистраЗаказов(Команда)
	ЗаполнениеРегистраЗаказовНаСервере();
КонецПроцедуры

//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746

#КонецОбласти

#Область Шаг4

//+ ИнфоСофт Сумин Д.В. 04.03.2024 УА #71107
&НаСервере
Процедура ЗаполнитьУслугиПоОтчетуНаСервере()  
	
	Если НомерОтчета.ВидОтчета <> Перечисления.ИС_WB_ВидыОтчетов.Российский Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Обработка услуг доступна для отчетов по подажам в РФ'"),,,"НомерОтчета");
		Возврат;
	КонецЕсли;

	//+ ИнфоСофт Власова И.С. 21.08.24 УА #61503
	РезультатПроверки = ИС_WB_Сервер.ПроверитьЗаполнениеНастроекЗакупки(Профиль);
	
	Если РезультатПроверки <> Неопределено И Не РезультатПроверки Тогда
		Возврат;
	КонецЕсли;
	
	Если Профиль.РаспределятьРасходыПоАртикулам Тогда
		ЗаполнитьРаспределениеУслугПоАртикулам();
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 21.08.24 УА #61503
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	//+ ИнфоСофт Мурсалимов Д.Р. 27.05.24 УА #76549
	//|	ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Наименование КАК Наименование,
	|	ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование КАК Наименование,
	//- ИнфоСофт Мурсалимов Д.Р. 27.05.24 УА #76549
	|	ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Сумма КАК Сумма,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.Номенклатура КАК Номенклатура,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.СтатьяРасходов КАК СтатьяРасходов,
	|	ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Ссылка КАК Ссылка,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.Ссылка КАК УслугаWildberries
	|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	|ИЗ
	|	Справочник.ИС_WB_НомерацияОтчетовОПродажах.ДополнительнаяИнформация КАК ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИС_WB_НаименованиеУслугИзОтчетаWildberries КАК ИС_WB_НаименованиеУслугИзОтчетаWildberries
	//+ ИнфоСофт Мурсалимов Д.Р. 27.05.24 УА #76549
	//|		ПО ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Наименование = ИС_WB_НаименованиеУслугИзОтчетаWildberries.НаименованиеУслугиИзОтчета
	//+ ИнфоСофт Власова И.С. 26.08.24 УА #82315	
	//|		ПО ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ИС_WB_НаименованиеУслугИзОтчетаWildberries.НаименованиеУслугиИзОтчета
	|		ПО ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга = ИС_WB_НаименованиеУслугИзОтчетаWildberries.Ссылка
	//- ИнфоСофт Власова И.С. 26.08.24 УА #82315
	//- ИнфоСофт Мурсалимов Д.Р. 27.05.24 УА #76549
	|ГДЕ
	|	ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Ссылка = &Ссылка
	//+ ИнфоСофт Заварин К.В. 01.10.24 УА #61499
	|	И НЕ ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ""НДС с вознаграждения Вайлдберриз""
	//- ИнфоСофт Заварин К.В. 01.10.24 УА #61499
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_ОсновныеДанные.Наименование = ""Сумма вознаграждения Вайлдберриз за текущий период (ВВ), без НДС""
	|			ТОГДА ЕСТЬNULL(ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Сумма, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НДС,
	|	ВТ_ОсновныеДанные.Наименование КАК Наименование,
	|	ВТ_ОсновныеДанные.Сумма КАК Сумма,
	|	ВТ_ОсновныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ОсновныеДанные.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ОсновныеДанные.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТ_ОсновныеДанные.Ссылка КАК Ссылка,
	|	ВТ_ОсновныеДанные.УслугаWildberries КАК УслугаWildberries
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_НомерацияОтчетовОПродажах.ДополнительнаяИнформация КАК ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация
	|		ПО ВТ_ОсновныеДанные.Ссылка = ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Ссылка
	//+ ИнфоСофт Власова И.С. 26.08.24 УА #82315
	|		И ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ""НДС с вознаграждения Вайлдберриз""
	|		И ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Ссылка = &Ссылка";
	//|ГДЕ 
	////+ ИнфоСофт Мурсалимов Д.Р. 27.05.24 УА #76549
	////|	ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Наименование = ""НДС с вознаграждения Вайлдберриз""
	//|	ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ""НДС с вознаграждения Вайлдберриз""
	////- ИнфоСофт Мурсалимов Д.Р. 27.05.24 УА #76549
	//|	И ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Ссылка = &Ссылка";
	//- ИнфоСофт Власова И.С. 26.08.24 УА #82315
	
	Запрос.УстановитьПараметр("Ссылка", НомерОтчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ОтражениеУслугWildberries.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 04.03.2024 УА #71107

//+ ИнфоСофт Власова И.С. 22.08.24 УА #61503
&НаСервере
Процедура ЗаполнитьРаспределениеУслугПоАртикулам()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 27.11.24 УА #85116
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокТранзакций.Номенклатура КАК Номенклатура,
	|	СписокТранзакций._ КАК Номер
	|ПОМЕСТИТЬ ВТ_СписокТранзакций
	|ИЗ
	|	&СписокТранзакций КАК СписокТранзакций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписокТранзакций.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(ВТ_СписокТранзакций.Номер КАК СТРОКА(100)) КАК Номер
	|ПОМЕСТИТЬ ВТ_СписокТранзакцийСГруппировкой
	|ИЗ
	|	ВТ_СписокТранзакций КАК ВТ_СписокТранзакций
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СписокТранзакций.Номенклатура,
	|	ВЫРАЗИТЬ(ВТ_СписокТранзакций.Номер КАК СТРОКА(100))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_ДанныеОтчетовОПродажах.Профиль КАК Профиль,
	|	ИС_WB_ДанныеОтчетовОПродажах.НомерОтчета КАК НомерОтчета,
	|	ИС_WB_ДанныеОтчетовОПродажах.Параметр КАК Параметр,
	|	ИС_WB_ДанныеОтчетовОПродажах.СтрокаНомер КАК СтрокаНомер,
	|	ИС_WB_ДанныеОтчетовОПродажах.ЗначениеПараметра КАК ЗначениеПараметра
	|ПОМЕСТИТЬ ВТ_ДанныеОтчетаОПродажах
	|ИЗ
	|	РегистрСведений.ИС_WB_ДанныеОтчетовОПродажах КАК ИС_WB_ДанныеОтчетовОПродажах
	|ГДЕ
	|	ИС_WB_ДанныеОтчетовОПродажах.Профиль = &Профиль
	|	И ИС_WB_ДанныеОтчетовОПродажах.НомерОтчета = &НомерОтчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_НомерацияОтчетовОПродажахУслугиРаспределения.Услуга КАК Услуга,
	|	ИС_WB_НомерацияОтчетовОПродажахУслугиРаспределения.ОбоснованиеДляОплаты КАК ОбоснованиеДляОплаты,
	|	ИС_WB_НомерацияОтчетовОПродажахУслугиРаспределения.ПараметрОтчета КАК ПараметрОтчета,
	|	ИС_WB_НомерацияОтчетовОПродажахУслугиРаспределения.Ссылка КАК НомерОтчета,
	|	ИС_WB_НомерацияОтчетовОПродажахУслугиРаспределения.Услуга.СтатьяРасходов КАК СтатьяРасходов
	|ПОМЕСТИТЬ ВТ_УслугиРаспределения
	|ИЗ
	|	Справочник.ИС_WB_НомерацияОтчетовОПродажах.УслугиРаспределения КАК ИС_WB_НомерацияОтчетовОПродажахУслугиРаспределения
	|ГДЕ
	|	ИС_WB_НомерацияОтчетовОПродажахУслугиРаспределения.Ссылка = &НомерОтчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеОтчетаОПродажах.СтрокаНомер КАК СтрокаНомер,
	|	ВТ_ДанныеОтчетаОПродажах.Параметр КАК Параметр,
	|	ВТ_УслугиРаспределения.ОбоснованиеДляОплаты КАК ОбоснованиеДляОплаты,
	|	ВТ_ДанныеОтчетаОПродажах.ЗначениеПараметра КАК ЗначениеПараметра,
	|	ВТ_УслугиРаспределения.НомерОтчета КАК НомерОтчета,
	|	ВТ_УслугиРаспределения.Услуга КАК Услуга,
	|	ВТ_УслугиРаспределения.СтатьяРасходов КАК СтатьяРасходов
	|ПОМЕСТИТЬ ВТ_ДанныеДляРаспределения
	|ИЗ
	|	ВТ_УслугиРаспределения КАК ВТ_УслугиРаспределения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеОтчетаОПродажах КАК ВТ_ДанныеОтчетаОПродажах
	|		ПО ВТ_УслугиРаспределения.ПараметрОтчета = ВТ_ДанныеОтчетаОПродажах.Параметр
	|			И (ВТ_ДанныеОтчетаОПродажах.НомерОтчета = ВТ_УслугиРаспределения.НомерОтчета)
	|			И (ВТ_ДанныеОтчетаОПродажах.ЗначениеПараметра <> ""0"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДляРаспределения.СтрокаНомер КАК СтрокаНомер,
	|	ВТ_ДанныеДляРаспределения.Параметр КАК Параметр,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ДанныеДляРаспределения.ОбоснованиеДляОплаты, """") = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ДанныеОтчетаОПродажахПродажи.ЗначениеПараметра = ""продажа""
	|						ТОГДА ВТ_ДанныеОтчетаОПродажахПродажи.ЗначениеПараметра
	|					КОГДА ВТ_ДанныеОтчетаОПродажахПродажи.ЗначениеПараметра = ""возврат""
	|						ТОГДА ВТ_ДанныеОтчетаОПродажахПродажи.ЗначениеПараметра
	|					ИНАЧЕ ВТ_ДанныеДляРаспределения.ОбоснованиеДляОплаты
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ДанныеДляРаспределения.ОбоснованиеДляОплаты
	|	КОНЕЦ КАК ОбоснованиеДляОплаты,
	|	ВТ_ДанныеДляРаспределения.ЗначениеПараметра КАК ЗначениеПараметра,
	|	ВТ_ДанныеОтчетаОПродажах.ЗначениеПараметра КАК Номер,
	|	ВТ_ДанныеДляРаспределения.Услуга КАК Услуга,
	|	ВТ_ДанныеДляРаспределения.Услуга.Номенклатура КАК НоменклатураУслуги,
	|	ВТ_ДанныеДляРаспределения.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТ_ДанныеДляРаспределения.НомерОтчета КАК НомерОтчета
	|ПОМЕСТИТЬ ВТ_ИтоговыеДанныеРаспределения
	|ИЗ
	|	ВТ_ДанныеДляРаспределения КАК ВТ_ДанныеДляРаспределения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеОтчетаОПродажах КАК ВТ_ДанныеОтчетаОПродажах
	|		ПО ВТ_ДанныеДляРаспределения.СтрокаНомер = ВТ_ДанныеОтчетаОПродажах.СтрокаНомер
	|			И ВТ_ДанныеДляРаспределения.НомерОтчета = ВТ_ДанныеОтчетаОПродажах.НомерОтчета
	|			И (ВТ_ДанныеОтчетаОПродажах.Параметр.Наименование = ""_"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеОтчетаОПродажах КАК ВТ_ДанныеОтчетаОПродажахПродажи
	|		ПО ВТ_ДанныеДляРаспределения.СтрокаНомер = ВТ_ДанныеОтчетаОПродажахПродажи.СтрокаНомер
	|			И (ВТ_ДанныеОтчетаОПродажахПродажи.Параметр.Наименование = ""ТипДокумента"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеОтчетаОПродажах КАК ВТ_ДанныеОтчетаОПродажахСодержание
	|		ПО ВТ_ДанныеДляРаспределения.СтрокаНомер = ВТ_ДанныеОтчетаОПродажахСодержание.СтрокаНомер
	|			И ВТ_ДанныеДляРаспределения.НомерОтчета = ВТ_ДанныеОтчетаОПродажахСодержание.НомерОтчета
	|			И (ВТ_ДанныеОтчетаОПродажахСодержание.Параметр.Наименование = ""ВидыЛогистики_ШтрафовИДоплат"")
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДляРаспределения.СтрокаНомер,
	|	ВТ_ДанныеДляРаспределения.Параметр,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ДанныеДляРаспределения.ОбоснованиеДляОплаты, """") = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ДанныеОтчетаОПродажахПродажи.ЗначениеПараметра = ""продажа""
	|						ТОГДА ВТ_ДанныеОтчетаОПродажахПродажи.ЗначениеПараметра
	|					КОГДА ВТ_ДанныеОтчетаОПродажахПродажи.ЗначениеПараметра = ""возврат""
	|						ТОГДА ВТ_ДанныеОтчетаОПродажахПродажи.ЗначениеПараметра
	|					ИНАЧЕ ВТ_ДанныеДляРаспределения.ОбоснованиеДляОплаты
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ДанныеДляРаспределения.ОбоснованиеДляОплаты
	|	КОНЕЦ,
	|	ВТ_ДанныеДляРаспределения.ЗначениеПараметра,
	|	ВТ_ДанныеОтчетаОПродажах.ЗначениеПараметра,
	|	ВТ_ДанныеДляРаспределения.Услуга,
	|	ВТ_ДанныеДляРаспределения.Услуга.Номенклатура,
	|	ВТ_ДанныеДляРаспределения.СтатьяРасходов,
	|	ВТ_ДанныеДляРаспределения.НомерОтчета,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеОтчетаОПродажахСодержание.ЗначениеПараметра = """"
	|			ТОГДА ВТ_ДанныеДляРаспределения.ОбоснованиеДляОплаты
	|		ИНАЧЕ ВТ_ДанныеОтчетаОПродажахСодержание.ЗначениеПараметра
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование КАК Наименование,
	|	ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Сумма КАК Сумма,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.Номенклатура КАК Номенклатура,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.СтатьяРасходов КАК СтатьяРасходов,
	|	ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Ссылка КАК Ссылка,
	|	ИС_WB_НаименованиеУслугИзОтчетаWildberries.Ссылка КАК УслугаWildberries
	|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	|ИЗ
	|	Справочник.ИС_WB_НомерацияОтчетовОПродажах.ДополнительнаяИнформация КАК ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИС_WB_НаименованиеУслугИзОтчетаWildberries КАК ИС_WB_НаименованиеУслугИзОтчетаWildberries
	|		ПО ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга = ИС_WB_НаименованиеУслугИзОтчетаWildberries.Ссылка
	|ГДЕ
	|	ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Ссылка = &НомерОтчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_ОсновныеДанные.Наименование = ""Сумма вознаграждения Вайлдберриз за текущий период (ВВ), без НДС""
	|			ТОГДА ЕСТЬNULL(ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Сумма, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НДССтрока,
	|	ВТ_ОсновныеДанные.Сумма КАК СуммаСтрока,
	|	ВТ_ОсновныеДанные.УслугаWildberries КАК УслугаWildberries,
	|	ВТ_ОсновныеДанные.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК АналитикаРасходов,
	|	ВТ_ОсновныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ОсновныеДанные.СтавкаНДС КАК СтавкаНДС,
	|	0 КАК Сумма,
	|	0 КАК НДС
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_НомерацияОтчетовОПродажах.ДополнительнаяИнформация КАК ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация
	|		ПО ВТ_ОсновныеДанные.Ссылка = ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Ссылка
	|ГДЕ
	|	ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Услуга.Наименование = ""НДС с вознаграждения Вайлдберриз""
	|	И ИС_WB_НомерацияОтчетовОПродажахДополнительнаяИнформация.Ссылка = &НомерОтчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	ВЫБОР
	|		КОГДА ВТ_ИтоговыеДанныеРаспределения.ОбоснованиеДляОплаты = ""возврат""
	|			ТОГДА ""-"" + ВТ_ИтоговыеДанныеРаспределения.ЗначениеПараметра
	|		ИНАЧЕ ВТ_ИтоговыеДанныеРаспределения.ЗначениеПараметра
	|	КОНЕЦ,
	|	ВТ_ИтоговыеДанныеРаспределения.Услуга,
	|	ВТ_ИтоговыеДанныеРаспределения.СтатьяРасходов,
	|	ЕСТЬNULL(ВТ_СписокТранзакцийСГруппировкой.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|	ЕСТЬNULL(ВТ_ИтоговыеДанныеРаспределения.НоменклатураУслуги, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка),
	|	0,
	|	0
	|ИЗ
	|	ВТ_ИтоговыеДанныеРаспределения КАК ВТ_ИтоговыеДанныеРаспределения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписокТранзакцийСГруппировкой КАК ВТ_СписокТранзакцийСГруппировкой
	|		ПО ВТ_ИтоговыеДанныеРаспределения.Номер = ВТ_СписокТранзакцийСГруппировкой.Номер";
	//- ИнфоСофт Мурсалимов Д.Р. 27.11.24 УА #85116
	
	Запрос.УстановитьПараметр("НомерОтчета",      НомерОтчета);
	Запрос.УстановитьПараметр("Профиль",          Профиль);
	Запрос.УстановитьПараметр("СписокТранзакций", СписокТранзакций.Выгрузить());
	
	ДанныеДокумента = Запрос.Выполнить().Выгрузить();
	
	Если ДанныеДокумента.Количество() > 0 Тогда
		
		Для Каждого Строка Из ДанныеДокумента Цикл
			Строка.Сумма = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строка.СуммаСтрока);
			Строка.НДС   = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строка.НДССтрока);
		КонецЦикла;
		
		ДанныеДокумента.Свернуть("УслугаWildberries, АналитикаРасходов, Номенклатура, СтавкаНДС, СтатьяРасходов", "Сумма, НДС");
		
		ОтражениеУслугWildberries.Загрузить(ДанныеДокумента);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.08.24 УА #61503

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
&НаСервере
Процедура СоздатьДокументПриобретенияНаСервере() 
	
	ДопПараметры = Новый Структура;
	
	СуммаОтрицательныхУслуг = 0;
	
	МассивСтрокПоложительныхУслуг = Новый Массив;
	
	Для Каждого Строка Из ОтражениеУслугWildberries Цикл	
		
		Если Строка.Сумма < 0 Тогда	
			СуммаОтрицательныхУслуг = СуммаОтрицательныхУслуг + Строка.Сумма;
		ИначеЕсли Строка.Сумма > 0 Тогда	
			МассивСтрокПоложительныхУслуг.Добавить(Строка);
		КонецЕсли;	
		
	КонецЦикла;
	
	Если СуммаОтрицательныхУслуг < 0 Тогда
		
		Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ;
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить("СтатьяДоходовОтрицательноеВознаграждение");
		
		Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров);
		
		СтатьяДоходовОтрицательноеВознаграждение = ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка();
		
		Если Не Настройки = Неопределено Тогда
			
			Если Не Настройки["СтатьяДоходовОтрицательноеВознаграждение"] = Неопределено Тогда
				СтатьяДоходовОтрицательноеВознаграждение = Настройки["СтатьяДоходовОтрицательноеВознаграждение"];
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеДокумента = ИС_WB_Сервер.ПолучитьСтруктуруКорректировкиЗадолженности(); 
		
		РеквизитыПрофиля = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Профиль,
			"Организация, Контрагент, Партнер, Договор, Соглашение");
		
		ДанныеДокумента.Дата                  = КонецДня(НомерОтчета.ДатаОкончания);
		ДанныеДокумента.Комментарий           = НомерОтчета.Наименование;	
		ДанныеДокумента.Организация           = РеквизитыПрофиля.Организация;
	    ДанныеДокумента.Контрагент            = РеквизитыПрофиля.Контрагент;
	    ДанныеДокумента.Договор               = РеквизитыПрофиля.Договор;
		ДанныеДокумента.Соглашение            = РеквизитыПрофиля.Соглашение;
		ДанныеДокумента.ХозяйственнаяОперация = ИС_WB_СерверУТ11_5.ПолучитьХозОперациюСписаниеКредиторскойЗадолженности(); 
		
		ДанныеДокумента.КорреспонденцияСДоходами = Истина;
		
		СтрокаЗадолженность = ДанныеДокумента.Задолженность.Добавить();
		СтрокаЗадолженность.ТипРасчетов = ИС_WB_СерверУТ11_5.ПолучитьТипРасчетовСПартнерамиРасчетыСКлиентом();
		СтрокаЗадолженность.Партнер     = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "Партнер");
		СтрокаЗадолженность.Сумма       = -СуммаОтрицательныхУслуг;
		
		СтрокаДоходыРасходыАктивыПассивы = ДанныеДокумента.ДоходыРасходыАктивыПассивы.Добавить();
		СтрокаДоходыРасходыАктивыПассивы.Статья        = СтатьяДоходовОтрицательноеВознаграждение;
		СтрокаДоходыРасходыАктивыПассивы.Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "Подразделение");
		СтрокаДоходыРасходыАктивыПассивы.Сумма         = -СуммаОтрицательныхУслуг;
		
		ДокументМинусовыхУслуг = ИС_WB_Сервер.СоздатьИзменитьКорректировкуЗадолженности(Профиль, ДанныеДокумента, ДопПараметры);
		
		Если Не ДокументМинусовыхУслуг = Неопределено Тогда
			
			СформированныеДокументы.Добавить().Документ = ДокументМинусовыхУслуг;
			
			ДобавитьДокументКОтчетуОПродажах(НомерОтчета, ДокументМинусовыхУслуг);
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Если Не МассивСтрокПоложительныхУслуг.Количество() = 0 Тогда
		
		ДанныеДокумента = Новый Структура;
		
		ДанныеДокумента.Вставить("ДатаДокумента", КонецДня(НомерОтчета.ДатаОкончания));
		ДанныеДокумента.Вставить("Комментарий",   НомерОтчета.Наименование);
		
		ДокументПриобретения = ИС_WB_Сервер.СоздатьДокументПриобретения(Профиль, МассивСтрокПоложительныхУслуг, ДанныеДокумента);
		
		Если Не ДокументПриобретения = Неопределено Тогда
			
			СформированныеДокументы.Добавить().Документ = ДокументПриобретения;
			
			ДобавитьДокументКОтчетуОПродажах(НомерОтчета, ДокументПриобретения);
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Макарова Н.Е. 10.04.2025 УА #76491
&НаСервере
Функция ПолучитьДанныеНомераОтчета(НомерОтчета)
	
	ОтветСтруктура = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_WB_НомерацияОтчетовОПродажахДокументы.Документ КАК Документ
	|ИЗ
	|	Справочник.ИС_WB_НомерацияОтчетовОПродажах.Документы КАК ИС_WB_НомерацияОтчетовОПродажахДокументы
	|ГДЕ
	|	ИС_WB_НомерацияОтчетовОПродажахДокументы.Ссылка = &Ссылка
	|	И НЕ ВЫРАЗИТЬ(ИС_WB_НомерацияОтчетовОПродажахДокументы.Документ КАК Документ.ОтчетКомиссионера).ПометкаУдаления
	|	И ИС_WB_НомерацияОтчетовОПродажахДокументы.Документ ССЫЛКА Документ.ОтчетКомиссионера";
	
	Запрос.УстановитьПараметр("Ссылка", НомерОтчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ОтветСтруктура.Вставить("ЕстьОтчетКомиссионера", Истина);
		
	Иначе
		
		ОтветСтруктура.Вставить("ЕстьОтчетКомиссионера", Ложь);
		
	КонецЕсли;
	
	ОтветСтруктура.Вставить("ПометкаУдаления", НомерОтчета.ПометкаУдаления);
	
	Возврат ОтветСтруктура;
	
КонецФункции //- ИнфоСофт Макарова Н.Е. 10.04.2025 УА #76491

#КонецОбласти

#Область Шаг5

//+ ИнфоСофт Власова И.С. 08.04.25 УА #78061
&НаСервере
Процедура СоздатьВзаимозачетНаСервере()
	
	ДанныеОтчета = ПолучитьДанныеОтчетаКомиссионера(НомерОтчета);
	
	Если ДанныеОтчета = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Ошибка получения данных по отчету'"));
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеОтчета.ВидОтчета = Перечисления.ИС_WB_ВидыОтчетов.Российский Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Функциональность создания взаимозачета доступна для отчетов по продажам в РФ'"),,,"НомерОтчета");
		Возврат;
	КонецЕсли;
	
	ДокументыДебитор  = Новый Массив;
	ДокументыДебитор.Добавить(ОтчетКомиссионера);
	
	ДокументыКредитор = Новый Массив;
	ДокументыКредитор.Добавить(ДокументПриобретения);
	
	Для Каждого Элемент Из ДанныеОтчета.Документы Цикл
		
		Если ТипЗнч(Элемент.Документ) = Тип(ИС_МП_СерверЛокализация.СтрокаТипСписаниеЗадолженности()) Тогда
			
			ХозяйственнаяОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Документ, "ХозяйственнаяОперация");
			
			Если ХозяйственнаяОперация = ИС_МП_СерверЛокализация.ХозяйственнаяОперацияСписаниеДебиторскойЗадолженности() Тогда
				ДокументыКредитор.Добавить(Элемент.Документ);
			ИначеЕсли ХозяйственнаяОперация = ИС_МП_СерверЛокализация.ХозяйственнаяОперацияСписаниеКредиторскойЗадолженности() Тогда	
				ДокументыКредитор.Добавить(Элемент.Документ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеДокумента = ИС_WB_Сервер.ЗаполнитьДанныеВзаимозачетЗадолженности(Профиль, ДокументыДебитор, ДокументыКредитор);
	
	ДанныеДокумента.Дата        = КонецДня(ДанныеОтчета.ДатаОкончания);
	ДанныеДокумента.Комментарий = ДанныеОтчета.Наименование;
	
	ДокументВзаимозачет = ИС_WB_Сервер.СоздатьИзменитьВзаимозачетЗадолженности(Профиль, ДанныеДокумента);
	
	Если ДокументВзаимозачет <> Неопределено Тогда
		
		СформированныеДокументы.Добавить().Документ = ДокументВзаимозачет;
		
		ДобавитьДокументКОтчетуОПродажах(НомерОтчета, ДокументВзаимозачет);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 08.04.25 УА #78061

//+ ИнфоСофт Власова И.С. 08.04.25 УА #78061
&НаСервереБезКонтекста
Функция ПолучитьДанныеОтчетаКомиссионера(НомерОтчетаСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_НомерацияОтчетовОПродажах.ВидОтчета КАК ВидОтчета,
		|	ИС_WB_НомерацияОтчетовОПродажах.ДатаНачала КАК ДатаНачала,
		|	ИС_WB_НомерацияОтчетовОПродажах.ДатаОкончания КАК ДатаОкончания,
		|	ИС_WB_НомерацияОтчетовОПродажах.Наименование КАК Наименование,
		|	ИС_WB_НомерацияОтчетовОПродажах.Документы.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Документ КАК Документ
		|	) КАК Документы
		|ИЗ
		|	Справочник.ИС_WB_НомерацияОтчетовОПродажах КАК ИС_WB_НомерацияОтчетовОПродажах
		|ГДЕ
		|	ИС_WB_НомерацияОтчетовОПродажах.Ссылка = &НомерОтчета";
	
	Запрос.УстановитьПараметр("НомерОтчета", НомерОтчетаСсылка);
	
	ДанныеОтчета = Запрос.Выполнить().Выгрузить();
	
	Если ДанныеОтчета.Количество() > 0 Тогда
		Возврат ДанныеОтчета[0];
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Власова И.С. 08.04.25 УА #78061

#КонецОбласти

//+ ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107
&НаКлиенте
Процедура ОбработатьДанныеЗавершение(Результат, ДополнительныеПараметры) Экспорт
 
	Если Результат = Неопределено Тогда      
		 Возврат;
 	КонецЕсли; 
	
 	Если Результат.Статус = "Ошибка" Тогда
  		ПоказатьПредупреждение(,Результат.ПодробноеПредставлениеОшибки);
	Иначе
		ДлительныеОперацииЗавершениеНаСервере(Результат.АдресРезультата);
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Операция завершена'"));
 	КонецЕсли;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107
&НаСервере
Процедура ДлительныеОперацииЗавершениеНаСервере(АдресХранилища)
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);  
	
	Если Результат = Неопределено Тогда
		
		//+ ИнфоСофт Заварин К.В. 27.09.24 УА #73673
		//ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()) + ". Попробуйте использовать изначальный обработанный отчет."); 
		//- ИнфоСофт Заварин К.В. 27.09.24 УА #73673
		
		//+ ИнфоСофт Сумин Д.В. 14.05.2024 УА #75591
		Возврат;
        //- ИнфоСофт Сумин Д.В. 14.05.2024 УА #75591
	КонецЕсли;
	
	//+ ИнфоСофт Сумин Д.В. 15.03.2024 УА #71773
	Если Результат.НомерСТраницы = 1 Тогда
		
		НомерОтчета = Справочники.ИС_WB_НомерацияОтчетовОПродажах.ПустаяСсылка();
		
	ИначеЕсли Результат.НомерСтраницы = 2 Тогда
		
		СписокТранзакций.Загрузить(Результат.СписокТранзакций);
		
	ИначеЕсли Результат.НомерСтраницы = 3 Тогда
		
		Для Каждого Документ Из Результат.МассивДокументов Цикл
			
			НоваяСтрока = СформированныеДокументы.Добавить();
			НоваяСтрока.Документ = Документ;
			
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
				ОтчетКомиссионера = Документ.Ссылка;
				
				//+ ИнфоСофт Макарова Н.Е. 10.04.2025 УА #76491
				СтрОК = НомерОтчета.Документы.Найти(ОтчетКомиссионера, "Документ");
				
				Если СтрОК <> Неопределено Тогда
					
					Продолжить;
					
				КонецЕсли;
				//- ИнфоСофт Макарова Н.Е. 10.04.2025 УА #76491
				
			КонецЕсли;
			
			//+ ИнфоСофт Власова И.С. 26.08.24 УА #81190
			//ДобавитьДокументКОтчетуОПроджах(НомерОтчета, Документ);
			ДобавитьДокументКОтчетуОПродажах(НомерОтчета, Документ);
			//- ИнфоСофт Власова И.С. 26.08.24 УА #81190
			
		КонецЦикла;
		
	КонецЕсли;	
	//- ИнфоСофт Сумин Д.В. 15.03.2024 УА #71773
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107	

//+ ИнфоСофт Власова И.С. 26.08.24 УА #81190
&НаСервере
Процедура ДобавитьДокументКОтчетуОПродажах(НомерОтчетаВБ, Документ)
	
	НомерОтчетаОбъект = НомерОтчетаВБ.ПолучитьОбъект();
	НомерОтчетаОбъект.Документы.Добавить().Документ = Документ;
	НомерОтчетаОбъект.Записать();
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 26.08.24 УА #81190	

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	Для Каждого Элемент Из СписокТранзакций Цикл
		Если Не ЗначениеЗаполнено(Элемент.Номенклатура) Тогда
			Элемент.Номенклатура = Номенклатура;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

//+ ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987
&НаСервере
Процедура ЗагрузитьОтчетКомисисонераПоApiНаСервере()
	
	Попытка
	
		ДатаНачала 		= НачалоДня(Период.ДатаНачала);
		ДатаОкончания 	= КонецДня(Период.ДатаОкончания);
		
		ДанныеОК		= ИС_WB_Сервер.ПолучитьДанныеОК(Профиль, ДатаНачала, ДатаОкончания); 
		
		Если ДанныеОК.Таблица.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Нет данных для обработки.");
			Возврат;
		КонецЕсли;
		
		НомерРФ = 0;
		
		Если ДанныеОК.Свойство("НомерРФ") Тогда
			НомерРФ = ДанныеОК.НомерРФ;
		КонецЕсли;
		
		ДанныеОтчетаКомиссионера = ПолучитьТаблицуЗначенийДанныхПродаж(НомерРФ, ДанныеОК.Таблица); 
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = ИС_WB_Сервер.ПолучитьТекстЗапросаОК();
		
		Запрос.УстановитьПараметр("Профиль", 	Профиль);
		Запрос.УстановитьПараметр("ДанныеТЗ", 	ДанныеОтчетаКомиссионера);	
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ДанныеДляДокумента = РезультатЗапроса.Выгрузить(); 
		
		ДанныеДляДокумента = ПодобратьПоАртикулуApiНаСервере(ДанныеДляДокумента);
		
		Если ДанныеДляДокумента = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Комментарий = "Отчет Вайлдберриз №" + Строка(НомерРФ) + " от " + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
		
		МассивПараметров = Новый Массив;
		
		МассивПараметров.Добавить("WildBerriesСтатьяЗадолженности");
		
		Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивПараметров);
		
		СтатьяЗадолженности = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
		
		Если Настройки <> Неопределено Тогда
			
			Если Настройки["WildBerriesСтатьяЗадолженности"] <> Неопределено Тогда
				СтатьяЗадолженности = Настройки["WildBerriesСтатьяЗадолженности"];       
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаголовокСтруктура = Новый Структура;
		
		ЗаголовокСтруктура.Вставить("ДатаДокумента", 		Период.ДатаНачала);
		ЗаголовокСтруктура.Вставить("Комментарий", 			Комментарий);
		ЗаголовокСтруктура.Вставить("НачалоПериода", 		Период.ДатаНачала);
		ЗаголовокСтруктура.Вставить("КонецПериода", 		Период.ДатаОкончания);  
		
		ДанныеВВ = Новый Структура;  
		ДанныеВВ.Вставить("РассчитыватьВВ", Ложь);
		
		ЗаголовокСтруктура.Вставить("ДанныеВВ", 			ДанныеВВ);
		
		МассивПараметров = Новый Массив;
		
		МассивПараметров.Добавить("WildBerriesСтатьяЗадолженности");
		
		Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивПараметров);
		
		СтатьяЗадолженности = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
		
		Если Настройки <> Неопределено Тогда
			
			Если Настройки["WildBerriesСтатьяЗадолженности"] <> Неопределено Тогда
				СтатьяЗадолженности = Настройки["WildBerriesСтатьяЗадолженности"];       
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаголовокСтруктура.Вставить("СтатьяЗадолженности",	СтатьяЗадолженности);
		
		СтруктураДанных = Новый Структура;
	
		СтруктураДанных.Вставить("СтатьяЗадолженности",						СтатьяЗадолженности);
		СтруктураДанных.Вставить("ТаблицаПродаж",							ДанныеДляДокумента);
		СтруктураДанных.Вставить("РассчитатьКомиссионноеВознаграждение",	Ложь);
		СтруктураДанных.Вставить("ВариантСозданияОтчета", 					Ложь);
		СтруктураДанных.Вставить("ВариантФормированияЦеныВозврата", 		ВариантФормированияЦеныВозврата); 	
		СтруктураДанных.Вставить("ВидЦеныВозврата", 						Справочники.ВидыЦен.ПустаяСсылка());
		СтруктураДанных.Вставить("НомерОтчета", 							НомерРФ);
		СтруктураДанных.Вставить("Профиль", 								Профиль);
		СтруктураДанных.Вставить("Партнер", 								Профиль.Партнер);
		СтруктураДанных.Вставить("Контрагент", 								Профиль.Контрагент);
		СтруктураДанных.Вставить("Организация", 							Профиль.Организация); 
		СтруктураДанных.Вставить("Соглашение", 								Профиль.Соглашение);
		СтруктураДанных.Вставить("Договор", 								Профиль.Договор);
		СтруктураДанных.Вставить("Подразделение", 							Профиль.Подразделение);
		СтруктураДанных.Вставить("ДатаНачала", 								Период.ДатаНачала);
		СтруктураДанных.Вставить("ДатаОкончания", 							Период.ДатаОкончания);
		СтруктураДанных.Вставить("ДатаВходящегоДокумента", 					Период.ДатаНачала);
		СтруктураДанных.Вставить("НомерВходящегоДокумента", 				НомерРФ);
		СтруктураДанных.Вставить("Комментарий", 							Комментарий);
		
		//Создание документа отчет комиссионера о продажах		
		ОтчетКомиссионера = ИС_WB_СерверУТ11_5.СоздатьДокументОтчетКомиссионераNew(СтруктураДанных);
		ДобавитьДокументВРезультирующуюТЧ(ОтчетКомиссионера.Ссылка);
			
		//Создание документа корректировки задолженности по браку
		Взаимозачет = Неопределено;
		
		Если ДанныеОК.Брак > 0 Тогда
			Взаимозачет = ИС_WB_СерверУТ11_5.ПолучитьДокументКорректировкиЗадолженности(ЗаголовокСтруктура, ОтчетКомиссионера.Ссылка, ДанныеОК.Брак);
			ДобавитьДокументВРезультирующуюТЧ(Взаимозачет.Ссылка);
		КонецЕсли;      
		
		ОбщегоНазначения.СообщитьПользователю("Документы созданы. Перейдите, пожалуйста, на вкладку Созданные документы.");
	
	Исключение
	 	ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;	
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987

//+ ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987
&НаСервере
Функция ПодобратьПоАртикулуApiНаСервере(СписокТранзакций)
	
	ТЗРезультирующая = Новый ТаблицаЗначений;
	
	ТЗРезультирующая.Колонки.Добавить("Артикул", 			Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ТЗРезультирующая.Колонки.Добавить("РазмерПоставщика", 	Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
		
	ТаблицаСопоставления = СписокТранзакций;  
		
	Для Каждого Строка Из ТаблицаСопоставления Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			НоваяСтрока = ТЗРезультирующая.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ТЗРезультирующая.Свернуть("Артикул, РазмерПоставщика");
	
	Если ТЗРезультирующая.Количество() = 0 Тогда		
		Возврат ТаблицаСопоставления;		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ДанныеТЗ.Артикул КАК Артикул,
	|	ДанныеТЗ.РазмерПоставщика КАК Размер
	|ПОМЕСТИТЬ ВТ_ДанныеТЗ
	|ИЗ
	|	&ТЗРезультирующая КАК ДанныеТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_Номенклатура.Ссылка КАК Ссылка,
	|	ВТ_ДанныеТЗ.Артикул КАК Артикул,
	|	ВТ_ДанныеТЗ.Размер КАК Размер
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.ИС_WB_Номенклатура КАК ИС_WB_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеТЗ КАК ВТ_ДанныеТЗ
	|		ПО ИС_WB_Номенклатура.vendorCode = ВТ_ДанныеТЗ.Артикул
	|ГДЕ
	|	ИС_WB_Номенклатура.Профиль = &Профиль
	|	И НЕ ВТ_ДанныеТЗ.Размер ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Ссылка КАК НоменклатураWB,
	|	ВТ_Номенклатура.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(ИС_WB_РазмерыНоменклатур.techSize) > 1
	|			ТОГДА ВТ_Номенклатура.Размер
	|		ИНАЧЕ ИС_WB_РазмерыНоменклатур.techSize
	|	КОНЕЦ КАК Размер
	|ПОМЕСТИТЬ ВТ_РазмерНоменклатуры
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|		ПО (ИС_WB_РазмерыНоменклатур.Владелец = ВТ_Номенклатура.Ссылка)
	|			И (ИС_WB_РазмерыНоменклатур.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Номенклатура.Ссылка,
	|	ИС_WB_РазмерыНоменклатур.techSize,
	|	ВТ_Номенклатура.Размер,
	|	ВТ_Номенклатура.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ВТ_РазмерНоменклатуры.Артикул КАК Артикул, 
	|	ВТ_РазмерНоменклатуры.Размер КАК Размер,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоНабор,
	|	ИС_WB_СоответствиеРазмеров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель
	|	КОНЕЦ КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВТ_Результирующая
	|ИЗ
	|	ВТ_РазмерНоменклатуры КАК ВТ_РазмерНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|		ПО ВТ_РазмерНоменклатуры.НоменклатураWB = ИС_WB_РазмерыНоменклатур.Владелец
	|			И ВТ_РазмерНоменклатуры.Размер = ИС_WB_РазмерыНоменклатур.techSize
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_РазмерыНоменклатур.Ссылка = ИС_WB_СоответствиеРазмеров.РазмерWB)
	|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
	|ГДЕ
	|	ИС_WB_РазмерыНоменклатур.Профиль = &Профиль
	|	И НЕ ИС_WB_РазмерыНоменклатур.ПометкаУдаления
	|	И НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результирующая.Номенклатура КАК Номенклатура,
	|	ВТ_Результирующая.Характеристика КАК Характеристика, 
	|	ВТ_Результирующая.Артикул КАК АртикулПоставщика,   
	|	ВТ_Результирующая.Размер КАК Размер,
	|	ВТ_Результирующая.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Результирующая.Упаковка КАК Упаковка,
	|	ВТ_Результирующая.КоэффициентУпаковки КАК КоэффициентУпаковки
	|ИЗ
	|	ВТ_Результирующая КАК ВТ_Результирующая";
	
	Запрос.УстановитьПараметр("Профиль", 			Профиль);
	Запрос.УстановитьПараметр("ТЗРезультирующая", 	ТЗРезультирующая);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = ТаблицаСопоставления.НайтиСтроки(Новый Структура("Артикул", Выборка.АртикулПоставщика));
		
		Для Каждого Элемент Из НайденныеСтроки Цикл
			
			Если Не ЗначениеЗаполнено(Элемент.Номенклатура) Тогда
				
				ЗаполнитьЗначенияСвойств(Элемент, Выборка, "Номенклатура,Характеристика,Упаковка,КоэффициентУпаковки,ЭтоНабор,Размер");   
					
				Элемент.КоэффициентУпаковки = Выборка.КоэффициентУпаковки; 
					
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	СписокТранзакций.Сортировать("Номенклатура");
	
	Возврат СписокТранзакций;
		
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987

//+ ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987
&НаСерверебезКонтекста
Функция ПолучитьТаблицуЗначенийДанныхПродаж(Номер, Таблица)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Номер", Номер);
	
	ДанныеТЗ = Таблица.Скопировать(Отбор);
	
	Возврат ДанныеТЗ;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987

//+ ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987
&НаСервере
Процедура ДобавитьДокументВРезультирующуюТЧ(ДокументСсылка)
	СформированныеДокументы.Добавить().Документ = ДокументСсылка;	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987

#КонецОбласти
