
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 20.01.2023 УА #5252
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстанавливатьОтбор = Истина;
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		УстанавливатьОтбор = Ложь;
	Иначе
		ИС_MP_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

//+ ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524
&НаКлиенте
Процедура ПриОткрытии(Отказ)	

	Если УстанавливатьОтбор Тогда
		УстрановитьОтборПоПрофилю();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

//+ ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	УстрановитьОтборПоПрофилю();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ТекДанные = Элемент.ТекущиеДанные; 
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ОткрытьНаAli Тогда
		СтандартнаяОбработка = Ложь;
		ПерейтиПоНавигационнойСсылке("https://aliexpress.ru/item/" + ТекДанные.Код + ".html");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524
&НаСервере
Процедура УстрановитьОтборПоПрофилю()	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Профиль", Профиль);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

#КонецОбласти
