#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьЗначения(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли;

	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;

	//ДлительнаяОперация 	= ЗагрузитьЗначенияНаСервере(ТекущаяСтрока.Ссылка);
	//ПараметрыОжидания 	= БСП_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	//ПараметрыОжидания.ТекстСообщения = СтрШаблон("Выполняется загрузка значения для характеристики ""%1"".",
	//	ТекущаяСтрока.Ссылка);
	//ПараметрыОжидания.ВыводитьСообщения = Истина;

	//БСП_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, , ПараметрыОжидания);    
	
	ДлительнаяОперация = ЗагрузитьЗначенияНаСервере(ТекущаяСтрока.Ссылка); 
		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, , ПараметрыОжидания());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗагрузитьЗначенияНаСервере(Характеристика)

	Возврат ДлительныеОперации.ВыполнитьПроцедуру( ,
		"ИС_Ozon_Сервер.ЗагрузитьЗначенияХарактеристик", Профиль, Характеристика);

КонецФункции 

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
&НаКлиенте
Функция ПараметрыОжидания()
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = "Идет процесс загрузки...";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Интервал = 5;
	ПараметрыОжидания.ПолучатьРезультат = Истина;     
	
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	//ПараметрыОжидания.ОповещениеПользователя.НавигационнаяСсылка = "e1cib/app/Обработка.ИС_Ozon_ВыгрузкаКарточек";
	
	Возврат ПараметрыОжидания;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983 

#КонецОбласти