  
#Область ОписаниеПеременных

//+ ИнфоСофт Мурсалимов Д.Р. 14.04.24 УА #66901
&НаКлиенте
Перем ПоследняяСтраница; //- ИнфоСофт Мурсалимов Д.Р. 14.04.24 УА #66901

#КонецОбласти  
  
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Мурсалимов Д.Р. 14.04.24 УА #66901
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	ИС_MP_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	Маркетплейс = "WildBerries";
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 14.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 14.04.24 УА #66901
&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	
	#Если ВебКлиент Тогда                         
		ПодключитьРасширениеДляРаботыСФайлами(Истина);
	#КонецЕсли
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["Страница" + Маркетплейс];
	ПоследняяСтраница = Элементы["Страница" + Маркетплейс];		
	УправлениеФормой();
	ЗаполнитьШапку();
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 14.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 27.04.24 УА #66901
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		Возврат;	
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 14.01.25 УА #90120
	//ОпределитьИнтегрируемыеМаркетплейсы();
	//- ИнфоСофт Власова И.С. 14.01.25 УА #90120
	
	ПолучитьИЗаполнитьФункциональныеОпцииЦен(Профиль);
	ОбновитьСписокНаСервере();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 27.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 27.04.24 УА #66901
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда

		Отказ = Истина;

		Если ЗавершениеРаботы Тогда
			ТекстПредупреждения = НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'");
			Возврат;
		КонецЕсли;		
		
		Оповещение = Новый ОписаниеОповещения("НесохраненныеИзмененияЗавершение", 
			ЭтотОбъект, Новый Структура("Закрытие", Истина));
		
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
			НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'"), 
			РежимДиалогаВопрос.ДаНет);
	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 27.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 16.04.24 УА #66901
&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОчиститьСообщения();
	
	Если Модифицированность Тогда
	
		Оповещение = Новый ОписаниеОповещения("НесохраненныеИзмененияЗавершение", ЭтотОбъект);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
			НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'"), 
			РежимДиалогаВопрос.ДаНет);
		Возврат;
	
	КонецЕсли;
	
	Элементы.ВыгрузитьЦены.Доступность = Ложь;
	
	Маркетплейс = СтрЗаменить(ТекущаяСтраница.Имя, "Страница", "");
	ПоследняяСтраница = Элементы["Страница" + Маркетплейс];

	УстановитьВидимостьПолученияЦен();
	ЗаполнитьШапку();
	
	Если ЗначениеЗаполнено(Профиль) Тогда
		
		ОбновитьСписокНаСервере();
			
		Если ЭтотОбъект[Маркетплейс + "ОтображатьТекущиеЦены"] 
			И ЭтотОбъект[Маркетплейс + "ПолучатьТекущиеЦеныАвтоматически"] Тогда
			
			НачатьПолучениеТекущихЦен();
		
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 16.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	//ОпределитьИнтегрируемыеМаркетплейсы();
	//ГруппаСтраницыПриСменеСтраницы(Элементы.ГруппаСтраницы, Элементы.ГруппаСтраницы.ТекущаяСтраница);
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
	Если ЗначениеЗаполнено(Профиль) Тогда
	
		ПолучитьИЗаполнитьФункциональныеОпцииЦен(Профиль);
		ЗаполнитьШапку();
		
		ВидыЦен = ПолучитьМассивВидовЦен(Маркетплейс);
		
		Если ВидыЦен.Количество() > 0 Тогда
			ОбновитьСписокНаСервере();
			УстановитьВидимостьПолученияЦен();
			Возврат;
		КонецЕсли;
				
	КонецЕсли;
	
	ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Очистить();
	Элементы.ВыгрузитьЦены.Доступность = Ложь;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура ПутьКФайлуРучныхЦенПриИзменении(Элемент)
	
	ОчиститьСообщения();
		
	Если Не ЗначениеЗаполнено(ПутьКФайлуРучныхЦен) Тогда
		АдресРучныхЦенВоВременномХранилище = "";
		Элементы.ЗагрузитьРучныеЦены.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(
		"Путь к файлу был изменен, чтобы выбрать другой файл воспользуйтесь кнопкой выбора");
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 10.07.24 УА #66901
&НаКлиенте
Процедура ОтображатьТекущиеЦеныПриИзменении(Элемент)
    УстановитьВидимостьПолученияЦен();	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 10.07.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 07.08.24 УА #66901
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Для Каждого Строка Из ТаблицаФоновыхЗаданий Цикл
		ОтменитьФоновыеЗаданияНаСервере(Строка.ИдентификаторЗадания);	
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 07.08.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура ПутьКФайлуРучныхЦенНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОчиститьСообщения(); 
	  
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл ручных цен";
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.Фильтр = "Excel файлы(*.xlsx)|*.xlsx";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПутьКФайлуРучныхЦенНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры); 
	
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура ПутьКФайлуРучныхЦенОчистка(Элемент, СтандартнаяОбработка)
	АдресРучныхЦенВоВременномХранилище = "";
	Элементы.ЗагрузитьРучныеЦены.Доступность = Ложь;
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыВыгрузки

//+ ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901
&НаКлиенте
Процедура ТаблицаВыгрузкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ТолькоПросмотр Тогда
		ПоказатьЗначение( , Элемент.ТекущиеДанные[СтрЗаменить(Поле.Имя, Маркетплейс + "ТаблицаВыгрузки", "")]);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901
&НаКлиенте
Процедура ТаблицаВыгрузкиРучнаяЦенаПриИзменении(Элемент)
	
	ТекДанные = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.РучнаяЦенаИзменена = Истина;
	Модифицированность = Истина;
	Элементы.СохранитьИзменения.Видимость = Истина;
	
	ПересчитатьБудетВыгружено(Маркетплейс, ТекДанные);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901
&НаКлиенте
Процедура ТаблицаВыгрузкиРучнаяСкидкаПриИзменении(Элемент)
	
	ТекДанные = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.РучнаяСкидкаИзменена = Истина;
	Модифицированность = Истина;
	Элементы.СохранитьИзменения.Видимость = Истина;
	
	ПересчитатьБудетВыгружено(Маркетплейс, ТекДанные);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901
&НаКлиенте
Процедура ТаблицаВыгрузкиРучнаяЦенаМинимальнаяПриИзменении(Элемент)
	
	ТекДанные = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.РучнаяЦенаМинимальнаяИзменена = Истина;
	Модифицированность = Истина;
	Элементы.СохранитьИзменения.Видимость = Истина;
	
	ПересчитатьБудетВыгружено(Маркетплейс, ТекДанные);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901
&НаКлиенте
Процедура УдалитьРучнуюЦену(Команда)
	
	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПолеСопоставление = ИС_МП_Клиент.ПолеСопоставленияОстатков(КонвертироватьМаркетплейс(Маркетплейс));
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл

		ОбрабатываемаяСтрока = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка);
		
		УдалитьРучнуюЦенуНаСервере(Профиль, Маркетплейс, ОбрабатываемаяСтрока[ПолеСопоставление]);
		
		ОбрабатываемаяСтрока.ЕстьРучнаяЦена = Ложь;
		ОбрабатываемаяСтрока.РучнаяЦенаИзменена = Ложь;
		ОбрабатываемаяСтрока.РучнаяЦена = 0; 
		
		ПересчитатьБудетВыгружено(Маркетплейс, ОбрабатываемаяСтрока);

	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901
&НаКлиенте
Процедура УдалитьРучнуюЦенуМинимальную(Команда)
	
	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПолеСопоставление = ИС_МП_Клиент.ПолеСопоставленияОстатков(КонвертироватьМаркетплейс(Маркетплейс));
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл

		ОбрабатываемаяСтрока = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка);
		
		УдалитьРучнуюЦенуМинимальнуюНаСервере(Профиль, Маркетплейс, ОбрабатываемаяСтрока[ПолеСопоставление]);
		
		ОбрабатываемаяСтрока.ЕстьРучнаяЦенаМинимальная = Ложь;
		ОбрабатываемаяСтрока.РучнаяЦенаМинимальнаяИзменена = Ложь;
		ОбрабатываемаяСтрока.РучнаяЦенаМинимальная = 0;
		
		ПересчитатьБудетВыгружено(Маркетплейс, ОбрабатываемаяСтрока);

	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901
&НаКлиенте
Процедура УдалитьРучнуюСкидку(Команда)
	
	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПолеСопоставление = ИС_МП_Клиент.ПолеСопоставленияОстатков(КонвертироватьМаркетплейс(Маркетплейс));
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл

		ОбрабатываемаяСтрока = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка);
		
		УдалитьРучнуюСкидкуНаСервере(Профиль, Маркетплейс, ОбрабатываемаяСтрока[ПолеСопоставление]);
				
		ОбрабатываемаяСтрока.ЕстьРучнаяСкидка = Ложь;
		ОбрабатываемаяСтрока.РучнаяСкидкаИзменена = Ложь;
		ОбрабатываемаяСтрока.РучнаяСкидка = 0;
		
		ПересчитатьБудетВыгружено(Маркетплейс, ОбрабатываемаяСтрока);

	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура ОтменитьВводРучнойЦены(Команда)

	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ОбрабатываемаяСтрока = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка);
		ОбрабатываемаяСтрока.РучнаяЦенаИзменена = Ложь;
		ОбрабатываемаяСтрока.РучнаяЦена = ОбрабатываемаяСтрока.КэшРучнаяЦена;
		ПересчитатьБудетВыгружено(Маркетплейс, ОбрабатываемаяСтрока);
	КонецЦикла;	

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура ОтменитьВводРучнойЦеныМинимальной(Команда)

	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ОбрабатываемаяСтрока = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка);
		ОбрабатываемаяСтрока.РучнаяЦенаМинимальнаяИзменена = Ложь;
		ОбрабатываемаяСтрока.РучнаяЦенаМинимальная = ОбрабатываемаяСтрока.КэшРучнаяЦенаМинимальная;
		ПересчитатьБудетВыгружено(Маркетплейс, ОбрабатываемаяСтрока);
	КонецЦикла;	

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура ОтменитьВводСкидки(Команда)
	
	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ОбрабатываемаяСтрока = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка);
		ОбрабатываемаяСтрока.РучнаяСкидкаИзменена = Ложь;
		ОбрабатываемаяСтрока.РучнаяСкидка = ОбрабатываемаяСтрока.КэшРучнаяСкидка;
		ПересчитатьБудетВыгружено(Маркетплейс, ОбрабатываемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901
&НаКлиенте
Процедура ТаблицаВыгрузкиРучнаяЦенаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    
	ТекДанные = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.РучнаяЦенаИзменена = Ложь;
	ТекДанные.РучнаяЦена = ТекДанные.КэшРучнаяЦена;
	
	ПересчитатьБудетВыгружено(Маркетплейс, ТекДанные);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901
&НаКлиенте
Процедура ТаблицаВыгрузкиРучнаяСкидкаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    
	ТекДанные = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.РучнаяСкидкаИзменена = Истина;
	ТекДанные.РучнаяСкидка = ТекДанные.КэшРучнаяСкидка;
	
	ПересчитатьБудетВыгружено(Маркетплейс, ТекДанные);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901
&НаКлиенте
Процедура ТаблицаВыгрузкиРучнаяЦенаМинимальнаяОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    
	ТекДанные = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.РучнаяЦенаМинимальнаяИзменена = Истина;
	ТекДанные.РучнаяЦенаМинимальная = ТекДанные.КэшРучнаяЦенаМинимальная;
	
	ПересчитатьБудетВыгружено(Маркетплейс, ТекДанные);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 02.05.24 УА #66901
&НаКлиенте
Процедура ИспользоватьПоследниеЦеныПриИзменении(Элемент)
    УстановитьВидимостьПолученияЦен();	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 02.05.24 УА #66901

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Мурсалимов Д.Р. 16.04.24 УА #66901
&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Оповещение = Новый ОписаниеОповещения("НесохраненныеИзмененияЗавершение", ЭтотОбъект);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
			НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'"), 
			РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ОбновитьСписокНаСервере();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 16.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901
&НаКлиенте
Процедура ПолучитьТекущиеЦены(Команда)

	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
		
	Если ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
    НачатьПолучениеТекущихЦен();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901
&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	СохранитьИзмененияНаСервере();
	Модифицированность = Ложь;
	Элементы.СохранитьИзменения.Видимость = Ложь; 
	ОбновитьСписокНаСервере();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 07.05.24 УА #66901
&НаКлиенте
Процедура ЗаполнитьПоВыделенным(Команда)

	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ТекПоле = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ТекущийЭлемент;
	
	Если ТекПоле = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Маркетплейс = "Ozon" Тогда
		
		Если ТекПоле = Элементы[Маркетплейс + "ТаблицаВыгрузкиРучнаяЦена"] Тогда
			Параметр = "РучнаяЦена";
		ИначеЕсли ТекПоле = Элементы[Маркетплейс + "ТаблицаВыгрузкиРучнаяСкидка"]	Тогда
			Параметр = "РучнаяСкидка";
		ИначеЕсли ТекПоле = Элементы[Маркетплейс + "ТаблицаВыгрузкиРучнаяЦенаМинимальная"]	Тогда
			Параметр = "РучнаяЦенаМинимальная";
		Иначе
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Маркетплейс = "Сбер" Тогда
		
		Если ТекПоле = Элементы[Маркетплейс + "ТаблицаВыгрузкиРучнаяЦена"] Тогда
			Параметр = "РучнаяЦена";
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		
		Если ТекПоле = Элементы[Маркетплейс + "ТаблицаВыгрузкиРучнаяЦена"] Тогда
			Параметр = "РучнаяЦена";
		ИначеЕсли ТекПоле = Элементы[Маркетплейс + "ТаблицаВыгрузкиРучнаяСкидка"]	Тогда
			Параметр = "РучнаяСкидка";
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	    
    ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоВыделеннымЗавершение", ЭтотОбъект, Параметр);
	ПоказатьВводЧисла(ОписаниеОповещения, 0, "Заполнение ручных цен", 10, 0);	

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 07.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901
&НаКлиенте
Процедура ОтметитьВсе(Команда)

	Для Каждого Строка Из ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"] Цикл
		Строка.Выгружать = Истина;
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901
&НаКлиенте
Процедура ОтметитьВыделенные(Команда)

	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка).Выгружать = Истина;
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901

//+ ИнфоСофт ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901
&НаКлиенте
Процедура СнятьВыделенные(Команда)

	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка).Выгружать = Ложь;
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901

//+ ИнфоСофт ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901
&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого Строка Из ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"] Цикл
		Строка.Выгружать = Ложь;
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура ЗагрузитьРучныеЦены(Команда) 
	
	ОчиститьСообщения();
	
	Если ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресРучныхЦенВоВременномХранилище) Тогда

		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Не выбран файл для загрузки ручных цен", , , "ПутьКФайлуРучныхЦен");

		Возврат;

	КонецЕсли;
	
	ЗагрузитьРучныеЦеныНаСервере();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура ВыгрузитьЦены(Команда)
	
	ОчиститьСообщения();
   
	Если ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Оповещение = Новый ОписаниеОповещения("ВыгрузитьЦеныЗавершение", ЭтотОбъект);
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
		"Уверены что хотите произвести выгрузку цен маркетплейса " + Маркетплейс + "?", 
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте 
Процедура ПодключитьРасширениеДляРаботыСФайлами(УстановитьЕслиНеПодключено) Экспорт

	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПодключитьРасширениеДляРаботыСФайламиЗавершение", ЭтотОбъект, УстановитьЕслиНеПодключено); 

	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура ПодключитьРасширениеДляРаботыСФайламиЗавершение(Подключено, УстановитьЕслиНеПодключено) Экспорт
	
	Если Подключено Тогда
		Возврат;
	ИначеЕсли УстановитьЕслиНеПодключено Тогда  	
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьРасширениеДляРаботыСФайлами", ЭтотОбъект, Ложь);     
		НачатьУстановкуРасширенияРаботыСФайлами(ОписаниеОповещения);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось подключить расширение для работы с файлами...");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901
&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	МассивМаркетплейсов = Новый Массив; 
	МассивМаркетплейсов.Добавить("WildBerries");
	МассивМаркетплейсов.Добавить("Ozon");
	МассивМаркетплейсов.Добавить("Яндекс");
	МассивМаркетплейсов.Добавить("Сбер");
	МассивМаркетплейсов.Добавить("Aliexpress");
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	МассивМаркетплейсов.Добавить("Ламода");
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
	ТипЭлементОтбораКомпоновкиДанных = Тип("ЭлементОтбораКомпоновкиДанных");
	ОформлениеЦветТекста = "ЦветТекста";
	ОформлениеФормат = "Формат";
	ФорматНуля = "ЧН=0";
	
	Для Каждого Маркетплейс Из МассивМаркетплейсов Цикл
	    
	    // Отсутствует сопоставление
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьСопоставление");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Ложь;

		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, ЦветаСтиля.ЦветОсобогоТекста);

		// Есть ручная цена
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиРучнаяЦена");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьРучнаяЦена");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;

		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, ЦветаСтиля.ЦветАкцента);
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		// Есть ручная скидка
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиРучнаяСкидка");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьРучнаяСкидка");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;

		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, ЦветаСтиля.ЦветАкцента); 
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		// Есть ручная цена минимальная
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиРучнаяЦенаМинимальная");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьРучнаяЦенаМинимальная");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;

		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, ЦветаСтиля.ЦветАкцента);
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		// Выгружать
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиБудетВыгруженаЦена");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.Выгружать");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиБудетВыгруженаСкидка");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.Выгружать");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина; 
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиБудетВыгруженаЦенаСоСкидкой");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.Выгружать");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;                              
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиБудетВыгруженаЦенаМинимальная");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.Выгружать");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;   
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		             		
		// Ручной цена изменение
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиРучнаяЦена");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.РучнаяЦенаИзменена");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
        
        Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, WebЦвета.СинеСерый);        
        Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ИС_MP_ШрифтПолужирный);		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		// Ручная скидка изменение
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиРучнаяСкидка");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.РучнаяСкидкаИзменена");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
        
        Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, WebЦвета.СинеСерый);        
        Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ИС_MP_ШрифтПолужирный);
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		// Ручной цена минимальная изменение
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиРучнаяЦенаМинимальная");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.РучнаяЦенаМинимальнаяИзменена");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
        
        Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, WebЦвета.СинеСерый);        
        Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ИС_MP_ШрифтПолужирный);
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
        
        // Есть последняя выгруженная
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиПоследняяВыгруженнаяЦена");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
			Маркетплейс + "ТаблицаВыгрузки.ЕстьПоследняяВыгруженнаяЦена");
		
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;     
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиПоследняяВыгруженнаяСкидка");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
			Маркетплейс + "ТаблицаВыгрузки.ЕстьПоследняяВыгруженнаяСкидка");
		
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;  
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиПоследняяВыгруженнаяЦенаСоСкидкой");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
			Маркетплейс + "ТаблицаВыгрузки.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой");
		
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина; 
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
	    // Есть цена маркетплейса
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиЦенаНаМаркетплейсе");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьЦенаНаМаркетплейсе");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;  
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиСкидкаНаМаркетплейсе");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьСкидкаНаМаркетплейсе");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиЦенаСоСкидкойНаМаркетплейсе");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьЦенаСоСкидкойНаМаркетплейсе");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиЦенаМинимальнаяНаМаркетплейсе");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьЦенаМинимальнаяНаМаркетплейсе");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;    
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		//+ ИнфоСофт Заварин К.В. 07.04.25 УА #89329
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиЦенаДляПокупателя");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьЦенаДляПокупателя");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;    
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиЦенаВаша");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьЦенаВаша");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;    
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		//- ИнфоСофт Заварин К.В. 07.04.25 УА #89329
		
	КонецЦикла;
			
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901
&НаКлиенте
Процедура УправлениеФормой()
    
    Элементы.СохранитьИзменения.Видимость = Ложь;
	
	УстановитьВидимостьПолученияЦен();
	
	Если ЭтотОбъект[Маркетплейс + "ОтображатьТекущиеЦены"] 
		И ЭтотОбъект[Маркетплейс + "ПолучатьТекущиеЦеныАвтоматически"] Тогда
	    
	    Если ЗначениеЗаполнено(Профиль) Тогда
			НачатьПолучениеТекущихЦен();
		КонецЕсли;
	
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901
&НаКлиенте
Процедура ЗаполнитьШапку()
	
	РежимОкругленияЦен 				= ЭтотОбъект[Маркетплейс + "РежимОкругленияЦен"];
		
	ОтображениеРежимОкругленияЦен 	= ?(РежимОкругленияЦен = 0, "Округлять 1.5 как 1", "Округлять 1.5 как 2");
	
	Элементы.ОтображениеВидЦены.Видимость 						= Ложь;
	Элементы.ОтображениеВидЦены.ЦветТекста 						= WebЦвета.Зеленый;
	Элементы.ОтображениеВидЦеныСоСкидкой.Видимость 				= Ложь;
	Элементы.ОтображениеВидЦеныСоСкидкой.ЦветТекста 			= WebЦвета.Зеленый;
	Элементы.ОтображениеВидЦеныМинимальный.Видимость 			= Ложь;
	Элементы.ОтображениеВидЦеныМинимальный.ЦветТекста 			= WebЦвета.Зеленый;
	
	ВидыЦен = ПолучитьМассивВидовЦен(Маркетплейс);
		
	Если ВидыЦен.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из ВидыЦен Цикл
		
		ВидЦены 												= ЭтотОбъект[Маркетплейс + Элемент.Ключ];
		
		Если ЗначениеЗаполнено(ВидЦены) Тогда	
			ЭтотОбъект["Отображение" + Элемент.Ключ] 			= ВидЦены;	
		Иначе			
			ЭтотОбъект["Отображение" + Элемент.Ключ] 			= Элементы["Отображение" + Элемент.Ключ].Заголовок + " не заполнен";	
			Элементы["Отображение" + Элемент.Ключ].ЦветТекста 	= WebЦвета.Красный;	
		КонецЕсли;
		
		Элементы["Отображение" + Элемент.Ключ].Видимость 		= Истина;	
		
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901 

//+ ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901
&НаКлиенте
Процедура УстановитьВидимостьПолученияЦен()
	
	ВидимостьПоследнихЦен = ЭтотОбъект[Маркетплейс + "ИспользоватьПоследниеЦены"];
	
	Элементы[Маркетплейс + "ТаблицаВыгрузкиПоследняяВыгруженнаяЦена"].Видимость 			= ВидимостьПоследнихЦен;
	Элементы[Маркетплейс + "ТаблицаВыгрузкиПоследняяВыгруженнаяЦенаСоСкидкой"].Видимость 	= ВидимостьПоследнихЦен;
	
	Видимость = ЭтотОбъект[Маркетплейс + "ОтображатьТекущиеЦены"];
	
	Если Маркетплейс = "WildBerries" Тогда
	
		Элементы[Маркетплейс + "ПолучатьТекущиеЦеныАвтоматически"].Видимость 				= Видимость;
		Элементы[Маркетплейс + "ПолучитьТекущиеЦены"].Видимость 							= Видимость;
		Элементы[Маркетплейс + "ТаблицаВыгрузкиЦенаНаМаркетплейсе"].Видимость 				= Видимость;
		Элементы[Маркетплейс + "ТаблицаВыгрузкиСкидкаНаМаркетплейсе"].Видимость 			= Видимость;
		Элементы[Маркетплейс + "ТаблицаВыгрузкиЦенаСоСкидкойНаМаркетплейсе"].Видимость 		= Видимость;
		
	ИначеЕсли Маркетплейс = "Ozon" Тогда
	
		Элементы[Маркетплейс + "ПолучатьТекущиеЦеныАвтоматически"].Видимость 				= Видимость;
		Элементы[Маркетплейс + "ПолучитьТекущиеЦены"].Видимость 							= Видимость;
		Элементы[Маркетплейс + "ТаблицаВыгрузкиЦенаНаМаркетплейсе"].Видимость 				= Видимость;
		Элементы[Маркетплейс + "ТаблицаВыгрузкиЦенаСоСкидкойНаМаркетплейсе"].Видимость 		= Видимость;
		Элементы[Маркетплейс + "ТаблицаВыгрузкиЦенаМинимальнаяНаМаркетплейсе"].Видимость 	= Видимость;
		//+ ИнфоСофт Заварин К.В. 07.04.25 УА #89329
		Элементы[Маркетплейс + "ТаблицаВыгрузкиТоварУчаствуетВАкции"].Видимость 			= Видимость;
		Элементы[Маркетплейс + "ТаблицаВыгрузкиЦенаДляПокупателя"].Видимость 				= Видимость;
		Элементы[Маркетплейс + "ТаблицаВыгрузкиЦенаВаша"].Видимость 						= Видимость;
		//- ИнфоСофт Заварин К.В. 07.04.25 УА #89329
				
	Иначе
	
		Элементы[Маркетплейс + "ПолучатьТекущиеЦеныАвтоматически"].Видимость 				= Видимость;
		Элементы[Маркетплейс + "ПолучитьТекущиеЦены"].Видимость 							= Видимость;
		Элементы[Маркетплейс + "ТаблицаВыгрузкиЦенаНаМаркетплейсе"].Видимость 				= Видимость;
		Элементы[Маркетплейс + "ТаблицаВыгрузкиЦенаСоСкидкойНаМаркетплейсе"].Видимость 		= Видимость;
		                                                                                
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901
// 
// Возвращаемое значение:
//  Структура - Возвращает параметры ожидания для длительных операций
//
&НаКлиенте
Функция ПараметрыОжидания()

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.НавигационнаяСсылка = 
		"e1cib/command/Обработка.ИС_МП_УправлениеЦенами.Команда.ОткрытьФормуПанельНавигации";
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	Возврат ПараметрыОжидания;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901
&НаКлиенте
Процедура НачатьПолучениеТекущихЦен()
	
	НайденныеСтроки = ТаблицаФоновыхЗаданий.НайтиСтроки(Новый Структура("Маркетплейс", Маркетплейс));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = НачатьПолучениеЦенНаСервере();
	
	Если ДлительнаяОперация.Свойство("ИдентификаторЗадания") 
		И ЗначениеЗаполнено(ДлительнаяОперация.ИдентификаторЗадания) Тогда
		
		НоваяСтрока = ТаблицаФоновыхЗаданий.Добавить();
		НоваяСтрока.ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
		НоваяСтрока.Маркетплейс = Маркетплейс;
		
		ДопПараметры = ДлительнаяОперация.ИдентификаторЗадания;
		
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучениеЦенЗавершение", ЭтотОбъект, ДопПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
	
	Элементы[Маркетплейс + "КартинкаОжидание"].Видимость = Истина;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901
// 
// Возвращаемое значение:
//  Структура - Возвращает структуру сформированную в результате запуска фонового задания
//
&НаСервере   
Функция НачатьПолучениеЦенНаСервере()
    
    ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[КонвертироватьМаркетплейс(Маркетплейс)];
    
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		"ИС_МП_УправлениеЦенами.ПолучитьЦеныFBS", ПеречислениеМП, Профиль);

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901
&НаКлиенте
Процедура ПолучениеЦенЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	МП = Маркетплейс;
   
    Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
    	
    	НайденныеСтроки = ТаблицаФоновыхЗаданий.НайтиСтроки(
    			Новый Структура("ИдентификаторЗадания", ДополнительныеПараметры));
    	
    	Если НайденныеСтроки.Количество() > 0 Тогда
    		МП = НайденныеСтроки[0].Маркетплейс;
    		ТаблицаФоновыхЗаданий.Удалить(НайденныеСтроки[0]);
    	КонецЕсли;	
    	
    КонецЕсли;
	
    Элементы[МП + "КартинкаОжидание"].Видимость = Ложь;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
    
	Если Результат.Статус = "Выполнено" Тогда
	    ОбработатьРезультатПолученияЦенНаСервере(Результат.АдресРезультата, МП);
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли;
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901
&НаСервере   
Процедура ОбработатьРезультатПолученияЦенНаСервере(Знач Адрес, Знач МП)
	
	Если МП = Неопределено Тогда
		МП = Маркетплейс;
	КонецЕсли;
	
	Цены = ПолучитьИзВременногоХранилища(Адрес);
	
    ПолеСопоставления = 
    	ИС_МП_УправлениеЦенами.ПолучитьПолеСопоставленияЦен(Перечисления.ИС_МП_Маркетплейсы[КонвертироватьМаркетплейс(МП)]);
    
    Таблица = ЭтотОбъект[МП + "ТаблицаВыгрузки"];	
	
	Если Цены = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если МП = "WildBerries" Тогда
		
		Для Каждого Строка Из Таблица Цикл
			
			Строка.ЦенаНаМаркетплейсе = 0;
			Строка.ЕстьЦенаНаМаркетплейсе = Ложь;
			
			Строка.СкидкаНаМаркетплейсе = 0;
			Строка.ЕстьСкидкаНаМаркетплейсе = Ложь;
			
			Строка.ЦенаСоСкидкойНаМаркетплейсе = 0;
			Строка.ЕстьЦенаСоСкидкойНаМаркетплейсе = Ложь;
			
		КонецЦикла;
		
		Для Каждого Строка Из Цены Цикл
			
			НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура(ПолеСопоставления, Строка[ПолеСопоставления]));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				НайденныеСтроки[0].ЦенаНаМаркетплейсе = Строка.Цена;
				НайденныеСтроки[0].ЕстьЦенаНаМаркетплейсе = ЗначениеЗаполнено(Строка.Цена);
				
				НайденныеСтроки[0].СкидкаНаМаркетплейсе = Строка.Скидка;
				НайденныеСтроки[0].ЕстьСкидкаНаМаркетплейсе = ЗначениеЗаполнено(Строка.Скидка);
				
				НайденныеСтроки[0].ЦенаСоСкидкойНаМаркетплейсе = Строка.ЦенаСоСкидкой;
				НайденныеСтроки[0].ЕстьЦенаСоСкидкойНаМаркетплейсе = ЗначениеЗаполнено(Строка.ЦенаСоСкидкой);
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли МП = "Ozon" Тогда
		
		Для Каждого Строка Из Таблица Цикл
			
			Строка.ЦенаНаМаркетплейсе = 0;
			Строка.ЕстьЦенаНаМаркетплейсе = Ложь;
			
			Строка.ЦенаСоСкидкойНаМаркетплейсе = 0;
			Строка.ЕстьЦенаСоСкидкойНаМаркетплейсе = Ложь;
			
			Строка.ЦенаМинимальнаяНаМаркетплейсе = 0;
			Строка.ЕстьЦенаМинимальнаяНаМаркетплейсе = Ложь;
			
			//+ ИнфоСофт Заварин К.В. 07.04.25 УА #89329
			Строка.ЦенаДляПокупателя = 0;
			Строка.ЕстьЦенаДляПокупателя = Ложь; 
			
			Строка.ЦенаВаша = 0;
			Строка.ЕстьЦенаВаша = Ложь;
			//- ИнфоСофт Заварин К.В. 07.04.25 УА #89329
			
		КонецЦикла;
		
		Для Каждого Строка Из Цены Цикл
			
			НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура(ПолеСопоставления, Строка[ПолеСопоставления]));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				НайденныеСтроки[0].ЦенаНаМаркетплейсе = Строка.Цена;
				НайденныеСтроки[0].ЕстьЦенаНаМаркетплейсе = ЗначениеЗаполнено(Строка.Цена);
				
				НайденныеСтроки[0].ЦенаСоСкидкойНаМаркетплейсе = Строка.ЦенаСоСкидкой;
				НайденныеСтроки[0].ЕстьЦенаСоСкидкойНаМаркетплейсе = ЗначениеЗаполнено(Строка.ЦенаСоСкидкой); 
				
				НайденныеСтроки[0].ЦенаМинимальнаяНаМаркетплейсе = Строка.ЦенаМинимальная;
				НайденныеСтроки[0].ЕстьЦенаМинимальнаяНаМаркетплейсе = ЗначениеЗаполнено(Строка.ЦенаМинимальная);
				
				//+ ИнфоСофт Заварин К.В. 07.04.25 УА #89329
				НайденныеСтроки[0].ЦенаДляПокупателя = Строка.ЦенаДляПокупателя;
				НайденныеСтроки[0].ЕстьЦенаДляПокупателя = ЗначениеЗаполнено(Строка.ЦенаДляПокупателя); 
				
				НайденныеСтроки[0].ЦенаВаша = Строка.ЦенаВаша;
				НайденныеСтроки[0].ЕстьЦенаВаша = ЗначениеЗаполнено(Строка.ЦенаВаша);
				
				НайденныеСтроки[0].ТоварУчаствуетВАкции = Строка.ТоварУчаствуетВАкции;
				//- ИнфоСофт Заварин К.В. 07.04.25 УА #89329
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Строка Из Таблица Цикл
			
			Строка.ЦенаНаМаркетплейсе = 0;
			Строка.ЕстьЦенаНаМаркетплейсе = Ложь;
			
			Строка.ЦенаСоСкидкойНаМаркетплейсе = 0;
			Строка.ЕстьЦенаСоСкидкойНаМаркетплейсе = Ложь;
			
		КонецЦикла;
		
		Для Каждого Строка Из Цены Цикл
			
			НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура(ПолеСопоставления, Строка[ПолеСопоставления]));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				НайденныеСтроки[0].ЦенаНаМаркетплейсе = Строка.Цена;
				НайденныеСтроки[0].ЕстьЦенаНаМаркетплейсе = ЗначениеЗаполнено(Строка.Цена);
								
				НайденныеСтроки[0].ЦенаСоСкидкойНаМаркетплейсе = Строка.ЦенаСоСкидкой;
				НайденныеСтроки[0].ЕстьЦенаСоСкидкойНаМаркетплейсе = ЗначениеЗаполнено(Строка.ЦенаСоСкидкой);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901
// Отказываемся от асинхронности т.к. это основной функционал формы
&НаСервере   
Процедура ОбновитьСписокНаСервере()
    
    ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[КонвертироватьМаркетплейс(Маркетплейс)];

	РежимОкругленияЦен = ЭтотОбъект[Маркетплейс + "РежимОкругленияЦен"];
	ИспользоватьПоследниеЦены = ЭтотОбъект[Маркетплейс + "ИспользоватьПоследниеЦены"];
	
	Таблица = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"];
	Таблица.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ИС_МП_УправлениеЦенами.ПолучитьТекстЗапросаЦен(ПеречислениеМП);
	
	ИС_МП_УправлениеЦенами.УстановитьПараметрыЗапросаЦен(ПеречислениеМП, Запрос, Профиль);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЦен = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЦен.Следующий() Цикл
		
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЦен);
		
		Если ВыборкаЦен.ЕстьСопоставление Или ВыборкаЦен.ЕстьРучнаяЦена Тогда
			НоваяСтрока.Выгружать = Истина;
		КонецЕсли;
		
		ПересчитатьБудетВыгруженоНаСервере(Профиль, ПеречислениеМП, НоваяСтрока, ВыборкаЦен, РежимОкругленияЦен);
		
		ЗаполнитьКэшЦен(ПеречислениеМП, НоваяСтрока);
		
		Если ИспользоватьПоследниеЦены Тогда
			ПроверитьПоследниеВыгруженныеЦены(ПеречислениеМП, НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Количество() > 0 Тогда
		Элементы.ВыгрузитьЦены.Доступность = Истина;
	КонецЕсли;	
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 14.10.24 УА #83503
&НаСервере
Процедура ПересчитатьБудетВыгруженоНаСервере(Профиль, ПеречислениеМП, Строка, ВыборкаЦен, РежимОкругленияЦен) Экспорт
	
	Если ВыборкаЦен.ЕстьРучнаяЦена Тогда
		Цена = ВыборкаЦен.РучнаяЦена;
	Иначе  
		Цена = ВыборкаЦен.Цена;	
	КонецЕсли;
	
	Цена = Окр(Цена, 0, РежимОкругленияЦен);
	
	Строка.БудетВыгруженаЦена = Цена;
	
	Если ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		
		Если ВыборкаЦен.ЕстьРучнаяЦенаСоСкидкой Тогда
			ЦенаСоСкидкой = ВыборкаЦен.РучнаяЦенаСоСкидкой;
		Иначе
			ЦенаСоСкидкой = ВыборкаЦен.ЦенаСоСкидкой;
		КонецЕсли;
		
		ЦенаСоСкидкой = Окр(ЦенаСоСкидкой, 0, РежимОкругленияЦен);
		
		Строка.БудетВыгруженаЦенаСоСкидкой = ЦенаСоСкидкой;
		
		Если ЦенаСоСкидкой = 0 Тогда
			Скидка = 0;	
		Иначе
			Скидка = ?(Цена = 0, 0, 100 - Окр(ЦенаСоСкидкой / Цена * 100, 0, РежимОкругленияЦен));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Скидка) > 0 Тогда 
			Строка.РучнаяСкидка = Скидка; 
			Строка.ЕстьРучнаяСкидка = ЗначениеЗаполнено(Скидка);
		КонецЕсли;
		
		Строка.БудетВыгруженаСкидка = Скидка; 
		
		Если Цена = 0 И ЦенаСоСкидкой = 0 Тогда 
			Строка.Выгружать = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		
		Если ВыборкаЦен.ЕстьРучнаяЦенаМинимальная Тогда
			ЦенаМинимальная = ВыборкаЦен.РучнаяЦенаМинимальная;
		Иначе  
			ЦенаМинимальная = ВыборкаЦен.ЦенаМинимальная;	
		КонецЕсли;
		
		ЦенаМинимальная = Окр(ЦенаМинимальная, 0, РежимОкругленияЦен);
		
		Строка.БудетВыгруженаЦенаМинимальная = ЦенаМинимальная;
		
		Если ВыборкаЦен.ЕстьРучнаяЦенаСоСкидкой Тогда
			ЦенаСоСкидкой = ВыборкаЦен.РучнаяЦенаСоСкидкой;
		Иначе
			ЦенаСоСкидкой = ВыборкаЦен.ЦенаСоСкидкой;
		КонецЕсли;
		
		ЦенаСоСкидкой = Окр(ЦенаСоСкидкой, 0, РежимОкругленияЦен);
		
		Строка.БудетВыгруженаЦенаСоСкидкой = ЦенаСоСкидкой;
		
		Если ЦенаСоСкидкой = 0 Тогда
			Скидка = 0;	
		Иначе
			Скидка = ?(Цена = 0, 0, 100 - Окр(ЦенаСоСкидкой / Цена * 100, 0, РежимОкругленияЦен));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Скидка) > 0 Тогда 
			Строка.РучнаяСкидка = Скидка; 
			Строка.ЕстьРучнаяСкидка = ЗначениеЗаполнено(Скидка);
		КонецЕсли;
		
		Если Цена = 0 И ЦенаСоСкидкой = 0 И ЦенаМинимальная = 0 Тогда 
			Строка.Выгружать = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		
		Если ВыборкаЦен.ЕстьРучнаяЦенаСоСкидкой Тогда
			ЦенаСоСкидкой = ВыборкаЦен.РучнаяЦенаСоСкидкой;
		Иначе
			ЦенаСоСкидкой = ВыборкаЦен.ЦенаСоСкидкой;
		КонецЕсли;
		
		ЦенаСоСкидкой = Окр(ЦенаСоСкидкой, 0, РежимОкругленияЦен);
		
		Строка.БудетВыгруженаЦенаСоСкидкой = ЦенаСоСкидкой;
		
		Если ЦенаСоСкидкой = 0 Тогда
			Скидка = 0;	
		Иначе
			Скидка = ?(Цена = 0, 0, 100 - Окр(ЦенаСоСкидкой / Цена * 100, 0, РежимОкругленияЦен));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Скидка) > 0 Тогда 
			Строка.РучнаяСкидка = Скидка; 
			Строка.ЕстьРучнаяСкидка = ЗначениеЗаполнено(Скидка);
		КонецЕсли; 
		
		Если Цена = 0 И ЦенаСоСкидкой = 0 Тогда 
			Строка.Выгружать = Ложь;
		КонецЕсли;
				
	КонецЕсли;
	
	Если ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда

		Если Цена = 0 Тогда 
			Строка.Выгружать = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		
		Если ВыборкаЦен.ЕстьРучнаяЦенаСоСкидкой Тогда
			ЦенаСоСкидкой = ВыборкаЦен.РучнаяЦенаСоСкидкой;
		Иначе
			ЦенаСоСкидкой = ВыборкаЦен.ЦенаСоСкидкой;
		КонецЕсли;
		
		ЦенаСоСкидкой = Окр(ЦенаСоСкидкой, 0, РежимОкругленияЦен);
		
		Строка.БудетВыгруженаЦенаСоСкидкой = ЦенаСоСкидкой;
		
		Если ЦенаСоСкидкой = 0 Тогда
			Скидка = 0;	
		Иначе
			Скидка = ?(Цена = 0, 0, 100 - Окр(ЦенаСоСкидкой / Цена * 100, 0, РежимОкругленияЦен));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Скидка) > 0 Тогда 
			Строка.РучнаяСкидка = Скидка; 
			Строка.ЕстьРучнаяСкидка = ЗначениеЗаполнено(Скидка);
		КонецЕсли;    
		
		Если Цена = 0 И ЦенаСоСкидкой = 0 Тогда 
			Строка.Выгружать = Ложь;
		КонецЕсли;
				
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда

		Если ВыборкаЦен.ЕстьРучнаяЦенаСоСкидкой Тогда
			ЦенаСоСкидкой = ВыборкаЦен.РучнаяЦенаСоСкидкой;
		Иначе
			ЦенаСоСкидкой = ВыборкаЦен.ЦенаСоСкидкой;
		КонецЕсли;
		
		ЦенаСоСкидкой = Окр(ЦенаСоСкидкой, 0, РежимОкругленияЦен);
		
		Строка.БудетВыгруженаЦенаСоСкидкой = ЦенаСоСкидкой;
		
		Если ЦенаСоСкидкой = 0 Тогда
			Скидка = 0;	
		Иначе
			Скидка = ?(Цена = 0, 0, 100 - Окр(ЦенаСоСкидкой / Цена * 100, 0, РежимОкругленияЦен));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Скидка) > 0 Тогда 
			Строка.РучнаяСкидка = Скидка; 
			Строка.ЕстьРучнаяСкидка = ЗначениеЗаполнено(Скидка);
		КонецЕсли;    
		
		Если Цена = 0 И ЦенаСоСкидкой = 0 Тогда 
			Строка.Выгружать = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 14.10.24 УА #83503

//+ ИнфоСофт Мурсалимов Д.Р. 13.05.24 УА #66901
&НаСервере   
Процедура ЗаполнитьКэшЦен(ПеречислениеМП, Строка)
	
	Если ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		
		Строка.КэшРучнаяЦена 			= Строка.РучнаяЦена;
		Строка.КэшРучнаяСкидка 			= Строка.РучнаяСкидка;
		Строка.КэшРучнаяЦенаМинимальная = Строка.РучнаяЦенаМинимальная;
		
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
	
		Строка.КэшРучнаяЦена 			= Строка.РучнаяЦена;
		
	Иначе                  
		
		Строка.КэшРучнаяЦена 			= Строка.РучнаяЦена;
		Строка.КэшРучнаяСкидка 			= Строка.РучнаяСкидка;
		
	КонецЕсли;			
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 13.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901
&НаСервере   
Функция ПолучитьМассивВидовЦен(Знач Маркетплейс)
	
	ВидыЦен = Новый Структура;
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[КонвертироватьМаркетплейс(Маркетплейс)];
	
	МассивПараметров = ИС_МП_УправлениеЦенами.ПолучитьПоляДляВидовЦен(ПеречислениеМП);
	
	Для Каждого Элемент Из МассивПараметров Цикл
		ВидыЦен.Вставить(Элемент, ЭтотОбъект[Маркетплейс + Элемент]);
	КонецЦикла;
	
	Возврат ВидыЦен;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901
&НаСервере   
Процедура ПолучитьИЗаполнитьФункциональныеОпцииЦен(Профиль)	
	ИС_МП_УправлениеЦенами.ПолучитьРеквизитыЦен(Профиль, ЭтотОбъект);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901 

//+ ИнфоСофт Мурсалимов Д.Р. 27.04.24 УА #66901
&НаКлиенте
Процедура НесохраненныеИзмененияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда
    	Возврат;
    КонецЕсли;
    
    Если Результат.Значение = КодВозвратаДиалога.Да Тогда
    	
    	Модифицированность = Ложь;
    	Элементы.СохранитьИзменения.Видимость = Ложь;
    	
    	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") 
    			И ДополнительныеПараметры.Свойство("Закрытие") 
    			И ДополнительныеПараметры.Закрытие Тогда 
    	
    		Закрыть();
    	
    	КонецЕсли;
    	
    	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
    	
    	Маркетплейс = СтрЗаменить(ТекущаяСтраница.Имя, "Страница", "");
		ПоследняяСтраница = Элементы["Страница" + Маркетплейс];

		УстановитьВидимостьПолученияЦен();
		
		Если ЗначениеЗаполнено(Профиль) Тогда
			ОбновитьСписокНаСервере();
		КонецЕсли;
   
       	Возврат;
    			
    КонецЕсли;
    
    Элементы.ГруппаСтраницы.ТекущаяСтраница = ПоследняяСтраница;
    	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 27.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901
&НаКлиенте
Процедура ПересчитатьБудетВыгружено(Маркетплейс, ТекДанные)
	
	Если ТекДанные.ЕстьРучнаяЦена Или ТекДанные.РучнаяЦенаИзменена Тогда	
		ТекДанные.БудетВыгруженаЦена = ТекДанные.РучнаяЦена;	
		ТекДанные.Выгружать = Истина;	
	КонецЕсли; 
	
	Если ТекДанные.ЕстьРучнаяСкидка Или ТекДанные.РучнаяСкидкаИзменена Тогда
		
		ТекДанные.БудетВыгруженаЦенаСоСкидкой = Окр(ТекДанные.БудетВыгруженаЦена * (100 - ТекДанные.РучнаяСкидка) / 100, 0, РежимОкругленияЦен);	
		ТекДанные.Выгружать = Истина;
		
	КонецЕсли;
	
	Если Маркетплейс = "WildBerries" Тогда
		
		ТекДанные.БудетВыгруженаСкидка = ТекДанные.РучнаяСкидка;
		
		Если ТекДанные.ЕстьПоследняяВыгруженнаяЦена И ТекДанные.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой 
			И ТекДанные.БудетВыгруженаЦена = ТекДанные.ПоследняяВыгруженнаяЦена 
			И ТекДанные.БудетВыгруженаЦенаСоСкидкой = ТекДанные.ПоследняяВыгруженнаяЦенаСоСкидкой Тогда
			
			ТекДанные.Выгружать = Ложь;
			
			ТекДанные.БудетВыгруженаЦена = 0;
			ТекДанные.БудетВыгруженаЦенаСоСкидкой = 0;
			ТекДанные.БудетВыгруженаСкидка = 0;
			
		КонецЕсли;
		
	ИначеЕсли Маркетплейс = "Ozon" Тогда 
		
		Если ТекДанные.ЕстьРучнаяЦенаМинимальная Или ТекДанные.РучнаяЦенаМинимальнаяИзменена Тогда	
			ТекДанные.БудетВыгруженаЦенаМинимальная = ТекДанные.РучнаяЦенаМинимальная;	
			ТекДанные.Выгружать = Истина;	
		КонецЕсли;
		
		Если ТекДанные.ЕстьПоследняяВыгруженнаяЦена И ТекДанные.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой 
			И ТекДанные.ЕстьПоследняяВыгруженнаяЦенаМинимальная
			И ТекДанные.БудетВыгруженаЦена = ТекДанные.ПоследняяВыгруженнаяЦена 
			И ТекДанные.БудетВыгруженаЦенаСоСкидкой = ТекДанные.ПоследняяВыгруженнаяЦенаСоСкидкой
			И ТекДанные.БудетВыгруженаЦенаМинимальная = ТекДанные.ПоследняяВыгруженнаяЦенаМинимальная Тогда
			
			ТекДанные.Выгружать = Ложь;
			ТекДанные.БудетВыгруженаЦена = 0;
			ТекДанные.БудетВыгруженаЦенаСоСкидкой = 0;
			ТекДанные.БудетВыгруженаЦенаМинимальная = 0;
			
		КонецЕсли;
		
	ИначеЕсли Маркетплейс = "Сбер" Тогда
		
		Если ТекДанные.ЕстьПоследняяВыгруженнаяЦена И ТекДанные.БудетВыгруженаЦена = ТекДанные.ПоследняяВыгруженнаяЦена Тогда
			
			ТекДанные.Выгружать = Ложь;
			ТекДанные.БудетВыгруженаЦена = 0;
			
		КонецЕсли;
		
	Иначе
		
		Если ТекДанные.ЕстьПоследняяВыгруженнаяЦена И ТекДанные.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой 
			И ТекДанные.БудетВыгруженаЦена = ТекДанные.ПоследняяВыгруженнаяЦена 
			И ТекДанные.БудетВыгруженаЦенаСоСкидкой = ТекДанные.ПоследняяВыгруженнаяЦенаСоСкидкой Тогда
			
			ТекДанные.Выгружать = Ложь;
			ТекДанные.БудетВыгруженаЦена = 0;
			ТекДанные.БудетВыгруженаЦенаСоСкидкой = 0;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901 

//+ ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901
&НаСервере
Процедура РасчетЦенНаСервере(ПеречислениеМП, ТекДанные, ИспользоватьПоследниеЦены)
	
	Если ТекДанные.ЕстьРучнаяЦена Или ТекДанные.РучнаяЦенаИзменена Тогда	
		ТекДанные.БудетВыгруженаЦена = ТекДанные.РучнаяЦена;	
		ТекДанные.Выгружать = Истина;	
	КонецЕсли;
	
	Если ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда 
		
		Если ТекДанные.ЕстьРучнаяСкидка Или ТекДанные.РучнаяСкидкаИзменена Тогда
			
			ТекДанные.БудетВыгруженаЦенаСоСкидкой = Окр(ТекДанные.БудетВыгруженаЦена * (100 - ТекДанные.РучнаяСкидка) / 100, 0, РежимОкругленияЦен);	
			ТекДанные.Выгружать = Истина;
			
		КонецЕсли;
		
		ТекДанные.БудетВыгруженаСкидка = ТекДанные.РучнаяСкидка;
		
		Если ТекДанные.ЕстьПоследняяВыгруженнаяЦена И ТекДанные.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой 
			И ТекДанные.БудетВыгруженаЦена = ТекДанные.ПоследняяВыгруженнаяЦена 
			И ТекДанные.БудетВыгруженаЦенаСоСкидкой = ТекДанные.ПоследняяВыгруженнаяЦенаСоСкидкой Тогда
			
			ТекДанные.Выгружать = Ложь;
			
			ТекДанные.БудетВыгруженаЦена = 0;
			ТекДанные.БудетВыгруженаЦенаСоСкидкой = 0;
			ТекДанные.БудетВыгруженаСкидка = 0;
			
		КонецЕсли;
		
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда 
		
		Если ТекДанные.ЕстьРучнаяСкидка Или ТекДанные.РучнаяСкидкаИзменена Тогда
			
			ТекДанные.БудетВыгруженаЦенаСоСкидкой = Окр(ТекДанные.БудетВыгруженаЦена * (100 - ТекДанные.РучнаяСкидка) / 100, 0, РежимОкругленияЦен);	
			ТекДанные.Выгружать = Истина;
			
		КонецЕсли;
		
		Если ТекДанные.ЕстьРучнаяЦенаМинимальная Или ТекДанные.РучнаяЦенаМинимальнаяИзменена Тогда	
			ТекДанные.БудетВыгруженаЦенаМинимальная = ТекДанные.РучнаяЦенаМинимальная;	
			ТекДанные.Выгружать = Истина;	
		КонецЕсли;
		
		Если ТекДанные.ЕстьПоследняяВыгруженнаяЦена И ТекДанные.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой 
			И ТекДанные.ЕстьПоследняяВыгруженнаяЦенаМинимальная
			И ТекДанные.БудетВыгруженаЦена = ТекДанные.ПоследняяВыгруженнаяЦена 
			И ТекДанные.БудетВыгруженаЦенаСоСкидкой = ТекДанные.ПоследняяВыгруженнаяЦенаСоСкидкой
			И ТекДанные.БудетВыгруженаЦенаМинимальная = ТекДанные.ПоследняяВыгруженнаяЦенаМинимальная Тогда
			
			ТекДанные.Выгружать = Ложь;
			ТекДанные.БудетВыгруженаЦена = 0;
			ТекДанные.БудетВыгруженаЦенаСоСкидкой = 0;
			ТекДанные.БудетВыгруженаЦенаМинимальная = 0;
			
		КонецЕсли;
		
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		
		Если ТекДанные.ЕстьПоследняяВыгруженнаяЦена И ТекДанные.БудетВыгруженаЦена = ТекДанные.ПоследняяВыгруженнаяЦена Тогда
			
			ТекДанные.Выгружать = Ложь;
			ТекДанные.БудетВыгруженаЦена = 0;
			
		КонецЕсли;
		
	Иначе
		
		Если ТекДанные.ЕстьРучнаяСкидка Или ТекДанные.РучнаяСкидкаИзменена Тогда
			
			ТекДанные.БудетВыгруженаЦенаСоСкидкой = Окр(ТекДанные.БудетВыгруженаЦена * (100 - ТекДанные.РучнаяСкидка) / 100, 0, РежимОкругленияЦен);	
			ТекДанные.Выгружать = Истина;
			
		КонецЕсли;
		
		Если ТекДанные.ЕстьПоследняяВыгруженнаяЦена И ТекДанные.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой 
			И ТекДанные.БудетВыгруженаЦена = ТекДанные.ПоследняяВыгруженнаяЦена 
			И ТекДанные.БудетВыгруженаЦенаСоСкидкой = ТекДанные.ПоследняяВыгруженнаяЦенаСоСкидкой Тогда
			
			ТекДанные.Выгружать = Ложь;
			ТекДанные.БудетВыгруженаЦена = 0;
			ТекДанные.БудетВыгруженаЦенаСоСкидкой = 0;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИспользоватьПоследниеЦены Тогда
		ПроверитьПоследниеВыгруженныеЦены(ПеречислениеМП, ТекДанные);
	КонецЕсли;
			
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901
&НаСервере   
Процедура СохранитьИзмененияНаСервере()
		
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[КонвертироватьМаркетплейс(Маркетплейс)];    
	ПолеСопоставление = ИС_МП_УправлениеЦенами.ПолучитьПолеСопоставленияЦен(ПеречислениеМП);
	
	Для Каждого Строка Из ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"] Цикл
	    
		Если Строка.РучнаяЦенаИзменена Тогда

			ИС_МП_УправлениеЦенами.ЗаписатьРучнуюЦену(
				Профиль, ПеречислениеМП, Строка[ПолеСопоставление], Строка.РучнаяЦена, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦены);

			Строка.ЕстьРучнаяЦена = Истина;
			Строка.РучнаяЦенаИзменена = Ложь;

		КонецЕсли;
		
		Если Строка.РучнаяСкидкаИзменена Тогда
			
			ЦенаСоСкидкой = Окр(Строка.БудетВыгруженаЦена * (100 - Строка.РучнаяСкидка) / 100, 0, РежимОкругленияЦен);
			
			ИС_МП_УправлениеЦенами.ЗаписатьРучнуюЦену(
				Профиль, ПеречислениеМП, Строка[ПолеСопоставление], ЦенаСоСкидкой, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой);
	
		    Строка.ЕстьРучнаяСкидка = Истина;
			Строка.РучнаяСкидкаИзменена = Ложь;
		
		КонецЕсли;
		
		Если Строка.Свойство("РучнаяЦенаМинимальнаяИзменена") И Строка.РучнаяЦенаМинимальнаяИзменена Тогда
		
			ИС_МП_УправлениеЦенами.ЗаписатьРучнуюЦену(
				Профиль, ПеречислениеМП, Строка[ПолеСопоставление], Строка.РучнаяЦенаМинимальная, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныМинимальный);
	
		    Строка.ЕстьРучнаяЦенаМинимальная = Истина;
			Строка.РучнаяЦенаМинимальнаяИзменена = Ложь;
		
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 06.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 07.05.24 УА #66901
&НаКлиенте
Процедура ЗаполнитьПоВыделеннымЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
		
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		
		ТекСтрока = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка);
		ТекСтрока[ДополнительныеПараметры] = Результат;
		ТекСтрока[ДополнительныеПараметры + "Изменена"] = Истина;

	КонецЦикла;  
	
	Элементы.СохранитьИзменения.Видимость = Истина;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 07.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901
&НаСервереБезКонтекста
Процедура УдалитьРучнуюЦенуНаСервере(Знач Профиль, Знач Маркетплейс, Знач КарточкаМП)
	ИС_МП_УправлениеЦенами.УдалитьРучнуюЦену(
		Профиль, Перечисления.ИС_МП_Маркетплейсы[КонвертироватьМаркетплейс(Маркетплейс)], КарточкаМП, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦены);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901
	
//+ ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901
&НаСервереБезКонтекста
Процедура УдалитьРучнуюЦенуМинимальнуюНаСервере(Знач Профиль, Знач Маркетплейс, Знач КарточкаМП)
	ИС_МП_УправлениеЦенами.УдалитьРучнуюЦену(
		Профиль, Перечисления.ИС_МП_Маркетплейсы[КонвертироватьМаркетплейс(Маркетплейс)], КарточкаМП, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныМинимальный);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901
&НаСервереБезКонтекста
Процедура УдалитьРучнуюСкидкуНаСервере(Знач Профиль, Знач Маркетплейс, Знач КарточкаМП)
	ИС_МП_УправлениеЦенами.УдалитьРучнуюЦену(
		Профиль, Перечисления.ИС_МП_Маркетплейсы[КонвертироватьМаркетплейс(Маркетплейс)], КарточкаМП, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаСервере
Процедура ЗагрузитьРучныеЦеныНаСервере()

	Если Не ЗначениеЗаполнено(АдресРучныхЦенВоВременномХранилище) Тогда
		Возврат;
	КонецЕсли;
	
	РучныеЦеныТЗ = ИС_MP_Сервер.ПолучитьТаблицуЗначенийИзExcel(АдресРучныхЦенВоВременномХранилище);
	
	Если РучныеЦеныТЗ = Неопределено Или РучныеЦеныТЗ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
    
	Если РучныеЦеныТЗ.Колонки.Найти("Цена") = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("В файле не найдена колонка ""Цена"", проверьте корректность файла");
		Возврат;
	КонецЕсли;
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[КонвертироватьМаркетплейс(Маркетплейс)];
	
	ИспользоватьПоследниеЦены = ЭтотОбъект[Маркетплейс + "ИспользоватьПоследниеЦены"];
	
	ПолеПоиска = Неопределено;
	ПолеСопоставления = Неопределено;
	
	Таблица = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"];
	МассивСтрокВыгрузки = Новый Массив;
	МассивСтрокВыгрузки.Добавить(Таблица[0]);
	
	РеквизитыТаблицы = ПолучитьРеквизиты(Маркетплейс + "ТаблицаВыгрузки");
	
	ОпределитьПолеПоиска(РеквизитыТаблицы, РучныеЦеныТЗ.Колонки, ПолеСопоставления, ПолеПоиска);
	
	Если ПолеПоиска = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("В файле не найдена колонка для сопоставления цен по данному маркетплейсу");
		Возврат;
	КонецЕсли;
	
	Счетчик = 0;
	
	Для Каждого Строка Из РучныеЦеныТЗ Цикл
		
		НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура(ПолеПоиска, Строка[ПолеСопоставления]));
		
		Если Строка.Цена = "" И Строка.Скидка = "" Тогда
			Продолжить;
		КонецЕсли;
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			НайденныеСтроки[0].РучнаяЦена = Строка.Цена;
			НайденныеСтроки[0].РучнаяЦенаИзменена = ЗначениеЗаполнено(Строка.Цена);
			
			НайденныеСтроки[0].РучнаяСкидка = Строка.Скидка;
			НайденныеСтроки[0].РучнаяСкидкаИзменена = ЗначениеЗаполнено(Строка.Скидка);
			
			РасчетЦенНаСервере(ПеречислениеМП, НайденныеСтроки[0], ИспользоватьПоследниеЦены);
			
			Модифицированность = Истина;
			Элементы.СохранитьИзменения.Видимость = Истина;
			Счетчик = Счетчик + 1;	
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если Счетчик > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Загрузка выполнена успешно, заполнено строк: " + Счетчик);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаСервереБезКонтекста   
Процедура ОпределитьПолеПоиска(Знач РеквизитыТаблицы, Знач Колонки, ПолеСопоставления, ПолеПоиска)

	Для Каждого Колонка Из Колонки Цикл
		
		Если Колонка.Имя = "Цена" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Колонка.Имя = "Скидка" Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Реквизит Из РеквизитыТаблицы Цикл
			
			Если Не Реквизит.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрЗаменить(Реквизит.Заголовок, " ", "") = Колонка.Имя Тогда
				ПолеПоиска = Реквизит.Имя;
				ПолеСопоставления = Колонка.Имя;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;		                                        
		
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура ПутьКФайлуРучныхЦенНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	
	ВыбранныеФайлы = ДиалогВыбораФайла.ВыбранныеФайлы;
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлуРучныхЦен = ВыбранныеФайлы[0];
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоместитьФайлНаСерверЗавершение", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , , , ПутьКФайлуРучныхЦен, УникальныйИдентификатор);

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура ПоместитьФайлНаСерверЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.ПомещениеФайлаОтменено Тогда
	
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Не удалось загрузить файл, попробуйте ещё раз...", , , "ПутьКФайлуРучныхЦен");
	
		Возврат;
	
	КонецЕсли;
	
	АдресРучныхЦенВоВременномХранилище = Результат.Адрес;
	Элементы.ЗагрузитьРучныеЦены.Доступность = Истина;          
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура ВыгрузитьЦеныЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = КодВозвратаДиалога.Да Тогда 
        НачатьВыгрузкуЦен();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура ВыгрузкаЦенЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы.КартинкаОжидание.Видимость = Ложь;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
    
    Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;		
	КонецЕсли;
    
	Если Результат.Статус = "Выполнено" Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка завершена");	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
&НаКлиенте
Процедура НачатьВыгрузкуЦен()
	
	ДлительнаяОперация = НачатьВыгрузкуЦенНаСервере();
	
	Если ДлительнаяОперация = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбрано ни одной строки для выгрузки");
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузкаЦенЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
	
    Элементы.КартинкаОжидание.Видимость = Истина;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
// 
// Возвращаемое значение:
//  Структура - Возвращает структуру сформированную в результате запуска фонового задания
//
&НаСервере  
Функция НачатьВыгрузкуЦенНаСервере()
    
    ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[КонвертироватьМаркетплейс(Маркетплейс)];
    
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	ТаблицаВыгрузки = СформироватьТаблицуВыгрузки(ПеречислениеМП);
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "ИС_МП_УправлениеЦенами.ВыгрузитьЦены", 
		ПеречислениеМП, Профиль, ТаблицаВыгрузки);

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
//
// Параметры:
//  ПеречислениеМП	 - ПеречислниеСсылка.ИС_МП_Маркетплейсы	 - Маркетплейс по которому необходимо сформировать таблицу
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Сформированная таблица для выгрузки цен на Маркетплейс
//
&НаСервере   
Функция СформироватьТаблицуВыгрузки(ПеречислениеМП)

	ТаблицаВыгрузки = Новый ТаблицаЗначений;
	
	ИС_МП_УправлениеЦенами.ЗаполнитьКолонкиТаблицыВыгрузкиЦен(ПеречислениеМП, ТаблицаВыгрузки);
	
	МассивПараметров = ИС_МП_УправлениеЦенами.ПолучитьПоляДляВыгрузки(ПеречислениеМП);
	
	Если ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		
		//+ ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #91535
		ВыгружатьНулевыеСкидки = ЭтотОбъект[Маркетплейс + "ВыгружатьНулевыеСкидки"];	
		
		Для Каждого Строка Из ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"] Цикл
			
			Если Не Строка.Выгружать Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
			
			Для Каждого Элемент Из МассивПараметров Цикл
				НоваяСтрока[Элемент] = Строка[Элемент];
			КонецЦикла;
			
			НоваяСтрока.Цена 				= Строка.БудетВыгруженаЦена;
			НоваяСтрока.Скидка 				= Строка.БудетВыгруженаСкидка;
			НоваяСтрока.ЦенаСоСкидкой 		= Строка.БудетВыгруженаЦенаСоСкидкой;	
			
			//+ ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #91535
			Если ВыгружатьНулевыеСкидки Тогда
				НоваяСтрока.ВыгружатьСкидку = Истина;	
			Иначе
				
				НоваяСтрока.ВыгружатьСкидку = Ложь;
				
				Если ЗначениеЗаполнено(НоваяСтрока.Скидка) И НоваяСтрока.Скидка > 0 Тогда 
					НоваяСтрока.ВыгружатьСкидку = Истина;       	
				КонецЕсли;
				
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #91535
			
		КонецЦикла;
		//- ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #91535
		
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		
		Для Каждого Строка Из ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"] Цикл
			
			Если Не Строка.Выгружать Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
			
			Для Каждого Элемент Из МассивПараметров Цикл
				НоваяСтрока[Элемент] = Строка[Элемент];
			КонецЦикла;
			
			НоваяСтрока.Цена = Строка.БудетВыгруженаЦена;
			НоваяСтрока.ЦенаСоСкидкой = Строка.БудетВыгруженаЦенаСоСкидкой; 
			НоваяСтрока.ЦенаМинимальная = Строка.БудетВыгруженаЦенаМинимальная;
			
		КонецЦикла;
		
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		
		Для Каждого Строка Из ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"] Цикл
			
			Если Не Строка.Выгружать Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.shopSku) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
			
			Для Каждого Элемент Из МассивПараметров Цикл
				НоваяСтрока[Элемент] = Строка[Элемент];
			КонецЦикла;
			
			НоваяСтрока.Цена = Строка.БудетВыгруженаЦена;
			НоваяСтрока.ЦенаСоСкидкой = Строка.БудетВыгруженаЦенаСоСкидкой;
			
			Если НоваяСтрока.Цена > 0 И НоваяСтрока.ЦенаСоСкидкой > 0 Тогда
				
				Если Строка.РучнаяСкидка < 5 Или Строка.РучнаяСкидка > 75 Тогда	
					
					ОбщегоНазначения.СообщитьПользователю("Для номенклатуры " + Строка.НоменклатураЯМ 
						+ " неправильно установлена цена! Скидка должна быть от 5 до 75%!");
					
					ТаблицаВыгрузки.Удалить(НоваяСтрока);
					Продолжить;
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		
		Для Каждого Строка Из ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"] Цикл
			
			Если Не Строка.Выгружать Тогда
				Продолжить;
			КонецЕсли; 
			
			Если Не ЗначениеЗаполнено(Строка.offerID) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
			
			Для Каждого Элемент Из МассивПараметров Цикл
				НоваяСтрока[Элемент] = Строка[Элемент];
			КонецЦикла;
			
			НоваяСтрока.Цена = Строка.БудетВыгруженаЦена;
			
		КонецЦикла;
		
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		
		Для Каждого Строка Из ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"] Цикл
			
			Если Не Строка.Выгружать Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
			
			Для Каждого Элемент Из МассивПараметров Цикл
				НоваяСтрока[Элемент] = Строка[Элемент];
			КонецЦикла;
			
			НоваяСтрока.Цена = Строка.БудетВыгруженаЦена;
			НоваяСтрока.ЦенаСоСкидкой = Строка.БудетВыгруженаЦенаСоСкидкой;
			
		КонецЦикла;
		
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
		
		Для Каждого Строка Из ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"] Цикл
			
			Если Не Строка.Выгружать Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
			
			Для Каждого Элемент Из МассивПараметров Цикл
				НоваяСтрока[Элемент] = Строка[Элемент];
			КонецЦикла;
			
			НоваяСтрока.Цена          = Строка.БудетВыгруженаЦена;
			НоваяСтрока.ЦенаСоСкидкой = Строка.БудетВыгруженаЦенаСоСкидкой;
			
		КонецЦикла;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120	
		
	КонецЕсли;
	
	Возврат ТаблицаВыгрузки;
	 
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 13.05.24 УА #66901
&НаСервереБезКонтекста   
Процедура ПроверитьПоследниеВыгруженныеЦены(ПеречислениеМП, Строка)
	
	Если ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда 
		
		Если Строка.ЕстьПоследняяВыгруженнаяЦена И Строка.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой 
			И Строка.БудетВыгруженаЦена = Строка.ПоследняяВыгруженнаяЦена 
			И Строка.БудетВыгруженаЦенаСоСкидкой = Строка.ПоследняяВыгруженнаяЦенаСоСкидкой Тогда
			
			Строка.Выгружать = Ложь;
			
			Строка.БудетВыгруженаЦена = 0;
			Строка.БудетВыгруженаЦенаСоСкидкой = 0;
			Строка.БудетВыгруженаСкидка = 0;
			
		КонецЕсли;
		
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда 
		
		Если Строка.ЕстьПоследняяВыгруженнаяЦена И Строка.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой 
			И Строка.ЕстьПоследняяВыгруженнаяЦенаМинимальная
			И Строка.БудетВыгруженаЦена = Строка.ПоследняяВыгруженнаяЦена 
			И Строка.БудетВыгруженаЦенаСоСкидкой = Строка.ПоследняяВыгруженнаяЦенаСоСкидкой
			И Строка.БудетВыгруженаЦенаМинимальная = Строка.ПоследняяВыгруженнаяЦенаМинимальная Тогда
			
			Строка.Выгружать = Ложь;
			Строка.БудетВыгруженаЦена = 0;
			Строка.БудетВыгруженаЦенаСоСкидкой = 0;
			Строка.БудетВыгруженаЦенаМинимальная = 0;
			
		КонецЕсли;
		
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		
		Если Строка.ЕстьПоследняяВыгруженнаяЦена И Строка.БудетВыгруженаЦена = Строка.ПоследняяВыгруженнаяЦена Тогда
			
			Строка.Выгружать = Ложь;
			Строка.БудетВыгруженаЦена = 0;
			
		КонецЕсли;
		
	Иначе
		
		Если Строка.ЕстьПоследняяВыгруженнаяЦена И Строка.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой 
			И Строка.БудетВыгруженаЦена = Строка.ПоследняяВыгруженнаяЦена 
			И Строка.БудетВыгруженаЦенаСоСкидкой = Строка.ПоследняяВыгруженнаяЦенаСоСкидкой Тогда
			
			Строка.Выгружать = Ложь;
			Строка.БудетВыгруженаЦена = 0;
			Строка.БудетВыгруженаЦенаСоСкидкой = 0;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 13.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 07.08.24 УА #66901
&НаСервереБезКонтекста   
Процедура ОтменитьФоновыеЗаданияНаСервере(Знач ИдентификаторЗадания)
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 07.08.24 УА #66901

//+ ИнфоСофт Власова И.С. 14.01.25 УА #90120
&НаСервере   
Процедура ОпределитьИнтегрируемыеМаркетплейсы()
	
	ИнтегрируемыеМаркетплейсы = ИС_МП_Сервер.ИнтегрируемыеМаркетплейсыЦены();
		
	СтруктураНастроек = Новый Структура;
	
	Для Каждого Элемент Из ИнтегрируемыеМаркетплейсы Цикл
		СтруктураНастроек.Вставить(Элемент, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "Интеграция" + Элемент));	
	КонецЦикла;
	
	ТребуетсяСменаСтраницы = Ложь;
	ПерваяДоступнаяСтраница = Неопределено;
	
	Для Каждого Элемент Из СтруктураНастроек Цикл 
		
		ИмяСтраницы = "Страница" + Элемент.Ключ;
		Видимость = ?(Элемент.Значение = Неопределено, Ложь, Элемент.Значение);
		Элементы[ИмяСтраницы].Видимость = Видимость;
		
		Если Видимость И Не ЗначениеЗаполнено(ПерваяДоступнаяСтраница) Тогда
			ПерваяДоступнаяСтраница = ИмяСтраницы; 
		КонецЕсли;
		
		Если Не Видимость И Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[ИмяСтраницы] Тогда
			ТребуетсяСменаСтраницы = Истина;	
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТребуетсяСменаСтраницы Тогда 
		
		Если ЗначениеЗаполнено(ПерваяДоступнаяСтраница) Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[ПерваяДоступнаяСтраница];		
		Иначе
			
			// +#Удалить
			Для Каждого Страница Из Элементы.ГруппаСтраницы.ПодчиненныеЭлементы Цикл
				
				Если Страница.Видимость Тогда
					Элементы.ГруппаСтраницы.ТекущаяСтраница = Страница;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			// -#Удалить

		КонецЕсли;		
			
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 14.01.25 УА #90120

//+ ИнфоСофт Ивонин К.А. 04.03.25 УА #92887
&НаСервереБезКонтекста   
Функция КонвертироватьМаркетплейс(МП)
	
	Если МП = "WildBerries" Тогда
		Возврат "ВБ";
	КонецЕсли;
	
	Если МП = "Ozon" Тогда
		Возврат "Озон";
	КонецЕсли;
	
	Если МП = "Яндекс" Тогда
		Возврат "ЯМ";
	КонецЕсли;
	
	Если МП = "Aliexpress" Тогда
		Возврат "Али";
	КонецЕсли;
	
	Возврат МП;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 04.03.25 УА #92887

#КонецОбласти