                                           
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция НастройкиСоединения(Профиль) Экспорт
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода;
	МассивПараметров = ИС_Ламода_Сервер.МассивНастроекПодключения();
	
	Результат = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("AccessTokenB2B");
	МассивПараметров.Добавить("AccessTokenSeller");
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров, "Строка");
	
	ЗаполнитьЗначенияСвойств(Результат, СтруктураНастроек);
		
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
Функция НастройкиОстатков(Профиль) Экспорт
		
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода;
	
	МассивПараметров = ИС_Ламода_Сервер.МассивНастроекОстатков();
	
	Результат = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров);
	
	Результат.Вставить("Организация");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_Профили.Организация КАК Организация
		|ИЗ
		|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
		|ГДЕ
		|	ИС_WB_Профили.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОрганизация = РезультатЗапроса.Выбрать();
	
	Если ВыборкаОрганизация.Следующий() Тогда
		Результат.Организация = ВыборкаОрганизация.Организация;
	КонецЕсли;
			
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти
