
#Область ПрограммныйИнтерфейс

//+ ИнфоСофт Мурсалимов Д.Р. 11.07.24 УА #79512
Процедура ОбработатьДанныеШтрихкода(ЗавершениеОбработки, Форма, ДанныеШтрихкода, ПараметрыСканирования) Экспорт
	
	ИмяОбщегоМодуляШтрихкодирования = ИС_МП_ВызовСервера.ОбщийМодульШтрихкодирования();
	
	ОбщийМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль(ИмяОбщегоМодуляШтрихкодирования);	
    ОбщийМодуль.ОбработатьДанныеШтрихкода(ЗавершениеОбработки, Форма, ДанныеШтрихкода, ПараметрыСканирования);	
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 11.07.24 УА #79512

//+ ИнфоСофт Мурсалимов Д.Р. 11.07.24 УА #79512
Процедура ПоказатьВводШтрихкода(Оповещение) Экспорт
	
	ИмяОбщегоМодуляШтрихкодирования = ИС_МП_ВызовСервера.ОбщийМодульШтрихкодирования();
	
	ОбщийМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль(ИмяОбщегоМодуляШтрихкодирования);	
    ОбщийМодуль.ПоказатьВводШтрихкода(Оповещение);	
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 11.07.24 УА #79512

//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686
Функция ПараметрыСканирования(Контекст = Неопределено, ФормаВыбора = Неопределено, ВидПродукции = Неопределено, ПараметрыРежимаИсправленияОшибок = Неопределено) Экспорт
	
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #93336
	//ИмяОбщегоМодуляШтрихкодирования = ИС_МП_ВызовСервера.ОбщийМодульШтрихкодирования();
	ИмяОбщегоМодуляШтрихкодирования = ИС_МП_ВызовСервера.ОпределитьОбщийМодульПараметровСканированияКлиент();
	//- ИнфоСофт Власова И.С. 13.02.25 УА #93336
	
	ОбщийМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль(ИмяОбщегоМодуляШтрихкодирования);	
    Возврат ОбщийМодуль.ПараметрыСканирования(Контекст, ФормаВыбора, ВидПродукции, ПараметрыРежимаИсправленияОшибок);	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686                                                       

#КонецОбласти
