#Область ОбработчикиСобытий

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ВызватьИсключение("Необходимо выбрать профиль.");
	КонецЕсли;
	
	ОстаткиFBO = ИС_WB_Сервер.ПолучитьИнфорамциюОбОстаткахFBO(Профиль);
	Если ОстаткиFBO = Неопределено Тогда
		ОстаткиFBO = Новый ТаблицаЗначений;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 06.03.2024 УА #66813	
	//ОстаткиFBO.Свернуть("Склад", "НаСкладе");
	ОстаткиFBO.Свернуть("Склад, Бренд", "НаСкладе");
	//- ИнфоСофт Стояк Ю.К. 06.03.2024 УА #66813
	ВсегоНаСкладах = ОстаткиFBO.Итог("НаСкладе");
	
	ОстаткиFBO.Колонки.Добавить("ПоВсемСкладам", Новый ОписаниеТипов("Число"));
	
	Для Каждого Строка Из ОстаткиFBO Цикл
		Строка.ПоВсемСкладам = ВсегоНаСкладах;	
	КонецЦикла;	
	
	ВнешниеНаборыДанных = Новый Структура;
	
	ВнешниеНаборыДанных.Вставить("ОстаткиFBO", ОстаткиFBO);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

#КонецОбласти
