
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	ОпределитьИнтегрируемыеМаркетплейсы();
	ПолучитьНастройкиМаркетплейсов();
	
	УправлениеФормойНаСервере();
	ЗаполнитьНастройкиРегламентныхЗаданий();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 24.06.22 УА #46999
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УстановитьНастройкиСоединенияПоУмолчанию();
	КонецЕсли;
	                   
	ЗаполнитьНастройки();
	УправлениеФормой();
	РежимТехническогоСпециалиста(Неопределено);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.06.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 27.06.22 УА #46999
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ТекущееАктивноеОкно = АктивноеОкно();
	ОбновитьИнтерфейс();
	Если ТекущееАктивноеОкно <> Неопределено Тогда
		ТекущееАктивноеОкно.Активизировать();
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения(); 
	
	ЗаписатьНаСервере();

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.06.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаКлиенте
Процедура РегламентноеЗаданиеПриИзменении(Элемент)
	ИзменитьРеглЗаданиеНаСервере(Элемент.Имя);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаКлиенте
Процедура РасписанияНажатие(Элемент)
	УстановитьРасписание(СтрЗаменить(Элемент.Имя, "Расписание", ""));
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаКлиенте
Процедура ОбновитьОбработку(Команда)
	ОбновитьОбработкуЗапускаРегламентныхЗаданийНаСервере();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 20.02.23 УА #53535
&НаКлиенте
Процедура РассчитыватьДатыОтгрузкиПриИзменении(Элемент)
	Элементы.ВремяОтсчета.Видимость = Объект.РассчитыватьДатыОтгрузки;
	Элементы.КоличествоДнейКОтгрузке.Видимость = Объект.РассчитыватьДатыОтгрузки;
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 21.02.23 УА #53535
&НаКлиенте
Процедура РежимСозданияЗаказовПриИзменении(Элемент)

	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Если Объект.РежимСозданияЗаказов = 2 Тогда
		
		Элементы.ИспользоватьРазбиениеПоСкладамВБ.Видимость = Истина;
		
		Если НЕ Объект.ИспользоватьРазбиениеПоСкладам Тогда
			Элементы.АктивныйЗаказКлиента.Видимость = Истина;	
		Иначе
			Элементы.АктивныйЗаказКлиента.Видимость = Ложь;
		КонецЕсли;
		//+ ИнфоСофт Стояк Ю.К. 13.11.2023 УА #62353		
		Если Объект.АвтоматическиДобавлятьВПоставку Тогда  
			Элементы.Поставка.Видимость = Истина;
			Элементы.ПоставкаКГТ.Видимость = Истина;
		КонецЕсли;                                  
		//- ИнфоСофт Стояк Ю.К. 13.11.2023 УА #62353
	Иначе
		Элементы.ИспользоватьРазбиениеПоСкладамВБ.Видимость = Ложь;
		Элементы.АктивныйЗаказКлиента.Видимость = Ложь;
		//+ ИнфоСофт Стояк Ю.К. 13.11.2023 УА #62353
		Элементы.Поставка.Видимость = Ложь;
		Элементы.ПоставкаКГТ.Видимость = Ложь;
		//- ИнфоСофт Стояк Ю.К. 13.11.2023 УА #62353
	КонецЕсли;
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424  
	
	//+ ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146	
	Если РежимСозданияЗаказовOzon = 2 Тогда
		Элементы.ФормироватьЕдиныйЗаказБезРазбиенияOzon.Видимость = Истина;
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Элементы.ЗакрытиеЗаказаПоДатеОтгрузкиOzon.Видимость = Истина;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		Элементы.ИспользоватьРазбиениеПоСкладамOzon.Видимость = Истина;
		//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Иначе
		Элементы.ФормироватьЕдиныйЗаказБезРазбиенияOzon.Видимость = Ложь;
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Элементы.ЗакрытиеЗаказаПоДатеОтгрузкиOzon.Видимость = Ложь;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		Элементы.ИспользоватьРазбиениеПоСкладамOzon.Видимость = Ложь;
		//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	КонецЕсли; 
	
	Если РежимСозданияЗаказовЯМ = 2 Тогда
		Элементы.ФормироватьЕдиныйЗаказБезРазбиенияЯМ.Видимость = Истина;
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Элементы.ЗакрытиеЗаказаПоДатеОтгрузкиЯМ.Видимость = Истина;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		Элементы.ИспользоватьРазбиениеПоСкладамЯМ.Видимость = Истина;
		//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Иначе
		Элементы.ФормироватьЕдиныйЗаказБезРазбиенияЯМ.Видимость = Ложь;
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Элементы.ЗакрытиеЗаказаПоДатеОтгрузкиЯМ.Видимость = Ложь;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		Элементы.ИспользоватьРазбиениеПоСкладамЯМ.Видимость = Ложь;
		//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	КонецЕсли; 
	
	Если РежимСозданияЗаказовАли = 2 Тогда
		Элементы.ФормироватьЕдиныйЗаказБезРазбиенияАли.Видимость = Истина;
	Иначе
		Элементы.ФормироватьЕдиныйЗаказБезРазбиенияАли.Видимость = Ложь; 
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
	
	//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
	Если СберРежимСозданияЗаказов = 2 Тогда 
		
		Элементы.СберФормироватьЕдиныйЗаказБезРазбиения.Видимость = Истина; 
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Элементы.СберЗакрытиеЗаказаПоДатеОтгрузки.Видимость = Истина;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Если СберФормироватьЕдиныйЗаказБезРазбиения Тогда
			Элементы.СберАктивныйЗаказКлиента.Видимость = Истина;
		Иначе
			Элементы.СберАктивныйЗаказКлиента.Видимость = Ложь; 
		КонецЕсли; 
		
	Иначе
		Элементы.СберФормироватьЕдиныйЗаказБезРазбиения.Видимость = Ложь;
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Элементы.СберЗакрытиеЗаказаПоДатеОтгрузки.Видимость = Ложь;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	КонецЕсли;	
	//- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 29.09.23 УА #64020
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборМагазина" Тогда
		
		ЯМКампанияID = Параметр.CampaignID;
		ЯМКодБизнеса = Параметр.BusinessID;
		
		//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
		ЗаписатьМодельРаботыМагазинаНаСервере(Параметр.МодельРаботы);
		//- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.09.23 УА #64020

//+ ИнфоСофт Ивонин К.А. 18.10.23 УА #61102
&НаКлиенте
Процедура РежимСокрытияОстатковПриИзменении(Элемент)
	ИзменитьЗначениеСкрываемогоОстатка();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 18.10.23 УА #61102

//+ ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
&НаКлиенте
Процедура ФормироватьЕдиныйЗаказБезРазбиенияПриИзменении(Элемент)
	
	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Если ФормироватьЕдиныйЗаказБезРазбиенияOzon И НЕ ИспользоватьРазбиениеПоСкладамOzon Тогда
		Элементы.АктивныйЗаказКлиентаOzon.Видимость = Истина;
	Иначе
		Элементы.АктивныйЗаказКлиентаOzon.Видимость = Ложь; 
	КонецЕсли;
	
	Если НЕ Объект.ИспользоватьРазбиениеПоСкладам Тогда
		Элементы.АктивныйЗаказКлиента.Видимость = Истина;
	Иначе
		Элементы.АктивныйЗаказКлиента.Видимость = Ложь; 
	КонецЕсли;
	
	Если ФормироватьЕдиныйЗаказБезРазбиенияЯМ И НЕ ИспользоватьРазбиениеПоСкладамЯМ Тогда
		Элементы.АктивныйЗаказКлиентаЯМ.Видимость = Истина;
	Иначе
		Элементы.АктивныйЗаказКлиентаЯМ.Видимость = Ложь; 
	КонецЕсли;
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424  
	
	Если ФормироватьЕдиныйЗаказБезРазбиенияАли Тогда
		Элементы.АктивныйЗаказКлиентаАли.Видимость = Истина;
	Иначе
		Элементы.АктивныйЗаказКлиентаАли.Видимость = Ложь; 
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
	Если СберФормироватьЕдиныйЗаказБезРазбиения Тогда
		Элементы.СберАктивныйЗаказКлиента.Видимость = Истина;
	Иначе
		Элементы.СберАктивныйЗаказКлиента.Видимость = Ложь; 
	КонецЕсли;  
	//- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146

//+ ИнфоСофт Стояк Ю.К. 13.11.2023 УА #62353
&НаКлиенте
Процедура АвтоматическиДобавлятьВПоставкуПриИзменении(Элемент)
	
	Если Объект.АвтоматическиДобавлятьВПоставку И Объект.РежимСозданияЗаказов = 2 Тогда				
		Элементы.Поставка.Видимость = Истина;
		Элементы.ПоставкаКГТ.Видимость = Истина;
		Элементы.ПоставкаСГТ.Видимость = Истина;
	Иначе
		Элементы.Поставка.Видимость = Ложь;
		Элементы.ПоставкаКГТ.Видимость = Ложь;
		Элементы.ПоставкаСГТ.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.11.2023 УА #62353

//+ ИнфоСофт Заварин К.В. 25.09.24 УА #77549
&НаКлиенте
Процедура УдалятьРТУOzonПриИзменении(Элемент)
	
	Если УдалятьРТУOzon Тогда
		Элементы.ПроверятьДатуПередУдалениемOzon.Видимость = Истина;
	Иначе
		Элементы.ПроверятьДатуПередУдалениемOzon.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 25.09.24 УА #77549

//+ ИнфоСофт Заварин К.В. 25.09.24 УА #77549
&НаКлиенте
Процедура УдалятьРТУЯМПриИзменении(Элемент)
	
	Если УдалятьРТУЯМ Тогда
		Элементы.ПроверятьДатуПередУдалениемЯМ.Видимость = Истина;
	Иначе
		Элементы.ПроверятьДатуПередУдалениемЯМ.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 25.09.24 УА #77549

//+ ИнфоСофт Заварин К.В. 26.09.24 УА #77549
&НаКлиенте
Процедура СберУдалятьРТУПриИзменении(Элемент)
	Если СберУдалятьРТУ Тогда
		Элементы.СберПроверятьДатуПередУдалением.Видимость = Истина;
	Иначе
		Элементы.СберПроверятьДатуПередУдалением.Видимость = Ложь;
	КонецЕсли; 
		
КонецПроцедуры //- ИнфоСофт Заварин К.В. 26.09.24 УА #77549

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
&НаКлиенте
Процедура ИнтеграцияПриИзменении(Элемент)
	
	Маркетплейс = СтрЗаменить(Элемент.Имя, "Интеграция", "");
	Элементы["Страница" + Маркетплейс].Видимость = Объект[Элемент.Имя];
	Если Объект[Элемент.Имя] Тогда
		ЗаполнитьПоУмолчаниюНажатие(Элементы["ЗаполнитьПоУмолчанию" + Маркетплейс]);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
&НаКлиенте
Процедура ЗаполнитьПоУмолчаниюНажатие(Элемент)
	Маркетплейс = СтрЗаменить(Элемент.Имя, "ЗаполнитьПоУмолчанию", "");
	СтруктураНастроек = ИС_МП_Клиент.НастройкиСоединенияПоУмолчанию(Маркетплейс);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек);
	Модифицированность = Истина;
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
&НаКлиенте
Процедура ТестПодключенияНажатие(Элемент)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Перед проведением теста необходимо записать Профиль");
		Возврат;	
	КонецЕсли;
	
	Маркетплейс = СтрЗаменить(Элемент.Имя, "ТестПодключения", "");
	ПараметрыТеста = ИС_МП_Клиент.ПараметрыТестаПодключения(Маркетплейс, ЭтотОбъект);
	
	Если ПараметрыТеста = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ТестПодключенияМаркетплейсов(Объект.Ссылка, Маркетплейс, ПараметрыТеста);
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(Результат);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 01.03.25 УА #92887
&НаКлиенте
Процедура ДанныеОтладкиНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;	
	КонецЕсли;
	
	Маркетплейс = ПредопределенноеЗначение("Перечисление.ИС_МП_Маркетплейсы." 
		+ СтрЗаменить(Элемент.Имя, "ДанныеОтладки", ""));
	
	Отбор = Новый Структура;
	Отбор.Вставить("Профиль", Объект.Ссылка);
	Отбор.Вставить("Маркетплейс", Маркетплейс);
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.ИС_МП_ДанныеОтладки.Форма.ФормаСписка", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.03.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 22.04.25 УА #96894
&НаКлиенте
Процедура ВБАвтоматическиСопоставлятьПриИзменении(Элемент)
	
	Если ВБАвтоматическиСопоставлять И Не ЗначениеЗаполнено(ВБСопоставлятьПо) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать режим сопоставления", , , "ВБСопоставлятьПо");	
		ВБАвтоматическиСопоставлять = Ложь;	
	КонецЕсли;	
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 22.04.25 УА #96894
&НаКлиенте
Асинх Процедура ВБЗаказыFBOПриИзменении(Элемент)
	
	Если Не ЭтотОбъект[Элемент.Имя] Тогда
		Возврат;	
	КонецЕсли;
	
	Текст = "Уверены что хотите включить работу с заказами ФБО? 
		|Активируется возможность загрузки и создания заказов по схеме ФБО.		
		|Внимание! Контроль остатков в случае возвратов по схеме ФБО остаётся на вашей стороне!";
	
	Ответ = Ждать ВопросАсинх(Текст, РежимДиалогаВопрос.ДаНет, 10, 
		КодВозвратаДиалога.Нет, "Включение работы с заказами ФБО");
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ЭтотОбъект[Элемент.Имя] = Ложь                 
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.04.25 УА #96894

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 24.06.22 УА #46999
&НаКлиенте
Процедура ЗаполнитьНастройкиСоединенияПоУмолчанию(Команда)
	УстановитьНастройкиСоединенияПоУмолчанию();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.06.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 24.06.22 УА #46999
&НаКлиенте
Процедура ТестПодключения(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Перед проведением теста необходимо записать Профиль");
		Возврат;	
	КонецЕсли;
	
	Если Элементы.СтраницыМаркетплесы.ТекущаяСтраница = Элементы.СтраницаСбер Тогда
		ТестПодключенияСбер();  
	//+ ИнфоСофт Украинцева А.А. 30.11.2023 УА #62922
	ИначеЕсли Элементы.СтраницыМаркетплесы.ТекущаяСтраница = Элементы.СтраницаАли Тогда
		ТестПодключенияАли(); 
	ИначеЕсли Элементы.СтраницыМаркетплесы.ТекущаяСтраница = Элементы.СтраницаОзон Тогда
		ТестПодключенияOzon(); 
	//- ИнфоСофт Украинцева А.А. 30.11.2023 УА #62922
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.06.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 31.10.22 УА #50199
&НаКлиенте
Процедура РежимТехническогоСпециалиста(Команда)
	
	Если Команда = Неопределено Тогда
		Видимость = Ложь;
	Иначе
		Видимость = Не Элементы.НастройкиСоединенияВБ.Видимость;
	КонецЕсли;
	
	РежимПароля = Не Видимость;
	
	#Область ВБ
	
	Элементы.НастройкиСоединенияВБ.Видимость = Видимость;
	Элементы.ТокеныВБРедактироватьТокенВБ.Видимость = Видимость;
	Элементы.СлужебныйНастройкиВБ.Видимость = Видимость;
	Элементы.ТокеныВБТокен.РежимПароля = РежимПароля;
	
	#КонецОбласти
	
	#Область Озон
	
	Элементы.ApiKey.РежимПароля = РежимПароля;
	//Элементы.Озон.РежимПароля = РежимПароля;
	Элементы.НастройкиСоединенияОзон.Видимость = Видимость;
	Элементы.СлужебныйНастройкиОзон.Видимость = Видимость;
		
	#КонецОбласти
	
	#Область ЯМ
	
	Элементы.ЯМТокен.РежимПароля = РежимПароля;
	Элементы.ЯМАдресСервисаAPI.Видимость = Видимость;
	Элементы.НастройкиСоединенияЯМ.Видимость = Видимость;
	Элементы.СлужебныйНастройкиЯМ.Видимость = Видимость;
	
	#КонецОбласти
	
	#Область Сбер
	
	Элементы.СберТокен.РежимПароля = РежимПароля;
	Элементы.НастройкиСоединенияСбер.Видимость = Видимость;
	Элементы.СлужебныйНастройкиСбер.Видимость = Видимость;
	
	#КонецОбласти
	
	#Область Али
	
	Элементы.АлиТокен.РежимПароля = РежимПароля;
	Элементы.НастройкиСоединенияАли.Видимость = Видимость;
	Элементы.СлужебныйНастройкиАли.Видимость = Видимость;
	
	#КонецОбласти
		
	#Область МВМ
	
	Элементы.МВМApiKey.РежимПароля = РежимПароля;
	Элементы.ГруппаМВМAccessToken.Видимость = Видимость;
	Элементы.ГруппаМВМRefreshToken.Видимость = Видимость;
	Элементы.НастройкиСоединенияМВМ.Видимость = Видимость;
	Элементы.СлужебныйНастройкиМВМ.Видимость = Видимость;
	
	#КонецОбласти
	
	#Область Ламода
	
	Элементы.ЛамодаClientSecret.РежимПароля = РежимПароля;
	Элементы.ГруппаЛамодаAccessTokenB2B.Видимость = Видимость;
	Элементы.ГруппаЛамодаAccessTokenSeller.Видимость = Видимость;
	Элементы.НастройкиСоединенияЛамода.Видимость = Видимость;
	Элементы.СлужебныйНастройкиЛамода.Видимость = Видимость;
	
	#КонецОбласти
	
	Элементы.ГруппаФункциональностьСлужебные.Видимость = Видимость;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.10.22 УА #50199

//+ ИнфоСофт Ивонин К.А. 28.09.23 УА #64020
&НаКлиенте
Процедура ЯМПолучитьТокен(Команда)
	ПерейтиПоНавигационнойСсылке("https://oauth.yandex.ru/authorize?response_type=token&client_id=" + ЯМClientID);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.09.23 УА #64020  

//+ ИнфоСофт Ивонин К.А. 28.09.23 УА #64020
&НаКлиенте
Процедура ВыбратьМагазин(Команда)
	
	Если Не ЗначениеЗаполнено(ЯМТокен) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сначала необходимо получить токен");
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать профиль");
		Возврат;
	КонецЕсли;
    
    ПараметрыОткрытия = Новый Структура;
    ПараметрыОткрытия.Вставить("Профиль", Объект.Ссылка);
    
	ОткрытьФорму("Справочник.ИС_WB_Профили.Форма.ЯМФормаВыбораМагазина", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.09.23 УА #64020

//+ ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621
&НаКлиенте
Процедура ЗагрузитьДанныеОк(Команда)
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать профиль");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
    ПараметрыОткрытия.Вставить("Профиль", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("МП", ПредопределенноеЗначение("Перечисление.ИС_МП_Маркетплейсы.ВБ"));
    
	ОткрытьФорму("Справочник.ИС_WB_Профили.Форма.ВБФормаЗагрузкиДанныхОК", ПараметрыОткрытия, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621

//+ ИнфоСофт Стояк Ю.К. 25.03.2024 УА #62623                  
&НаКлиенте
Процедура ЗагрузитьДанныеУслугOzon(Команда)
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать профиль");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
    ПараметрыОткрытия.Вставить("Профиль", Объект.Ссылка);                       	
	ПараметрыОткрытия.Вставить("МП", ПредопределенноеЗначение("Перечисление.ИС_МП_Маркетплейсы.Озон"));
	    
	ОткрытьФорму("Справочник.ИС_WB_Профили.Форма.ВБФормаЗагрузкиДанныхОК", ПараметрыОткрытия, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.03.2024 УА #62623

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 16.01.25 УА #89159
&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ТипЭлементОтбораКомпоновкиДанных = Тип("ЭлементОтбораКомпоновкиДанных");
	ОформлениеЦветТекста = "ЦветТекста";
	ОформлениеФормат = "Формат";
	ФорматНуля = "ЧН=0";
	
    // Истекший токен ВБ
    
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТокеныВБ");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТокеныВБ.ДатаОкончания");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = ТекущаяДатаСеанса();

	Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, ЦветаСтиля.ЦветОсобогоТекста);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #86001
&НаСервере   
Процедура ОпределитьИнтегрируемыеМаркетплейсы()
	
	ИнтегрируемыеМаркетплейсы = ИС_МП_Сервер.ИнтегрируемыеМаркетплейсы();
	
	Для Каждого Элемент Из ИнтегрируемыеМаркетплейсы Цикл 
		ИмяСтраницы = "Страница" + Элемент;
		Элементы[ИмяСтраницы].Видимость = Объект["Интеграция" + Элемент];
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #86001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #86001
&НаСервере   
Процедура ПолучитьНастройкиМаркетплейсов()
	
	ИнтегрируемыеМаркетплейсы = ИС_МП_Сервер.ИнтегрируемыеМаркетплейсы();
	
	Для Каждого Элемент Из ИнтегрируемыеМаркетплейсы Цикл
		
		Если Объект["Интеграция" + Элемент] Тогда
			ИС_МП_Сервер.ПолучитьНастройкиМакетплейсов(ЭтотОбъект, Элемент);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьТаблицуТокеновВБ();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаКлиенте
Процедура УправлениеФормой() 
	
	Если ОбработкаВыгрузкиОбъявленийЗагружена Тогда
		
		Элементы.ИнформацияОбОбработке.Заголовок = "Обработка запуска регламентных заданий установлена";
		Элементы.УстановитьОбработку.Видимость = Ложь;
		
		ВидимостьНастройкиРасписания = ЗначениеЗаполнено(Объект.Ссылка);
	
	Иначе
		
		Элементы.ИнформацияОбОбработке.Заголовок = "Обработка запуска регламентных заданий НЕ установлена";
		Элементы.ИнформацияОбОбработке.ЦветТекста = Новый Цвет(255, 0, 0);
		Элементы.УстановитьОбработку.Видимость = Истина;
		
		ВидимостьНастройкиРасписания = Ложь;
		
	КонецЕсли;
	
	Элементы.ГруппаРегламентныеЗадания.Видимость = ВидимостьНастройкиРасписания;
	Элементы.ВремяОтсчета.Видимость = Объект.РассчитыватьДатыОтгрузки;
	Элементы.КоличествоДнейКОтгрузке.Видимость = Объект.РассчитыватьДатыОтгрузки;
	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Если Объект.РежимСозданияЗаказов = 2 Тогда
		
		Элементы.ИспользоватьРазбиениеПоСкладамВБ.Видимость = Истина;
		
		Если Не Объект.ИспользоватьРазбиениеПоСкладам Тогда
			Элементы.АктивныйЗаказКлиента.Видимость = Истина;
		Иначе
			Элементы.АктивныйЗаказКлиента.Видимость = Ложь;
		КонецЕсли;
		//+ ИнфоСофт Стояк Ю.К. 13.11.2023 УА #62353		
		Если Объект.АвтоматическиДобавлятьВПоставку Тогда  
			Элементы.Поставка.Видимость = Истина;
			Элементы.ПоставкаКГТ.Видимость = Истина;
		КонецЕсли;                                  
		//- ИнфоСофт Стояк Ю.К. 13.11.2023 УА #62353
	Иначе
		Элементы.АктивныйЗаказКлиента.Видимость = Ложь;
		Элементы.ИспользоватьРазбиениеПоСкладамВБ.Видимость = Ложь;
	КонецЕсли;
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	
	//+ ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146	
	Если РежимСозданияЗаказовOzon = 2 Тогда
		Элементы.ФормироватьЕдиныйЗаказБезРазбиенияOzon.Видимость = Истина;
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Элементы.ЗакрытиеЗаказаПоДатеОтгрузкиOzon.Видимость = Истина;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		Элементы.ИспользоватьРазбиениеПоСкладамOzon.Видимость = Истина;
		//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Иначе
		Элементы.ФормироватьЕдиныйЗаказБезРазбиенияOzon.Видимость = Ложь;
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Элементы.ЗакрытиеЗаказаПоДатеОтгрузкиOzon.Видимость = Ложь;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		Элементы.ИспользоватьРазбиениеПоСкладамOzon.Видимость = Ложь;
		//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	КонецЕсли; 
	
	Если РежимСозданияЗаказовЯМ = 2 Тогда
		Элементы.ФормироватьЕдиныйЗаказБезРазбиенияЯМ.Видимость = Истина;
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Элементы.ЗакрытиеЗаказаПоДатеОтгрузкиЯМ.Видимость = Истина;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		Элементы.ИспользоватьРазбиениеПоСкладамЯМ.Видимость = Истина;
		//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Иначе
		Элементы.ФормироватьЕдиныйЗаказБезРазбиенияЯМ.Видимость = Ложь;
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Элементы.ЗакрытиеЗаказаПоДатеОтгрузкиЯМ.Видимость = Ложь;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		Элементы.ИспользоватьРазбиениеПоСкладамЯМ.Видимость = Ложь;
		//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	КонецЕсли;

	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Если ФормироватьЕдиныйЗаказБезРазбиенияOzon И НЕ ИспользоватьРазбиениеПоСкладамOzon Тогда
		Элементы.АктивныйЗаказКлиентаOzon.Видимость = Истина;
	Иначе
		Элементы.АктивныйЗаказКлиентаOzon.Видимость = Ложь; 
	КонецЕсли;
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424

	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Если ФормироватьЕдиныйЗаказБезРазбиенияЯМ И НЕ ИспользоватьРазбиениеПоСкладамЯМ Тогда
		Элементы.АктивныйЗаказКлиентаЯМ.Видимость = Истина;
	Иначе
		Элементы.АктивныйЗаказКлиентаЯМ.Видимость = Ложь; 
	КонецЕсли;
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424 
	
	//+ ИнфоСофт Стояк Ю.К. 11.03.2024 УА #56408
	Если РежимСозданияЗаказовАли = 2 Тогда
		Элементы.АктивныйЗаказКлиентаАли.Видимость = Истина;
	Иначе
		Элементы.АктивныйЗаказКлиентаАли.Видимость = Ложь; 
	КонецЕсли;
	
	Если ФормироватьЕдиныйЗаказБезРазбиенияАли Тогда
		Элементы.ФормироватьЕдиныйЗаказБезРазбиенияАли.Видимость = Истина;
	Иначе
		Элементы.ФормироватьЕдиныйЗаказБезРазбиенияАли.Видимость = Ложь; 
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 11.03.2024 УА #56408 
	
	//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
	Если СберРежимСозданияЗаказов = 2 Тогда 
		
		Элементы.СберФормироватьЕдиныйЗаказБезРазбиения.Видимость = Истина;
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Элементы.СберЗакрытиеЗаказаПоДатеОтгрузки.Видимость = Истина;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175

		
		Если СберФормироватьЕдиныйЗаказБезРазбиения Тогда
			Элементы.СберАктивныйЗаказКлиента.Видимость = Истина;
		Иначе
			Элементы.СберАктивныйЗаказКлиента.Видимость = Ложь; 
		КонецЕсли; 
		
	Иначе
		Элементы.СберФормироватьЕдиныйЗаказБезРазбиения.Видимость = Ложь;
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Элементы.СберЗакрытиеЗаказаПоДатеОтгрузки.Видимость = Ложь;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175

	КонецЕсли;	
	//- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
	
	//+ ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	Если УдалятьРТУOzon Тогда
		Элементы.ПроверятьДатуПередУдалениемOzon.Видимость = Истина;
	Иначе
		Элементы.ПроверятьДатуПередУдалениемOzon.Видимость = Ложь;
	КонецЕсли;
	
	Если УдалятьРТУЯМ Тогда
		Элементы.ПроверятьДатуПередУдалениемЯМ.Видимость = Истина;
	Иначе
		Элементы.ПроверятьДатуПередУдалениемЯМ.Видимость = Ложь;
	КонецЕсли; 
	
	Если СберУдалятьРТУ Тогда
		Элементы.СберПроверятьДатуПередУдалением.Видимость = Истина;
	Иначе
		Элементы.СберПроверятьДатуПередУдалением.Видимость = Ложь;
	КонецЕсли; 
	
	//- ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	
	ИзменитьЗначениеСкрываемогоОстатка();
	
	УправлениеФормойНаСервере();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 07.02.23 УА #53535
&НаСервере   
Процедура УправлениеФормойНаСервере()
	
	Элементы.ГруппаФункциональностьСлужебные.Видимость = Ложь; 
	
	Перечисления.СтатусыЗаказовКлиентов.ЗаполнитьСписокВыбора(Элементы.СтатусЗаказаКлиента.СписокВыбора, Объект.СтатусЗаказаКлиента);
	
	//+ ИнфоСофт Стояк Ю.К. 25.04.2023 УА #58008 
	Если Не Константы.ИспользоватьСоглашенияСКлиентами.Получить() Тогда
		Элементы.Соглашение.Видимость = Ложь;	
		Элементы.СоглашениеOzon.Видимость = Ложь;
		Элементы.СоглашениеЯМ.Видимость = Ложь;
		//+ ИнфоСофт Стояк Ю.К. 11.03.2024 УА #56408		
		Элементы.СоглашениеАли.Видимость = Ложь;    
		//- ИнфоСофт Стояк Ю.К. 11.03.2024 УА #56408
	КонецЕсли; 
	
	Если Не Константы.ИспользоватьДоговорыСКлиентами.Получить() Тогда
		Элементы.Договор.Видимость = Ложь;	
		Элементы.ДоговорOzon.Видимость = Ложь;
		Элементы.ДоговорЯМ.Видимость = Ложь;
		//+ ИнфоСофт Стояк Ю.К. 11.03.2024 УА #56408
		Элементы.ДоговорАли.Видимость = Ложь;
		//- ИнфоСофт Стояк Ю.К. 11.03.2024 УА #56408
	КонецЕсли;
	
	Если Не Константы.ИспользоватьРасширенныеВозможностиЗаказаКлиента.Получить() Тогда
		Элементы.СтатусЗаказаКлиента.Видимость = Ложь;
	КонецЕсли;
	
	Если Не Константы.ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента.Получить() Тогда
		Элементы.ВариантОбеспечения.Видимость = Ложь;
		//+ ИнфоСофт Стояк Ю.К. 21.03.2025 УА #96695 
		Элементы.ВариантОбеспеченияOzon.Видимость = Ложь;
		Элементы.ВариантОбеспеченияЯМ.Видимость = Ложь;
		Элементы.ВариантОбеспеченияАли.Видимость = Ложь;
		Элементы.СберВариантОбеспечения.Видимость = Ложь;
		//- ИнфоСофт Стояк Ю.К. 21.03.2025 УА #96695
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 25.04.2023 УА #58008
	//+ ИнфоСофт Стояк Ю.К. 17.08.2023 УА #61318	
	Если Не Константы.ИспользоватьПричиныОтменыЗаказовКлиентов.Получить() Тогда
		Элементы.ПричинаОтменыЯМ.Видимость = Ложь;
		//+ ИнфоСофт Мурсалимов Д.Р. 12.02.24 УА #63850
		Элементы.ПричинаОтменыOzon.Видимость = Ложь;
		//- ИнфоСофт Мурсалимов Д.Р. 12.02.24 УА #63850
	КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 17.08.2023 УА #61318
	
	КомиссионныеПродажи = ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриПродажах");
	
	Если Не КомиссионныеПродажи Тогда
		Элементы.ГруппаДекорацияОтключенаКомиссионнаяТорговля.Видимость = Истина;
		Возврат;
	КонецЕсли; 	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 24.06.22 УА #46999
&НаКлиенте
Процедура УстановитьНастройкиСоединенияПоУмолчанию()

	Объект.Порт = 443;
	Объект.ЗащищенноеСоединение = Истина;
	
	Объект.КоличествоЭлементовНаЗапрос = 100;
	Объект.КоличествоОшибокЗапросов = 10;  
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800	
	//OzonКоличествоДнейОбновлениеСтатусов = 7;   	
	//ЯндексКоличествоДнейОбновлениеСтатусов = 30;
	Объект.КоличествоДнейОбновлениеСтатусов = 30;
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	//OzonАдресСервисаAPI = "api-seller.ozon.ru";	
	
	//ЯМАдресСервисаAPI = "api.partner.market.yandex.ru";	
	//ЯМКлиентID = "f445d92bb14c4f5abb2539b7197f0d33";		
	
	//СберАдресСервисаAPI = "partner.sbermegamarket.ru";
	//СберАдресСервисаAPI = "api.megamarket.tech";
	
	//АлиАдресСервисаAPI = "openapi.aliexpress.ru";
	
	//+ ИнфоСофт Стояк Ю.К. 26.11.2024 УА #87103
	//OzonАвтоприменениеАкций = "UNKNOWN"; 
	//OzonАвтоприменениеСтратегийЦены = "UNKNOWN";
	//- ИнфоСофт Стояк Ю.К. 26.11.2024 УА #87103
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.06.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 07.12.22 УА #52566
&НаСервере
Процедура ЗаполнитьНастройкиРегламентныхЗаданий()
	
	ОбработкаВыгрузкиОбъявленийЗагружена = 
		ИС_MP_РаботаСРегламентнымиЗаданиями.ОбработкаЗапускаРегламентныхЗаданийЗагружена(ОбработкаВыгрузкиОбъявлений);
	
	Если Не ОбработкаВыгрузкиОбъявленийЗагружена Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНастройкуРегламентныхЗаданий("ПолучениеКарточекТоваров");
	ЗаполнитьНастройкуРегламентныхЗаданий("ПолучениеСборочныхЗаданий");
	ЗаполнитьНастройкуРегламентныхЗаданий("ОбновлениеСтатусовСборочныхЗаданий");
	ЗаполнитьНастройкуРегламентныхЗаданий("ОбновлениеПоставок");
	//+ ИнфоСофт Мурсалимов Д.Р. 02.04.24 УА #72003
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаЦенИСкидок");
	//ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаЦен"); 
	//- ИнфоСофт Мурсалимов Д.Р. 02.04.24 УА #72003
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаОстатков");
	ЗаполнитьНастройкуРегламентныхЗаданий("ЗакрыватьЗаказВТечениеДня");
	ЗаполнитьНастройкуРегламентныхЗаданий("ЗагружатьДанныеОК");
	//+ ИнфоСофт Стояк Ю.К. 01.03.2023 УА #54628	
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаЦенЯМ");
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаЦенOzon");
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаОстатковЯМ");
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаОстатковOzon");
	
	#Область МегаМаркет 
	
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаЦенСбер");
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаОстатковСбер");
	ЗаполнитьНастройкуРегламентныхЗаданий("СберЗагрузкаОтправлений");
	ЗаполнитьНастройкуРегламентныхЗаданий("СберОбновлениеСтатусов");
	
	//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
	ЗаполнитьНастройкуРегламентныхЗаданий("СберЗакрыватьЗаказВТечениеДня");
	//- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
		
	#КонецОбласти
	
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаЦенАли");
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаОстатковАли");
	
	ЗаполнитьНастройкуРегламентныхЗаданий("ПолучениеСборочныхЗаданийOzon");
	ЗаполнитьНастройкуРегламентныхЗаданий("ОбновлениеСтатусовСборочныхЗаданийOzon");
	ЗаполнитьНастройкуРегламентныхЗаданий("ЗакрыватьЗаказВТечениеДняOzon"); 
	
	//+ ИнфоСофт Стояк Ю.К. 12.02.2024 УА #70009                         
	ЗаполнитьНастройкуРегламентныхЗаданий("ПолучениеКарточекТоваровЯМ");
	//- ИнфоСофт Стояк Ю.К. 12.02.2024 УА #70009
	ЗаполнитьНастройкуРегламентныхЗаданий("ПолучениеСборочныхЗаданийЯМ");
	ЗаполнитьНастройкуРегламентныхЗаданий("ОбновлениеСтатусовСборочныхЗаданийЯМ");
	ЗаполнитьНастройкуРегламентныхЗаданий("ЗакрыватьЗаказВТечениеДняЯМ");
 	//- ИнфоСофт Стояк Ю.К. 01.03.2023 УА #54628  
	//+ ИнфоСофт Сумин Д.В. 23.05.2023 УА #58355
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыполнениеАлгоритмаПоОсновнойСхемеFbo");
	//- ИнфоСофт Сумин Д.В. 23.05.2023 УА #58355
	//+ ИнфоСофт Стояк Ю.К. 27.10.2023 УА #62964
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаСкидок");
	//- ИнфоСофт Стояк Ю.К. 27.10.2023 УА #62964
	//+ ИнфоСофт Стояк Ю.К. 01.11.2023 УА #62748
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыполнениеАлгоритмаПоОсновнойСхемеFboOzon");
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыполнениеАлгоритмаПоОсновнойСхемеFboЯМ");
	ЗаполнитьНастройкуРегламентныхЗаданий("ПолучитьОстаткиFBO");
	//- ИнфоСофт Стояк Ю.К. 01.11.2023 УА #62748
	//+ ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
	ЗаполнитьНастройкуРегламентныхЗаданий("ПолучениеСборочныхЗаданийАли");
	ЗаполнитьНастройкуРегламентныхЗаданий("ОбновлениеСтатусовСборочныхЗаданийАли");
	ЗаполнитьНастройкуРегламентныхЗаданий("ЗакрыватьЗаказВТечениеДняАли");
	//- ИнфоСофт Стояк Ю.К. 04.03.2024 УА #56408
	
	//+ ИнфоСофт Стояк Ю.К. 25.03.2024 УА #62623
	ЗаполнитьНастройкуРегламентныхЗаданий("ЗагружатьДанныеУслугOzon");
	//- ИнфоСофт Стояк Ю.К. 25.03.2024 УА #62623
	
	#Область МВМ                                                      
	
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаОстатковМВМ");
	
	#КонецОбласти
	
	#Область Ламода                                                      
	
	ЗаполнитьНастройкуРегламентныхЗаданий("ВыгрузкаОстатковЛамода");
	
	#КонецОбласти
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.12.22 УА #52566

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаСервере
Процедура ЗаполнитьНастройкуРегламентныхЗаданий(ИдентификаторКоманды) 
		
	РегламентноеЗаданиеGUID = 
		ИС_MP_РаботаСРегламентнымиЗаданиями.ПолучитьGUIDЗадания(Объект.Ссылка, ИдентификаторКоманды);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗаданиеGUID);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Задание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементФормы = Элементы["Расписание" + ИдентификаторКоманды];
	
	ЭтотОбъект[ИдентификаторКоманды] = Задание.Использование;
	Если ЭтотОбъект[ИдентификаторКоманды] Тогда
		ЭлементФормы.Видимость = Истина;
		ЭлементФормы.Заголовок = Задание.Расписание;
	КонецЕсли;
	
	Если Задание.ПоследнееЗадание <> Неопределено Тогда
		
		Элементы["Дата" + ИдентификаторКоманды].Видимость = Истина;
		Элементы["Состояние" + ИдентификаторКоманды].Видимость = Истина;  
		
		Если Задание.ПоследнееЗадание.Конец <> Неопределено Тогда 
			ЭтотОбъект["Дата" + ИдентификаторКоманды] = ИС_МП_Сервер.ЛокализоватьДату(Задание.ПоследнееЗадание.Конец);
		КонецЕсли;
		
		Если Задание.ПоследнееЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Элементы["Состояние" + ИдентификаторКоманды].Картинка = БиблиотекаКартинок.ОформлениеКругЗаполненный;
		ИначеЕсли Задание.ПоследнееЗадание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Элементы["Состояние" + ИдентификаторКоманды].Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
		ИначеЕсли Задание.ПоследнееЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			Элементы["Состояние" + ИдентификаторКоманды].Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
		Иначе
			Элементы["Состояние" + ИдентификаторКоманды].Картинка = БиблиотекаКартинок.ОформлениеКругЖелтый;
		КонецЕсли;
			
	КонецЕсли; 

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 07.12.22 УА #52566
&НаСервере
Процедура ИзменитьРеглЗаданиеНаСервере(ИдентификаторКоманды)
		
	ИС_MP_РаботаСРегламентнымиЗаданиями.УстановитьРеглЗаданиеИДобавитьКоманду(
		Объект.Ссылка, ИдентификаторКоманды, ЭтотОбъект[ИдентификаторКоманды]);
		
	ЭлементФормы = Элементы["Расписание" + ИдентификаторКоманды];
	ЭлементФормы.Видимость = ЭтотОбъект[ИдентификаторКоманды];
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.12.22 УА #52566

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаКлиенте
Процедура УстановитьРасписание(ИдентификаторКоманды) 
	
	РегламентноеЗаданиеGUID = 
		ИС_MP_РаботаСРегламентнымиЗаданиями.ПолучитьGUIDЗадания(Объект.Ссылка, ИдентификаторКоманды);
	Расписание = ПолучитьРасписаниеВыгрузки(РегламентноеЗаданиеGUID);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдентификаторКоманды", ИдентификаторКоманды);
	ДопПараметры.Вставить("РегламентноеЗаданиеGUID", РегламентноеЗаданиеGUID);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеИзмененияРасписания", ЭтотОбъект, ДопПараметры);
				
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	ДиалогРасписания.Показать(ОписаниеОповещения);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаСервереБезКонтекста
Функция ПолучитьРасписаниеВыгрузки(РегламентноеЗаданиеGUID) 

	Расписание = Новый РасписаниеРегламентногоЗадания;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗаданиеGUID);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Если РегламентноеЗадание <> Неопределено Тогда
		Расписание = РегламентноеЗадание.Расписание;
	КонецЕсли;
	
	Возврат Расписание;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаКлиенте
Процедура ПослеИзмененияРасписания(Расписание, ДопПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Представление = ИзменитьРасписание(ДопПараметры.РегламентноеЗаданиеGUID, Расписание);
	
	ЭлементФормы = Элементы["Расписание" + ДопПараметры.ИдентификаторКоманды];
	ЭлементФормы.Заголовок = Представление;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаСервереБезКонтекста
Функция ИзменитьРасписание(РегламентноеЗаданиеGUID, Расписание) 
	
	Представление = ИС_MP_РаботаСРегламентнымиЗаданиями.ИзменитьРасписание(РегламентноеЗаданиеGUID, Расписание);
	
	Возврат Представление;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаСервере
Процедура ОбновитьОбработкуЗапускаРегламентныхЗаданийНаСервере()
	
	Результат = ИС_MP_РаботаСРегламентнымиЗаданиями.ЗагрузитьОбработкуЗапускаРегламентныхЗаданий();
	ОбработкаСсылка = Результат.ОбработкаСсылка;
	
	ОбработкаОбъект = ОбработкаСсылка.ПолучитьОбъект();
	ОбработкаОбъект.Команды.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_РегламентныеЗадания.Профиль КАК Профиль,
	|	ИС_WB_РегламентныеЗадания.ИдентификаторКоманды КАК ИдентификаторКоманды,
	|	ИС_WB_РегламентныеЗадания.ИдентификаторЗадания КАК ИдентификаторЗадания
	|ИЗ
	|	РегистрСведений.ИС_WB_РегламентныеЗадания КАК ИС_WB_РегламентныеЗадания";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		НоваяКоманда = ОбработкаОбъект.Команды.Добавить();
		НоваяКоманда.Представление  = СтрШаблон("Профиль (%1): %2", Выборка.Профиль, Выборка.ИдентификаторКоманды);
		НоваяКоманда.Идентификатор 	= Выборка.ИдентификаторКоманды;
		НоваяКоманда.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода;
		НоваяКоманда.РегламентноеЗаданиеGUID = Выборка.ИдентификаторЗадания;
		
	КонецЦикла;
	
	Попытка
		ОбработкаОбъект.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Стояк Ю.К. 21.02.2023 УА #54628
&НаКлиенте
Процедура ЗаполнитьНастройки()

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
    
    МассивНаименованийРеквизитов = ПолучитьМассивНаименованийНастраиваемыхРеквизитов();

	Настройки = ПолучитьНастройки(Объект.Ссылка, МассивНаименованийРеквизитов);
	
	Если Настройки = Неопределено Тогда
		
		Для Каждого Элемент Из МассивНаименованийРеквизитов Цикл
			ЭтотОбъект[Элемент] = Неопределено;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Элемент Из МассивНаименованийРеквизитов Цикл
			ЭтотОбъект[Элемент] = Настройки[Элемент];
		КонецЦикла;
	
	КонецЕсли;
	
	//+ ИнфоСофт Сумин Д.В. 17.02.2024 УА #65888	
    ЗаполнитьНазначенияНаСервере();
	//- ИнфоСофт Сумин Д.В. 17.02.2024 УА #65888
	
	//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901 
	ПолучитьРеквизитыЦенНаСервере();
	//- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
	
	//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
	ПолучитьРеквизитыЗаказовНаСервере();           
	//- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.02.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.02.2023 УА #54628
&НаСервереБезКонтекста
Функция ПолучитьНастройки(ЛичныйКабинет, МассивНаименованийРеквизитов)	
	Возврат ИС_MP_Сервер.ПолучитьНастройки(ЛичныйКабинет, МассивНаименованийРеквизитов);	
КонецФункции //- ИнфоСофт Стояк Ю.К. 21.02.2023 УА #54628 

//+ ИнфоСофт Стояк Ю.К. 21.02.2023 УА #54628
&НаСервереБезКонтекста
Функция ПолучитьМассивНаименованийНастраиваемыхРеквизитов()

	Результат = Новый Массив;
	
	#Область WildBerries
		
	//+ ИнфоСофт Заварин К.В. 14.10.24 УА #85478
	Результат.Добавить("WildBerriesСтатьяЗадолженности");
	//- ИнфоСофт Заварин К.В. 14.10.24 УА #85478 
	
	//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
	Результат.Добавить("WildBerriesПроигрыватьЗвукиПриСканировании");
	//- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
	
	#КонецОбласти
	
	#Область Ozon
	
	Результат.Добавить("OzonАдресСервисаAPI");
	Результат.Добавить("OzonApiKey");
	Результат.Добавить("OzonClientID");
	//+ ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #66901
	Результат.Добавить("OzonВидЦены");
	Результат.Добавить("OzonВидЦеныСоСкидкой");
	Результат.Добавить("OzonВидЦеныМинимальный");
	Результат.Добавить("OzonРежимОкругленияЦен");
	//- ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #66901
	Результат.Добавить("АвтоматическиСоздаватьЗаказыOzon");
	Результат.Добавить("РежимСозданияЗаказовOzon");
	Результат.Добавить("АктивныйЗаказКлиентаOzon");
	Результат.Добавить("АвтоматическиСоздаватьРеализацииOzon");
	//+ ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113	
	//Результат.Добавить("КоличествоДнейКРеализацииOzon");
	Результат.Добавить("ДатаОтгрузкиИлиТекущаяДатаВРеализациюOzon");	
	//- ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	Результат.Добавить("КонтрагентOzon");	
	Результат.Добавить("ДоговорOzon");
	Результат.Добавить("ПартнерOzon");
	Результат.Добавить("СоглашениеOzon");
	Результат.Добавить("ПодразделениеOzon");
	Результат.Добавить("ПриоритетЗаказаOzon");
	Результат.Добавить("ВариантОбеспеченияOzon");
	Результат.Добавить("ФормироватьЕдиныйЗаказБезРазбиенияOzon");
	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Результат.Добавить("ИспользоватьРазбиениеПоСкладамOzon");
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	Результат.Добавить("ЗакрытиеЗаказаПоДатеОтгрузкиOzon");
	//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	Результат.Добавить("ПроводитьЗаказыOzon");
	Результат.Добавить("ПроводитьРеализацииOzon");
	//+ ИнфоСофт Мурсалимов Д.Р. 13.02.24 УА #63850
	Результат.Добавить("ПричинаОтменыOzon");
	Результат.Добавить("УдалятьРТУOzon");
	//- ИнфоСофт Мурсалимов Д.Р. 13.02.24 УА #63850
	
	//+ ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	Результат.Добавить("ПроверятьДатуПередУдалениемOzon");
	//- ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	
	//+ ИнфоСофт Мурсалимов Д.Р. 04.03.24 УА #67173
	Результат.Добавить("OzonСоздатьЗаказНаСборку");
	//- ИнфоСофт Мурсалимов Д.Р. 04.03.24 УА #67173
	//+ ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
	Результат.Добавить("ВариантОбеспеченияПриНехваткеOzon");
	Результат.Добавить("ИзменятьДатуОтгрузкиOzon");
	//- ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	Результат.Добавить("OzonКоличествоДнейОбновлениеСтатусов");
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	//+ ИнфоСофт Заварин К.В. 26.04.24 УА #69327
	Результат.Добавить("OzonАвтоматическиСобиратьЗаказы");
	//- ИнфоСофт Заварин К.В. 26.04.24 УА #69327 
		
	//+ ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87933
	Результат.Добавить("OzonСтатусЗаказа");	
	//- ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87933
	//+ ИнфоСофт Стояк Ю.К. 26.11.2024 УА #87103
	Результат.Добавить("OzonАвтоприменениеАкций");
	Результат.Добавить("OzonАвтоприменениеСтратегийЦены");
	//- ИнфоСофт Стояк Ю.К. 26.11.2024 УА #87103
	
	//+ ИнфоСофт Заварин К.В. 27.11.24 УА #74680
	Результат.Добавить("OzonСоглашениеРеализации");
	Результат.Добавить("OzonДоговорРеализации");
	Результат.Добавить("OzonСкладРеализации");
	//- ИнфоСофт Заварин К.В. 27.11.24 УА #74680
	
	//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
	Результат.Добавить("OzonРазнестиЗаказыПоКоличеству");
	Результат.Добавить("OzonПроигрыватьЗвукиПриСканировании");
	//- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
	
	//+ ИнфоСофт Заварин К.В. 11.02.25 УА #93503
	Результат.Добавить("OzonОтделятьТоварыПриНехватке");
	//- ИнфоСофт Заварин К.В. 11.02.25 УА #93503
	
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	Результат.Добавить("OzonРежимСозданияРеализаций");
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	
	#КонецОбласти 
	
	#Область Яндекс	
	
	Результат.Добавить("ЯМАдресСервисаAPI");
	Результат.Добавить("ЯМКампанияID");
	Результат.Добавить("ЯМClientID");
	Результат.Добавить("ЯМТокен");	
	Результат.Добавить("ЯМКодБизнеса");
	//+ ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #66901
	Результат.Добавить("ЯндексВидЦены");
	Результат.Добавить("ЯндексВидЦеныСоСкидкой");
	Результат.Добавить("ЯндексРежимОкругленияЦен");
	Результат.Добавить("ЯндексИспользоватьНовыеМетодыApi");
	//- ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #66901
	Результат.Добавить("АвтоматическиСоздаватьЗаказыЯМ");
	Результат.Добавить("РежимСозданияЗаказовЯМ");
	Результат.Добавить("АктивныйЗаказКлиентаЯМ");
	Результат.Добавить("РассчитыватьДатыОтгрузкиЯМ");
	Результат.Добавить("ВремяОтсчетаЯМ");
	//+ ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113	
	//Результат.Добавить("КоличествоДнейКОтгрузкеЯМ");
	//Результат.Добавить("КоличествоДнейКРеализацииЯМ");
	Результат.Добавить("ДатаОтгрузкиИлиТекущаяДатаВРеализациюЯМ");
	//- ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	Результат.Добавить("АвтоматическиСоздаватьРеализацииЯМ");	
	Результат.Добавить("ПартнерЯМ");
	Результат.Добавить("КонтрагентЯМ");
	Результат.Добавить("СоглашениеЯМ");
	Результат.Добавить("ДоговорЯМ");
	Результат.Добавить("ПодразделениеЯМ");
	Результат.Добавить("ПриоритетЗаказаЯМ");
	Результат.Добавить("СтатусЗаказаЯМ");
	Результат.Добавить("ПричинаОтменыЯМ");
	Результат.Добавить("УдалятьРТУЯМ");
	
	//+ ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	Результат.Добавить("ПроверятьДатуПередУдалениемЯМ");
	//- ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	
	Результат.Добавить("ПересчитыватьТоварПоКомплектамЯМ");
	//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	Результат.Добавить("ЗакрытиеЗаказаПоДатеОтгрузкиЯМ");
	//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	Результат.Добавить("ВариантОбеспеченияЯМ");
	Результат.Добавить("ФормироватьЕдиныйЗаказБезРазбиенияЯМ");
	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Результат.Добавить("ИспользоватьРазбиениеПоСкладамЯМ");
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Результат.Добавить("ПроводитьЗаказыЯМ");
	Результат.Добавить("ПроводитьРеализацииЯМ");
	Результат.Добавить("ПереводитьЗаказВГотовностьЯМ");
	//+ ИнфоСофт Мурсалимов Д.Р. 04.03.24 УА #67173
	Результат.Добавить("ЯМСоздатьЗаказНаСборку");
	//- ИнфоСофт Мурсалимов Д.Р. 04.03.24 УА #67173
	//+ ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
	Результат.Добавить("ВариантОбеспеченияПриНехваткеЯМ");	
	//- ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	Результат.Добавить("ЯндексКоличествоДнейОбновлениеСтатусов");
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
	Результат.Добавить("ЯндексМодельРаботы");
	//- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
		
	//+ ИнфоСофт Стояк Ю.К. 05.11.2024 УА #86321
	Результат.Добавить("ЯндексСоздаватьЗаказыПоЮрЛицам");  
	//- ИнфоСофт Стояк Ю.К. 05.11.2024 УА #86321
	
	//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
    Результат.Добавить("ЯндексРазнестиЗаказыПоКоличеству");
	Результат.Добавить("ЯндексПроигрыватьЗвукиПриСканировании");
	//- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
	
	//+ ИнфоСофт Власова И.С. 06.02.25 УА #83194
	Результат.Добавить("ЯндексЗаполнятьЦеныСУчетомСкидок");
	//- ИнфоСофт Власова И.С. 06.02.25 УА #83194
	
	//+ ИнфоСофт Заварин К.В. 13.02.25 УА #93503 
	Результат.Добавить("ЯндексОтделятьТоварыПриНехватке");
	//- ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	Результат.Добавить("ЯндексРежимСозданияРеализаций");
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	
	#КонецОбласти
	
	#Область Сбер
	
	Результат.Добавить("СберИдКабинета");
	Результат.Добавить("СберТокен");
	Результат.Добавить("СберАдресСервисаAPI");
	//+ ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #66901
	Результат.Добавить("СберВидЦены");
	Результат.Добавить("СберРежимОкругленияЦен"); 
	//- ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #66901
	Результат.Добавить("СберПартнер");
	Результат.Добавить("СберКонтрагент");
	Результат.Добавить("СберСоглашение");
	Результат.Добавить("СберДоговор");
	Результат.Добавить("СберПодразделение");
	Результат.Добавить("СберПриоритетЗаказа");
	Результат.Добавить("СберСоздаватьЗаказы");
	Результат.Добавить("СберСтатусЗаказаКлиента");
	Результат.Добавить("СберВариантОбеспечения");
	Результат.Добавить("СберРежимСозданияЗаказов");
	Результат.Добавить("СберПроводитьЗаказы");
	Результат.Добавить("СберСоздаватьРеализации");
	Результат.Добавить("СберПроводитьРеализации");
	//+ ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208
	Результат.Добавить("СберЦенаЛотаВЗаказ"); 
	//- ИнфоСофт Стояк Ю.К. 26.01.2024 УА #67208
	//+ ИнфоСофт Мурсалимов Д.Р. 04.03.24 УА #67173
	Результат.Добавить("СберСоздатьЗаказНаСборку");
	//- ИнфоСофт Мурсалимов Д.Р. 04.03.24 УА #67173
	//+ ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113	
	Результат.Добавить("СберДатаОтгрузкиИлиТекущаяДатаВРеализацию"); 	
	//- ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	//+ ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
	Результат.Добавить("СберВариантОбеспеченияПриНехватке");	
	//- ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
    
	//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	Результат.Добавить("СберЗакрытиеЗаказаПоДатеОтгрузки");
	//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	
	//+ ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
	Результат.Добавить("СберАктивныйЗаказКлиента");
	Результат.Добавить("СберФормироватьЕдиныйЗаказБезРазбиения");
	//- ИнфоСофт Стояк Ю.К. 09.04.2024 УА #73643
		
	//+ ИнфоСофт Заварин К.В. 26.09.24 УА #77549 
	Результат.Добавить("СберПричинаОтмены");
	Результат.Добавить("СберУдалятьРТУ");
	Результат.Добавить("СберПроверятьДатуПередУдалением");
	//- ИнфоСофт Заварин К.В. 26.09.24 УА #77549
	
	//+ ИнфоСофт Заварин К.В. 30.09.24 УА #72472 
	Результат.Добавить("СберАвтоматическиПодтверждатьЗаказы");
	//- ИнфоСофт Заварин К.В. 30.09.24 УА #72472
	
	//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
	Результат.Добавить("СберПроигрыватьЗвукиПриСканировании");
	//- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
	
	//+ ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	Результат.Добавить("СберОтделятьТоварыПриНехватке");
	//- ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	
	#КонецОбласти
	
	#Область Ali
	
	Результат.Добавить("АлиТокен");
	Результат.Добавить("АлиАдресСервисаAPI");
	//+ ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #66901
	Результат.Добавить("AliexpressВидЦены");
	Результат.Добавить("AliexpressВидЦеныСоСкидкой"); 
	Результат.Добавить("AliexpressРежимОкругленияЦен");
	//- ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #66901 
	//+ ИнфоСофт Мурсалимов Д.Р. 04.03.24 УА #67173
	Результат.Добавить("АлиСоздатьЗаказНаСборку");
	//- ИнфоСофт Мурсалимов Д.Р. 04.03.24 УА #67173
	//+ ИнфоСофт Стояк Ю.К. 11.03.2024 УА #56408	
	Результат.Добавить("ПартнерАли");
	Результат.Добавить("КонтрагентАли");
	Результат.Добавить("СоглашениеАли");
	Результат.Добавить("ДоговорАли");
	Результат.Добавить("ПодразделениеАли");
	Результат.Добавить("ПриоритетЗаказаАли");
	Результат.Добавить("АвтоматическиСоздаватьЗаказыАли");
	Результат.Добавить("СтатусЗаказаАли");
	Результат.Добавить("ВариантОбеспеченияАли");
	Результат.Добавить("РежимСозданияЗаказовАли");
	Результат.Добавить("ПроводитьЗаказыАли");
	Результат.Добавить("АвтоматическиСоздаватьРеализацииАли");
	Результат.Добавить("ПроводитьРеализацииАли");
	
	Результат.Добавить("АктивныйЗаказКлиентаАли");	
	Результат.Добавить("ФормироватьЕдиныйЗаказБезРазбиенияАли");
	Результат.Добавить("ДатаОтгрузкиИлиТекущаяДатаВРеализациюАли");
	//- ИнфоСофт Стояк Ю.К. 11.03.2024 УА #56408
	//+ ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
	Результат.Добавить("ВариантОбеспеченияПриНехваткеАли");	
	//- ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
		
	//+ ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	Результат.Добавить("AliexpressОтделятьТоварыПриНехватке");
	//- ИнфоСофт Заварин К.В. 13.02.25 УА #93503
	
	#КонецОбласти          
	             
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 21.02.2023 УА #54628 

//+ ИнфоСофт Стояк Ю.К. 21.02.2023 УА #54628
&НаСервере
Процедура ЗаписатьНаСервере()

	МассивНаименованийРеквизитов = ПолучитьМассивНаименованийНастраиваемыхРеквизитов();
	СоответствиеПараметровЗаписи = Новый Соответствие;
	
	Для Каждого Элемент Из МассивНаименованийРеквизитов Цикл
		СоответствиеПараметровЗаписи.Вставить(Элемент, ЭтотОбъект[Элемент]);
	КонецЦикла;  
		
	ИС_MP_Сервер.ЗаписатьНастройкиСправочника(Объект.Ссылка, СоответствиеПараметровЗаписи);
		
	//+ ИнфоСофт Сумин Д.В. 17.02.2024 УА #65888
	//Пока склад по СМ определяется в профиле, храним назначения в справочнике ИС_MP_Настройки
	ЗаписатьНастройкиНазначения();
	//+ ИнфоСофт Сумин Д.В. 17.02.2024 УА #65888

	//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
	ИнтегрируемыеМаркетплейсы = ИС_МП_Сервер.ИнтегрируемыеМаркетплейсы();
	
	Для Каждого Элемент Из ИнтегрируемыеМаркетплейсы Цикл
		
		Если Объект["Интеграция" + Элемент] Тогда
			ИС_МП_Сервер.ЗаписатьНастройкиМаркетплейсов(ЭтотОбъект, Элемент);
		КонецЕсли;
		
	КонецЦикла;
	//- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
	
	//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
	ИС_МП_УправлениеЦенами.ЗаписатьРеквизитыЦен(Объект.Ссылка, ЭтотОбъект);
	//- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
	
	//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
	ИС_МП_УправлениеЗаказами.ЗаписатьРеквизитыЗаказов(Объект.Ссылка, ЭтотОбъект);                       
	//- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
	
	//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
	//WildBerries	
	СтруктураПараметровWB = Новый Структура;
	СтруктураПараметровWB.Вставить("ПроигрыватьЗвукиПриСканировании", ЭтотОбъект.WildBerriesПроигрыватьЗвукиПриСканировании);
	//+ ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
	//СтруктураПараметровWB.Вставить("ЗагружатьЗаказыПоСхемеФБО", ВБЗагружатьЗаказыПоСхемеФБО);
	//- ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
	Настройки = ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Объект.Ссылка, Перечисления.ИС_МП_Маркетплейсы.ВБ, СтруктураПараметровWB);
	
	//Ozon
	СтруктураПараметровOzon = Новый Структура;
	СтруктураПараметровOzon.Вставить("РазнестиЗаказыПоКоличеству", ЭтотОбъект.OzonРазнестиЗаказыПоКоличеству);
	СтруктураПараметровOzon.Вставить("ПроигрыватьЗвукиПриСканировании", ЭтотОбъект.OzonПроигрыватьЗвукиПриСканировании);
	//+ ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
	//СтруктураПараметровWB.Вставить("ЗагружатьЗаказыПоСхемеФБО", ОзонЗагружатьЗаказыПоСхемеФБО);
	//- ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
	Настройки = ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Объект.Ссылка, Перечисления.ИС_МП_Маркетплейсы.Озон, СтруктураПараметровOzon);
	
	//Яндекс
	СтруктураПараметровЯМ = Новый Структура;
	СтруктураПараметровЯМ.Вставить("РазнестиЗаказыПоКоличеству", ЭтотОбъект.ЯндексРазнестиЗаказыПоКоличеству);
	СтруктураПараметровЯМ.Вставить("ПроигрыватьЗвукиПриСканировании", ЭтотОбъект.ЯндексПроигрыватьЗвукиПриСканировании);
	Настройки = ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Объект.Ссылка, Перечисления.ИС_МП_Маркетплейсы.ЯМ, СтруктураПараметровЯМ);
	
	//Сбер
	СтруктураПараметровСбер = Новый Структура;
	СтруктураПараметровСбер.Вставить("ПроигрыватьЗвукиПриСканировании", ЭтотОбъект.СберПроигрыватьЗвукиПриСканировании);
	Настрйоки = ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Объект.Ссылка, Перечисления.ИС_МП_Маркетплейсы.Сбер, СтруктураПараметровСбер);
	//- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.02.2023 УА #54628

//+ ИнфоСофт Ивонин К.А. 13.08.23 УА #61542
&НаКлиенте
Процедура ТестПодключенияСбер()
	
	Если ЗначениеЗаполнено(СберТокен) И ЗначениеЗаполнено(СберАдресСервисаAPI) Тогда	
		
		Результат = ТестПодключенияAPIСберНаСервере(Объект.Ссылка,
													СберТокен,
													СберАдресСервисаAPI,
													Объект.Порт,
													Объект.ЗащищенноеСоединение);
			
		Если Результат = Неопределено Тогда
			Текст = "Тест подключения API Сбер Мега Маркета не выполнен";
		ИначеЕсли Результат Тогда
			Текст = "Тест подключения API Сбер Мега Маркета успешно пройден";
		Иначе
			Текст = "Тест подключения API Сбер Мега Маркета не пройден, проверьте настройки подключения";
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
			
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнены данные сервиса API Сбер Мега Маркета, 
													|тест подключения не будет выполнен");
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.08.23 УА #61542

//+ ИнфоСофт Украинцева А.А. 30.11.2023 УА #62922
&НаКлиенте
Процедура ТестПодключенияOzon()  
	
	Если ЗначениеЗаполнено(OzonApiKey) И ЗначениеЗаполнено(OzonClientID) Тогда	
		
		Результат = ТестПодключенияOzonНаСервере();
		
		Если Результат = Неопределено Тогда
			Текст = "Тест подключения API Ozon не выполнен";
		ИначеЕсли ТипЗнч(Результат) = Тип("Соответствие") Тогда
			Текст = "Тест подключения API Ozon успешно пройден";
		Иначе
			Текст = "Тест подключения API Ozon не пройден, проверьте настройки подключения";
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнены данные сервиса API Ozon, 
														|тест подключения не будет выполнен");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Украинцева А.А. 30.11.2023 УА #62922  

//+ ИнфоСофт Украинцева А.А. 30.11.2023 УА #62922
&НаКлиенте
Процедура ТестПодключенияАли() 
	Если ЗначениеЗаполнено(АлиТокен) Тогда	
		
		Результат = ТестПодключенияAliexpressНаСервере();
		
		Если Результат = Неопределено Тогда
			Текст = "Тест подключения API Aliexpress не выполнен";
		ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда
			Текст = "Тест подключения API Aliexpress успешно пройден";
		Иначе
			Текст = "Тест подключения API Aliexpress не пройден, проверьте настройки подключения";
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнены данные сервиса API Aliexpress, 
														|тест подключения не будет выполнен");
	КонецЕсли; 
КонецПроцедуры //- ИнфоСофт Украинцева А.А. 30.11.2023 УА #62922   

//+ ИнфоСофт Украинцева А.А. 30.11.2023 УА #62922  
&НаСервере
Функция ТестПодключенияAliexpressНаСервере()   
	Возврат ИС_АЛИ_Сервер.ТестПодключенияAliexpressНаСервере(Объект.Ссылка)
КонецФункции //- ИнфоСофт Украинцева А.А. 30.11.2023 УА #62922

//+ ИнфоСофт Украинцева А.А. 30.11.2023 УА #62922
&НаСервере
Функция ТестПодключенияOzonНаСервере()       
	Возврат ИС_Ozon_Сервер.ЗагрузитьЛимитыСозданияИОбновленияТоваров(Объект.Ссылка);
КонецФункции //- ИнфоСофт Украинцева А.А. 30.11.2023 УА #62922 

//+ ИнфоСофт Ивонин К.А. 13.08.23 УА #61542
&НаСервереБезКонтекста
Функция ТестПодключенияAPIСберНаСервере(Профиль, Токен, Адрес, Порт, ЗащищенноеСоединение)				
    
    СтруктураПроверки = Новый Структура;
    СтруктураПроверки.Вставить("Профиль", Профиль);
	СтруктураПроверки.Вставить("Токен", Токен);
	СтруктураПроверки.Вставить("АдресСервиса", Адрес);
	СтруктураПроверки.Вставить("Порт", Порт);
	СтруктураПроверки.Вставить("ЗащищенноеСоединение", ЗащищенноеСоединение);
		
	Возврат ИС_Сбер_Сервер.ТестПодключенияAPI(СтруктураПроверки);	
			
КонецФункции //- ИнфоСофт Ивонин К.А. 13.08.23 УА #61542

//+ ИнфоСофт Ивонин К.А. 18.10.23 УА #61108
&НаКлиенте
Процедура ИзменитьЗначениеСкрываемогоОстатка()
		
	Если ВБРежимСокрытияОстатков Тогда
		Элементы.ВБСкрываемыйОстаток.МаксимальноеЗначение = 100;
	Иначе
		Элементы.ВБСкрываемыйОстаток.МаксимальноеЗначение = Неопределено;	
	КонецЕсли;
	
	Если ОзонРежимСокрытияОстатков Тогда
		Элементы.ОзонСкрываемыйОстаток.МаксимальноеЗначение = 100;
	Иначе
		Элементы.ОзонСкрываемыйОстаток.МаксимальноеЗначение = Неопределено;
	КонецЕсли;
	
	Если ЯМРежимСокрытияОстатков Тогда
		Элементы.ЯМСкрываемыйОстаток.МаксимальноеЗначение = 100;
	Иначе
		Элементы.ЯМСкрываемыйОстаток.МаксимальноеЗначение = Неопределено;
	КонецЕсли;
	
	Если СберРежимСокрытияОстатков Тогда
		Элементы.СберСкрываемыйОстаток.МаксимальноеЗначение = 100;
	Иначе
		Элементы.СберСкрываемыйОстаток.МаксимальноеЗначение = Неопределено;
	КонецЕсли;
	
	Если АлиРежимСокрытияОстатков Тогда
		Элементы.АлиСкрываемыйОстаток.МаксимальноеЗначение = 100;
	Иначе
		Элементы.АлиСкрываемыйОстаток.МаксимальноеЗначение = Неопределено;
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 18.10.23 УА #61108

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
&НаСервере
Процедура ПолучитьРеквизитыЦенНаСервере()
	ИС_МП_УправлениеЦенами.ПолучитьРеквизитыЦен(Объект.Ссылка, ЭтотОбъект);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
&НаСервере
Процедура ПолучитьРеквизитыЗаказовНаСервере()
	ИС_МП_УправлениеЗаказами.ПолучитьРеквизитыЗаказов(Объект.Ссылка, ЭтотОбъект);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277

//+ ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277
&НаСервере
Процедура ЗаписатьМодельРаботыМагазинаНаСервере(МодельРаботы)	
	ЯндексМодельРаботы = Перечисления.ИС_МП_МодельРаботы[МодельРаботы];	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 10.09.24 УА #83277

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
&НаСервереБезКонтекста   
Функция ТестПодключенияМаркетплейсов(Профиль, Маркетплейс, ПараметрыТеста)
	Возврат ИС_МП_Сервер.ТестПодключенияМаркетплейсов(Профиль, Маркетплейс, ПараметрыТеста);	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 16.01.25 УА #89159
&НаСервере   
Процедура ОбновитьТаблицуТокеновВБ()

	ТокеныВБ.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_МП_Токены.Добавлен КАК ДатаДобавления,
	|	ИС_МП_Токены.Токен КАК Токен,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.Контент КАК Контент,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.Аналитика КАК Аналитика,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.Цены КАК Цены,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.Маркетплейс КАК Маркетплейс,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.Статистика КАК Статистика,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.Продвижение КАК Продвижение,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.Вопросы КАК Вопросы,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.Чат КАК Чат,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.Поставки КАК Поставки,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.Возвраты КАК Возвраты,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.Документы КАК Документы,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.Тарифы КАК Тарифы,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.ТолькоЧтение КАК ТолькоЧтение,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.ТестовыйКонтур КАК ТестовыйКонтур,
	|	ИС_МП_ТокеныСвойстваТокенаВБ.ДатаОкончания КАК ДатаОкончания,
	|	ИС_МП_Токены.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_МП_Токены КАК ИС_МП_Токены
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_МП_Токены.СвойстваТокенаВБ КАК ИС_МП_ТокеныСвойстваТокенаВБ
	|		ПО ИС_МП_Токены.Ссылка = ИС_МП_ТокеныСвойстваТокенаВБ.Ссылка
	|ГДЕ
	|	НЕ ИС_МП_Токены.ПометкаУдаления
	|	И ИС_МП_Токены.Владелец = &Профиль
	|	И ИС_МП_Токены.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.ИС_МП_Маркетплейсы.ВБ)";
	
	Запрос.УстановитьПараметр("Профиль", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТокенов = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаТокенов.Следующий() Цикл
		НоваяСтрока = ТокеныВБ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТокенов);
	КонецЦикла;
	
КонецПроцедуры

//+ ИнфоСофт Ивонин К.А. 16.01.25 УА #89159
&НаКлиенте
Процедура СоздатьТокенВБ(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для добавления токена необходимо записать Профиль");
		Возврат;	
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Владелец", Объект.Ссылка);
	ЗначенияЗаполнения.Вставить("Маркетплейс", ПредопределенноеЗначение("Перечисление.ИС_МП_Маркетплейсы.ВБ"));
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменениеТокенаВБЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ИС_МП_Токены.Форма.ФормаЭлемента", ПараметрыФормы, 
		ЭтотОбъект, УникальныйИдентификатор, , , ОповещениеОЗакрытии);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 17.01.25 УА #89159
&НаКлиенте
Процедура РедактироватьТокенВБ(Команда)
	
	ТекущиеДанные = Элементы.ТокеныВБ.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменениеТокенаВБЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ИС_МП_Токены.Форма.ФормаЭлемента", ПараметрыФормы, 
		ЭтотОбъект, УникальныйИдентификатор, , , ОповещениеОЗакрытии);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 17.01.25 УА #89159
&НаКлиенте
Асинх Процедура УдалитьТокенВБ(Команда)
	
	ТекущиеДанные = Элементы.ТокеныВБ.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = Ждать ВопросАсинх("Уверены что хотите удалить токен?", РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Нет,
		"Удаление токена", КодВозвратаДиалога.Нет);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	УдалитьТокенНаСервере(ТекущиеДанные.Ссылка);
	ОбновитьТаблицуТокеновВБ();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
&НаСервереБезКонтекста
Процедура УдалитьТокенНаСервере(Ссылка)
	
	ТокенОбъект = Ссылка.ПолучитьОбъект();
	Попытка
		ТокенОбъект.Удалить();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 17.01.25 УА #89159
&НаКлиенте
Процедура ИзменениеТокенаВБЗавершение(Результат, ДопПараметры) Экспорт
	ОбновитьТаблицуТокеновВБ();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.01.25 УА #89159

//+ ИнфоСофт Сумин Д.В. 17.02.2024 УА #65888
&НаСервере
Процедура ЗаполнитьНазначенияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Хранилище КАК Хранилище
	|ИЗ
	|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.ЛичныйКабинет = &ЛичныйКабинет
	|	И ИС_MP_Настройки.Наименование = ""Назначение""";
	
	Запрос.УстановитьПараметр("ЛичныйКабинет", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Назначения = ВыборкаДетальныеЗаписи.Хранилище.Получить();	
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 17.02.2024 УА #65888

//+ ИнфоСофт Сумин Д.В. 17.02.2024 УА #65888
&НаСервере
Процедура ЗаписатьНастройкиНазначения() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.Наименование = ""Назначение""
	|	И ИС_MP_Настройки.ЛичныйКабинет = &ЛичныйКабинет";
	
	Запрос.УстановитьПараметр("ЛичныйКабинет", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЭлементСправочника = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Иначе
		ЭлементСправочника = Справочники.ИС_MP_Настройки.СоздатьЭлемент();	
	КонецЕсли;	
	
	ЭлементСправочника.Наименование = "Назначение";
	ЭлементСправочника.ЛичныйКабинет = Объект.Ссылка; 
	
	Хранилище = Новый ХранилищеЗначения(Назначения);
	ЭлементСправочника.Хранилище = Хранилище;
	
	ЭлементСправочника.Записать();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 17.02.2024 УА #65888 

#КонецОбласти
