
//+ ИнфоСофт Конышев А.Е. 28.11.24 УА #72929
&НаКлиенте
Процедура УдалитьСборочныеЗадания(Команда)	
	
	Результат = Новый Структура;
	
	ТекстОшибки = "Неверно задан период!";
	Если НачалоПериода > КонецПериода Тогда
		Статус = "Ошибка";
		ПодробноеПредставлениеОшибки = ТекстОшибки;
	КонецЕсли;
	
	Если НачалоПериода = Неопределено Тогда
		Статус = "Ошибка";
		ПодробноеПредставлениеОшибки = ТекстОшибки;
	КонецЕсли;
	
	Если КонецПериода = Неопределено Тогда
		Статус = "Ошибка";
		ПодробноеПредставлениеОшибки = ТекстОшибки;
	КонецЕсли;
		
	Результат = Новый Структура;
    Результат.Вставить("НачалоПериода", НачалоПериода);
    Результат.Вставить("КонецПериода", КонецПериода);
	Результат.Вставить("Статус", Статус);
	Результат.Вставить("ПодробноеПредставлениеОшибки", ПодробноеПредставлениеОшибки);
	
	Закрыть(Результат);	

КонецПроцедуры //- ИнфоСофт Конышев А.Е. 28.11.24 УА #72929

//+ ИнфоСофт Конышев А.Е. 28.11.24 УА #72929
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
	КонецПериода = КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1));

КонецПроцедуры //- ИнфоСофт Конышев А.Е. 28.11.24 УА #72929