
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 31.01.23 УА #54554
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Результат = ИС_МП_ОбновлениеМодуля.ТестПодключения();
			
	Если Результат = Неопределено Тогда
		Отказ = Истина;	
		Возврат;
	КонецЕсли;
	
	Если Результат.ТокенКорректный Тогда
		
		Если Не Результат.ПроверкаПройдена Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Данный токен, не зарегистрирован за данной базой"); 
			Возврат;
		КонецЕсли;
	
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Неверный токен");
		Возврат;
	КонецЕсли;
			
	МожноОбновляться = Истина;
	Если Не ПолучитьИнформациюОбОбновлении() Тогда
		Элементы.ДекорацияНачалоКомментарий.Заголовок = "Не удалось получить информацию об обновлении. 
														|Продолжение невозможно";
	КонецЕсли;	
	
	ПроверитьВозможностьОбновления();	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.01.23 УА #54554

//+ ИнфоСофт Ивонин К.А. 05.06.23 УА #59411
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Далее.Видимость = Ложь;
	
	Если МожноОбновляться Тогда
		Элементы.Далее.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 05.06.23 УА #59411

//+ ИнфоСофт Ивонин К.А. 06.03.23 УА #53535
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НеПрерываниеОбновления Тогда
		Возврат;	
	КонецЕсли;
	
	ПрерватьОбновлениеНаСервере();	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.03.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 06.03.23 УА #53535
&НаКлиенте
Процедура НаличиеРезервнойКопииПриИзменении(Элемент)
    
    Если Не НаличиеРезервнойКопии Тогда
    	Возврат;
    КонецЕсли;
    
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Данным действие вы подтверждаете наличие резервной копии данной информационной базы 1С.
	|При возникновения нештатной ситуации ваша база данных 1С может быть повреждена и восстановление в случае отсутствия копии может быть НЕВОЗМОЖНЫМ!
	|Уверены что хотите продолжить?'"), Режим);
    
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.03.23 УА #53535

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 31.01.23 УА #54554
&НаКлиенте
Процедура Далее(Команда)
	УправлениеПросмотром();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.01.23 УА #54554

//+ ИнфоСофт Ивонин К.А. 06.03.23 УА #53535
&НаКлиенте
Процедура ПрерватьОбновление(Команда)
	ПрерватьОбновлениеНаСервере();
	Закрыть();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.03.23 УА #53535 

//+ ИнфоСофт Ивонин К.А. 06.03.23 УА #53535
&НаКлиенте
Процедура Проверить(Команда)
	
	МожноОбновляться = Истина;
	ПроверитьВозможностьОбновления();
	
	Элементы.Далее.Видимость = Ложь;
	
	Если МожноОбновляться Тогда
		Элементы.Далее.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.03.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 06.03.23 УА #53535
&НаКлиенте
Процедура Установить(Команда)
	
	Если Не НаличиеРезервнойКопии Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Перед установкой необходимо наличие резервной копии данной базы 1С!"
			, , , "НаличиеРезервнойКопии");
		Возврат;
	КонецЕсли;
	
	Результат = УстановитьНаСервере();
	
	Если Результат = Истина Тогда
		УправлениеПросмотром();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.03.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 23.06.23 УА #59411
&НаКлиенте
Процедура Перезапустить(Команда)
	НеПрерываниеОбновления = Истина;
	ЗавершитьРаботуСистемы(Истина, Истина);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 23.06.23 УА #59411

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 01.02.23 УА #54554
&НаКлиенте
Процедура УправлениеПросмотром()
	
	Элементы.Установить.Видимость = Ложь;
	Элементы.Далее.Видимость = Ложь;
	
	Если МожноОбновляться Тогда
		Элементы.Далее.Видимость = Истина;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаНачало Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаИнформацияОбОбновлении;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаИнформацияОбОбновлении Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаРезервнаяКопия;
		Элементы.Установить.Видимость = Истина;
		Элементы.Далее.Видимость = Ложь;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаРезервнаяКопия Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаЗавершение;
		Элементы.Установить.Видимость = Ложь;
		Элементы.Далее.Видимость = Ложь;
		Элементы.Перезапустить.Видимость = Истина;	
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.02.23 УА #54554

//+ ИнфоСофт Ивонин К.А. 01.02.23 УА #54554
&НаСервере
Функция ПолучитьИнформациюОбОбновлении()
    
    Элементы.ДекорацияИнформацияОбОбновленииДа.Видимость = Ложь;
	Элементы.ДекорацияИнформацияОбОбновленииНет.Видимость = Ложь;
	
	ТехИнфо = ИС_МП_ОбновлениеМодуля.ТехническаяИнформация();
	ИнформацияОбОбновлении = ИС_МП_ОбновлениеМодуля.ПроверитьНаличиеОбновлений(ТехИнфо);
	
	Если ИнформацияОбОбновлении.ЕстьОшибки Тогда
		Элементы.ДекорацияИнформацияОбОбновленииНет.Видимость = Истина;
		МожноОбновляться = Ложь;
		Возврат Ложь;
	КонецЕсли;
	
	ДатаВыхода = ИнформацияОбОбновлении.Дата;
	Версия = ИнформацияОбОбновлении.Версия;
	Описание = ИнформацияОбОбновлении.Описание;
	Хеш = ИнформацияОбОбновлении.Хеш;
	Guid = ИнформацияОбОбновлении.Guid;
	ИзменяетСтруктуру = Истина;
		
	Элементы.ДекорацияИнформацияОбОбновленииДа.Видимость = Истина;	
	
	Возврат Истина;

КонецФункции //- ИнфоСофт Ивонин К.А. 01.02.23 УА #54554

//+ ИнфоСофт Ивонин К.А. 01.02.23 УА #54554
&НаСервере
Процедура ПроверитьВозможностьОбновления()

	Элементы.ДекорацияДостаточноПравДа.Видимость = Ложь;
	Элементы.ДекорацияДостаточноПравНет.Видимость = Ложь;
	Элементы.ДекорацияОтсутствуютАктивныеСеансыДа.Видимость = Ложь;
	Элементы.ДекорацияОтсутствуютАктивныеСеансыНет.Видимость = Ложь; 
	Элементы.Далее.Видимость = Истина;
	
	Если ПроверитьПраваНаОбновление() Тогда
		Элементы.ДекорацияДостаточноПравДа.Видимость = Истина;
	Иначе
		Элементы.ДекорацияДостаточноПравНет.Видимость = Истина;
		Элементы.Далее.Видимость = Ложь;
		МожноОбновляться = Ложь;		
	КонецЕсли;        
	
	Если ПроверитьМонопольныйДоступ(ИзменяетСтруктуру) Тогда
		Элементы.ДекорацияОтсутствуютАктивныеСеансыДа.Видимость = Истина;
	Иначе
		Элементы.ДекорацияОтсутствуютАктивныеСеансыНет.Видимость = Истина;
		МожноОбновляться = Ложь;
	КонецЕсли;	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.02.23 УА #54554

//+ ИнфоСофт Ивонин К.А. 31.01.23 УА #54554
&НаСервере
Функция ПроверитьПраваНаОбновление()
	Возврат ИС_МП_ОбновлениеМодуля.ПроверитьПраваНаОбновление();
КонецФункции //- ИнфоСофт Ивонин К.А. 31.01.23 УА #54554

//+ ИнфоСофт Ивонин К.А. 31.01.23 УА #54554
&НаСервере
Функция ПроверитьМонопольныйДоступ(ИзменяетСтруктурыДанных)
	Возврат ИС_МП_ОбновлениеМодуля.ПроверитьМонопольныйДоступ(ИзменяетСтруктурыДанных);	
КонецФункции //- ИнфоСофт Ивонин К.А. 31.01.23 УА #54554 

//+ ИнфоСофт Ивонин К.А. 06.03.23 УА #53535
&НаСервере   
Процедура ПрерватьОбновлениеНаСервере()

	Попытка
		УстановитьМонопольныйРежим(Ложь);	
	Исключение	
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.03.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 06.03.23 УА #53535
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт

    Если Результат = КодВозвратаДиалога.Нет Тогда
        НаличиеРезервнойКопии = Ложь;
        Возврат;
    КонецЕсли;
    
    НаличиеРезервнойКопии = Истина;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.03.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 06.03.23 УА #53535
&НаСервере
Функция УстановитьНаСервере()
	Возврат ИС_МП_ОбновлениеМодуля.УстановитьОбновление(Guid);
КонецФункции //- ИнфоСофт Ивонин К.А. 06.03.23 УА #53535

#КонецОбласти
