
#Область ОбработчикиСобытий

//+ ИнфоСофт Заварин К.В. 25.10.24 УА #67824
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТаблицаПоставок = Новый ТаблицаЗначений;
	
	ТаблицаПоставок = ИС_WB_Сервер.ПолучитьПродажиПоРегионам(Профиль);	
	
	Если ТаблицаПоставок = Неопределено Тогда
		ТаблицаПоставок = Новый ТаблицаЗначений;	
	КонецЕсли;		
		
	ВнешниеНаборыДанных = Новый Структура;
	
	ВнешниеНаборыДанных.Вставить("ТаблицаПоставок", ТаблицаПоставок); 
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 25.10.24 УА #67824 

#КонецОбласти
