                                           
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 06.07.22 УА #46999
Функция ПолучитьПрофильПоУмолчанию() Экспорт

	Результат = Справочники.ИС_WB_Профили.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ИС_WB_Профили.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
	|ГДЕ
	|	НЕ ИС_WB_Профили.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Результат;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 06.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 15.12.21 УА #40085
Функция ПолучитьИмяКонфигурации() Экспорт
	Возврат Метаданные.Имя;
КонецФункции //- ИнфоСофт Ивонин К.А. 15.12.21 УА #40085 

//+ ИнфоСофт Ивонин К.А. 31.03.22 УА #44037
Функция ПолучитьВерсиюКонфигурации() Экспорт
	Возврат Метаданные.Версия;
КонецФункции //- ИнфоСофт Ивонин К.А. 31.03.22 УА #44037

//+ ИнфоСофт Ивонин К.А. 13.02.24 УА #70076
Функция ПолучитьВерсиюБезРедакции() Экспорт

	Версия = ПолучитьВерсиюКонфигурации();
	КолУдаляемыхСим = СтрНайти(Версия, ".");
	ДлинаСтроки = СтрДлина(Версия) - КолУдаляемыхСим;
	
	Версия = Прав(Версия, ДлинаСтроки);
	
	Возврат Версия;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.24 УА #70076

//+ ИнфоСофт Ивонин К.А. 24.05.24 УА #75485
Функция ЧасовойПоясИнформационнойБазы() Экспорт
	Возврат ПолучитьЧасовойПоясИнформационнойБазы();
КонецФункции //- ИнфоСофт Ивонин К.А. 24.05.24 УА #75485

#КонецОбласти
