                                           
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 19.01.23 УА #53535
Функция НастройкиСоединения(Профиль) Экспорт
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.МВМ;
	МассивПараметров = ИС_МВМ_Сервер.МассивНастроекПодключения();
	
	Результат = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("AccessToken");
	МассивПараметров.Добавить("RefreshToken");
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров, "Строка");
	
	ЗаполнитьЗначенияСвойств(Результат, СтруктураНастроек);
		
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 19.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция НастройкиОстатков(Профиль) Экспорт
		
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.МВМ;
	МассивПараметров = ИС_МВМ_Сервер.МассивНастроекОстатков();
	
	Результат = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров);
	
	Результат.Вставить("Организация");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_Профили.Организация КАК Организация
	|ИЗ
	|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
	|ГДЕ
	|	ИС_WB_Профили.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОрганизация = РезультатЗапроса.Выбрать();
	
	Если ВыборкаОрганизация.Следующий() Тогда
		Результат.Организация = ВыборкаОрганизация.Организация;
	КонецЕсли;
			
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

#КонецОбласти
