
#Область ОбработчикиСобытий

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	
	Профиль = ПараметрКоманды;
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Результат = ОбновитьПоставкиНаСервере(Профиль);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Поставки успешно обновлены");
	ОповеститьОбИзменении(Тип("СправочникСсылка.ИС_ВБ_ПоставкиFBS"));
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

#КонецОбласти
                               
#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаСервере   
Функция ОбновитьПоставкиНаСервере(Профиль)
	Возврат ИС_ВБ_Сервер.СписокПоставок(Профиль);	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

#КонецОбласти 
