
#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 07.05.23 УА #58360
&НаКлиенте
Процедура Начать(Команда)
    
    Результат = Новый Структура;
    Результат.Вставить("ОтвязатьЗаказы", ОтвязатьЗаказы);
    Результат.Вставить("ПометитьЗаказыНаУдаление", ПометитьЗаказыНаУдаление);
    Результат.Вставить("ПометитьРеализацииНаУдаление", ПометитьРеализацииНаУдаление);
    Результат.Вставить("ПометитьСвязанныеОбъектыНаУдаление", ПометитьСвязанныеОбъектыНаУдаление);
	
	Закрыть(Результат);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.05.23 УА #58360

#КонецОбласти
