#Область ОбработчикиСобытийФормы
//+ ИнфоСофт Стояк Ю.К. 25.01.2024 УА #69482
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СортировкаЭтикеток = "Наименование";
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.01.2024 УА #69482

#КонецОбласти
#Область ОбработчикиКомандФорм              

//+ ИнфоСофт Стояк Ю.К. 25.01.2024 УА #69482
&НаКлиенте
Процедура ПечатьШтрихкодов(Команда)  
	
	Массив = Элементы.Список.ВыделенныеСтроки;
	
	Табличныйдокумент = СформироватьТабличныйДокументЭтикетки(Массив); 
	
	Табличныйдокумент.Показать();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.01.2024 УА #69482

#КонецОбласти

#Область СлужебныеПроцедурыИФункции   

//+ ИнфоСофт Стояк Ю.К. 22.10.2023 УА #69482
&НаСервере
Функция СформироватьТабличныйДокументЭтикетки(МассивОбъектов)  
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "Этикетка";		
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_ЯМ_ФормированиеПоставкиFBO.ПФ_MXL_Штрихкод58х40_ЯМ");
	
	ОбластьМакетаОсновныеДанные = Макет.ПолучитьОбласть("Этикетка");      
	
	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон"); 
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		
		ДанныеДок = ПолучитьДанныеДляФормированияЭтикетки(ЭлементМассива.Ссылка); 
		ДанныеДок.Сортировать(СортировкаЭтикеток + " Возв");
		
		Для Каждого Данные Из ДанныеДок Цикл 
			
			Для Итератор = 1 По Данные.Количество Цикл    
				
				ОбластьМакетаОсновныеДанные.Параметры.Заполнить(Данные);
				
				ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
				
				ПараметрыШК.Ширина = Окр(ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе);
				ПараметрыШК.Высота = Окр(ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе);
				ПараметрыШК.РазмерШрифта = 10;
				ПараметрыШК.Штрихкод = Данные.Штрихкод;
				ПараметрыШК.Масштабировать = Истина;
				ПараметрыШК.СохранятьПропорции = Истина;
				ПараметрыШК.ВертикальноеВыравнивание = 2;
				
				СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
				
				Если СтруктураКартинки.Результат Тогда	
					ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Картинка = СтруктураКартинки.Картинка;
				КонецЕсли;  
				
				ТабличныйДокумент.Вывести(ОбластьМакетаОсновныеДанные);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.10.2023 УА #69482

//+ ИнфоСофт Стояк Ю.К. 22.10.2023 УА #69482
&НаСервере
Функция ПолучитьДанныеДляФормированияЭтикетки(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Штрихкоды
	|ИЗ
	|	&Штрихкоды КАК Штрихкоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Штрихкоды.Количество) КАК Количество,
	|	ИС_ЯМ_Штрихкоды.Наименование КАК Штрихкод,
	|	ИС_ЯМ_Номенклатура.shopSku КАК Артикул,
	|	ИС_ЯМ_Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	ВТ_Штрихкоды КАК ВТ_Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Штрихкоды КАК ИС_ЯМ_Штрихкоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|			ПО ИС_ЯМ_Штрихкоды.Владелец = ИС_ЯМ_Номенклатура.Ссылка
	|		ПО ВТ_Штрихкоды.Штрихкод = ИС_ЯМ_Штрихкоды.Наименование
	|ГДЕ
	|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_ЯМ_Штрихкоды.Наименование,
	|	ИС_ЯМ_Номенклатура.shopSku,
	|	ИС_ЯМ_Номенклатура.Наименование";
	
	Запрос.УстановитьПараметр("Штрихкоды", Документ.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Профиль", Документ.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();     
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	МассивАртикулов = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		МассивАртикулов.Добавить(ВыборкаДетальныеЗаписи.Артикул);		
	КонецЦикла;  
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("offerIds", МассивАртикулов);
	
	Результат = ИС_ЯМ_Сервер.ПолучитьИнформациюОКарточкахПоАртикулу(Документ.Профиль, ТелоЗапроса); 
	
	Если Результат = Неопределено Тогда
		Возврат ТЗ;
	КонецЕсли;
	
	Для Каждого Товар Из Результат.offerMappings Цикл	 
		
		Если Товар.Свойство("offer") Тогда  
			
			Отбор = Новый Структура("Артикул", Товар.offer.offerId);
			
			НайденныеСтроки = ТЗ.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда 
				
				Для Каждого Строка Из НайденныеСтроки Цикл
			 		Строка.Наименование = Товар.offer.name;
				КонецЦикла;
			
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;

	
	Возврат ТЗ;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.10.2023 УА #69482	

#КонецОбласти  

#Область ПроверкаАктаПриемки

#КонецОбласти
