#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИнициализироватьФорму(Параметры.МассивЗначений);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЗначений

&НаКлиенте
Процедура ТаблицаЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Элементы.ТаблицаЗначений.ТекущиеДанные.Значение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФорму(МассивЗначений)

	Для Каждого Значение Из МассивЗначений Цикл
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.Значение = Значение;
		НоваяСтрока.Представление = Строка(Значение);
	КонецЦикла;
	ТаблицаЗначений.Сортировать("Значение");

КонецПроцедуры

#КонецОбласти