
#Область ОбработчикиСобытийФормы 

//+ ИнфоСофт Стояк Ю.К. 14.10.24 УА #84967
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Профиль") Тогда
		Профиль = Параметры.Профиль;
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль");
		Возврат;
	КонецЕсли;
	
	МассивЗначений = Новый Массив;	
	МассивЗначений.Добавить("ПечататьАртикул1С");   
	МассивЗначений.Добавить("ПечататьАртикулЯМ");
	МассивЗначений.Добавить("ПечататьКоличество");   
	МассивЗначений.Добавить("ПечататьНазвание");
	МассивЗначений.Добавить("ПечататьНомерРеализации");
	//+ ИнфоСофт Стояк Ю.К. 09.02.2025 УА #77168       
	МассивЗначений.Добавить("ПечататьНомерЗаказа"); 
	МассивЗначений.Добавить("ПечататьНомерСтроки");   
	//- ИнфоСофт Стояк Ю.К. 09.02.2025 УА #77168
	МассивЗначений.Добавить("ПечататьНомерСборочного");	
	МассивЗначений.Добавить("ПечататьРазмер");	
	МассивЗначений.Добавить("ПечататьШтрихкод");	
	МассивЗначений.Добавить("ПечататьФото");	
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, МассивЗначений);
		
	Если Результат.Количество() = 0 Тогда		
		ПечататьАртикулЯМ 			= Истина;				
		ПечататьНазвание 			= Истина;
		ПечататьНомерСборочного 	= Истина;		
		ПечататьРазмер 				= Истина;		
		ПечататьШтрихкод		 	= Истина;
		ПечататьФото			 	= Истина;
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.10.24 УА #84967

#КонецОбласти

#Область ОбработчикиКомандФормы  

//+ ИнфоСофт Стояк Ю.К. 14.10.24 УА #84967
&НаКлиенте
Процедура СохранитьДанные(Команда)
	СохранитьДанныеНаСервере(Профиль);
	Закрыть();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.10.24 УА #84967

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Стояк Ю.К. 14.10.24 УА #84967
&НаСервере 
Процедура СохранитьДанныеНаСервере(Профиль)
	
	СтруктураРезультатовЗначение = Новый Структура;	
	СтруктураРезультатовЗначение.Вставить("ПечататьАртикул1С", ПечататьАртикул1С);
	СтруктураРезультатовЗначение.Вставить("ПечататьАртикулЯМ", ПечататьАртикулЯМ);		
	СтруктураРезультатовЗначение.Вставить("ПечататьКоличество", ПечататьКоличество);
	СтруктураРезультатовЗначение.Вставить("ПечататьНазвание", ПечататьНазвание); 
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерРеализации", ПечататьНомерРеализации);
	//+ ИнфоСофт Стояк Ю.К. 09.02.2025 УА #77168
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерЗаказа", ПечататьНомерЗаказа);
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерСтроки", ПечататьНомерСтроки); 
	//- ИнфоСофт Стояк Ю.К. 09.02.2025 УА #77168
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерСборочного", ПечататьНомерСборочного);
	СтруктураРезультатовЗначение.Вставить("ПечататьРазмер", ПечататьРазмер);	
	СтруктураРезультатовЗначение.Вставить("ПечататьШтрихкод", ПечататьШтрихкод);
	СтруктураРезультатовЗначение.Вставить("ПечататьФото", ПечататьФото);

	ИС_MP_Сервер.ЗаписатьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, СтруктураРезультатовЗначение);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.10.24 УА #84967

#КонецОбласти
