#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)

	КатегорияПриИзмененииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоответствиеХарактеристик

&НаКлиенте
Процедура СоответствиеХарактеристикРеквизит1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.СоответствиеХарактеристик.ТекущиеДанные;

	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры"));
	Если ЕстьВидНоменклатурыУХарактеристики() Тогда
		СписокВыбора.Добавить(ПредопределенноеЗначение(
			"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры"));
	КонецЕсли;
	СписокВыбора.Добавить(ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры"));

	Если Не ТекущаяСтрока.ТребуетсяСопоставление Тогда
		СписокВыбора.Добавить(ПредопределенноеЗначение(
			"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение"));
		СписокВыбора.Добавить(ПредопределенноеЗначение(
			"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры"));
	КонецЕсли;

	ДанныеВыбора = СписокВыбора;

КонецПроцедуры

&НаКлиенте
Процедура СоответствиеХарактеристикРеквизит1ССОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока = Элементы.СоответствиеХарактеристик.ТекущиеДанные;

	Если ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры") Тогда

		МассивЗначений = РеквизитыНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры") Тогда

		МассивЗначений = ДопРеквизитыНабора();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры") Тогда

		МассивЗначений = ДопСвойстваНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры") Тогда

		МассивЗначений = РеквизитыХарактеристикиНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры") Тогда

		МассивЗначений = НаборыДопРеквизитовХарактеристикиНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры") Тогда

		МассивЗначений = ВидыНоменклатурыХарактеристик();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение") Тогда

		ТекущаяСтрока.ВидРеквизита1С = ВыбранноеЗначение;
		Возврат;

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры") Тогда

		ТекущаяСтрока.ВидРеквизита1С = ВыбранноеЗначение;
		ДобавитьСопоставлениеХарактеристики(
				Категория, ТекущаяСтрока.ХарактеристикаOzon, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
			ТекущаяСтрока.ФиксированноеЗначение);
		Возврат;

	КонецЕсли;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МассивЗначений", МассивЗначений);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидРеквизита1С", ВыбранноеЗначение);

	Оповещение = Новый ОписаниеОповещения("ВыборРеквизитаДляЗаполнения", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаВыбора", СтруктураПараметров, , , , , Оповещение,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСопоставлениеХарактеристики(Категория, ХарактеристикаOzon, ВидРеквизита1С, Реквизит1С, ФиксированноеЗначение)	
	ИС_Ozon_Сервер.ДобавитьСопоставлениеХарактеристики(Категория, ХарактеристикаOzon, ВидРеквизита1С, Реквизит1С, ФиксированноеЗначение); 
КонецПроцедуры   

&НаСервере
Процедура УдалитьСопоставлениеХарактеристики(Категория, ХарактеристикаOzon)	
	ИС_Ozon_Сервер.УдалитьСопоставлениеХарактеристики(Категория, ХарактеристикаOzon);
КонецПроцедуры 

&НаСервере
Функция ТекстКоличествоСопоставленныхЗначений(Категория, ХарактеристикаOzon, ВидРеквизита1С, Реквизит1С, ТребуетсяСопоставление)
	Возврат ИС_Ozon_Сервер.ТекстКоличествоСопоставленныхЗначений(Категория, ХарактеристикаOzon, ВидРеквизита1С, Реквизит1С, ТребуетсяСопоставление);
КонецФункции   

&НаСервере
Функция ДопРеквизитыНабора(Результат = Неопределено)
	Возврат ИС_Ozon_Сервер.ДопРеквизитыНабора(Результат)
КонецФункции

&НаКлиенте
Процедура СоответствиеХарактеристикРеквизит1СОчистка(Элемент, СтандартнаяОбработка)

	ТекущаяСтрока = Элементы.СоответствиеХарактеристик.ТекущиеДанные;

	УдалитьСопоставлениеХарактеристики(Категория, ТекущаяСтрока.ХарактеристикаOzon);

	ТекущаяСтрока.Реквизит1С 	 		= Неопределено;
	ТекущаяСтрока.ВидРеквизита1С 		= ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ПустаяСсылка");
	ТекущаяСтрока.ФиксированноеЗначение = Неопределено;

	ТекущаяСтрока.СопоставленоЗначений = ТекстКоличествоСопоставленныхЗначений(
		Категория, ТекущаяСтрока.ХарактеристикаOzon, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
		ТекущаяСтрока.ТребуетсяСопоставление);

КонецПроцедуры

&НаКлиенте
Процедура СоответствиеХарактеристикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Элементы.СоответствиеХарактеристикСопоставленоЗначений Тогда

		СтандартнаяОбработка = Ложь;

		ТекущаяСтрока = СоответствиеХарактеристик.НайтиПоИдентификатору(ВыбраннаяСтрока);

		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Реквизит1С) Или Не ТекущаяСтрока.ТребуетсяСопоставление Тогда
			Возврат;
		КонецЕсли;

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Категория", Категория);
		ПараметрыФормы.Вставить("ХарактеристикаOzon", ТекущаяСтрока.ХарактеристикаOzon);
		ПараметрыФормы.Вставить("ВидРеквизита1С", ТекущаяСтрока.ВидРеквизита1С);
		ПараметрыФормы.Вставить("Реквизит1С", ТекущаяСтрока.Реквизит1С);
		ПараметрыФормы.Вставить("НаборЗначений", ТекущаяСтрока.НаборЗначений);
		Оповещение = Новый ОписаниеОповещения("ПриЗакрытииФормыСопоставленияЗначений", ЭтотОбъект,
			Новый Структура("ВыбраннаяСтрока", ВыбраннаяСтрока));

		ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаСопоставленияЗначений", ПараметрыФормы, ЭтотОбъект, , , ,
			Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоответствиеХарактеристикФиксированноеЗначениеПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.СоответствиеХарактеристик.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ФиксированноеЗначение) Тогда
		ДобавитьСопоставлениеХарактеристики(
				Категория, ТекущаяСтрока.ХарактеристикаOzon, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
			ТекущаяСтрока.ФиксированноеЗначение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоответствиеХарактеристикФиксированноеЗначениеОчистка(Элемент, СтандартнаяОбработка)

	ТекущаяСтрока = Элементы.СоответствиеХарактеристик.ТекущиеДанные;

	УдалитьСопоставлениеХарактеристики(
		Категория, ТекущаяСтрока.ХарактеристикаOzon);
	ТекущаяСтрока.Реквизит1С 	 = Неопределено;
	ТекущаяСтрока.ВидРеквизита1С = ПредопределенноеЗначение("Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ПустаяСсылка");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкопироватьИзКатегории(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Категория", Категория);
	ПараметрыФормы.Вставить("СопоставлениеОсновныхРеквизитов", Ложь);

	Оповещение = Новый ОписаниеОповещения("ПриЗакрытииФормыКопированияСопоставленияХарактеристик", ЭтотОбъект);

	ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаКопированияСопоставленияХарактеристик", ПараметрыФормы, ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыОповещения

&НаКлиенте
Процедура ВыборРеквизитаДляЗаполнения(Результат, СтруктураПараметров) Экспорт

	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока = Элементы.СоответствиеХарактеристик.ТекущиеДанные;

	Если ТипЗнч(Результат) = Тип("СправочникСсылка.НаборыДополнительныхРеквизитовИСведений") Тогда

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВидРеквизита1С", СтруктураПараметров.ВидРеквизита1С);

		Оповещение = Новый ОписаниеОповещения("ВыборРеквизитаДляЗаполнения", ЭтотОбъект, ДополнительныеПараметры);

		МассивЗначений = ДопРеквизитыНабора(Результат);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("МассивЗначений", МассивЗначений);

		ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаВыбора", СтруктураПараметров, , , , , Оповещение,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе

		ТекущаяСтрока.ВидРеквизита1С = СтруктураПараметров.ВидРеквизита1С;
		ТекущаяСтрока.Реквизит1С 	 = Результат;

	КонецЕсли;

	Если ЗначениеЗаполнено(ТекущаяСтрока.Реквизит1С) Тогда
		ДобавитьСопоставлениеХарактеристики(
			Категория, ТекущаяСтрока.ХарактеристикаOzon, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
			ТекущаяСтрока.ФиксированноеЗначение);

		ТекущаяСтрока.СопоставленоЗначений = ТекстКоличествоСопоставленныхЗначений(
			Категория, ТекущаяСтрока.ХарактеристикаOzon, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
			ТекущаяСтрока.ТребуетсяСопоставление);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыСопоставленияЗначений(ДанныеПоСопоставленнымЗначениям, ДополнительныеПараметры) Экспорт

	ТекущаяСтрока = СоответствиеХарактеристик.НайтиПоИдентификатору(ДополнительныеПараметры.ВыбраннаяСтрока);

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока.СопоставленоЗначений = ТекстКоличествоСопоставленныхЗначений(
		Категория, ТекущаяСтрока.ХарактеристикаOzon, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
		ТекущаяСтрока.ТребуетсяСопоставление);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыКопированияСопоставленияХарактеристик(Результат, ДополнительныеПараметры) Экспорт

	КатегорияПриИзмененииНаСервере();

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура КатегорияПриИзмененииНаСервере()

	СоответствиеХарактеристик.Очистить();
	Если Не ЗначениеЗаполнено(Категория) Тогда
		Возврат;
	КонецЕсли;

	СоответствиеРеквизитовНоменклатуры =  ИС_Ozon_Сервер.СоответствиеРеквизитовНоменклатуры();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ozon_КатегорииТоваровХарактеристики.Характеристика КАК ХарактеристикаOzon,
	|	Ozon_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	Ozon_Характеристики.ИДСправочникаЗначенийХарактеристики > 0 КАК ТребуетсяСопоставление,
	|	Ozon_КатегорииТоваровХарактеристики.Обязательная КАК Обязательная,
	|	Ozon_Характеристики.НаборЗначений КАК НаборЗначений,
	|	Ozon_СоответствиеЗначенийХарактеристик.ФиксированноеЗначение КАК ФиксированноеЗначение
	|ИЗ
	|	Справочник.ИС_Ozon_КатегорииТоваров.Характеристики КАК Ozon_КатегорииТоваровХарактеристики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеЗначенийХарактеристик КАК Ozon_СоответствиеЗначенийХарактеристик
	|		ПО Ozon_КатегорииТоваровХарактеристики.Характеристика = Ozon_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon
	|			И Ozon_КатегорииТоваровХарактеристики.Ссылка = Ozon_СоответствиеЗначенийХарактеристик.Категория
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Характеристики КАК Ozon_Характеристики
	|		ПО Ozon_КатегорииТоваровХарактеристики.Характеристика = Ozon_Характеристики.Ссылка
	|			И Ozon_КатегорииТоваровХарактеристики.Характеристика = Ozon_Характеристики.Ссылка
	|ГДЕ
	|	Ozon_КатегорииТоваровХарактеристики.Ссылка = &Категория
	|
	|СГРУППИРОВАТЬ ПО
	|	Ozon_КатегорииТоваровХарактеристики.Характеристика,
	|	Ozon_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	Ozon_Характеристики.ИДСправочникаЗначенийХарактеристики > 0,
	|	Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
	|	Ozon_КатегорииТоваровХарактеристики.Обязательная,
	|	Ozon_Характеристики.НаборЗначений,
	|	Ozon_СоответствиеЗначенийХарактеристик.ФиксированноеЗначение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Обязательная УБЫВ,
	|	ХарактеристикаOzon";

	Запрос.УстановитьПараметр("Категория", Категория);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		НоваяСтрока = СоответствиеХарактеристик.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);

		Если Выборка.ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры
			И СоответствиеРеквизитовНоменклатуры.Получить(Выборка.Реквизит1С) = Неопределено Тогда

			ИС_Ozon_Сервер.УдалитьСопоставлениеХарактеристики(Категория, Выборка.ХарактеристикаOzon);
			НоваяСтрока.ВидРеквизита1С 	= Неопределено;
			НоваяСтрока.Реквизит1С 		= Неопределено;

		КонецЕсли;

		НоваяСтрока.СопоставленоЗначений = ИС_Ozon_Сервер.ТекстКоличествоСопоставленныхЗначений(
				Категория, НоваяСтрока.ХарактеристикаOzon, НоваяСтрока.ВидРеквизита1С, НоваяСтрока.Реквизит1С,
			НоваяСтрока.ТребуетсяСопоставление);

	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьВидНоменклатурыУХарактеристики()

	Возврат ИС_Ozon_Сервер.ЕстьВидНоменклатурыУХарактеристики();

КонецФункции
 
&НаСервере
Функция РеквизитыНоменклатуры()
	Возврат ИС_Ozon_Сервер.РеквизитыНоменклатуры();
КонецФункции

&НаСервере
Функция ДопСвойстваНоменклатуры()
	Возврат ИС_Ozon_Сервер.ДопСвойстваНоменклатуры();
КонецФункции

&НаСервере
Функция НаборыДопРеквизитовХарактеристикиНоменклатуры()
	Возврат ИС_Ozon_Сервер.НаборыДопРеквизитовХарактеристикиНоменклатуры();
КонецФункции

&НаСервере
Функция ВидыНоменклатурыХарактеристик()
	Возврат ИС_Ozon_Сервер.ВидыНоменклатурыХарактеристик();
КонецФункции

&НаСервере
Функция РеквизитыХарактеристикиНоменклатуры()
	Возврат ИС_Ozon_Сервер.РеквизитыХарактеристикиНоменклатуры();
КонецФункции

#КонецОбласти