
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Профиль") Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не выбран профиль");
		Возврат;
	КонецЕсли;
	
	Профиль = Параметры.Профиль;
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585

//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
		
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Склад", Склад);
	
	//+ ИнфоСофт Заварин К.В. 11.04.25 УА #77376
    ПараметрыЗакрытия.Вставить("Грузоместа", Грузоместа);	
	//- ИнфоСофт Заварин К.В. 11.04.25 УА #77376 
	
	Оповестить("ВыборСклада", ПараметрыЗакрытия, ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть();	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585

#КонецОбласти
