
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 07.07.22 УА #46999
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОформлениеНаСервере();
	ПолучитьИнформациюОСтатусах();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 04.07.22 УА #46999
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	Режим = РежимДиалогаВопрос.ДаНет;
	
	ДопПараметры = Новый Структура("Поставка", ВыбранноеЗначение);
	Оповещение = Новый ОписаниеОповещения("ПрикреплениеКПоставкеЗавершение", ЭтотОбъект, ДопПараметры);
	Текст = СтрШаблон("Прикрепить выделенные задания к поставке: %1?", ВыбранноеЗначение); 
	ПоказатьВопрос(Оповещение, Текст, Режим, 0);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 13.07.22 УА #46999
&НаКлиенте
Процедура ЗагрузитьСборочноеЗадание(Команда)
	ЗагрузитьСборочноеЗаданиеНаСервере(Объект.Профиль, Объект.Дата);
	Прочитать();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 14.07.22 УА #46999
&НаКлиенте
Процедура ОтменитьЗадание(Команда)

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ОтменитьЗаданиеЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Уверены что хотите отменить сбороное задание?'"), Режим, 0);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.07.22 УА #46999 

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаКлиенте
Процедура ПрикрепитьКПоставке(Команда)
	
	ПараметрыОтбора = Новый Структура("Профиль", Объект.Профиль);
	ПараметрыОтбора.Вставить("ТипТовара", Объект.ТипТовара);
	ПараметрыОтбора.Вставить("done", Ложь);
	ПараметрыОтбора.Вставить("ПометкаУдаления", Ложь);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.ИС_ВБ_ПоставкиFBS.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.06.24 УА #77581
&НаКлиенте
Процедура ДекорацияОткрытьНаКартеНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://maps.yandex.ru/?text=" + Объект.latitude + "+" + Объект.longitude); 
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.06.24 УА #77581

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 04.07.22 УА #46999
&НаКлиенте
Процедура УстановитьОформление()
		
	Если Не Объект.Ссылка.Пустая() Тогда
	   
	   	ШрифтПолужирный = ПолучитьШрифтПолужирный();
	   	
		Элементы.Номер.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Номер.Шрифт = ШрифтПолужирный;
		Элементы.Номер.Формат = "ЧГ=0";
		Элементы.Дата.Вид = ВидПоляФормы.ПолеНадписи; 
		Элементы.Дата.Шрифт = ШрифтПолужирный; 
		Элементы.Профиль.Вид = ВидПоляФормы.ПолеНадписи; 
		Элементы.Профиль.Шрифт = ШрифтПолужирный;
		
		Если ЗначениеЗаполнено(Объект.Склад) Тогда
			Элементы.Склад.Вид = ВидПоляФормы.ПолеНадписи; 
			Элементы.Склад.Шрифт = ШрифтПолужирный;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Валюта) Тогда
			Элементы.Валюта.Вид = ВидПоляФормы.ПолеНадписи; 
			Элементы.Валюта.Шрифт = ШрифтПолужирный;
		КонецЕсли;
		
	КонецЕсли;
	
	//+ ИнфоСофт Сумин Д.В. 26.04.2024 УА #70825 
	Если ЗначениеЗаполнено(Объект.ВалютаПродажи) тогда
		Элементы.ВалютаПродажи.Вид = ВидПоляФормы.ПолеНадписи; 
		Элементы.ВалютаПродажи.Шрифт = ШрифтПолужирный;	
	КонецЕсли;
	
	Если Объект.price = Объект.convertedPrice Тогда
		Элементы.convertedPrice.Видимость = Ложь;
		Элементы.Валюта.Видимость = Ложь;
		Элементы.ДекорацияЦенаПоставщика.Видимость = Ложь;
		Элементы.ДекорацияВалюта.Видимость = Ложь;
	КонецЕсли;
	//Если Объект.price = Объект.convertedPrice Тогда
	//	Элементы.price.Видимость = Ложь;
	//	Элементы.Валюта.Видимость = Ложь;
	//КонецЕсли;
	//- ИнфоСофт Сумин Д.В. 26.04.2024 УА #70825
	
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	Если Объект.ТипДоставки = ПредопределенноеЗначение("Перечисление.ИС_ВБ_ТипыДоставки.FBO") Тогда
		Элементы.ПрикрепитьКПоставке.Доступность = Ложь;
		Элементы.ОтменитьЗадание.Доступность = Ложь;
		Элементы.ФормаЗагрузитьСборочноеЗадание.Доступность = Ложь;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469 
		 
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 14.07.22 УА #46999
&НаСервере   
Процедура УстановитьОформлениеНаСервере()

	//Элементы.ГруппаОшибки.Видимость = ПроверитьНаличиеОшибок(Объект.Ссылка);
	//
	//СтатусФинальный = Объект.Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.СборочноеЗаданиеЗавершено
	//	Или Объект.Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.СборочноеЗаданиеОтклонено
	//	Или Объект.Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.КурьерДовезИКлиентПринялТовар
	//	Или Объект.Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.КлиентНеПринялТовар;
	//
	//Если СтатусФинальный Тогда 
	//    
	//	Элементы.УстановитьСтатус.Видимость = Ложь;
	//	Элементы.Статус.Вид = ВидПоляФормы.ПолеНадписи; 
	//	Элементы.Статус.Шрифт = ШрифтыСтиля.ИС_ШрифтПолужирный;
	//		
	//КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаСервере   
Процедура ПолучитьИнформациюОСтатусах()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Поставка КАК Поставка,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус КАК Статус,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB КАК СтатусWB,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.ДатаДоставкиС КАК ДатаДоставкиС,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.ДатаДоставкиПо КАК ДатаДоставкиПо
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|				И ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка = &СборочноеЗадание";
	
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);
	Запрос.УстановитьПараметр("СборочноеЗадание", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);	
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 13.07.22 УА #46999
&НаСервереБезКонтекста
Процедура ЗагрузитьСборочноеЗаданиеНаСервере(Профиль, Дата)
	ИС_ВБ_Сервер.ВыполнитьЗагрузкуЗаказов(Профиль, Дата - 1, Дата + 1);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаКлиенте
Процедура ОтменитьЗаданиеЗавершение(Результат, Параметры) Экспорт
    
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ОтменитьЗаданиеНаСервере(Объект.Профиль, Объект.Номер);
    
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 14.07.22 УА #46999
&НаСервереБезКонтекста
Процедура ОтменитьЗаданиеНаСервере(Профиль, Номер)	
	ИС_WB_Сервер.ОтменитьСборочноеЗадание(Профиль, Номер);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 23.01.23 УА #53535
&НаСервереБезКонтекста
Функция ПолучитьШрифтПолужирный()
	Возврат Новый Шрифт( , 10, Истина);	
КонецФункции //- ИнфоСофт Ивонин К.А. 23.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаКлиенте
Процедура ПрикреплениеКПоставкеЗавершение(Результат, Параметры) Экспорт
    
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ПрикрепитьЗаказыКПоставкеНаСервере(Параметры.Поставка);
    ПолучитьИнформациюОСтатусах();

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаСервере
Процедура ПрикрепитьЗаказыКПоставкеНаСервере(Поставка)
	
	ВыделенныеСтроки = Новый Массив();
	ВыделенныеСтроки.Добавить(Объект.Ссылка);
	ИС_ВБ_Сервер.ДобавитьСборочныеЗаданияВПоставку(Объект.Профиль, Поставка, ВыделенныеСтроки);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
  
#КонецОбласти
