
#Область ПрограммныйИнтерфейс

//+ ИнфоСофт Мурсалимов Д.Р. 05.03.24 УА #70747
Функция РазборКодаМаркировки(ДанныеДляРазбора) Экспорт   
	
	ОбщийМодуль = ОпределитьОбщийМодульРазбораКодаМаркировки();    
	Возврат ОбщийМодуль.РазобратьКодМаркировки(ДанныеДляРазбора);	
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 05.03.24 УА #70747

//+ ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #80967
Функция ПолучитьКизНоменклатуры(Данные) Экспорт
	
	КодМаркировки = "";
	
	СтруктураКода = РазборКодаМаркировки(Данные.ЗначениеШтрихкода);
	
	Если СтруктураКода.Свойство("СоставКодаМаркировки") Тогда
	    
	    GTIN = СтруктураКода.СоставКодаМаркировки.GTIN;
	    СерийныйНомер = СтруктураКода.СоставКодаМаркировки.СерийныйНомер;
		
		КодМаркировки = "01" + GTIN + "21" + СерийныйНомер;
		
		РазделительGS1 = МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1();
    	ЭкранированныйСимволGS1 = "\u001d";
   	 	КодМаркировки = СтрЗаменить(КодМаркировки, РазделительGS1, ЭкранированныйСимволGS1);
	
	КонецЕсли;
	
	Возврат КодМаркировки;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #80967

//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686
Функция ОбработатьШтрихкод(ВходящиеДанные, ПараметрыСканирования, КэшированныеЗначения, УникальныйИдентификатор) Экспорт
	
	//+ ИнфоСофт Заварин К.В. 21.03.25 УА #96791
	ПараметрыСканирования.Вставить("ТребуетсяПроверкаСредствамиККТ", Ложь);
	//- ИнфоСофт Заварин К.В. 21.03.25 УА #96791
	
	ОбщийМодуль = ОпределитьОбщийМодульШтрихкодированияВызовСервера();    
 	Возврат ОбщийМодуль.ОбработатьШтрихкод(ВходящиеДанные, ПараметрыСканирования, КэшированныеЗначения, УникальныйИдентификатор);
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Мурсалимов Д.Р. 05.03.24 УА #70747
Функция ОпределитьОбщийМодульРазбораКодаМаркировки()
	
	Возврат ИС_MP_МаркировкаПовтИсп.ОпределитьОбщийМодульРазбораКодаМаркировки();	
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 05.03.24 УА #70747

//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686
Функция ОпределитьОбщийМодульШтрихкодированияВызовСервера()
	
	Возврат ИС_MP_МаркировкаПовтИсп.ОпределитьОбщийМодульШтрихкодированияВызовСервера();	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686

#КонецОбласти
