#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Категория", Категория);
	Профиль = Параметры.Профиль;  
			
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("AliexpressВидЦены");
	МассивПараметров.Добавить("AliexpressВидЦеныСоСкидкой");
	
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивПараметров);
	
	Price 			= Справочники.ВидыЦен.ПустаяСсылка();
	discount_price 	= Справочники.ВидыЦен.ПустаяСсылка();	
	
	Если Настройки <> Неопределено Тогда
		                    
		Если Настройки["AliexpressВидЦены"] <> Неопределено Тогда
			Price = Настройки["AliexpressВидЦены"];       
		КонецЕсли;
		
		Если Настройки["AliexpressВидЦеныСоСкидкой"] <> Неопределено Тогда
			discount_price = Настройки["AliexpressВидЦеныСоСкидкой"];       
		КонецЕсли;
	
	КонецЕсли;
	
	Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Price, "ВалютаЦены");   
	
	ИС_Ozon_Сервер.УстановитьСвязиПараметровВыбораХарактеристикиИУпаковки(ЭтотОбъект);

	СписокОбязательныхХарактеристик = Новый ФиксированныйМассив(Новый Массив);

	ИнициализироватьХарактеристики();	
	
	//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
	Элементы.СопоставитьНоменклатуруАвтоматически.Видимость = СоздатьКарточкиПослеВыгрузки;
	//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	ПроверяемыеРеквизиты.Очистить();
	ПроверяемыеРеквизиты.Добавить("Номенклатура");
	ПроверяемыеРеквизиты.Добавить("Цена");
	ПроверяемыеРеквизиты.Добавить("product_unit");
	ПроверяемыеРеквизиты.Добавить("freight_template_id");
	ПроверяемыеРеквизиты.Добавить("shipping_lead_time");
	//ПроверяемыеРеквизиты.Добавить("product_unit");
	//ПроверяемыеРеквизиты.Добавить("product_unit");
	ПроверяемыеРеквизиты.Добавить("ВесУпаковки");
	ПроверяемыеРеквизиты.Добавить("ДлинаУпаковки");
	ПроверяемыеРеквизиты.Добавить("ШиринаУпаковки");
	ПроверяемыеРеквизиты.Добавить("ВысотаУпаковки");
	ПроверяемыеРеквизиты.Добавить("СсылкаНаГлавноеФото");
	ПроверяемыеРеквизиты.Добавить("Категория");
	ПроверяемыеРеквизиты.Добавить("multi_language_subject_list");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПроверяемыеРеквизиты, СписокОбязательныхХарактеристик);

	РеквизитыТаблицы = ПолучитьРеквизиты("Товары");

	НомерСтроки = 1;
	Для Каждого стр Из Товары Цикл

		ИндексСтрокой = Формат(Товары.Индекс(стр), "ЧН=0; ЧГ=");
		Для Каждого реквизит Из РеквизитыТаблицы Цикл
			Если Не ПроверяемыеРеквизиты.Найти(реквизит.Имя) = Неопределено И Не ЗначениеЗаполнено(стр[реквизит.Имя])
				И Не (ТипЗнч(стр[реквизит.Имя]) = Тип("Число") И СтрНайти(Реквизит.Имя, "Атрибут_") > 1) Тогда

				ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон("В строке: %1  не заполнена колонка: %2", НомерСтроки, реквизит.Заголовок), , СтрШаблон(
					"Товары[%1].%2", ИндексСтрокой, реквизит.Имя));

				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		//Проверим Поле "Название" на наличие недопустимых символов
		Если ЗначениеЗаполнено(Стр.multi_language_subject_list) И ИС_Ozon_Сервер.ЕстьНедопустимыеСимволыВСтроке(
			Стр.multi_language_subject_list) Тогда

			ДопустимыеСимволы = "a-z A-Z а-я А-Я ёЁ 0-9 () "" ' & ; , : . / ? ! % * # № @ < > _ + -"
				+ " и символ ПРОБЕЛА";
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон("В строке: %1 колонка 'Название' содержит недопустимые символы!
						  |	Разрешены к использованию только: %2", НомерСтроки, ДопустимыеСимволы), , СтрШаблон(
				"Товары[%1].%2", ИндексСтрокой, "Название"));

			Отказ = Истина;

		КонецЕсли;

		НомерСтроки = НомерСтроки + 1;

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)

	ИнициализироватьХарактеристики();

КонецПроцедуры

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
&НаКлиенте
Процедура СоздатьКарточкиПослеВыгрузкиПриИзменении(Элемент)
	
	Элементы.СопоставитьНоменклатуруАвтоматически.Видимость = СоздатьКарточкиПослеВыгрузки;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Не КатегорияЗаполнена() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если Копирование = Истина Тогда
		ИДСтроки = Элементы.Товары.ТекущаяСтрока;
		ТекущаяСтрока = Товары.НайтиПоИдентификатору(ИДСтроки);
		ТекущаяСтрока.sku_code = "";
		ЗаполнитьЗависимыРеквизиты(ИДСтроки);
	КонецЕсли;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура ХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ИДстрокой = СтрРазделить(Элемент.Имя, "_")[1];
	Атрибут = АтрибутПоКоду(ИДстрокой);
	СтруктураПараметров = Новый Структура;	
	СтруктураПараметров.Вставить("АтрибутАли", Атрибут);

	ОткрытьФорму("Справочник.ИС_АЛИ_ЗначенияАтрибутов.ФормаВыбора", СтруктураПараметров, Элемент, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура ХарактеристикаНачалоМножественногоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ИДстрокой = СтрРазделить(Элемент.Имя, "_")[1];
	Атрибут = АтрибутПоКоду(ИДстрокой);
	ВыбранныеЗначения = ТекущаяСтрока[Элемент.Имя].ВыгрузитьЗначения();

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВыбранныеЗначения", ВыбранныеЗначения);
	//СтруктураПараметров.Вставить("Категория", Категория);
	СтруктураПараметров.Вставить("АтрибутАли", Атрибут);
	ОткрытьФорму("Обработка.ИС_АЛИ_ВыгрузкаКарточекТоваров.Форма.ФормаМножественногоВыбораАтрибута", СтруктураПараметров, Элемент, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура ХарактеристикаОбработкаМножественногоВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока[Элемент.Имя].ЗагрузитьЗначения(ВыбранноеЗначение);	

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ИДСтроки = Элементы.Товары.ТекущаяСтрока;
	ЗаполнитьЗависимыРеквизиты(ИДСтроки);
	
КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура ХарактеристикаНоменклатурыПриИзменении(Элемент)	
	
	ИДСтроки = Элементы.Товары.ТекущаяСтрока;
	ЗаполнитьЗависимыРеквизиты(ИДСтроки);
	
КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	
	ИДСтроки = Элементы.Товары.ТекущаяСтрока;
	ЗаполнитьЗависимыРеквизиты(ИДСтроки);
	
КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура ШтрихкодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Штрихкод = ВыбранноеЗначение;
	
	
КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура ШтрихкодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.ЗагрузитьЗначения(ШтрихкодыНоменклатуры(ТекущаяСтрока.Номенклатура,
		ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.Упаковка));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура ОткрытьПодбор(Команда)

	Если Не ЗначениеЗаполнено(Категория) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена Категория товаров", , "Категория");
		Возврат;
	КонецЕсли;

	ПараметрыФормыПодбораТоваров = ПараметрыФормыПодбораТоваров(Профиль, Валюта,
		УникальныйИдентификатор, Price);

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПодбора", ЭтотОбъект);
	ОткрытьФорму(ПараметрыФормыПодбораТоваров.ИмяФормы, ПараметрыФормыПодбораТоваров.ПараметрыФормы, ЭтотОбъект, , , ,
		Оповещение);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура ЗаполнитьКолонкуТекущимЗначением(Команда)

	ТекущиеДанные 	= Элементы.Товары.ТекущиеДанные;
	ИмяКолонки 		= Элементы.Товары.ТекущийЭлемент.Имя;

	ЭтоСписок = ТипЗнч(ТекущиеДанные[ИмяКолонки]) = Тип("СписокЗначений");
	Если ЭтоСписок Тогда
		Значение = ТекущиеДанные[ИмяКолонки].ВыгрузитьЗначения();
	Иначе
		Значение = ТекущиеДанные[ИмяКолонки];
	КонецЕсли;

	Для Каждого стр Из Товары Цикл

		Если ЭтоСписок Тогда
			стр[ИмяКолонки].ЗагрузитьЗначения(Значение);
		Иначе
			стр[ИмяКолонки] = Значение;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура ЗаполнитьКолонкуСопоставленнымиЗначениями(Команда)

	ИмяКолонки = Элементы.Товары.ТекущийЭлемент.Имя;
	Если ИмяКолонки = "sku_code" Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьКолонкуСопоставленнымиЗначениямиНаСервере(ИмяКолонки);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура СохранитьТовары(Команда)

	Если ПроверитьЗаполнение() Тогда
		СохранитьТоварыНаСервере();		
	КонецЕсли;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура Подсказка(Команда)

	ТекущаяКолонка = Элементы.Товары.ТекущийЭлемент;

	Если ТекущаяКолонка <> Неопределено Тогда
		ТекстПодсказки = Элементы.Товары.ТекущийЭлемент.РасширеннаяПодсказка.Заголовок;
		ПоказатьПредупреждение( , ТекстПодсказки, , ТекущаяКолонка.Заголовок);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Функция КатегорияЗаполнена()

	Результат = Истина;

	Если Не ЗначениеЗаполнено(Категория) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена Категория товаров", , "Категория");
		Результат = Ложь;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#Область ПроцедурыОповещения

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаКлиенте
Процедура ПослеЗакрытияПодбора(Результат, СтруктураПараметров) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		Если Результат.Свойство("АдресТоваровВХранилище") Тогда
			ПослеЗакрытияПодбораНаСервере(Результат.АдресТоваровВХранилище);
		Иначе
			ПослеЗакрытияПодбораНаСервере(Результат.АдресКорзиныВХранилище);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Процедура ПослеЗакрытияПодбораНаСервере(АдресТоваровВХранилище)

	ТаблицаПодбора = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);

	ТаблицаНоменклатуры = ТаблицаНоменклатурыПоТаблицеПодбора(ТаблицаПодбора);

	ТаблицаТоваров = ПолучитьДанныеПоНоменклатуре(ТаблицаНоменклатуры);
	ЕстьНастройкиОсновныхРеквизитовДляКатегории = ИС_АЛИ_Сервер.ЕстьНастройкиОсновныхРеквизитовДляКатегории(
		Категория);
	ТаблицаСоответствийЗначений = ИС_АЛИ_Сервер.ТаблицаСоответствийДопРеквизитов(Категория,
		ЕстьНастройкиОсновныхРеквизитовДляКатегории);
	СтруктураПараметровЗначенийРеквизитовНоменклатуры = ИС_АЛИ_Сервер.СтруктураПараметровЗначенийРеквизитовНоменклатуры(
		Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории);
	СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры = ИС_АЛИ_Сервер.СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры(
		Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории);

	Для Каждого ДанныеНоменклатуры Из ТаблицаТоваров Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьСтрокуТовара(НоваяСтрока, ДанныеНоменклатуры, ТаблицаСоответствийЗначений,
			СтруктураПараметровЗначенийРеквизитовНоменклатуры,
			СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Процедура ЗаполнитьТовары(МассивРедактируемыхТоваров)

	Для Каждого СтруктураТовара Из МассивРедактируемыхТоваров Цикл
		стрТовары = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(стрТовары, СтруктураТовара);
	КонецЦикла;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Процедура ЗаполнитьЗависимыРеквизиты(ИДСтроки)

	ТаблицаНоменклатуры = ТаблицаЗначенийНоменклатуры();

	ТекущаяСтрока = Товары.НайтиПоИдентификатору(ИДСтроки);

	СтрНоменклатуры = ТаблицаНоменклатуры.Добавить();
	СтрНоменклатуры.Номенклатура 	= ТекущаяСтрока.Номенклатура;
	СтрНоменклатуры.Характеристика 	= ТекущаяСтрока.ХарактеристикаНоменклатуры;
	СтрНоменклатуры.Упаковка 		= ТекущаяСтрока.Упаковка;

	ТаблицаТоваров = ПолучитьДанныеПоНоменклатуре(ТаблицаНоменклатуры);
	ЕстьНастройкиОсновныхРеквизитовДляКатегории = ИС_АЛИ_Сервер.ЕстьНастройкиОсновныхРеквизитовДляКатегории(
		Категория);

	Если ТаблицаТоваров.Количество() Тогда
		ЗаполнитьСтрокуТовара(ТекущаяСтрока, ТаблицаТоваров[0],
			ИС_АЛИ_Сервер.ТаблицаСоответствийДопРеквизитов(Категория,
			ЕстьНастройкиОсновныхРеквизитовДляКатегории),
			ИС_АЛИ_Сервер.СтруктураПараметровЗначенийРеквизитовНоменклатуры(Категория,
			ЕстьНастройкиОсновныхРеквизитовДляКатегории),
			ИС_АЛИ_Сервер.СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры(Категория,
			ЕстьНастройкиОсновныхРеквизитовДляКатегории));
	КонецЕсли;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Функция ПолучитьДанныеПоНоменклатуре(ТаблицаНоменклатуры)

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	СтруктураПараметров.Вставить("Price", Price);	
	СтруктураПараметров.Вставить("discount_price", discount_price);
	СтруктураПараметров.Вставить("Аккаунт", Профиль);
	СтруктураПараметров.Вставить("Категория", Категория);
	СтруктураПараметров.Вставить("Валюта", Валюта);

	ТаблицаТоваров = ЗависимыеРеквизитыНоменклатуры(СтруктураПараметров);

	Возврат ТаблицаТоваров;

КонецФункции

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Процедура ЗаполнитьСтрокуТовара(СтрокаТаблицы, ДанныеЗаполнения, ТаблицаСоответствийЗначений,
	
	СтруктураПараметровЗначенийРеквизитовНоменклатуры, СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры)
	
	СтрокаТаблицы.Номенклатура 					= ДанныеЗаполнения.Номенклатура;
	СтрокаТаблицы.Упаковка 						= ДанныеЗаполнения.Упаковка;
	СтрокаТаблицы.ХарактеристикаНоменклатуры 	= ДанныеЗаполнения.Характеристика;
	СтрокаТаблицы.sku_code						= "";
	СтрокаТаблицы.Штрихкод 						= ДанныеЗаполнения.Штрихкод;

	СтрокаТаблицы.Цена							= ДанныеЗаполнения.Цена;
	СтрокаТаблицы.ЦенаСоСкидкой					= ДанныеЗаполнения.ЦенаСоСкидкой;	
	СтрокаТаблицы.ДлинаУпаковки 				= Макс(ДанныеЗаполнения.Высота, ДанныеЗаполнения.Глубина,
		ДанныеЗаполнения.Ширина);
	СтрокаТаблицы.ВысотаУпаковки 				= Мин(ДанныеЗаполнения.Высота, ДанныеЗаполнения.Глубина,
		ДанныеЗаполнения.Ширина);
	СтрокаТаблицы.ШиринаУпаковки 				= (ДанныеЗаполнения.Высота + ДанныеЗаполнения.Глубина
		+ ДанныеЗаполнения.Ширина) - (СтрокаТаблицы.ДлинаУпаковки + СтрокаТаблицы.ВысотаУпаковки);
	СтрокаТаблицы.ВесУпаковки 					= ДанныеЗаполнения.ВесУпаковки;
	СтрокаТаблицы.ИспользоватьХарактеристики 	= ДанныеЗаполнения.ИспользоватьХарактеристики;
	СтрокаТаблицы.ИспользоватьУпаковки 			= ДанныеЗаполнения.ИспользоватьУпаковки;
	
	РазделительФотографий = "";
	ИС_АЛИ_Сервер.ЗаполнитьЗначенияПоДопРеквизитам(СтрокаТаблицы, ТаблицаСоответствийЗначений,
	РазделительФотографий);
	ИС_АЛИ_Сервер.ЗаполнитьЗначенияПоРеквизитамНоменклатуры(СтрокаТаблицы,
	СтруктураПараметровЗначенийРеквизитовНоменклатуры, РазделительФотографий);
	ИС_АЛИ_Сервер.ЗаполнитьЗначенияПоРеквизитамХарактеристикиНоменклатуры(СтрокаТаблицы,
	СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры, РазделительФотографий);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Процедура ИнициализироватьХарактеристики()
	
	УдалитьХарактеристики();
	
	Элементы.ГруппаШапкаПредупреждение.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Категория) Тогда
		
		Элементы.ГруппаТаблица.Доступность 		= Истина;
		Элементы.СохранитьТовары.Доступность 	= Истина;
		ИмяТабличнойЧасти = "Товары";
		
		ОбязательныеХарактеристики 	= Новый Массив;
		АспектныеХарактеристики 	= Новый Массив;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИС_АЛИ_Атрибут.Наименование КАК Наименование,
		|	ИС_АЛИ_Атрибут.is_multi_select КАК НаборЗначений,
		|	ИС_АЛИ_Атрибут.is_enum_prop КАК Справочный,
		|	ИС_АЛИ_КатегорииТоваровproperties.is_required КАК Обязательная,
		|	ИС_АЛИ_Атрибут.Код КАК Код
		|ИЗ
		|	Справочник.ИС_АЛИ_КатегорииТоваров.properties КАК ИС_АЛИ_КатегорииТоваровproperties
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_АЛИ_Атрибут КАК ИС_АЛИ_Атрибут
		|		ПО ИС_АЛИ_КатегорииТоваровproperties.Атрибут = ИС_АЛИ_Атрибут.Ссылка
		|ГДЕ
		|	ИС_АЛИ_КатегорииТоваровproperties.Ссылка = &Категория
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИС_АЛИ_АтрибутРазмер.Наименование,
		|	ИС_АЛИ_АтрибутРазмер.is_multi_select,
		|	ИС_АЛИ_АтрибутРазмер.is_enum_prop,
		|	ИС_АЛИ_КатегорииТоваровsku_properties.is_required,
		|	ИС_АЛИ_АтрибутРазмер.Код
		|ИЗ
		|	Справочник.ИС_АЛИ_КатегорииТоваров.sku_properties КАК ИС_АЛИ_КатегорииТоваровsku_properties
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_АЛИ_Атрибут КАК ИС_АЛИ_АтрибутРазмер
		|		ПО ИС_АЛИ_КатегорииТоваровsku_properties.Атрибут = ИС_АЛИ_АтрибутРазмер.Ссылка
		|ГДЕ
		|	ИС_АЛИ_КатегорииТоваровsku_properties.Ссылка = &Категория
		|
		|УПОРЯДОЧИТЬ ПО
		|	Обязательная УБЫВ";
		
		Запрос.УстановитьПараметр("Категория", Категория);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		ЦветФона = Новый Цвет(255, 255, 255);
			
		Пока Выборка.Следующий() Цикл
			
			ИмяРеквизита 		= "Атрибут_" + Формат(Выборка.Код, "ЧГ=0");
			МножественныйВыбор  = Выборка.НаборЗначений;
			
			Если Выборка.НаборЗначений Тогда
				ТипРеквизита 	= Новый ОписаниеТипов("СписокЗначений");
			ИначеЕсли Выборка.Справочный Тогда
				ТипРеквизита 	= Новый ОписаниеТипов("СправочникСсылка.ИС_АЛИ_ЗначенияАтрибутов");
			Иначе
				ТипРеквизита 	= Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная));
			КонецЕсли; 
			
			ПутьКДанным  		= ?(ИмяТабличнойЧасти = "", ИмяРеквизита, ИмяТабличнойЧасти + "." + ИмяРеквизита);
			СоздатьРеквизитФормы(ИмяРеквизита, ТипРеквизита, Выборка.Наименование, ИмяТабличнойЧасти);
			
			Если Выборка.Обязательная Тогда
				ОбязательныеХарактеристики.Добавить(ИмяРеквизита);
			КонецЕсли;
			
			СоздатьПолеФормы(Выборка, ИмяРеквизита, ПутьКДанным, МножественныйВыбор, ЦветФона);
						
		КонецЦикла;
		
		СписокОбязательныхХарактеристик = Новый ФиксированныйМассив(ОбязательныеХарактеристики);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Процедура УдалитьХарактеристики()

	ЭлементыХарактеристик = Элементы.ГруппаХарактеристики.ПодчиненныеЭлементы;

	УдаляемыеПоля = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;

	Для Каждого Элемент Из ЭлементыХарактеристик Цикл
		УдаляемыеПоля.Добавить(Элемент);
		УдаляемыеРеквизиты.Добавить(Элемент.ПутьКДанным);
	КонецЦикла;

	Для Каждого Элемент Из УдаляемыеПоля Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;

	ИзменитьРеквизиты( , УдаляемыеРеквизиты);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Процедура СоздатьРеквизитФормы(ИмяРеквизита, Тип, ЗаголовокПоля = "", ИмяТабличнойЧасти = "")

	ДобавляемыеРеквизиты = Новый Массив;

	ИмяРеквизита = ИмяРеквизита;
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Тип, ИмяТабличнойЧасти, ЗаголовокПоля);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);

	ИзменитьРеквизиты(ДобавляемыеРеквизиты);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Процедура СоздатьПолеФормы(Выборка, ИмяРеквизита, ПутьКДанным, МножественныйВыбор, ЦветФона)

	ГруппаФормы = Элементы.ГруппаХарактеристики;
	//type 		= НРег(Выборка.ТипХарактеристики);
	ВидПоля = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), ГруппаФормы);
	НовыйЭлемент.ПутьКДанным 	= ПутьКДанным;
	НовыйЭлемент.Вид 			= ВидПоля;
	НовыйЭлемент.Заголовок		= Выборка.Наименование + ?(Выборка.Обязательная, "*", "");
	
	// Оформление
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	//Подсказка = Новый ФорматированнаяСтрока(Выборка.Описание, Новый Шрифт(, 10, Истина));
	//НовыйЭлемент.РасширеннаяПодсказка.Заголовок = Подсказка;
	//НовыйЭлемент.ОтображениеПодсказки 			= ОтображениеПодсказки.Кнопка;
	НовыйЭлемент.ЦветФонаЗаголовка 				= ЦветФона;
	//Если type = "multiline" Тогда
	//	НовыйЭлемент.МногострочныйРежим 	= Истина;
	//	НовыйЭлемент.Высота 				= 1;
	//	НовыйЭлемент.РастягиватьПоВертикали = Ложь;
	//КонецЕсли;

	Если Не НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка Тогда
		НовыйЭлемент.РастягиватьПоГоризонтали 	= Истина;
		НовыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
		НовыйЭлемент.АвтоОтметкаНезаполненного 	= Выборка.Обязательная;
		НовыйЭлемент.КнопкаОчистки 	= Истина;
	КонецЕсли;
	
	// Выбор из списка
	Если Не МножественныйВыбор Тогда
		НовыйЭлемент.КнопкаВыбора 				= Истина;
		НовыйЭлемент.ОтображениеКнопкиВыбора 	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		НовыйЭлемент.ИсторияВыбораПриВводе  	= ИсторияВыбораПриВводе.НеИспользовать;
		НовыйЭлемент.КнопкаВыпадающегоСписка 	= Ложь;
		НовыйЭлемент.КнопкаСоздания 			= Ложь;
		НовыйЭлемент.КнопкаОткрытия 			= Ложь;
		НовыйЭлемент.РедактированиеТекста 		= Ложь;
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ХарактеристикаНачалоВыбора");
	КонецЕсли;

	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ХарактеристикаПриИзменении");

	Если МножественныйВыбор Тогда
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ХарактеристикаНачалоМножественногоВыбора");
		НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", "ХарактеристикаОбработкаМножественногоВыбора");
		НовыйЭлемент.КнопкаВыбора 	= Истина;
	КонецЕсли;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Процедура ЗаполнитьКолонкуСопоставленнымиЗначениямиНаСервере(ИмяКолонки)

	ЕстьНастройкиОсновныхРеквизитовДляКатегории = ИС_АЛИ_Сервер.ЕстьНастройкиОсновныхРеквизитовДляКатегории(
		Категория);
	ТаблицаСоответствийЗначений = ИС_АЛИ_Сервер.ТаблицаСоответствийДопРеквизитов(Категория,
		ЕстьНастройкиОсновныхРеквизитовДляКатегории);
	СтруктураПараметровЗначенийРеквизитовНоменклатуры = ИС_АЛИ_Сервер.СтруктураПараметровЗначенийРеквизитовНоменклатуры(
		Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории);
	СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры = ИС_АЛИ_Сервер.СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры(
		Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории);
			
	РазделительФотографий = "";

	Для Каждого СтрокаТаблицы Из Товары Цикл

		ИС_АЛИ_Сервер.ЗаполнитьЗначенияПоДопРеквизитам(СтрокаТаблицы, ТаблицаСоответствийЗначений,
			РазделительФотографий, ИмяКолонки);
		ИС_АЛИ_Сервер.ЗаполнитьЗначенияПоРеквизитамНоменклатуры(СтрокаТаблицы,
			СтруктураПараметровЗначенийРеквизитовНоменклатуры, РазделительФотографий, ИмяКолонки);
		ИС_АЛИ_Сервер.ЗаполнитьЗначенияПоРеквизитамХарактеристикиНоменклатуры(СтрокаТаблицы,
			СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры, РазделительФотографий, ИмяКолонки);

	КонецЦикла;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Процедура СохранитьТоварыНаСервере()

	МассивТоваров = Новый Массив;
	ПоляАтрибутов = Элементы.ГруппаХарактеристики.ПодчиненныеЭлементы; 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_АЛИ_КатегорииТоваровsku_properties.Атрибут КАК Атрибут
		|ИЗ
		|	Справочник.ИС_АЛИ_КатегорииТоваров.sku_properties КАК ИС_АЛИ_КатегорииТоваровsku_properties
		|ГДЕ
		|	ИС_АЛИ_КатегорииТоваровsku_properties.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Категория);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	АтрибутыРазмера = РезультатЗапроса.Выгрузить();
	
	МассивОбработаныхПризнаков = Новый Массив;
	
	Товары.Сортировать("КолонкаОбъединитьНаОднойКарточке Возр");
	
	СтруктураТовара = Неопределено;
	
	Для Каждого стр Из Товары Цикл
		
		Если стр.КолонкаОбъединитьНаОднойКарточке = "" Тогда
			
			Если ЗначениеЗаполнено(СтруктураТовара) Тогда
				МассивТоваров.Добавить(СтруктураТовара);
			КонецЕсли;
			
        	СтруктураТовара = СтруктураДобавленияТовара();
			СтруктураТовара = ЗаполнитьСтруктуруДобавленияТовара(стр, Категория, СтруктураТовара);
			СтруктураТовара.attribute_list = ЗаполнениеОсновныхАтрибутов(стр, ПоляАтрибутов, АтрибутыРазмера);
			СтруктураТовара.sku_info_list.Добавить(ЗаполнениеРазмерныхАтрибутов(стр, ПоляАтрибутов, АтрибутыРазмера));			

		ИначеЕсли МассивОбработаныхПризнаков.Найти(стр.КолонкаОбъединитьНаОднойКарточке) <> Неопределено Тогда
			СтруктураТовара.sku_info_list.Добавить(ЗаполнениеРазмерныхАтрибутов(стр, ПоляАтрибутов, АтрибутыРазмера));			
		Иначе 
			
			Если ЗначениеЗаполнено(СтруктураТовара) Тогда
				МассивТоваров.Добавить(СтруктураТовара);
			КонецЕсли;
			
			МассивОбработаныхПризнаков.Добавить(стр.КолонкаОбъединитьНаОднойКарточке);
			СтруктураТовара = СтруктураДобавленияТовара();
			СтруктураТовара = ЗаполнитьСтруктуруДобавленияТовара(стр, Категория, СтруктураТовара);
			СтруктураТовара.attribute_list = ЗаполнениеОсновныхАтрибутов(стр, ПоляАтрибутов, АтрибутыРазмера);			
			СтруктураТовара.sku_info_list.Добавить(ЗаполнениеРазмерныхАтрибутов(стр, ПоляАтрибутов, АтрибутыРазмера));			
			
		КонецЕсли;   
				
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтруктураТовара) Тогда
		МассивТоваров.Добавить(СтруктураТовара);
	КонецЕсли;
	
	ИС_АЛИ_Сервер.СозданиеКТ(Профиль, МассивТоваров);
	
	//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
	Если СоздатьКарточкиПослеВыгрузки Тогда
		СоздатьСопоставитьНоменклатуру(МассивТоваров);
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
	
КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
&НаСервере
Функция ЗначенияРавны(Знач1, Знач2) 
		
	Если ТипЗнч(Знач1) = Тип("СписокЗначений") Тогда
	
		Если Знач1.Количество() = Знач2.Количество() Тогда
			Результат = Истина;
			Для Каждого элем Из Знач1 Цикл
				Если знач2.НайтиПоЗначению(элем.Значение) = Неопределено Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;		
			КонецЦикла;	
		Иначе
			Результат = Ложь;	
		КонецЕсли;
		
	Иначе	
		Результат = Знач1 = Знач2;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Функция СтруктураДобавленияТовара()

	Результат = Новый Структура;

	Результат.Вставить("aliexpress_category_id", 0); 
	Результат.Вставить("attribute_list", Новый Массив);
	Результат.Вставить("freight_template_id", 0);
	Результат.Вставить("main_image_urls_list", Новый Массив); 
	Результат.Вставить("multi_language_description_list", Новый Массив); 
	Результат.Вставить("language", "ru");
	Результат.Вставить("multi_language_subject_list", Новый Массив);
	Результат.Вставить("package_width", 1);  
	Результат.Вставить("package_length", 1); 
	Результат.Вставить("package_height", 1); 
	Результат.Вставить("product_unit", 100000015); 
	Результат.Вставить("weight", "0.01");  
	Результат.Вставить("shipping_lead_time", 5);
	Результат.Вставить("sku_info_list", Новый Массив);

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Функция ЗаполнитьСтруктуруДобавленияТовара(Источник, Категория, СтруктураТовара) Экспорт
	

	СтруктураТовара.aliexpress_category_id	= Категория.Код;
	СтруктураТовара.freight_template_id		= Источник.freight_template_id;
	
	Описание = Новый Структура("language, web, mobile", "ru_RU", Источник.multi_language_description_list, Источник.multi_language_description_list);
	СтруктураТовара.multi_language_description_list.Добавить(Описание);
			
	СтруктураТовара.main_image_urls_list.Добавить(Источник.main_image_urls_list);
	
	Название = Новый Структура("language, subject", "ru_RU", Источник.multi_language_subject_list);
	СтруктураТовара.multi_language_subject_list.Добавить(Название);
	
	СтруктураТовара.weight		 	= СтрЗаменить(Строка(Формат(Источник.ВесУпаковки / 1000, "ЧРД=.; ЧН=0; ЧГ=0")), Символы.НПП, "");	
	СтруктураТовара.package_length	= Источник.ДлинаУпаковки / 10;
	СтруктураТовара.package_width 	= Источник.ШиринаУпаковки / 10;
	СтруктураТовара.package_height	= Источник.ВысотаУпаковки / 10;
	СтруктураТовара.product_unit 	= Источник.product_unit;			
	СтруктураТовара.shipping_lead_time	= Источник.shipping_lead_time;	
	
	Возврат СтруктураТовара;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Функция ЗаполнениеОсновныхАтрибутов(Источник, ПоляАтрибутов, АтрибутыРазмера)

	Результат = Новый Массив;

	Для Каждого Поле Из ПоляАтрибутов Цикл

		ЗначениеАтрибута = Источник[Поле.Имя];
		Если Не ЗначениеЗаполнено(ЗначениеАтрибута) Тогда
			Продолжить;	
		КонецЕсли;
		
		ИдАтрибута = Число(СтрРазделить(Поле.Имя, "_")[1]);
		СтруктураАтрибута = СтруктураОсновногоАтрибутаДобавлениеТовара(ИдАтрибута, АтрибутыРазмера);
		Если СтруктураАтрибута.attribute_name_id = "" Тогда
			Продолжить;
		КонецЕсли;	
			
		Если ТипЗнч(ЗначениеАтрибута) = Тип("СписокЗначений") Тогда
			МассивВыбранныхЗначений = ЗначениеАтрибута.ВыгрузитьЗначения();
			Для Каждого Значение Из МассивВыбранныхЗначений Цикл
				Если ЗначениеЗаполнено(Значение) Тогда					
					СтруктураАтрибута.attribute_value_id = СтрЗаменить(Строка(Значение.Код), Символы.НПП, "");
					СтруктураАтрибута.attribute_value = СтрЗаменить(Строка(Значение.Наименование), Символы.НПП, "");;
				КонецЕсли;
			КонецЦикла;
		Иначе
			СтруктураАтрибута.attribute_value_id = СтрЗаменить(Строка(ЗначениеАтрибута.Код), Символы.НПП, "");
			СтруктураАтрибута.attribute_value = СтрЗаменить(Строка(ЗначениеАтрибута.Наименование), Символы.НПП, "");;
		КонецЕсли;

		Результат.Добавить(СтруктураАтрибута);

	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Функция СтруктураОсновногоАтрибутаДобавлениеТовара(ИДАтрибута, АтрибутыРазмеров)

	Результат = Новый Структура;
	Результат.Вставить("attribute_name", "");
	Результат.Вставить("attribute_name_id", "");
	Результат.Вставить("attribute_value_id", ""); 
	Результат.Вставить("attribute_value", ""); 

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИС_АЛИ_Атрибут.Код КАК Код,
	|	ИС_АЛИ_Атрибут.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ИС_АЛИ_Атрибут КАК ИС_АЛИ_Атрибут
	|ГДЕ
	|	ИС_АЛИ_Атрибут.Код = &Код
	|	И НЕ ИС_АЛИ_Атрибут.Ссылка В (&Массив)";

	Запрос.УстановитьПараметр("Код", ИДАтрибута);
	Запрос.УстановитьПараметр("Массив", АтрибутыРазмеров);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Результат.attribute_name 			= Выборка.Наименование;
		Результат.attribute_name_id		 	= СтрЗаменить(Строка(Выборка.Код), Символы.НПП, "");
	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Функция СтруктураРазмераАтрибутаДобавлениеТовара(ИДАтрибута, АтрибутыРазмеров)

	Результат = Новый Структура;	
	Результат.Вставить("sku_attribute_name_id", "");
	Результат.Вставить("sku_attribute_value_id", ""); 
	Результат.Вставить("sku_attribute_value_definition_name", ""); 

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИС_АЛИ_Атрибут.Код КАК Код	
	|ИЗ
	|	Справочник.ИС_АЛИ_Атрибут КАК ИС_АЛИ_Атрибут
	|ГДЕ
	|	ИС_АЛИ_Атрибут.Код = &Код
	|	И ИС_АЛИ_Атрибут.Ссылка В (&Массив)";

	Запрос.УстановитьПараметр("Код", ИДАтрибута);
	Запрос.УстановитьПараметр("Массив", АтрибутыРазмеров);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда		
		Результат.sku_attribute_name_id	= СтрЗаменить(Строка(Выборка.Код), Символы.НПП, "");
	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574
Функция ЗаполнениеРазмерныхАтрибутов(Источник, ПоляАтрибутов, АтрибутыРазмера)
	
	
	Результат = Новый Структура;
	Результат.Вставить("sku_code", Источник.sku_code);
	Результат.Вставить("price", СтрЗаменить(Строка(Формат(Источник.Цена, "ЧРД=.; ЧН=0; ЧГ=0")), Символы.НПП, ""));
	Результат.Вставить("discount_price", СтрЗаменить(Строка(Формат(Источник.ЦенаСоСкидкой, "ЧРД=.; ЧН=0; ЧГ=0")), Символы.НПП, ""));
	Результат.Вставить("inventory", 0);
	
	МассивАтрибутов = Новый Массив;

	Для Каждого Поле Из ПоляАтрибутов Цикл

		ЗначениеАтрибута = Источник[Поле.Имя];
		Если Не ЗначениеЗаполнено(ЗначениеАтрибута) Тогда
			Продолжить;	
		КонецЕсли;
		
		ИдАтрибута = Число(СтрРазделить(Поле.Имя, "_")[1]);
		СтруктураАтрибута = СтруктураРазмераАтрибутаДобавлениеТовара(ИдАтрибута, АтрибутыРазмера);
		Если СтруктураАтрибута.sku_attribute_name_id = "" Тогда
			Продолжить;
		КонецЕсли;	
			
		Если ТипЗнч(ЗначениеАтрибута) = Тип("СписокЗначений") Тогда
			МассивВыбранныхЗначений = ЗначениеАтрибута.ВыгрузитьЗначения();
			Для Каждого Значение Из МассивВыбранныхЗначений Цикл
				Если ЗначениеЗаполнено(Значение) Тогда					
					СтруктураАтрибута.sku_attribute_value_id = СтрЗаменить(Строка(Значение.Код), Символы.НПП, "");
					СтруктураАтрибута.sku_attribute_value_definition_name = Значение.Наименование;
				КонецЕсли;
			КонецЦикла;
		Иначе
			СтруктураАтрибута.sku_attribute_value_id = СтрЗаменить(Строка(ЗначениеАтрибута.Код), Символы.НПП, "");
			СтруктураАтрибута.sku_attribute_value_definition_name = ЗначениеАтрибута.Наименование;
		КонецЕсли;

		МассивАтрибутов.Добавить(СтруктураАтрибута);

	КонецЦикла; 
	
	Результат.Вставить("sku_attributes_list", МассивАтрибутов);

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #62574

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
&НаСервере
Функция СтруктураСопоставленияТовара()
	
	СтруктураСопоставления = Новый Структура;
	
	СтруктураСопоставления.Вставить("Номенклатура");
	СтруктураСопоставления.Вставить("ХарактеристикаНоменклатуры");
	СтруктураСопоставления.Вставить("Упаковка");
	
	Возврат СтруктураСопоставления;
	
КонецФункции //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
&НаСервере
Процедура СоздатьСопоставитьНоменклатуру(МассивТоваров)
	
	Перезаполнять = Ложь;	
	
	ИС_АЛИ_Сервер.ПолучитьКарточкиТоваров(Профиль, Перезаполнять);
	
	Если СопоставитьНоменклатуруАвтоматически Тогда
		
		МассивКодов = Новый Массив;
		
		Для Каждого Товар Из МассивТоваров Цикл
			МассивКодов.Добавить(Товар.sku_code);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИС_АЛИ_Вариации.Ссылка КАК ВариацияАЛИ,
			|	ИС_АЛИ_Вариации.КодВариации КАК sku_code
			|ПОМЕСТИТЬ ВТ_Вариации
			|ИЗ
			|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
			|ГДЕ
			|	ИС_АЛИ_Вариации.КодВариации В(&МассивКодов)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Вариации.ВариацияАЛИ КАК ВариацияАЛИ,
			|	ВТ_Вариации.sku_code КАК sku_code,
			|	ВЫБОР
			|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ = ЗНАЧЕНИЕ(Справочник.ИС_АЛИ_Вариации.ПустаяСсылка)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ТребуетсяСопоставление
			|ПОМЕСТИТЬ ВТ_ОтборНесопоставленных
			|ИЗ
			|	ВТ_Вариации КАК ВТ_Вариации
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеХарактеристик КАК ИС_АЛИ_СоответствиеХарактеристик
			|		ПО ВТ_Вариации.ВариацияАЛИ = ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ
			|			И (ИС_АЛИ_СоответствиеХарактеристик.Профиль = &Профиль)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ОтборНесопоставленных.ВариацияАЛИ КАК ВариацияАЛИ,
			|	ВТ_ОтборНесопоставленных.sku_code КАК sku_code,
			|	ВТ_ОтборНесопоставленных.ТребуетсяСопоставление КАК ТребуетсяСопоставление
			|ИЗ
			|	ВТ_ОтборНесопоставленных КАК ВТ_ОтборНесопоставленных
			|ГДЕ
			|	ВТ_ОтборНесопоставленных.ТребуетсяСопоставление";
		
		Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
		Запрос.УстановитьПараметр("Профиль",     Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаВариации = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаВариации.Следующий() Цикл
			
			НайденныеСтроки = МассивТоваров.НайтиСтроки(Новый Структура("sku_code", ВыборкаВариации.sku_code));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				ДанныеСопоставления = НайденныеСтроки[0].ДанныеСопоставления;
				
				Если Не ЗначениеЗаполнено(ДанныеСопоставления.Упаковка) Тогда			
					ДанныеСопоставления.Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСопоставления.Номенклатура, "ЕдиницаИзмерения");		
				КонецЕсли;
				
				ИС_АЛИ_Сервер.ДобавитьСоответствиеНоменклатуры(Профиль, ВыборкаВариации.ВариацияАЛИ, 
					ДанныеСопоставления.Номенклатура, ДанныеСопоставления.ХарактеристикаНоменклатуры, ДанныеСопоставления.Упаковка);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

//----------------------------------------------------------

&НаСервереБезКонтекста
Функция АтрибутПоКоду(ИДстрокой)
	Возврат ИС_АЛИ_Сервер.АтрибутПоКоду(ИДстрокой);	
КонецФункции

&НаСервере
Функция ПреобразоватьJSONВСоответствие(JSONСтрокой, ИменаСвойствСоЗначениямиДата = Неопределено,
	ОжидаемыйФорматДаты = Неопределено, ИмяФункцииВосстановления = Неопределено,
	МодульФункцииВосстановления = Неопределено, ИменаСвойствДляОбработкиВосстановления = Неопределено) Экспорт

	ИспользуемыйФорматДаты = ?(ОжидаемыйФорматДаты = Неопределено, ФорматДатыJSON.ISO, ОжидаемыйФорматДаты);

	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(JSONСтрокой);
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Истина, ИменаСвойствСоЗначениямиДата, ИспользуемыйФорматДаты,
			ИмяФункцииВосстановления, МодульФункцииВосстановления, , ИменаСвойствДляОбработкиВосстановления);
		ЧтениеJSON.Закрыть();
	Исключение
		ИмяСобытия 	= "ПреобразоватьJSONВСоответствие";
		Комментарий = "Не удалось прочитать JSON: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДанныеJSON = Новый Соответствие;
	КонецПопытки;

	Возврат ДанныеJSON;

КонецФункции 

&НаСервереБезКонтекста
Функция ВидПоля(type) Экспорт

	ВидПоля = ВидПоляФормы.ПолеВвода;

	Если НРег(type) = "boolean" Тогда
		ВидПоля = ВидПоляФормы.ПолеФлажка;
	КонецЕсли;

	Возврат ВидПоля;

КонецФункции 

&НаСервереБезКонтекста
Функция ПроверитьИЗаполнитьПараметрыЗапроса(ПараметрыЗапроса, НастройкиСоединения)
      
    Если Не ЗначениеЗаполнено(НастройкиСоединения["OzonАдресСервисаAPI"]) Тогда
   		ОбщегоНазначения.СообщитьПользователю(
   			"Для данного профиля не заполнен ""Адрес Сервиса Ozon"", проверьте настройки авторизации");
   		Возврат Ложь;
   	КонецЕсли;
   	
   	Если Не ЗначениеЗаполнено(НастройкиСоединения["OzonApiKey"]) Тогда
   		ОбщегоНазначения.СообщитьПользователю(
   			"Для данного профиля не заполнен ""Ozon Api Key"", проверьте настройки авторизации");
   		Возврат Ложь;
   	КонецЕсли;
   	
   	Если Не ЗначениеЗаполнено(НастройкиСоединения["OzonClientID"]) Тогда
   		ОбщегоНазначения.СообщитьПользователю(
   			"Для данного профиля не заполнен ""Ozon Client ID"", проверьте настройки авторизации");
   		Возврат Ложь;
   	КонецЕсли;
    
	ПараметрыЗапроса.Сервер = НастройкиСоединения["OzonАдресСервисаAPI"];
	ПараметрыЗапроса.Порт = 443;
	ПараметрыЗапроса.ЗащищенноеСоединение = Истина;
	ПараметрыЗапроса.Заголовки.Вставить("Client-Id", НастройкиСоединения["OzonClientID"]);
	ПараметрыЗапроса.Заголовки.Вставить("Api-Key", НастройкиСоединения["OzonApiKey"]);
	
	Возврат Истина;	

КонецФункции 

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
&НаСервереБезКонтекста
Функция ПреобразоватьДанныеВJSON(Данные, Знач ВариантЗаписиДаты = Неопределено) Экспорт

	Результат = "";
	Если ВариантЗаписиДаты = Неопределено Тогда
		ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	КонецЕсли;

	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);
		НастройкиСериализации = Новый НастройкиСериализацииJSON;
		НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДаты;
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, Данные, НастройкиСериализации);
		Результат = ЗаписьJSON.Закрыть();
	Исключение
		ИмяСобытия 	= "ПреобразоватьДанныеВJSON";
		Комментарий = "Не удалось записать JSON: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//Ozon_ЖурналСобытийВызовСервера.Ошибка(ИмяСобытия, Комментарий);
		//Ozon_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ИмяСобытия + "; " + Комментарий);
	КонецПопытки;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

&НаКлиенте
Процедура ИсторияОбновлений(Команда)
	ПерейтиПоНавигационнойСсылке("https://seller.ozon.ru/app/products/import-history/file");
КонецПроцедуры

// УНИКАЛЬНЫЕ УНФ -------------------------------------------- 

&НаСервере
Функция ШтрихкодыНоменклатуры(Номенклатура, Характеристика, Упаковка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
		|	И ШтрихкодыНоменклатуры.Характеристика = &Характеристика
		|	И ШтрихкодыНоменклатуры.Упаковка = &Упаковка";
	
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Упаковка", 		Упаковка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Штрихкод");
	
	Возврат Результат;
	
КонецФункции   

&НаСервере
Функция ПараметрыФормыПодбораТоваров(Профиль, Валюта, УникальныйИдентификатор, ВидЦены) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Соглашение", Неопределено);
	ПараметрыФормы.Вставить("Организация", Профиль.Организация);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Ложь);
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки", Ложь);
	ПараметрыФормы.Вставить("Валюта", Валюта);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Подбор товаров';"));
	ПараметрыФормы.Вставить("Дата", ТекущаяДатаСеанса());
	ПараметрыФормы.Вставить("Документ", ПредопределенноеЗначение("Документ.ЗаказКлиента.ПустаяСсылка"));
	ПараметрыФормы.Вставить("ПодборВариантовОбеспечения", Ложь);
	ПараметрыФормы.Вставить("ОстаткиПоВсемСкладам", Истина);
	ПараметрыФормы.Вставить("ВидЦены", ВидЦены);
	ПараметрыФормы.Вставить("РежимПодбораБезСоглашенийСКлиентами", Истина);

	Результат = Новый Структура;
	Результат.Вставить("ИмяФормы", "Обработка.ПодборТоваровВДокументПродажи.Форма");
	Результат.Вставить("ПараметрыФормы", ПараметрыФормы);

	Возврат Результат;

КонецФункции 

&НаСервереБезКонтекста
Функция ТаблицаНоменклатурыПоТаблицеПодбора(ТаблицаПодбора) Экспорт

	Результат = ТаблицаПодбора.Скопировать( , "Номенклатура, Упаковка, Характеристика");

	Возврат Результат;

КонецФункции 

&НаСервереБезКонтекста
Функция ТаблицаЗначенийНоменклатуры() Экспорт

	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатуры.Колонки.Добавить("Характеристика",
		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаНоменклатуры.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));

	Возврат ТаблицаНоменклатуры;

КонецФункции 

&НаСервере
Функция ЗависимыеРеквизитыНоменклатуры(СтруктураПараметров) Экспорт

	ИспользуетсяЦенообразование25 = Не Метаданные.ФункциональныеОпции.Найти("ИспользуетсяЦенообразование25")
		= Неопределено И ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование25");

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ТаблицаНоменклатуры.Упаковка КАК Упаковка,
		|	ТаблицаНоменклатуры.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ вт_ТаблицаНоменклатуры
		|ИЗ
		|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	НаборыУпаковок.Ссылка КАК НаборУпаковок,
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка
		|ПОМЕСТИТЬ вт_Упаковки
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыУпаковок КАК НаборыУпаковок
		|		ПО Номенклатура.НаборУпаковок = НаборыУпаковок.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО (НаборыУпаковок.Ссылка = УпаковкиЕдиницыИзмерения.Владелец)
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И Номенклатура.ИспользоватьУпаковки
		|	И НЕ Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
		|	И Номенклатура.Ссылка В
		|			(ВЫБРАТЬ
		|				вт_ТаблицаНоменклатуры.Номенклатура
		|			ИЗ
		|				вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	НаборыУпаковок.Ссылка,
		|	УпаковкиЕдиницыИзмерения.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыУпаковок КАК НаборыУпаковок
		|		ПО Номенклатура.НаборУпаковок = НаборыУпаковок.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО Номенклатура.Ссылка = УпаковкиЕдиницыИзмерения.Владелец
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И Номенклатура.ИспользоватьУпаковки
		|	И Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
		|	И Номенклатура.Ссылка В
		|			(ВЫБРАТЬ
		|				вт_ТаблицаНоменклатуры.Номенклатура
		|			ИЗ
		|				вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Упаковки.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_Упаковки.Упаковка) КАК Упаковка
		|ПОМЕСТИТЬ вт_КоличествоУпаковок
		|ИЗ
		|	вт_Упаковки КАК вт_Упаковки
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_Упаковки.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_Упаковки.Упаковка) = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_КоличествоУпаковок.Номенклатура КАК Номенклатура,
		|	вт_Упаковки.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ вт_УпаковкаПоУмолчанию
		|ИЗ
		|	вт_КоличествоУпаковок КАК вт_КоличествоУпаковок
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Упаковки КАК вт_Упаковки
		|		ПО вт_КоличествоУпаковок.Номенклатура = вт_Упаковки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА вт_ТаблицаНоменклатуры.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				И НЕ вт_УпаковкаПоУмолчанию.Упаковка ЕСТЬ NULL
		|			ТОГДА вт_УпаковкаПоУмолчанию.Упаковка
		|		ИНАЧЕ вт_ТаблицаНоменклатуры.Упаковка
		|	КОНЕЦ КАК Упаковка,
		|	вт_ТаблицаНоменклатуры.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ вт_ТаблицаНоменклатурыДополненная
		|ИЗ
		|	вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_УпаковкаПоУмолчанию КАК вт_УпаковкаПоУмолчанию
		|		ПО вт_ТаблицаНоменклатуры.Номенклатура = вт_УпаковкаПоУмолчанию.Номенклатура
		|;" 
		
		+ ?(ИспользуетсяЦенообразование25,
		
		"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|	КОНЕЦ КАК Числитель,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|	КОНЕЦ КАК Знаменатель,
		|	ЦеныНоменклатурыСрезПоследних.Период КАК ДатаУстановкиЦены,
		|	ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) / ЕСТЬNULL(КурсВалютВалюта.Курс, 1) * ЕСТЬNULL(КурсВалютВалюта.Кратность, 1) КАК ЧИСЛО(15, 2)) КАК Цена
		|ПОМЕСТИТЬ вт_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		//|			&Период, 
		|			,
		//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		|			(Номенклатура, ХарактеристикаЦО) В
		|				(ВЫБРАТЬ
		|					вт_ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|					ВЫБОР
		|						КОГДА вт_ТаблицаНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|							ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
		|						ИНАЧЕ вт_ТаблицаНоменклатуры.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования
		|					КОНЕЦ
		|				ИЗ
		|					вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО ЦеныНоменклатурыСрезПоследних.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка
		//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
		//|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсВалютВалюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Валюта) КАК КурсВалютВалюта
		//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		|		ПО (ИСТИНА)
		|;"
		
		,
		
		"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|	КОНЕЦ КАК Числитель,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|	КОНЕЦ КАК Знаменатель,
		|	ЦеныНоменклатурыСрезПоследних.Период КАК ДатаУстановкиЦены,
		|	ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) / ЕСТЬNULL(КурсВалютВалюта.Курс, 1) * ЕСТЬNULL(КурсВалютВалюта.Кратность, 1) КАК ЧИСЛО(15, 2)) КАК Цена
		|ПОМЕСТИТЬ вт_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		//|			&Период, 
		|			,
		//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		|			(Номенклатура, Характеристика) В
		|				(ВЫБРАТЬ
		|					вт_ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|					вт_ТаблицаНоменклатуры.Характеристика КАК Характеристика
		|				ИЗ
		|					вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО (ЦеныНоменклатурыСрезПоследних.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка)
		//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
		//|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсВалютВалюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Валюта) КАК КурсВалютВалюта
		//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		|		ПО (ИСТИНА)
		|;") 
		
		+ 
		
		"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вт_ТаблицаНоменклатурыДополненная.Номенклатура КАК Номенклатура,
		|	вт_ТаблицаНоменклатурыДополненная.Характеристика КАК Характеристика,
		|	вт_ТаблицаНоменклатурыДополненная.Упаковка КАК Упаковка,
		|	СпрНоменклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	СпрНоменклатура.СтавкаНДС КАК СтавкаНДС,
		|	ВЫБОР
		|		КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ИспользоватьХарактеристики,
		|	СпрНоменклатура.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
		|	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод,
		|	ВЫБОР
		|		КОГДА СпрНоменклатура.ИспользоватьУпаковки
		|				И НЕ УпаковкиЕдиницыИзмерения.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА УпаковкиЕдиницыИзмерения.ВесЕдиницаИзмерения.МеждународноеСокращение = ""KGM""
		|						ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0) * 1000
		|					ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СпрНоменклатура.ВесИспользовать
		|						И СпрНоменклатура.ВесЗнаменатель > 0
		|					ТОГДА ВЫБОР
		|							КОГДА СпрНоменклатура.ВесЕдиницаИзмерения.МеждународноеСокращение = ""KGM""
		|								ТОГДА СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель * 1000
		|							ИНАЧЕ СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК ВесУпаковки,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 10
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 1000
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0)
		|	КОНЕЦ КАК Высота,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 10
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 1000
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0)
		|	КОНЕЦ КАК Глубина,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 10
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 1000
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0)
		|	КОНЕЦ КАК Ширина,
		|	ВЫБОР
		|		КОГДА вт_цены_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_цены_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_цены_price.Цена, 0) * ЕСТЬNULL(вт_цены_price.Знаменатель, 1) / ЕСТЬNULL(вт_цены_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА вт_цены_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_Цены_old_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_Цены_old_price.Цена, 0) * ЕСТЬNULL(вт_Цены_old_price.Знаменатель, 1) / ЕСТЬNULL(вт_Цены_old_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаСоСкидкой,
		|	ВЫБОР
		|		КОГДА вт_Цены_min_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_Цены_min_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_Цены_min_price.Цена, 0) * ЕСТЬNULL(вт_Цены_min_price.Знаменатель, 1) / ЕСТЬNULL(вт_Цены_min_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаМинимальная
		|ИЗ
		|	вт_ТаблицаНоменклатурыДополненная КАК вт_ТаблицаНоменклатурыДополненная
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Упаковка = ШтрихкодыНоменклатуры.Упаковка)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = ШтрихкодыНоменклатуры.Характеристика)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = СпрНоменклатура.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_цены_price"
		
		+ ?(ИспользуетсяЦенообразование25, 
		
		"
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_цены_price.Номенклатура)
		|			И (ВЫБОР
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка) = вт_цены_price.Характеристика
		|				ИНАЧЕ вт_ТаблицаНоменклатурыДополненная.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования = вт_цены_price.Характеристика
		|			КОНЕЦ)
		|			И (ВЫБОР 
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке =  Значение(Перечисление.ВариантОтбораДляКлючаЦен.Использовать) 
		|					ТОГДА вт_ТаблицаНоменклатурыДополненная.Упаковка =  вт_цены_price.Упаковка
		|				ИНАЧЕ
		|					Истина
		|				КОНЕЦ)
		|			И (вт_цены_price.ВидЦены = &price)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_Цены_old_price
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_Цены_old_price.Номенклатура)
		|			И (ВЫБОР
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка) = вт_Цены_old_price.Характеристика
		|				ИНАЧЕ вт_ТаблицаНоменклатурыДополненная.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования = вт_Цены_old_price.Характеристика
		|			КОНЕЦ)
		|			И (ВЫБОР 
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке =  Значение(Перечисление.ВариантОтбораДляКлючаЦен.Использовать) 
		|					ТОГДА вт_ТаблицаНоменклатурыДополненная.Упаковка =  вт_Цены_old_price.Упаковка
		|				ИНАЧЕ
		|					Истина
		|				КОНЕЦ)
		|			И (вт_Цены_old_price.ВидЦены = &discount_price)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_Цены_min_price
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_Цены_min_price.Номенклатура)
		|			И (ВЫБОР
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка) = вт_Цены_min_price.Характеристика
		|				ИНАЧЕ вт_ТаблицаНоменклатурыДополненная.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования = вт_Цены_min_price.Характеристика
		|			КОНЕЦ)
		|			И (ВЫБОР 
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке =  Значение(Перечисление.ВариантОтбораДляКлючаЦен.Использовать) 
		|					ТОГДА вт_ТаблицаНоменклатурыДополненная.Упаковка =  вт_Цены_min_price.Упаковка
		|				ИНАЧЕ
		|					Истина
		|				КОНЕЦ)
		|			И (вт_Цены_min_price.ВидЦены = &min_price)"
		
		,
		
		"
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_цены_price.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = вт_цены_price.Характеристика)
		|			И (вт_цены_price.ВидЦены = &price)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_Цены_old_price
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_Цены_old_price.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = вт_Цены_old_price.Характеристика)
		|			И (вт_Цены_old_price.ВидЦены = &discount_price)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_Цены_min_price
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_Цены_min_price.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = вт_Цены_min_price.Характеристика)
		|			И (вт_Цены_min_price.ВидЦены = &min_price)")
		
		+
		
		"
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ТаблицаНоменклатурыДополненная.Номенклатура,
		|	вт_ТаблицаНоменклатурыДополненная.Характеристика,
		|	вт_ТаблицаНоменклатурыДополненная.Упаковка,
		|	СпрНоменклатура.НаименованиеПолное,
		|	СпрНоменклатура.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ,
		|	СпрНоменклатура.ИспользоватьУпаковки,
		|	ВЫБОР
		|		КОГДА вт_цены_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_цены_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_цены_price.Цена, 0) * ЕСТЬNULL(вт_цены_price.Знаменатель, 1) / ЕСТЬNULL(вт_цены_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА вт_цены_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_Цены_old_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_Цены_old_price.Цена, 0) * ЕСТЬNULL(вт_Цены_old_price.Знаменатель, 1) / ЕСТЬNULL(вт_Цены_old_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА вт_Цены_min_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_Цены_min_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_Цены_min_price.Цена, 0) * ЕСТЬNULL(вт_Цены_min_price.Знаменатель, 1) / ЕСТЬNULL(вт_Цены_min_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 10
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 1000
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 10
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 1000
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 10
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 1000
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СпрНоменклатура.ИспользоватьУпаковки
		|				И НЕ УпаковкиЕдиницыИзмерения.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА УпаковкиЕдиницыИзмерения.ВесЕдиницаИзмерения.МеждународноеСокращение = ""KGM""
		|						ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0) * 1000
		|					ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СпрНоменклатура.ВесИспользовать
		|						И СпрНоменклатура.ВесЗнаменатель > 0
		|					ТОГДА ВЫБОР
		|							КОГДА СпрНоменклатура.ВесЕдиницаИзмерения.МеждународноеСокращение = ""KGM""
		|								ТОГДА СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель * 1000
		|							ИНАЧЕ СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", СтруктураПараметров.ТаблицаНоменклатуры);
	//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
	//Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
	Запрос.УстановитьПараметр("price", СтруктураПараметров.Price);
	Запрос.УстановитьПараметр("discount_price", СтруктураПараметров.discount_price);
	Запрос.УстановитьПараметр("min_price", СтруктураПараметров.Price);
	Запрос.УстановитьПараметр("Аккаунт", СтруктураПараметров.Аккаунт);
	Запрос.УстановитьПараметр("Категория", СтруктураПараметров.Категория);
	Запрос.УстановитьПараметр("Валюта", СтруктураПараметров.Валюта);

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаТоваров = РезультатЗапроса.Выгрузить();

	Возврат ТаблицаТоваров;

КонецФункции

#КонецОбласти