
#Область ОбработчикиСобытийФормы 

//+ ИнфоСофт Стояк Ю.К. 14.10.24 УА #77168
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Профиль") Тогда
		Профиль = Параметры.Профиль;
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль");
		Возврат;
	КонецЕсли;
	
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить("ПечататьQR");
	МассивЗначений.Добавить("ПечататьАртикул1С");   
	МассивЗначений.Добавить("ПечататьАртикулВБ");
	МассивЗначений.Добавить("ПечататьАртикулПоставщика");   
	МассивЗначений.Добавить("ПечататьБренд");
	МассивЗначений.Добавить("ПечататьКоличество");   
	МассивЗначений.Добавить("ПечататьНазвание");
	МассивЗначений.Добавить("ПечататьНомерРеализации"); 
	МассивЗначений.Добавить("ПечататьНомерЗаказа"); 	
	МассивЗначений.Добавить("ПечататьНомерСборочного");
	МассивЗначений.Добавить("ПечататьНомерСтроки");   
	МассивЗначений.Добавить("ПечататьРазмер");
	МассивЗначений.Добавить("ПечататьЦвет");   
	МассивЗначений.Добавить("ПечататьШтрихкод");	
	МассивЗначений.Добавить("ПечататьФото");	
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль,Перечисления.ИС_МП_Маркетплейсы.ВБ,МассивЗначений);
		
	Если Результат.Количество() = 0 Тогда
		ПечататьQR 					= Истина;
		ПечататьАртикулВБ 			= Истина;
		ПечататьАртикулПоставщика 	= Истина;
		ПечататьБренд 				= Истина;
		ПечататьНазвание 			= Истина;
		ПечататьНомерСборочного 	= Истина;
		ПечататьНомерСтроки 		= Истина;
		ПечататьРазмер 				= Истина;
		ПечататьЦвет 				= Истина;
		ПечататьШтрихкод		 	= Истина;
		ПечататьФото			 	= Истина;
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.10.24 УА #77168

#КонецОбласти

#Область ОбработчикиКомандФормы  

//+ ИнфоСофт Стояк Ю.К. 14.10.24 УА #77168
&НаКлиенте
Процедура СохранитьДанные(Команда)
	СохранитьДанныеНаСервере(Профиль);
	Закрыть();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.10.24 УА #77168

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Стояк Ю.К. 14.10.24 УА #77168
&НаСервере 
Процедура СохранитьДанныеНаСервере(Профиль)
	
	СтруктураРезультатовЗначение = Новый Структура;
	СтруктураРезультатовЗначение.Вставить("ПечататьQR", ПечататьQR); 
	СтруктураРезультатовЗначение.Вставить("ПечататьАртикул1С", ПечататьАртикул1С);
	СтруктураРезультатовЗначение.Вставить("ПечататьАртикулВБ", ПечататьАртикулВБ);
	СтруктураРезультатовЗначение.Вставить("ПечататьАртикулПоставщика", ПечататьАртикулПоставщика); 
	СтруктураРезультатовЗначение.Вставить("ПечататьБренд", ПечататьБренд);
	СтруктураРезультатовЗначение.Вставить("ПечататьКоличество", ПечататьКоличество);
	СтруктураРезультатовЗначение.Вставить("ПечататьНазвание", ПечататьНазвание); 
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерРеализации", ПечататьНомерРеализации);	
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерЗаказа", ПечататьНомерЗаказа);
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерСборочного", ПечататьНомерСборочного);
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерСтроки", ПечататьНомерСтроки); 
	СтруктураРезультатовЗначение.Вставить("ПечататьРазмер", ПечататьРазмер);
	СтруктураРезультатовЗначение.Вставить("ПечататьЦвет", ПечататьЦвет);
	СтруктураРезультатовЗначение.Вставить("ПечататьШтрихкод", ПечататьШтрихкод);
	СтруктураРезультатовЗначение.Вставить("ПечататьФото", ПечататьФото);

	ИС_MP_Сервер.ЗаписатьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, СтруктураРезультатовЗначение);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.10.24 УА #77168

#КонецОбласти
