
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 22.03.24 УА #71892
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстанавливатьОтбор = Истина;
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		УстанавливатьОтбор = Ложь;
	Иначе
		ИС_MP_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 22.03.24 УА #71892
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если УстанавливатьОтбор Тогда
		УстрановитьОтборПоПрофилю();
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 22.03.24 УА #71892
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	УстрановитьОтборПоПрофилю();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.03.24 УА #71892

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 22.03.24 УА #71892
&НаКлиенте
Процедура УстрановитьОтборПоПрофилю()
	
	Если ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Профиль", Профиль);
		Элементы.СписокПрофиль.Видимость = Ложь;
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Профиль");	
		Элементы.СписокПрофиль.Видимость = Истина;
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.03.24 УА #71892

#КонецОбласти
