
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбщегоНазначения

Функция ПреобразоватьКЧислу(Знач Строка) Экспорт
	
	Если Строка = "" Тогда
		Возврат 0;
	КонецЕсли;
	
	//Строка = СтрЗаменить(Строка, " ", ""); 
	//Строка = СтрЗаменить(Строка, Символы.НПП, "");  
		
	ДопустимыеСимволы = "0123456789,." + Символы.НПП;
	
	МассивСимволов = Новый Массив;
	Для Позиция = 1 По СтрДлина(ДопустимыеСимволы) Цикл
		МассивСимволов.Добавить(Сред(ДопустимыеСимволы, Позиция, 1));
	КонецЦикла;
	
	Число = "";
	
	Для Позиция = 1 По СтрДлина(Строка) Цикл
		
		Символ = Сред(Строка, Позиция, 1);
		
		Если МассивСимволов.Найти(Символ) = Неопределено Тогда
			Прервать;
		КонецЕсли;
	    
	    Число = Число + Символ;
	
	КонецЦикла;
	
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	
	Возврат ОписаниеЧисла.ПривестиЗначение(Число);

КонецФункции
	
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
