
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстанавливатьОтбор = Истина;
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		УстанавливатьОтбор = Ложь;
	Иначе
		ИС_MP_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если УстанавливатьОтбор Тогда
		УстановитьОтборПоПрофилю();
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	УстановитьОтборПоПрофилю();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 26.01.24 УА #63724
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
	ТекДанные = Элемент.ТекущиеДанные; 
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ОткрытьНаWB Тогда
		СтандартнаяОбработка = Ложь;
		ПерейтиПоНавигационнойСсылке("https://www.wildberries.ru/catalog/" + Формат(ТекДанные.Код, "ЧГ=0") + "/detail.aspx");
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.01.24 УА #63724

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаКлиенте
Процедура ЗагрузитьДинамикуОборачиваемости(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    ДиалогВыбораФайла.Заголовок = "Выберите файл выгрузки цен с текущими данными";
    ДиалогВыбораФайла.МножественныйВыбор =  Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
    ДиалогВыбораФайла.Фильтр = "Excel файлы(*.xlsx)|*.xlsx";                                                          
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект, ДопПараметры);
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаКлиенте
Процедура УстановитьОтборПоПрофилю()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Профиль", Профиль);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаКлиенте
Процедура ВыборФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеФайлы = ДиалогВыбораФайла.ВыбранныеФайлы;
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПоместитьФайлНаСерверЗавершение", ЭтотОбъект);
		НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , , , ВыбранныеФайлы[0], УникальныйИдентификатор);				
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаКлиенте
Процедура ПоместитьФайлНаСерверЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.ПомещениеФайлаОтменено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось загрузить файл, попробуйте ещё раз...");
		Возврат;
	КонецЕсли;
	
	АдресВоВременномХранилище = Результат.Адрес;
	
	ОчиститьСообщения();
	ЗагрузитьДинамикуОборачиваемостиНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Загрузка завершена");          
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 16.02.23 УА #53535
&НаСервере
Процедура ЗагрузитьДинамикуОборачиваемостиНаСервере()

	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
			
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(Имя);
	
	Попытка	
		УдалитьФайлы(Имя);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ИС.МП.ИС_WB_Номенклатура.ФормаСписка.ЗагрузитьДинамикуОборачиваемостиНаСервере", 
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;
	
	ТабличныйДокумент.Область().Разъединить();
	
	ПоследняяСтрока = ТабличныйДокумент.ВысотаТаблицы;
	ПоследняяКолонка = ТабличныйДокумент.ШиринаТаблицы;
	
	ОбластьЯчеек = ТабличныйДокумент.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка);
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	
	ТаблицаЗначений = ПостроительОтчета.Результат.Выгрузить();
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		
		Ссылка = Справочники.ИС_WB_Номенклатура.НайтиПоКоду(Число(Строка.АртикулWB));
		
		Если Не Ссылка.Пустая() Тогда
						
			Оборачиваемость = 0;

			Если Строка.Оборачиваемость <> "Товар на сайте менее 30 дн." Тогда
				Оборачиваемость = Число(Строка.Оборачиваемость);
			КонецЕсли; 
		    
		    Если Ссылка.Оборачиваемость = Оборачиваемость Тогда
		    	Продолжить;
		    КонецЕсли;
		    
		    Номенклатура = Ссылка.ПолучитьОбъект();
		    Номенклатура.Оборачиваемость = Оборачиваемость;
		    
		    Попытка
				Номенклатура.Записать();
		    Исключение
		    	ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		    КонецПопытки;
		    
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.02.23 УА #53535

#КонецОбласти
