#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьХарактеристики(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли;
	
	Категория = Элементы.Список.ТекущаяСтрока;

	Если Не ЗначениеЗаполнено(Категория) Тогда
		Возврат;
	КонецЕсли;

	Если Не Элементы.Список.ТекущиеДанные.Используется Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Категория товаров не используется. Для загрузки характеристик необходимо включить использование");
		Возврат;
	КонецЕсли;

	ДлительнаяОперация 	= ЗагрузитьХарактеристикиНаСервере(Категория);
	//ПараметрыОжидания 	= БСП_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	//ПараметрыОжидания.ТекстСообщения = "Выполняется загрузка характеристик";
	//ПараметрыОжидания.ВыводитьСообщения = Истина;

	//БСП_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, , ПараметрыОжидания);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, , ПараметрыОжидания());

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗначенияХарактеристик(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли;
	
	Категория = Элементы.Список.ТекущаяСтрока;

	Если Не ЗначениеЗаполнено(Категория) Тогда
		Возврат;
	КонецЕсли;

	Если Не Элементы.Список.ТекущиеДанные.Используется Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Категория товаров не используется. Для загрузки характеристик необходимо включить использование");
		Возврат;
	КонецЕсли;

	ДлительнаяОперация 	= ЗагрузитьЗначенияХарактеристикНаСервере(Категория);
	//ПараметрыОжидания 	= БСП_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	//ПараметрыОжидания.ТекстСообщения = "Выполняется загрузка значений характеристик";
	//ПараметрыОжидания.ВыводитьСообщения = Истина;

	//БСП_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, , ПараметрыОжидания);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, , ПараметрыОжидания());

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗагрузитьХарактеристикиНаСервере(Категория)

	Возврат ДлительныеОперации.ВыполнитьПроцедуру( ,
		"ИС_Ozon_Сервер.ЗагрузитьХарактеристикиКатегорий", Профиль, Категория);

КонецФункции

&НаСервере
Функция ЗагрузитьЗначенияХарактеристикНаСервере(Категория)

	Возврат ДлительныеОперации.ВыполнитьПроцедуру( ,
		"ИС_Ozon_Сервер.ЗагрузитьЗначенияХарактеристик", Профиль, , Категория);

КонецФункции

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
&НаКлиенте
Функция ПараметрыОжидания()
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = "Идет процесс загрузки...";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Интервал = 5;
	ПараметрыОжидания.ПолучатьРезультат = Истина;     
	
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	//ПараметрыОжидания.ОповещениеПользователя.НавигационнаяСсылка = "e1cib/app/Обработка.ИС_Ozon_ВыгрузкаКарточек";
	
	Возврат ПараметрыОжидания;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

#КонецОбласти