
#Область ПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 13.02.24 УА #70067
Функция ПараметрыГенерацииШтрихкода() Экспорт	
	ОбщийМодуль = ОбщийМодульПараметров();
	Возврат ОбщийМодуль.ПараметрыГенерацииШтрихкода();	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.24 УА #70067

//+ ИнфоСофт Ивонин К.А. 13.02.24 УА #70067
Функция ИзображениеШтрихкода(ПараметрыШтрихкода) Экспорт
	
	//+ ИнфоСофт Заварин К.В. 08.10.24 УА #85099
	Если ПараметрыШтрихкода.Свойство("Инвертирован") Тогда
		ПараметрыШтрихкода.Удалить("Инвертирован");
	КонецЕсли;     
	//- ИнфоСофт Заварин К.В. 08.10.24 УА #85099
	
	ОбщийМодуль = ОбщийМодульГенерации();
	Возврат ОбщийМодуль.ИзображениеШтрихкода(ПараметрыШтрихкода);	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.24 УА #70067

//+ ИнфоСофт Ивонин К.А. 13.02.24 УА #70067
Функция ДанныеQRКода(QRСтрока, УровеньКоррекции, Размер) Экспорт   
    ОбщийМодуль = ОбщийМодульГенерации();    
	Возврат ОбщийМодуль.ДанныеQRКода(QRСтрока, УровеньКоррекции, Размер);	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.24 УА #70067

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 13.02.24 УА #70076
Функция ОбщийМодульПараметров()
	Возврат ИС_МП_ГенерацияШтрихкодаПовтИсп.ОбщийМодульПараметров();	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.24 УА #70076

//+ ИнфоСофт Ивонин К.А. 13.02.24 УА #70076
Функция ОбщийМодульГенерации()
	Возврат ИС_МП_ГенерацияШтрихкодаПовтИсп.ОбщийМодульГенерации();	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.24 УА #70076

#КонецОбласти
