
#Область СлужебныйПрограммныйИнтерфейс

#Область Настройки

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ПолучитьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияВБ Тогда
		Возврат;
	КонецЕсли;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ; 
	
	МассивНастроек = МассивНастроекПодключения();
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	//МассивНастроек = МассивНастроекЦен(МассивНастроек);
	
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
	МассивНастроек = МассивНастроекЗаполненияДокументов(МассивНастроек);
	//- ИнфоСофт Власова И.С. 14.03.25 УА #68471
	МассивНастроек = МассивНастроекСхемРаботы(МассивНастроек);	
	МассивНастроек = МассивНастроекТоваров(МассивНастроек);
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, МассивНастроек);

	СтруктураПараметров = Новый Структура;

	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить("ВБ" + Элемент.Ключ, Элемент.Значение);	
	КонецЦикла;
		
	ЗаполнитьЗначенияСвойств(Форма, СтруктураПараметров);
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ЗаписатьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияВБ Тогда
		Возврат;
	КонецЕсли;
	
	МассивНастроек = МассивНастроекПодключения();
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	//МассивНастроек = МассивНастроекЦен(МассивНастроек);	
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
	МассивНастроек = МассивНастроекЗаполненияДокументов(МассивНастроек);
	//- ИнфоСофт Власова И.С. 14.03.25 УА #68471
	МассивНастроек = МассивНастроекСхемРаботы(МассивНастроек);
	МассивНастроек = МассивНастроекТоваров(МассивНастроек);
	
	СтруктураНастроек = Новый Структура;
	
	Для Каждого Элемент Из МассивНастроек Цикл
		СтруктураНастроек.Вставить("ВБ" + Элемент, Неопределено);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, Форма);
	
	СтруктураПараметров = Новый Структура;
	
	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить(СтрЗаменить(Элемент.Ключ, "ВБ", ""), Элемент.Значение);	
	КонецЦикла;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ;
	
	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, СтруктураПараметров);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Функция МассивНастроекПодключения(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("АдресАналитика");
	МассивНастроек.Добавить("АдресВозвраты");
	МассивНастроек.Добавить("АдресВопросы");
	МассивНастроек.Добавить("АдресДокументы");
	МассивНастроек.Добавить("АдресКонтент");
	МассивНастроек.Добавить("АдресМаркетплейс");
	МассивНастроек.Добавить("АдресПоставки");
	МассивНастроек.Добавить("АдресПродвижение");
	МассивНастроек.Добавить("АдресСтатистика");
	МассивНастроек.Добавить("АдресТарифы");
	МассивНастроек.Добавить("АдресЦены");
	МассивНастроек.Добавить("АдресЧат");
	МассивНастроек.Добавить("ПортАналитика");
	МассивНастроек.Добавить("ПортВозвраты");
	МассивНастроек.Добавить("ПортВопросы");
	МассивНастроек.Добавить("ПортДокументы");
	МассивНастроек.Добавить("ПортКонтент");
	МассивНастроек.Добавить("ПортМаркетплейс");
	МассивНастроек.Добавить("ПортПоставки");
	МассивНастроек.Добавить("ПортПродвижение");
	МассивНастроек.Добавить("ПортСтатистика");
	МассивНастроек.Добавить("ПортТарифы");
	МассивНастроек.Добавить("ПортЦены");
	МассивНастроек.Добавить("ПортЧат");
	МассивНастроек.Добавить("HTTPSАналитика");
	МассивНастроек.Добавить("HTTPSВозвраты");
	МассивНастроек.Добавить("HTTPSВопросы");
	МассивНастроек.Добавить("HTTPSДокументы");
	МассивНастроек.Добавить("HTTPSКонтент");
	МассивНастроек.Добавить("HTTPSМаркетплейс");
	МассивНастроек.Добавить("HTTPSПоставки");
	МассивНастроек.Добавить("HTTPSПродвижение");
	МассивНастроек.Добавить("HTTPSСтатистика");
	МассивНастроек.Добавить("HTTPSТарифы");
	МассивНастроек.Добавить("HTTPSЦены");
	МассивНастроек.Добавить("HTTPSЧат");
	МассивНастроек.Добавить("РежимОтладки");
	МассивНастроек.Добавить("КоличествоЭлементовНаЗапрос");
	МассивНастроек.Добавить("КоличествоПопытокЗапроса");
	
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001 

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция МассивНастроекОстатков(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("РассчитыватьНесобранныеКомплекты");
	МассивНастроек.Добавить("ВыгружатьОстаткиВРазрезеОрганизации");
	МассивНастроек.Добавить("ИспользоватьПоследниеОстатки");	
	МассивНастроек.Добавить("ИспользоватьФиксированныйОстаток");
	МассивНастроек.Добавить("ФиксированныйОстаток");
	МассивНастроек.Добавить("РежимСокрытияОстатков");
	МассивНастроек.Добавить("СкрываемыйОстаток");
	
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Функция МассивНастроекЦен(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("ВидЦены");
		
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 03.04.25 УА #96894
Функция МассивНастроекСхемРаботы(МассивНастроек = Неопределено) Экспорт

	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("ЗаказыFBS");
	МассивНастроек.Добавить("ЗаказыDBS");
	МассивНастроек.Добавить("ЗаказыCnC");
	МассивНастроек.Добавить("ЗаказыFBO");
	
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 03.04.25 УА #96894

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
Функция МассивНастроекЗаполненияДокументов(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("СтатьяДоходовОтрицательноеВознаграждение");
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
	МассивНастроек.Добавить("СтатьяПрочихДоходов");
	МассивНастроек.Добавить("СтатьяПрочихРасходов");
	//- ИнфоСофт Власова И.С. 14.03.25 УА #83865
	
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Ивонин К.А. 27.03.25 УА #63915
Функция МассивНастроекТоваров(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("СопоставлятьПо");
	МассивНастроек.Добавить("АвтоматическиСопоставлять");
	
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 27.03.25 УА #63915

#КонецОбласти

#Область Подключение

//+ ИнфоСофт Ивонин К.А. 31.01.25 УА #89159
Функция ДанныеТокена(Токен) Экспорт
	
	ЧастиJWT = СтрРазделить(Токен, ".", Ложь);
	
	Если ЧастиJWT.Количество() <> 3 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Тело = ЧастиJWT[1];
	
	Пока СтрДлина(Тело) % 4 > 0 Цикл
		Тело = Тело + "=";
	КонецЦикла;
	
	ДвоичныеДанныеТокена = Base64Значение(Тело);
	JSON = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеТокена);
		
	ДанныеТокена = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(JSON);
	
	Если Не ДанныеТокена.Свойство("s") Тогда 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если Не ДанныеТокена.Свойство("t") Тогда 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если Не ДанныеТокена.Свойство("exp") Тогда 
		Возврат Неопределено;	
	КонецЕсли;
	
	Маска = ДанныеТокена.s;
	
	Результат = Новый Структура;
	
	Результат.Вставить("Контент",      ПроверитьБит(Маска, 1));
	Результат.Вставить("Аналитика",    ПроверитьБит(Маска, 2));
	Результат.Вставить("Цены", 		   ПроверитьБит(Маска, 3));
	Результат.Вставить("Маркетплейс",  ПроверитьБит(Маска, 4));
	Результат.Вставить("Статистика",   ПроверитьБит(Маска, 5));
	Результат.Вставить("Продвижение",  ПроверитьБит(Маска, 6));
	Результат.Вставить("Вопросы", 	   ПроверитьБит(Маска, 7));
	Результат.Вставить("Чат", 		   ПроверитьБит(Маска, 9));
	Результат.Вставить("Поставки",     ПроверитьБит(Маска, 10));
	Результат.Вставить("Возвраты",     ПроверитьБит(Маска, 11));
	Результат.Вставить("Документы",    ПроверитьБит(Маска, 12));
	Результат.Вставить("Тарифы", 	   Не ДанныеТокена.t);
	Результат.Вставить("ТолькоЧтение", ПроверитьБит(Маска, 30));
	Результат.Вставить("ТестовыйКонтур", ДанныеТокена.t);
	Результат.Вставить("ДатаОкончания", ИС_МП_Сервер.ДатаИзUnixTimeStamp(ДанныеТокена.exp));
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 31.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
Функция ТестПодключения(Профиль, Параметры) Экспорт

	ПараметрыЗапроса = ИС_МП_РаботаСHTTPЗапросами.СтруктураHTTPЗапроса();
		
	Результат = "";
	
	МассивСервисов = Новый Массив;
	МассивСервисов.Добавить("Контент");
	МассивСервисов.Добавить("Аналитика");
	МассивСервисов.Добавить("Цены");
	МассивСервисов.Добавить("Маркетплейс");
	МассивСервисов.Добавить("Статистика");
	МассивСервисов.Добавить("Продвижение");
	МассивСервисов.Добавить("Вопросы");
	МассивСервисов.Добавить("Чат");
	МассивСервисов.Добавить("Поставки");
	МассивСервисов.Добавить("Возвраты");
	МассивСервисов.Добавить("Документы");
	МассивСервисов.Добавить("Тарифы");
	
	Для Каждого Сервис Из МассивСервисов Цикл
	
		Если ЗначениеЗаполнено(Параметры["Адрес" + Сервис]) Тогда
		
			ПараметрыЗапроса.Сервер = Параметры["Адрес" + Сервис];
			ПараметрыЗапроса.Порт = Параметры["Порт" + Сервис];
			ПараметрыЗапроса.ЗащищенноеСоединение = Параметры["HTTPS" + Сервис];
			ПараметрыЗапроса.РежимОтладки = Параметры.РежимОтладки;
			ПараметрыЗапроса.КоличествоЭлементовНаЗапрос = Параметры.КоличествоЭлементовНаЗапрос;
			ПараметрыЗапроса.КоличествоПопытокЗапроса = Параметры.КоличествоПопытокЗапроса; 
						
			Токен = ИС_ВБ_СерверПовтИсп.ТокенДляСервиса(Профиль, Сервис);
			
			Если Токен = Неопределено Тогда
				Результат = Результат + "Не найден токен для теста подключения API " + Сервис + Символы.ПС;	
			Иначе	
				
				ПараметрыЗапроса.Заголовки.Вставить("Authorization", Токен);
				
				РезультатЗапроса = ИС_ВБ_АПИ.ТестПодключения(Профиль, ПараметрыЗапроса);
				
				Если РезультатЗапроса Тогда
					Результат = Результат + "Тест подключения API " + Сервис + " выполнен успешно " + Символы.ПС;
				Иначе
					Результат = Результат + "Тест подключения API " + Сервис + " завершен с ошибкой" + Символы.ПС;
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

// + ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
//
// Параметры:
//  Профиль	 - СправочникСсылка.ИС_WB_Профили - Профиль маркетплейса 
//  Сервис	 - Строка - Поддерживает следующие типы сервисов:
//							* Контент
//							* Аналитика
//							* Цены
//							* Маркетплейс
//							* Статистика
//							* Продвижение
//							* Вопросы
//							* Чат
//							* Поставки
//							* Возвраты
//							* Документы
//							* Тарифы
// 
// Возвращаемое значение:
//  Структура - Сформированная структура для отправки запроса на маркетплейс
//
Функция ПараметрыHTTPЗапроса(Профиль, Сервис) Экспорт
	
	МассивСервисов = Новый Массив;   
	
	МассивСервисов.Добавить("Аналитика");
	МассивСервисов.Добавить("Цены");
	МассивСервисов.Добавить("Маркетплейс");
	МассивСервисов.Добавить("Статистика");
	МассивСервисов.Добавить("Продвижение");
	МассивСервисов.Добавить("Вопросы");
	МассивСервисов.Добавить("Чат");
	МассивСервисов.Добавить("Поставки");
	МассивСервисов.Добавить("Возвраты");
	МассивСервисов.Добавить("Документы");
	МассивСервисов.Добавить("Тарифы");
	МассивСервисов.Добавить("Контент");
	
	ИскомыйСервис = МассивСервисов.Найти(Сервис);
	
	Если ИскомыйСервис = Неопределено Тогда
		ВызватьИсключение "Вызван неизвестный сервис WildBerries: " + Сервис;
	КонецЕсли;
	
	Токен = ИС_ВБ_СерверПовтИсп.ТокенДляСервиса(Профиль, Сервис);
	
	Если Токен = Неопределено Тогда
		ВызватьИсключение "Не найден токен WildBerries для подключения к API " + Сервис;	
	КонецЕсли;
		
	НастройкиСоединения = ИС_ВБ_СерверПовтИсп.НастройкиСоединения(Профиль);  
	
	ТекстОшибки = "";
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения["Адрес" + Сервис]) Тогда
		ТекстОшибки = ТекстОшибки 
			+ "Для данного профиля не заполнен адрес API " + Сервис + " , проверьте настройки подключения";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения["Порт" + Сервис]) Тогда
		ТекстОшибки = ТекстОшибки 
			+ "Для данного профиля не заполнен порт API " + Сервис + " , проверьте настройки подключения";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения["HTTPS" + Сервис]) Тогда
		ТекстОшибки = ТекстОшибки
			+ "Для данного профиля не заполнен HTTPS API " + Сервис + " , проверьте настройки подключения";
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если НастройкиСоединения.РежимОтладки = Неопределено Тогда
		НастройкиСоединения.РежимОтладки = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.КоличествоЭлементовНаЗапрос) Тогда
		НастройкиСоединения.КоличествоЭлементовНаЗапрос = 100;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.КоличествоПопытокЗапроса) Тогда
		НастройкиСоединения.КоличествоПопытокЗапроса = 10;
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_МП_РаботаСHTTPЗапросами.СтруктураHTTPЗапроса();
	ПараметрыЗапроса.Сервер = НастройкиСоединения["Адрес" + Сервис];
	ПараметрыЗапроса.Порт = НастройкиСоединения["Порт" + Сервис];
	ПараметрыЗапроса.ЗащищенноеСоединение = НастройкиСоединения["HTTPS" + Сервис];
	ПараметрыЗапроса.Вставить("РежимОтладки", НастройкиСоединения.РежимОтладки);
	ПараметрыЗапроса.Вставить("КоличествоЭлементовНаЗапрос", НастройкиСоединения.КоличествоЭлементовНаЗапрос);
	ПараметрыЗапроса.Вставить("КоличествоПопытокЗапроса", НастройкиСоединения.КоличествоПопытокЗапроса);
		
	ПараметрыЗапроса.Заголовки.Вставить("Authorization", Токен);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159

#КонецОбласти

#Область РаботаСТоварами

//+ ИнфоСофт Ивонин К.А. 21.02.25 УА #92887
Функция ТекстЗапросаСопоставления() Экспорт

	Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_РазмерыНоменклатур.Владелец КАК НоменклатураWB,
	|	ИС_WB_РазмерыНоменклатур.Ссылка КАК РазмерWB,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка = &ПустаяУпаковка
	|				ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL
	|			ТОГДА ИС_WB_СоответствиеРазмеров.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка
	|	КОНЕЦ КАК Упаковка
	|ИЗ
	|	Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ИС_WB_РазмерыНоменклатур.Ссылка = ИС_WB_СоответствиеРазмеров.РазмерWB
	|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
	|ГДЕ
	|	ИС_WB_РазмерыНоменклатур.Профиль = &Профиль
	|	И НЕ ИС_WB_РазмерыНоменклатур.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	НоменклатураWB";
	
	Возврат Текст;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.02.25 УА #92887

#Область КатегорииПредметыХарактеристики
	
//+ ИнфоСофт Ивонин К.А. 10.02.25 УА #92406
Функция НайтиИлиСоздатьКатегорию(Профиль, Имя, IDПредмета = Неопределено, 
	 	КешКатегорий = Неопределено, КешХарактеристикКатегорий = Неопределено, Перезаполнять = Ложь) Экспорт
	
	Событие = ИмяСобытия("НайтиИлиСоздатьКатегорию");
	
	Категория = Справочники.ИС_WB_Категории.НайтиПоНаименованию(Имя, Истина);
	
	Если Не Категория.Пустая() И Не Перезаполнять Тогда
		Возврат Категория;
	КонецЕсли;
	
	Если КешКатегорий <> Неопределено Тогда
		 
		ИскомыйКэш = КешКатегорий.Найти(Имя);	
		
		Если ИскомыйКэш <> Неопределено Тогда
			Возврат Категория; 	
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Контент");
	
	СтруктураЗапроса = ИС_ВБ_АПИ.СтруктураПараметровЗапросаСпискаПредметов();
	СтруктураЗапроса.name = Имя;
		
	СписокПредметов = ИС_ВБ_АПИ.СписокПредметов(Профиль, ПараметрыЗапроса, СтруктураЗапроса);
		
	Если СписокПредметов = Неопределено Или СписокПредметов.Количество() = 0 Тогда
		
		Если IDПредмета = Неопределено Тогда
			Возврат Справочники.ИС_WB_Категории.ПустаяСсылка();
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю("Не найдена категория: " + Имя + ", категория будет создана автоматически");
		
		JSON = Новый Структура;
		JSON.Вставить("subjectName", Имя);
		JSON.Вставить("subjectID",   IDПредмета);
		JSON.Вставить("parentName",  "");	
		
	Иначе
		JSON = СписокПредметов[0];
	КонецЕсли;
	
	Если Категория.Пустая() Тогда
		Категория = Справочники.ИС_WB_Категории.СоздатьЭлемент();
	Иначе
		Категория = Категория.ПолучитьОбъект();
	КонецЕсли;
	
	Категория.Наименование = JSON.subjectName;
	Категория.subjectID = JSON.subjectID;
	Категория.РодительскаяКатегория = JSON.parentName; 
	
	СписокХарактеристик = ИС_ВБ_АПИ.ХарактеристикиПредмета(Профиль, ПараметрыЗапроса, JSON.subjectID);
	
	Если СписокХарактеристик <> Неопределено Тогда
		Категория.Характеристики.Очистить();
		ЗаполнитьХарактеристикиКатегории(СписокХарактеристик, Категория.Характеристики, 
			КешХарактеристикКатегорий, Перезаполнять);
		Категория.Характеристики.Сортировать("Поле");
	КонецЕсли;
									
	Попытка	
		
		Категория.Записать();
		
		Если КешКатегорий <> Неопределено Тогда
			КешКатегорий.Добавить(Имя);
		КонецЕсли;
								
		Возврат Категория.Ссылка;	
	
	Исключение	
		Текст = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);			
	КонецПопытки;
	
	Возврат Справочники.ИС_WB_Категории.ПустаяСсылка();
						
КонецФункции //- ИнфоСофт Власова И.С. 04.02.25 УА #92612

#КонецОбласти

#Область КарточкиТоваров

//+ ИнфоСофт Ивонин К.А. 03.03.25 УА #92887
Функция КоличествоТоваров(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество
	|ИЗ
	|	Справочник.ИС_WB_Номенклатура КАК ИС_WB_Номенклатура
	|ГДЕ
	|	ИС_WB_Номенклатура.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКоличества = РезультатЗапроса.Выбрать();
	
	Если ВыборкаКоличества.Следующий() Тогда
		Возврат ВыборкаКоличества.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 03.03.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 07.02.25 УА #92406
Функция ОбработатьДопПараметрыЗагрузкиТоваров(ДопПараметры) Экспорт
	Возврат ДопПараметры;
КонецФункции //- ИнфоСофт Ивонин К.А. 07.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 08.02.25 УА #92406
Функция ЗагрузитьТовары(Профиль, Перезаполнять = Ложь, ДопПараметры = Неопределено) Экспорт
	
	Событие = ИмяСобытия("ЗагрузитьТовары");
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Контент");
	
	КоличествоЭлементовНаЗапрос = 
		?(ПараметрыЗапроса.КоличествоЭлементовНаЗапрос > 100, 100, ПараметрыЗапроса.КоличествоЭлементовНаЗапрос);
	КоличествоПопытокЗапроса = ПараметрыЗапроса.КоличествоПопытокЗапроса;
	
	СтруктураПараметров = ИС_ВБ_АПИ.СтруктураПараметровЗапросаСпискаТоваров();
	
	СтруктураПараметров.settings.cursor.limit = КоличествоЭлементовНаЗапрос;
	
	МассивNmID = Новый Массив;
	
	Обработано = 0;
	КоличествоОшибок = 0;
	ПервыйЗапрос = Истина;    
		
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("ДатаОбновления", Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("nmID", ОбщегоНазначения.ОписаниеТипаЧисло(15));
	
	КешКатегорий = Новый Массив;
	КешХарактеристикКатегорий = Новый Массив;
	
	СоответствиеТоваровДляЗагрузки = Новый Соответствие;
	
	МассивТоваров = Новый Массив;
	
	Пока Истина Цикл 
		
		ТаблицаЗначений.Очистить();    
		СоответствиеТоваровДляЗагрузки.Очистить();
		
		Если КоличествоОшибок >= КоличествоПопытокЗапроса Тогда
			ВызватьИсключение("Превышено количество ошибок при запросах к API");
		КонецЕсли;
		
		СписокТоваров = ИС_ВБ_АПИ.СписокКарточекТоваров(Профиль, ПараметрыЗапроса, СтруктураПараметров);
		
		Если СписокТоваров = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли;
						
		Для Каждого Элемент Из СписокТоваров["cards"] Цикл
		
			НоваяСтрока = ТаблицаЗначений.Добавить();
			НоваяСтрока.nmID = Элемент["nmID"];
			МассивNmID.Добавить(Элемент["nmID"]);
			НоваяСтрока.ДатаОбновления = ?(Перезаполнять, ТекущаяДатаСеанса(), 
				ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(Элемент["updatedAt"], ФорматДатыJSON.ISO));	
			СоответствиеТоваровДляЗагрузки.Вставить(Элемент["nmID"], Элемент);
		
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.ДатаОбновления КАК ДатаОбновления,
		|	ТЧ.nmID КАК nmID
		|ПОМЕСТИТЬ ВТ_nmID
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	isNULL(ИС_WB_Номенклатура.updateAt, ДатаВремя(3999, 12, 31, 23, 59, 59)) КАК ДатаПоследнегоИзменения,
		|	ВТ_nmID.ДатаОбновления КАК ДатаОбновления,
		|	ВТ_nmID.nmID КАК nmID,
		|	ИС_WB_Номенклатура.Ссылка КАК ИС_WB_Номенклатура
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	ВТ_nmID КАК ВТ_nmID
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_Номенклатура КАК ИС_WB_Номенклатура
		|		ПО ВТ_nmID.nmID = ИС_WB_Номенклатура.Код
		|			И (ИС_WB_Номенклатура.Профиль = &Профиль)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.nmID КАК nmID
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|ГДЕ
		|	ВТ_Номенклатура.ИС_WB_Номенклатура ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.nmID
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|ГДЕ
		|	ВТ_Номенклатура.ДатаОбновления > ВТ_Номенклатура.ДатаПоследнегоИзменения";
		
		Запрос.УстановитьПараметр("ТЧ", ТаблицаЗначений);
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Товар = СоздатьИлиОбновитьНоменклатуру(Профиль, СоответствиеТоваровДляЗагрузки[Выборка.nmID], 
				КешКатегорий, КешХарактеристикКатегорий, Перезаполнять);
				
			Если Товар <> Неопределено Тогда
				МассивТоваров.Добавить(Товар);	
			КонецЕсли;
				
		КонецЦикла;
		
		Обработано = Обработано + СписокТоваров["cursor"]["total"];
		ДлительныеОперации.СообщитьПрогресс( , "Уже обработано " + Обработано + " карточек товаров");
		
		Если КоличествоЭлементовНаЗапрос > СписокТоваров["cursor"]["total"] Тогда
			Прервать;
		КонецЕсли;
		
		Если ПервыйЗапрос Тогда
			СтруктураПараметров.settings.cursor.Вставить("updatedAt", СписокТоваров["cursor"]["updatedAt"]);
			СтруктураПараметров.settings.cursor.Вставить("nmID", СписокТоваров["cursor"]["nmID"]);
			ПервыйЗапрос = Ложь;
		Иначе
			СтруктураПараметров.settings.cursor.updatedAt = СписокТоваров["cursor"]["updatedAt"];
			СтруктураПараметров.settings.cursor.nmID = СписокТоваров["cursor"]["nmID"];
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_WB_Номенклатура КАК ИС_WB_Номенклатура
	|ГДЕ
	|	ИС_WB_Номенклатура.Профиль = &Профиль
	|	И НЕ ИС_WB_Номенклатура.Код В (&Код)
	|	И НЕ ИС_WB_Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Код", МассивNmID);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
	МассивНастроек = МассивНастроекТоваров();
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, МассивНастроек);
	
	Если СтруктураНастроек.АвтоматическиСопоставлять = Истина 
			И ЗначениеЗаполнено(СтруктураНастроек.СопоставлятьПо) Тогда
			
		  СопоставитьТовары(Профиль, МассивТоваров, СтруктураНастроек.СопоставлятьПо);
			
	КонецЕсли;
	
	Если Профиль.ПомечатьНаУдалениеПеремещенныеВКорзинуТовары Тогда
			
		СтруктураПараметров = ИС_ВБ_АПИ.СтруктураПараметровЗапросаСпискаТоваров();
	
		СтруктураПараметров.settings.cursor.limit = КоличествоЭлементовНаЗапрос;
	
		КоличествоОшибок = 0;
		ПервыйЗапрос = Истина;    
		
		МассивNmIDВКорзине = Новый Массив;
				
		Пока Истина Цикл 
			   			
			Если КоличествоОшибок >= КоличествоПопытокЗапроса Тогда
				ВызватьИсключение("Превышено количество ошибок при запросах к API");
			КонецЕсли;
			
			СписокТоваровВКорзине = ИС_ВБ_АПИ.СписокКарточекТоваровВКорзине(Профиль, ПараметрыЗапроса, СтруктураПараметров);
			
			Если СписокТоваровВКорзине = Неопределено Тогда
				КоличествоОшибок = КоличествоОшибок + 1;
				Продолжить;
			КонецЕсли;
							
			Для Каждого Элемент Из СписокТоваровВКорзине["cards"] Цикл
			    МассивNmIDВКорзине.Добавить(Элемент["nmID"]);			
			КонецЦикла;
									
			Если КоличествоЭлементовНаЗапрос > СписокТоваровВКорзине["cursor"]["total"] Тогда
				Прервать;
			КонецЕсли;
			
			Если ПервыйЗапрос Тогда
				СтруктураПараметров.settings.cursor.Вставить("trashedAt", СписокТоваровВКорзине["cursor"]["trashedAt"]);
				СтруктураПараметров.settings.cursor.Вставить("nmID", СписокТоваровВКорзине["cursor"]["nmID"]);
				ПервыйЗапрос = Ложь;
			Иначе
				СтруктураПараметров.settings.cursor.trashedAt = СписокТоваровВКорзине["cursor"]["trashedAt"];
				СтруктураПараметров.settings.cursor.nmID = СписокТоваровВКорзине["cursor"]["nmID"];
			КонецЕсли;
			
		КонецЦикла;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_WB_Номенклатура КАК ИС_WB_Номенклатура
		|ГДЕ
		|	ИС_WB_Номенклатура.Профиль = &Профиль
		|	И ИС_WB_Номенклатура.Код В (&Код)
		|	И НЕ ИС_WB_Номенклатура.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Код", МассивNmIDВКорзине);
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СправочникОбъект.УстановитьПометкуУдаления(Истина);
		КонецЦикла;	
	
	КонецЕсли;	
	
	Возврат "Загрузка завершена. Всего загружено " + Обработано + " элементов"; 
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.09.22 УА #49591

//+ ИнфоСофт Ивонин К.А. 10.02.25 УА #92406
Функция ОпределитьТипТовара(Номенклатура) Экспорт
    
	ТипТовара = Перечисления.ИС_ВБ_ТипыТоваров.МГТ;
	
    СуммаДлинСторон = 0;
        
	Если Номенклатура.weightBrutto >= 25 Тогда	
		Возврат Перечисления.ИС_ВБ_ТипыТоваров.СГТ;
	КонецЕсли;	
			
	Если Номенклатура.length >= 120 Тогда	
		ТипТовара = Перечисления.ИС_ВБ_ТипыТоваров.КГТ;	
	КонецЕсли;
	
	СуммаДлинСторон = СуммаДлинСторон + Номенклатура.length;

   	Если Номенклатура.width >= 120 Тогда	
		ТипТовара = Перечисления.ИС_ВБ_ТипыТоваров.КГТ;
	КонецЕсли;
	
	СуммаДлинСторон = СуммаДлинСторон + Номенклатура.width;
	
	Если Номенклатура.height >= 120 Тогда	
		ТипТовара = Перечисления.ИС_ВБ_ТипыТоваров.КГТ;
	КонецЕсли;
	
	СуммаДлинСторон = СуммаДлинСторон + Номенклатура.height;
		    
	Если СуммаДлинСторон >= 200 Тогда	
		ТипТовара = Перечисления.ИС_ВБ_ТипыТоваров.СГТ;	
	КонецЕсли;
	
	Возврат ТипТовара;	

КонецФункции //- ИнфоСофт Ивонин К.А. 10.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 28.09.22 УА #49591
Функция СоздатьИлиОбновитьНоменклатуру(Профиль, Данные, КешКатегорий, 
		КешХарактеристикКатегорий, Перезаполнять = Ложь) Экспорт
	
	Событие = ИмяСобытия("СоздатьИлиОбновитьНоменклатуру");

	Номенклатура = Справочники.ИС_WB_Номенклатура.НайтиПоКоду(Данные["nmID"]);	
	
	Если Номенклатура.Пустая() Тогда
		Номенклатура = Справочники.ИС_WB_Номенклатура.СоздатьЭлемент();	
	Иначе            
		Номенклатура = Номенклатура.ПолучитьОбъект();
	КонецЕсли;
	
	Номенклатура.ПометкаУдаления = Ложь;
	Номенклатура.Профиль = Профиль;
	Номенклатура.Код = Данные["nmID"];
	Номенклатура.Наименование = Данные["title"];	
	
	Номенклатура.imtID = Данные["imtID"];
	Номенклатура.nmUUID = Данные["nmUUID"];
	Номенклатура.vendorCode = Данные["vendorCode"];
	
	Номенклатура.length = Данные["dimensions"]["length"];
	Номенклатура.width =  Данные["dimensions"]["width"];
	Номенклатура.height = Данные["dimensions"]["height"];
	Номенклатура.weightBrutto = Данные["dimensions"]["weightBrutto"];
	Номенклатура.КорректностьГабаритов = Данные["dimensions"]["isValid"];
	
	Категория = НайтиИлиСоздатьКатегорию(Профиль, Данные["subjectName"], 
		Данные["subjectID"], КешКатегорий, КешХарактеристикКатегорий, Перезаполнять);          
	           
	Номенклатура.object = Категория; // subject
	Номенклатура.Бренд = Данные["brand"];
	Номенклатура.Описание = Данные["description"];
	Номенклатура.needKiz = Данные["needKiz"];
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиКатегорий.Поле КАК Поле,
	|	ХарактеристикиКатегорий.Поле.Наименование КАК Имя,
	|	ХарактеристикиКатегорий.Обязательное КАК Обязательное
	|ИЗ
	|	Справочник.ИС_WB_Категории.Характеристики КАК ХарактеристикиКатегорий
	|ГДЕ
	|	ХарактеристикиКатегорий.Ссылка = &Категория";
	
	Запрос.УстановитьПараметр("Категория", Категория);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДоступныхПолей = РезультатЗапроса.Выгрузить();
	
	Номенклатура.Характеристики.Очистить();
	
	Если Данные["characteristics"] <> Неопределено Тогда
	
		Для Каждого Поле Из Данные["characteristics"] Цикл
			
			НайденноеПоле = ТаблицаДоступныхПолей.НайтиСтроки(Новый Структура("Имя", Поле["name"]));
				
			Если НайденноеПоле.Количество() = 0 Тогда
				Продолжить;	
			КонецЕсли;
				
			Если ТипЗнч(Поле["value"]) = Тип("Массив") Тогда			    
				
				Для Каждого Параметр Из Поле["value"] Цикл
					
					НоваяСтрока = Номенклатура.Характеристики.Добавить();
					НоваяСтрока.Поле = НайденноеПоле[0].Поле;
					НоваяСтрока.Обязательное = НайденноеПоле[0].Обязательное;
					
					НоваяСтрока.Значение = Параметр;				
					НоваяСтрока.ЗначениеСтроковое = Строка(Параметр);
					
				КонецЦикла;
				
			Иначе
				
				НоваяСтрока = Номенклатура.Характеристики.Добавить();
				НоваяСтрока.Поле = НайденноеПоле[0].Поле;
				НоваяСтрока.Обязательное = НайденноеПоле[0].Обязательное;
				
				НоваяСтрока.Значение = Поле["value"];				
				НоваяСтрока.ЗначениеСтроковое = Строка(Поле["value"]);
				
			КонецЕсли;
								
		КонецЦикла;
				
		Номенклатура.Характеристики.Сортировать("Поле");
	
	КонецЕсли;
	
	Номенклатура.ТипТовара = ОпределитьТипТовара(Номенклатура);
	
	Номенклатура.МедиаФайлы.Очистить();
	
	Если Данные["photos"] <> Неопределено Тогда 
	
		Для Каждого СоответствиеФото Из Данные["photos"] Цикл		
			НоваяСтрока = Номенклатура.МедиаФайлы.Добавить();
			НоваяСтрока.Адрес = СоответствиеФото["big"];		
		КонецЦикла;
			
	КонецЕсли;
	
	Если Данные["video"] <> Неопределено Тогда
		НоваяСтрока = Номенклатура.МедиаФайлы.Добавить();
		НоваяСтрока.Адрес = Данные["video"];
	КонецЕсли;
		
	Номенклатура.МедиаФайлы.Сортировать("Адрес");
		
	Номенклатура.updateAt = ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(Данные["updatedAt"], ФорматДатыJSON.ISO);
	Номенклатура.createdAt = ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(Данные["createdAt"], ФорматДатыJSON.ISO);
	
	// TODO
	//	tags
	//		id
	//		name
	//		color
	
	Попытка
		Номенклатура.Записать();
	Исключение
		Текст = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		Возврат Неопределено;
	КонецПопытки;
	
	Для Каждого Размер Из Данные["sizes"] Цикл
		НайтиИлиСоздатьХарактеристику(Профиль, Размер, Номенклатура.Ссылка);			
	КонецЦикла;
	
	Возврат Номенклатура.Ссылка;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.09.22 УА #49591

#КонецОбласти

#Область СкладыПродавца

//+ ИнфоСофт Ивонин К.А. 03.02.25 УА #92406
Процедура ЗагрузитьСклады(Профиль) Экспорт
	
	Событие = ИмяСобытия("ЗагрузитьСклады");
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	СписокСкладов = ИС_ВБ_АПИ.СписокСкладовПродавца(Профиль, ПараметрыЗапроса);
		
	Если СписокСкладов = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если СписокСкладов.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("В данном профиле отсутствуют склады");
		Возврат;	
	КонецЕсли;
	
	УстанавливатьПометкиУдаления = Истина;
	
	СкладыВБ = ИС_ВБ_АПИ.СписокСкладовВБ(Профиль, ПараметрыЗапроса);
	
	Если СкладыВБ = Неопределено Тогда
		СкладыВБ = Новый Массив;	
	КонецЕсли;
	
	МассивЗагруженных = Новый Массив;
					
	Для Каждого Элемент Из СписокСкладов Цикл 
		
		Склад = СоздатьИлиОбновитьСклад(Профиль, Элемент, СкладыВБ);
		
		Если Склад = Неопределено Тогда
			УстанавливатьПометкиУдаления = Ложь;
			Продолжить;	
		КонецЕсли;
		
		МассивЗагруженных.Добавить(Склад);
		
	КонецЦикла;
	
	Если Не УстанавливатьПометкиУдаления Тогда
		Возврат;	
	КонецЕсли;
	
	// Помечаем на удаление склады, которых не было в ответе 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ВБ_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
	|ГДЕ
	|	НЕ ИС_ВБ_Склады.Ссылка В (&Массив)
	|	И ИС_ВБ_Склады.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Массив", МассивЗагруженных);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСкладов = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаСкладов.Следующий() Цикл
		
		СправочникОбъект = ВыборкаСкладов.Ссылка.ПолучитьОбъект();
		
		Попытка
			СправочникОбъект.УстановитьПометкуУдаления(Истина);
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);
		КонецПопытки;
			
	КонецЦикла;
				
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 05.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 05.02.25 УА #92406
Функция СоздатьИлиОбновитьСклад(Профиль, ДанныеСклада, СкладыВБ) Экспорт
	
	Событие = ИмяСобытия("СоздатьИлиОбновитьСклад");
	
	Если Не ДанныеСклада.Свойство("id") Тогда
		ОбщегоНазначения.СообщитьПользователю("В полученных данных отсутствует ID склада");
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ВБ_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
	|ГДЕ
	|	ИС_ВБ_Склады.Профиль = &Профиль
	|	И ИС_ВБ_Склады.Код = &Код";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Код", ДанныеСклада.id);
				
	РезультатЗапроса = Запрос.Выполнить();		
	
	Если РезультатЗапроса.Пустой() Тогда		
		Склад = Справочники.ИС_ВБ_Склады.СоздатьЭлемент();		
	Иначе
		ВыборкаСклада = РезультатЗапроса.Выбрать();
		ВыборкаСклада.Следующий();
		Склад = ВыборкаСклада.Ссылка.ПолучитьОбъект();                
	КонецЕсли; 
	
	Склад.Профиль = Профиль;
	Склад.Код = ДанныеСклада.id;
	Склад.ПометкаУдаления = Ложь;
	
	Если ДанныеСклада.Свойство("name") Тогда
		Склад.Наименование = ДанныеСклада.name;
	КонецЕсли;
	
	Если ДанныеСклада.Свойство("cargoType") Тогда
		Склад.ТипТовара = ЗначениеПеречисленияТипаТовара(ДанныеСклада.cargoType);
	КонецЕсли;

	Если ДанныеСклада.Свойство("deliveryType") Тогда
		Склад.ТипДоставки = ЗначениеПеречисленияТипаДоставки(ДанныеСклада.deliveryType);
	КонецЕсли;
	
	Если ДанныеСклада.Свойство("officeId") Тогда
		
		Для Каждого СкладВБ Из СкладыВБ Цикл
			
			Если Не СкладВБ.Свойство("id") Тогда
				Продолжить;
			КонецЕсли;
			
			Если СкладВБ.id = ДанныеСклада.officeId Тогда
				
				Если СкладВБ.Свойство("name") Тогда
					Склад.СкладWB = СкладВБ.name;	
				КонецЕсли; 
				
				Если СкладВБ.Свойство("address") Тогда
					Склад.АдресСкладаWB = СкладВБ.address;	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Склад.ЗагруженИзЛК = Истина;
	
	Попытка
		
		Склад.Записать();
		Возврат Склад.Ссылка;
		
	Исключение
	
		Текст = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 05.02.25 УА #34786

#КонецОбласти

#Область ОстаткиНаСкладахПродавца

//+ ИнфоСофт Ивонин К.А. 10.02.25 УА #92406
Функция ТекстЗапросаОстатков() Экспорт
    Возврат ИС_ВБ_СерверЛокализация.ТекстЗапросаОстатков();	
КонецФункции //- ИнфоСофт Ивонин К.А. 10.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 10.02.25 УА #92406
Процедура УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад) Экспорт
    ИС_ВБ_СерверЛокализация.УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад);		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 03.04.25 УА #63915
Функция УдалитьОстаткиПоСкладу(Профиль, МассивШтрихкодов, Склад) Экспорт
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	РезультатУдаления = ИС_ВБ_АПИ.УдалитьОстаткиПоСкладу(Профиль, ПараметрыЗапроса, Склад, МассивШтрихкодов);
		
	Если РезультатУдаления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Истина;	
		
КонецФункции //- ИнфоСофт Ивонин К.А. 03.04.25 УА #63915

#КонецОбласти

//+ ИнфоСофт Ивонин К.А. 27.03.25 УА #63915
Функция ПодобратьТовары(Профиль, МассивРазмеров, Параметры) Экспорт
	
	Запрос = Новый Запрос;
	
	Если Параметры.СопоставлятьПо = "Штрихкод" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_ШтрихкодыРазмеров.Размер КАК ПолеСопоставления,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатуры.#Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
		|			И (ИС_WB_ШтрихкодыРазмеров.Штрихкод = ШтрихкодыНоменклатуры.Штрихкод)
		|ГДЕ
		|	ИС_WB_ШтрихкодыРазмеров.Размер В(&Размеры)
		|	И НЕ ШтрихкодыНоменклатуры.Номенклатура ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ИС_WB_ШтрихкодыРазмеров.Размер,
		|	ШтрихкодыНоменклатуры.Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика,
		|	ШтрихкодыНоменклатуры.#Упаковка";
		
	ИначеЕсли Параметры.СопоставлятьПо = "Артикул" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_РазмерыНоменклатур.Ссылка КАК ПолеСопоставления,
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ИС_WB_РазмерыНоменклатур.Владелец.vendorCode = Номенклатура.Артикул
		|ГДЕ
		|	ИС_WB_РазмерыНоменклатур.Ссылка В(&Размеры)
		|	И НЕ Номенклатура.Ссылка ЕСТЬ NULL";
		
	Иначе
		
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить("ТекстЗапросаСопоставления");
	
		Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы.ВБ, МассивПараметров, "Строка");
				
		Если ЗначениеЗаполнено(Настройки.ТекстЗапросаСопоставления) Тогда
			Запрос.Текст = Настройки.ТекстЗапросаСопоставления;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не заполнен текст запроса для сопоставления, продолжение невозможно...");
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Упаковка", ИС_МП_СерверЛокализация.УпаковкаВЗапросе());
	
	Запрос.УстановитьПараметр("Размеры", МассивРазмеров);  
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Ивонин К.А. 27.03.25 УА #63915

//+ ИнфоСофт Ивонин К.А. 21.04.25 УА #96894
Процедура ДобавитьСопоставлениеТоваров(Профиль, РазмерWB, Номенклатура, Характеристика, 
		Упаковка = Неопределено, ТекНоменклатура = Неопределено, ТекХарактеристика = Неопределено) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_WB_СоответствиеРазмеров.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Профиль.Установить(Профиль); 
	НаборЗаписей.Отбор.РазмерWB.Установить(РазмерWB);
		
	НаборЗаписей.Прочитать(); 
	
	ТребуетсяНоваяЗапись = Истина;	
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		
		Для Каждого Запись Из НаборЗаписей Цикл
		
			Если Запись.Номенклатура = ТекНоменклатура И Запись.Характеристика = ТекХарактеристика Тогда
			
				Запись.Номенклатура 	= Номенклатура;
				Запись.Характеристика 	= Характеристика;
				Запись.Упаковка 		= Упаковка;
        		ТребуетсяНоваяЗапись 	= Ложь;
        		Прервать;
			
			КонецЕсли;
		
		КонецЦикла; 	
	
	КонецЕсли;
   
    Если ТребуетсяНоваяЗапись Тогда
	
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Профиль 			= Профиль; 
		НоваяЗапись.РазмерWB 			= РазмерWB;
		НоваяЗапись.Номенклатура 		= Номенклатура; 
		НоваяЗапись.Характеристика 		= Характеристика;
		НоваяЗапись.Упаковка 			= Упаковка;
		
	КонецЕсли;
				
	НаборЗаписей.Записывать = Истина; 
	
	НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.04.25 УА #96894 

#КонецОбласти

#Область Заказы

//+ ИнфоСофт Ивонин К.А. 03.04.25 УА #96894
Процедура ВыполнитьЗагрузкуЗаказов(Профиль, ДатаНачала, ДатаОкончания = Неопределено) Экспорт
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ;
	
	МассивНастроек = МассивНастроекСхемРаботы();
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивНастроек);
	
	ОригДатаНачала = ДатаНачала;
	
	Если СтруктураНастроек.ЗаказыFBS <> Неопределено И СтруктураНастроек.ЗаказыFBS Тогда
		ИС_WB_Сервер.ПолучитьСписокСборочныхЗаданий(Профиль, ДатаНачала, ДатаОкончания);	
	КонецЕсли;
	
	ДатаНачала = ОригДатаНачала;
	
	Если СтруктураНастроек.ЗаказыDBS <> Неопределено И СтруктураНастроек.ЗаказыDBS Тогда
		ЗагрузитьЗаказыDBS(Профиль, ДатаНачала, ДатаОкончания);
	КонецЕсли;
	
	ДатаНачала = ОригДатаНачала;
	
	Если СтруктураНастроек.ЗаказыCnC <> Неопределено И СтруктураНастроек.ЗаказыCnC Тогда
		ЗагрузитьЗаказыCnC(Профиль, ДатаНачала, ДатаОкончания);	
	КонецЕсли;

	_30Минут = 1800;
	ДатаНачала = ОригДатаНачала - _30Минут;
	
	Если СтруктураНастроек.ЗаказыFBO <> Неопределено И СтруктураНастроек.ЗаказыFBO Тогда
		ЗагрузитьЗаказыFBO(Профиль, ДатаНачала);	
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 03.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 05.02.25 УА #92406
Функция ЗначениеПеречисленияТипаТовара(Значение) Экспорт
	
	Пустая = 0;
	МГТ = 1;
	СГТ = 2;
	КГТ = 3;
	
	Если Значение = Пустая Тогда
		Возврат Перечисления.ИС_ВБ_ТипыТоваров.ПустаяСсылка();
	КонецЕсли;
	
	Если Значение = МГТ Тогда
		Возврат Перечисления.ИС_ВБ_ТипыТоваров.МГТ;
	КонецЕсли;
	
	Если Значение = СГТ Тогда
		Возврат Перечисления.ИС_ВБ_ТипыТоваров.СГТ;
	КонецЕсли;
	
	Если Значение = КГТ Тогда
		Возврат Перечисления.ИС_ВБ_ТипыТоваров.КГТ;
	КонецЕсли;
	
	Возврат Перечисления.ИС_ВБ_ТипыТоваров.ПустаяСсылка();
	
КонецФункции //- ИнфоСофт Ивонин К.А. 05.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 18.02.25 УА #92887
Функция ОпределитьТипДоставкиСборочногоЗадания(ТипДоставки) Экспорт

	Если ВРег(ТипДоставки) = "FBS" Тогда 
		Возврат Перечисления.ИС_ВБ_ТипыДоставки.FBS;	
	КонецЕсли;
	
	Если ВРег(ТипДоставки) = "DBS" Тогда 
		Возврат Перечисления.ИС_ВБ_ТипыДоставки.DBS;	
	КонецЕсли;

	Если ВРег(ТипДоставки) = "WBGO" Тогда 
		Возврат Перечисления.ИС_ВБ_ТипыДоставки.DBW;	
	КонецЕсли;

	Если ВРег(ТипДоставки) = "EDBS" Тогда 
		Возврат Перечисления.ИС_ВБ_ТипыДоставки.EDBS;	
	КонецЕсли;

	Возврат Перечисления.ИС_ВБ_ТипыДоставки.ПустаяСсылка();
	
КонецФункции //- ИнфоСофт Ивонин К.А. 18.02.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 04.04.25 УА #96894
Процедура ОбновитьСтатусыЗаказов(Профиль, МассивЗаказов = Неопределено, Период = Неопределено) Экспорт
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ;
	
	МассивНастроек = МассивНастроекСхемРаботы();
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивНастроек);
	
	Если СтруктураНастроек.ЗаказыFBS <> Неопределено И СтруктураНастроек.ЗаказыFBS Тогда
		ИС_WB_Сервер.ОбновитьСтатусыСборочныхЗаданий(Профиль, МассивЗаказов, Период);	
	КонецЕсли;
	
	Если СтруктураНастроек.ЗаказыDBS <> Неопределено И СтруктураНастроек.ЗаказыDBS Тогда
		ОбновитьСтатусыЗаказовDBS(Профиль, МассивЗаказов);
	КонецЕсли;
	
	Если СтруктураНастроек.ЗаказыCnC <> Неопределено И СтруктураНастроек.ЗаказыCnC Тогда
		ОбновитьСтатусыЗаказовCnC(Профиль, МассивЗаказов);	
	КонецЕсли; 
	
	Если СтруктураНастроек.ЗаказыFBO <> Неопределено И СтруктураНастроек.ЗаказыFBO Тогда
		ОбновитьСтатусыЗаказовFBO(Профиль, Период);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 03.04.25 УА #96894
Функция ДатаПоследнегоЗаказа(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_WB_СборочноеЗадание.Дата КАК Дата
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И НЕ ИС_WB_СборочноеЗадание.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДат = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДат.Следующий() Тогда
		Возврат ВыборкаДат.Дата;		
	КонецЕсли;
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции //- ИнфоСофт Ивонин К.А. 03.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ПеревестиЗаказыНаСборку(Профиль, ВыделенныеСтроки) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.ТипДоставки КАК ТипДоставки,
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&Ссылка)
	|ИТОГИ ПО
	|	ТипДоставки";
	
	Запрос.УстановитьПараметр("Ссылка", ВыделенныеСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТипДоставки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТипДоставки.Следующий() Цикл
		
		Если ВыборкаТипДоставки.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.DBW Тогда
		
			ВыборкаИдентификаторов = ВыборкаТипДоставки.Выбрать();
		
			Пока ВыборкаИдентификаторов.Следующий() Цикл
				ПеревестиЗаказНаСборкуDBW(Профиль, ВыборкаИдентификаторов.Номер);			
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		
		Если ВыборкаТипДоставки.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.DBS 
				Или ВыборкаТипДоставки.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.EDBS Тогда
		
			ВыборкаИдентификаторов = ВыборкаТипДоставки.Выбрать();
		
			Пока ВыборкаИдентификаторов.Следующий() Цикл
				ПеревестиЗаказНаСборкуDBS(Профиль, ВыборкаИдентификаторов.Номер);	
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		
		Если ВыборкаТипДоставки.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.CnC Тогда
		
			ВыборкаИдентификаторов = ВыборкаТипДоставки.Выбрать();
		
			Пока ВыборкаИдентификаторов.Следующий() Цикл
				ПеревестиЗаказНаСборкуCnC(Профиль, ВыборкаИдентификаторов.Номер)	
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьСтатусыЗаказов(Профиль, ВыделенныеСтроки);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ПеревестиЗаказыВДоставку(Профиль, ВыделенныеСтроки) Экспорт	
	
	ТипыДоставки = Новый Массив;
	ТипыДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.DBW);
	ТипыДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.DBS);
	ТипыДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.EDBS);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.ТипДоставки КАК ТипДоставки,
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&Ссылка)
	|	И ИС_WB_СборочноеЗадание.ТипДоставки В(&ТипДоставки)
	|ИТОГИ ПО
	|	ТипДоставки";
	
	Запрос.УстановитьПараметр("Ссылка", ВыделенныеСтроки);
	Запрос.УстановитьПараметр("ТипДоставки", ТипыДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТипДоставки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТипДоставки.Следующий() Цикл
		
		Если ВыборкаТипДоставки.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.DBW Тогда
		
			ВыборкаИдентификаторов = ВыборкаТипДоставки.Выбрать();
		
			Пока ВыборкаИдентификаторов.Следующий() Цикл
				ПеревестиЗаказВДоставкуDBW(Профиль, ВыборкаИдентификаторов.Номер);			
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		
		Если ВыборкаТипДоставки.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.DBS 
				Или ВыборкаТипДоставки.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.EDBS Тогда
		
			ВыборкаИдентификаторов = ВыборкаТипДоставки.Выбрать();
		
			Пока ВыборкаИдентификаторов.Следующий() Цикл
				ПеревестиЗаказВДоставкуDBS(Профиль, ВыборкаИдентификаторов.Номер);	
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
			
	КонецЦикла;
	
	ОбновитьСтатусыЗаказов(Профиль, ВыделенныеСтроки);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ПодтвердитьГотовностьКВыдачеЗаказов(Профиль, ВыделенныеСтроки) Экспорт	
	
	ТипыДоставки = Перечисления.ИС_ВБ_ТипыДоставки.CnC;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.ТипДоставки КАК ТипДоставки,
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&Ссылка)
	|	И ИС_WB_СборочноеЗадание.ТипДоставки = &ТипДоставки
	|ИТОГИ ПО
	|	ТипДоставки";
	
	Запрос.УстановитьПараметр("Ссылка", ВыделенныеСтроки);
	Запрос.УстановитьПараметр("ТипДоставки", ТипыДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТипДоставки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТипДоставки.Следующий() Цикл
		
		Если ВыборкаТипДоставки.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.CnC Тогда
		
			ВыборкаИдентификаторов = ВыборкаТипДоставки.Выбрать();
		
			Пока ВыборкаИдентификаторов.Следующий() Цикл
				ПодтвердитьГотовностьКВыдачеЗаказовCnC(Профиль, ВыборкаИдентификаторов.Номер);			
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
			
	КонецЦикла;
	
	ОбновитьСтатусыЗаказов(Профиль, ВыделенныеСтроки);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ОтменитьЗаказы(Профиль, ВыделенныеСтроки) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.ТипДоставки КАК ТипДоставки,
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&Ссылка)
	|ИТОГИ ПО
	|	ТипДоставки";
	
	Запрос.УстановитьПараметр("Ссылка", ВыделенныеСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТипДоставки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТипДоставки.Следующий() Цикл
		
		Если ВыборкаТипДоставки.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.FBS 
				Или ВыборкаТипДоставки.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.DBW Тогда
		
			ВыборкаИдентификаторов = ВыборкаТипДоставки.Выбрать();
		
			Пока ВыборкаИдентификаторов.Следующий() Цикл
				ОтменитьЗаказFBS(Профиль, ВыборкаИдентификаторов.Номер);			
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		
		Если ВыборкаТипДоставки.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.DBS 
				Или ВыборкаТипДоставки.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.EDBS Тогда
		
			ВыборкаИдентификаторов = ВыборкаТипДоставки.Выбрать();
		
			Пока ВыборкаИдентификаторов.Следующий() Цикл
				ОтменитьЗаказDBS(Профиль, ВыборкаИдентификаторов.Номер);	
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		
		Если ВыборкаТипДоставки.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.CnC Тогда
		
			ВыборкаИдентификаторов = ВыборкаТипДоставки.Выбрать();
		
			Пока ВыборкаИдентификаторов.Следующий() Цикл
				ОтменитьЗаказCnC(Профиль, ВыборкаИдентификаторов.Номер)	
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьСтатусыЗаказов(Профиль, ВыделенныеСтроки);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

#Область ЗаказыFBS

#Область СборочныеЗадания

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ОтменитьЗаказFBS(Профиль, Номер)
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	ИС_ВБ_АПИ.ОтменитьЗаказFBS(Профиль, ПараметрыЗапроса, Номер);
КонецПроцедуры //+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

#КонецОбласти

#Область ПоставкиFBS

//+ ИнфоСофт Ивонин К.А. 14.02.23 УА #53535
Процедура ОбновитьИнформациюОПоставках(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ВБ_ПоставкиFBS.Код КАК Код
	|ИЗ
	|	Справочник.ИС_ВБ_ПоставкиFBS КАК ИС_ВБ_ПоставкиFBS
	|ГДЕ
	|	ИС_ВБ_ПоставкиFBS.scanDt = ДАТАВРЕМЯ(1, 1, 1)
	|	И (ИС_ВБ_ПоставкиFBS.closedAt >= &ДатаЗакрытия
	|			ИЛИ ИС_ВБ_ПоставкиFBS.closedAt = ДАТАВРЕМЯ(1, 1, 1))
	|	И ИС_ВБ_ПоставкиFBS.Профиль = &Профиль
	|	И НЕ ИС_ВБ_ПоставкиFBS.ПометкаУдаления";

	_10Дней = 864000; // Могу существовать закрытые поставки, которые не будут отправлены	
	Запрос.УстановитьПараметр("ДатаЗакрытия", ТекущаяДатаСеанса() - _10Дней);	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
   		НайтиИлиСоздатьПоставку(Профиль, Выборка.Код, , Истина);
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 17.02.25 УА #92887
Функция СоздатьНовуюПоставку(Профиль, Имя) Экспорт
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	СозданнаяПоставка = ИС_ВБ_АПИ.СоздатьНовуюПоставку(Профиль, ПараметрыЗапроса, Имя);
		
	Если СозданнаяПоставка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Поставка = НайтиИлиСоздатьПоставку(Профиль, СозданнаяПоставка);
	
	Если Поставка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Поставка;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 17.02.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 17.02.25 УА #92887
Функция СписокПоставок(Профиль, Перезаполнять = Ложь) Экспорт 
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	КоличествоЭлементовНаЗапрос = ПараметрыЗапроса.КоличествоЭлементовНаЗапрос;
	КоличествоПопытокЗапроса = ПараметрыЗапроса.КоличествоПопытокЗапроса;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_ВБ_ПоставкиFBS.next КАК next
	|ИЗ
	|	Справочник.ИС_ВБ_ПоставкиFBS КАК ИС_ВБ_ПоставкиFBS
	|ГДЕ
	|	ИС_ВБ_ПоставкиFBS.Профиль = &Профиль
	|	И НЕ ИС_ВБ_ПоставкиFBS.ПометкаУдаления
	|	И НЕ ИС_ВБ_ПоставкиFBS.done
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИС_ВБ_ПоставкиFBS.createdAt";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПагинации = РезультатЗапроса.Выбрать();
	
	Если ВыборкаПагинации.Следующий() Тогда
		next = ВыборкаПагинации.next;	
	Иначе
		next = 0;	
	КонецЕсли;
	
	Если Перезаполнять Тогда
		next = 0;
	КонецЕсли;
	
	limit = КоличествоЭлементовНаЗапрос;
	
	КоличествоОшибок = 0;
	
	МассивПоставок = Новый Массив;
	
	_7Дней = 604800;
	ДатаОтбора = ТекущаяДатаСеанса() - _7Дней; 
	
	Пока Истина Цикл
	    
		Если КоличествоОшибок = КоличествоПопытокЗапроса Тогда
			ОбщегоНазначения.СообщитьПользователю("Превышено количество ошибок запросов к API");
			Возврат Неопределено;
		КонецЕсли;
			    
		СписокПоставок = ИС_ВБ_АПИ.СписокПоставок(Профиль, ПараметрыЗапроса, limit, next);
		
		Если СписокПоставок = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли; 
		
		Для Каждого Элемент Из СписокПоставок.supplies Цикл
		
			Если ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(Элемент.createdAt, ФорматДатыJSON.ISO) > ДатаОтбора Тогда
				Элемент.Вставить("next", next);
				МассивПоставок.Добавить(Элемент);	
			КонецЕсли;
		
		КонецЦикла;
		
		next = СписокПоставок.next;
		
		Если СписокПоставок.next = 0 Тогда
			Прервать;
		КонецЕсли; 
	
	КонецЦикла; 
	
	Для Каждого Элемент Из МассивПоставок Цикл
		НайтиИлиСоздатьПоставку(Профиль, Элемент.id, Элемент, Истина);		
	КонецЦикла;
	
	Возврат "Загрузка завершена";

КонецФункции //- ИнфоСофт Ивонин К.А. 17.02.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 25.01.23 УА #53535
Процедура ДобавитьСборочныеЗаданияВПоставку(Профиль, Поставка, МассивЗаказов) Экспорт
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&Массив)";
	
	Запрос.УстановитьПараметр("Массив", МассивЗаказов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	КодПоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поставка, "Код");
	
	Пока Выборка.Следующий() Цикл
	
		РезультатДобавления = ИС_ВБ_АПИ.ДобавитьСборочноеЗаданиеКПоставке(Профиль, ПараметрыЗапроса, КодПоставки, Выборка.Номер);
	    
	    Если РезультатДобавления <> Неопределено Тогда
	    	ЗаписатьПоставкуСборочногоЗадания(Профиль, Выборка.Ссылка, Поставка);
	    КонецЕсли;
	    
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 17.02.25 УА #92887
Функция УдалитьПоставку(Профиль, Поставка) Экспорт
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	Код = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поставка, "Код");
	
	ПоставкаУдалена = ИС_ВБ_АПИ.УдалитьПоставку(Профиль, ПараметрыЗапроса, Код);
		
	Если ПоставкаУдалена = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Поставка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);	
	Исключение          
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
			
КонецФункции //- ИнфоСофт Ивонин К.А. 17.02.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 18.02.25 УА #92887
Функция СписокСборочныхЗаданийВПоставке(Профиль, Поставка) Экспорт
		
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	МассивЗаданий = ИС_ВБ_АПИ.СписокСборочныхЗаданийВПоставке(Профиль, ПараметрыЗапроса, Поставка);
	
	Если МассивЗаданий = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Для Каждого Элемент Из МассивЗаданий Цикл
		Результат.Добавить(Элемент.id);
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 25.01.23 УА #53535
	
//+ ИнфоСофт Ивонин К.А. 17.02.25 УА #92887	
Функция ПередатьПоставкуВДоставку(Профиль, Поставка) Экспорт
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	ПоставкаЗакрыта = ИС_ВБ_АПИ.ПередатьПоставкуВДоставку(Профиль, ПараметрыЗапроса, Поставка.Код);
		
	Если ПоставкаЗакрыта = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	         
	НайтиИлиСоздатьПоставку(Профиль, Поставка.Код, , Истина); 
	
	Возврат Истина;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 17.02.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 17.02.25 УА #92887
Функция ПолучитьQRПоставки(Профиль, Поставка) Экспорт
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	КартинкаQR = ИС_ВБ_АПИ.ПолучитьQRПоставки(Профиль, ПараметрыЗапроса, Поставка);
	
	Если КартинкаQR = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Base64Значение(КартинкаQR);

КонецФункции //- ИнфоСофт Ивонин К.А. 17.02.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 18.02.25 УА #92887
Функция СписокКоробовПоставки(Профиль, supplyId) Экспорт 
		
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
			    
	СписокКоробовПоставки = ИС_ВБ_АПИ.СписокКоробовПоставки(Профиль, ПараметрыЗапроса, supplyId);
		
	Если СписокКоробовПоставки = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Для Каждого Элемент Из СписокКоробовПоставки Цикл
		Результат.Добавить(Элемент.id);	
	КонецЦикла;
		
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 18.02.25 УА #92887

//Добавить короба к поставке/api/v3/supplies/{supplyId}/trbx

//Удалить короба из поставки/api/v3/supplies/{supplyId}/trbx

//Добавить заказы в короб/api/v3/supplies/{supplyId}/trbx/{trbxId}

//Удалить заказ из короба/api/v3/supplies/{supplyId}/trbx/{trbxId}/orders/{orderId} 

//+ ИнфоСофт Ивонин К.А. 18.02.25 УА #92887
Функция ПолучитьСтикерыКоробов(Профиль, Поставка, МассивКоробов) Экспорт
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	СтикерыКоробов = ИС_ВБ_АПИ.ПолучитьСтикерыКоробов(Профиль, ПараметрыЗапроса, Поставка, МассивКоробов);
	
	Если СтикерыКоробов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Массив;
	Для каждого Элемент Из СтикерыКоробов Цикл
		Результат.Добавить(Base64Значение(Элемент.file));  	
	КонецЦикла;
		
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 18.02.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 17.02.25 УА #92887
Функция НайтиИлиСоздатьПоставку(Профиль, supplyId, ИнформацияОПоставке = Неопределено, Перезаполнять = Ложь) Экспорт 

	Событие = ИмяСобытия("НайтиИлиСоздатьПоставку");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_ВБ_ПоставкиFBS.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_ВБ_ПоставкиFBS КАК ИС_ВБ_ПоставкиFBS
	|ГДЕ
	|	ИС_ВБ_ПоставкиFBS.Профиль = &Профиль
	|	И ИС_ВБ_ПоставкиFBS.Код = &Код";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Код", supplyId);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоставки = РезультатЗапроса.Выбрать();
	
	Поставка = Справочники.ИС_ВБ_ПоставкиFBS.ПустаяСсылка();
	
	Если ВыборкаПоставки.Следующий() Тогда
		Поставка = ВыборкаПоставки.Ссылка;
	КонецЕсли;
	
	Если Не Поставка.Пустая() И Не Перезаполнять Тогда
		Возврат Поставка;
	КонецЕсли;
		
	Если ИнформацияОПоставке = Неопределено Тогда
		ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
		ИнформацияОПоставке = ИС_ВБ_АПИ.ИнформацияОПоставке(Профиль, ПараметрыЗапроса, supplyId);
	КонецЕсли;		
	
	Если ИнформацияОПоставке = Неопределено Тогда
		Возврат Поставка;
	КонецЕсли;
	
	Если ИнформацияОПоставке = 404 Тогда
		
		Если Не Поставка.Пустая() Тогда
			Поставка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
		КонецЕсли;
		
		Возврат Справочники.ИС_ВБ_ПоставкиFBS.ПустаяСсылка();
			
	КонецЕсли;
	
	Если Не Поставка.Пустая() Тогда
    	Поставка = Поставка.ПолучитьОбъект();
    Иначе
		Поставка = Справочники.ИС_ВБ_ПоставкиFBS.СоздатьЭлемент();
	КонецЕсли;
	
	Поставка.Код = ИнформацияОПоставке.id;
	Поставка.Профиль = Профиль;
	
	Если ЗначениеЗаполнено(ИнформацияОПоставке.name) Тогда
		Поставка.Наименование = ИнформацияОПоставке.name;
	Иначе
		Поставка.Наименование = ИнформацияОПоставке.id;
	КонецЕсли;
	
	Поставка.done = ИнформацияОПоставке.done;
	
	Поставка.createdAt = 
		ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(ИнформацияОПоставке.createdAt, ФорматДатыJSON.ISO);
		
	Если ЗначениеЗаполнено(ИнформацияОПоставке.closedAt) Тогда
		Поставка.closedAt = 
			ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(ИнформацияОПоставке.closedAt, ФорматДатыJSON.ISO);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ИнформацияОПоставке.scanDt) Тогда
		Поставка.scanDt = 
			ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(ИнформацияОПоставке.scanDt, ФорматДатыJSON.ISO);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ИнформацияОПоставке.rejectDt) Тогда
		Поставка.rejectDt = 
			ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(ИнформацияОПоставке.rejectDt, ФорматДатыJSON.ISO);
	КонецЕсли;

    Поставка.ТипТовара = ЗначениеПеречисленияТипаТовара(ИнформацияОПоставке.cargoType);
		
	Если Поставка.done Тогда
	
		QR = ПолучитьQRПоставки(Профиль, Поставка.Код);
		
		Если QR <> Неопределено Тогда 
			Поставка.QR = Новый ХранилищеЗначения(QR, Новый СжатиеДанных(9)); 
		КонецЕсли;
	
	КонецЕсли;
	
	Если ИнформацияОПоставке.Свойство("next") Тогда
		Поставка.next = ИнформацияОПоставке.next;
	КонецЕсли;
	
	Попытка	
		Поставка.Записать();						
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);
		
		Возврат Справочники.ИС_ВБ_ПоставкиFBS.ПустаяСсылка();
		
	КонецПопытки;
	
	СписокСборочныхЗаданий = СписокСборочныхЗаданийВПоставке(Профиль, supplyId);		
	
	МассивИдСборочныхЗаданий = Новый Массив;
	
	Если СписокСборочныхЗаданий <> Неопределено Тогда
		
		Для Каждого Элемент Из СписокСборочныхЗаданий Цикл
			МассивИдСборочныхЗаданий.Добавить(Элемент);	
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СборочныеЗадания
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И ИС_WB_СборочноеЗадание.Номер В(&СписокНомеров)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СборочныеЗадания.Ссылка КАК Ссылка,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Поставка КАК Поставка
	|ИЗ
	|	ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Профиль = &Профиль)
	|			И (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание = ВТ_СборочныеЗадания.Ссылка)
	|ГДЕ
	|	НЕ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Поставка = &Поставка";
	
	Запрос.УстановитьПараметр("СписокНомеров", МассивИдСборочныхЗаданий);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Поставка", Поставка.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСборочныхЗаданий = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаСборочныхЗаданий.Следующий() Цикл	
		ЗаписатьПоставкуСборочногоЗадания(Профиль, ВыборкаСборочныхЗаданий.Ссылка, Поставка.Ссылка); 			
	КонецЦикла;

	Возврат Поставка.Ссылка;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 17.02.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 18.02.25 УА #92887
Процедура ЗаписатьПоставкуСборочногоЗадания(Профиль, СборочноеЗадание, Поставка) Экспорт
   
    Событие = ИмяСобытия("ЗаписатьПоставкуСборочногоЗадания");
    
	МенеджерЗаписи = РегистрыСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.СборочноеЗадание = СборочноеЗадание;
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.СборочноеЗадание = СборочноеЗадание;
	МенеджерЗаписи.Поставка = Поставка;
	
	Попытка
		МенеджерЗаписи.Записать(Истина);	
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.02.23 УА #53535

#КонецОбласти

#Область ДоставкаКурьеромWB

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ПеревестиЗаказНаСборкуDBW(Профиль, Номер)
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	ИС_ВБ_АПИ.ПеревестиЗаказНаСборкуDBW(Профиль, ПараметрыЗапроса, Номер);
КонецПроцедуры //+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ПеревестиЗаказВДоставкуDBW(Профиль, Номер)
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	ИС_ВБ_АПИ.ПеревестиЗаказВДоставкуDBW(Профиль, ПараметрыЗапроса, Номер);
КонецПроцедуры //+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

#КонецОбласти

#КонецОбласти

#Область ЗаказыDBS

//+ ИнфоСофт Ивонин К.А. 03.04.25 УА #96894
Процедура ЗагрузитьЗаказыDBS(Профиль, ДатаНачала, ДатаОкончания = Неопределено) Экспорт

	Событие = ИмяСобытия("ЗагрузитьЗаказыDBS");
    	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	КоличествоЭлементовНаЗапрос = ПараметрыЗапроса.КоличествоЭлементовНаЗапрос;
	КоличествоПопытокЗапроса = ПараметрыЗапроса.КоличествоПопытокЗапроса;
		
	СтруктураПараметров = ИС_ВБ_АПИ.СтруктураПараметровЗапросаСборочныхЗаданий();
	
	СтруктураПараметров.limit = КоличествоЭлементовНаЗапрос;
	
	_30Суток  = 2592000;
	
	Если ДатаОкончания = Неопределено Тогда
		ДатаОкончания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Всего = 0;
	КоличествоОшибок = 0;
		
	МассивЗагруженныхЗаказов = Новый Массив;
	
	МассивТиповДоставки = Новый Массив;
	МассивТиповДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.DBS);
	МассивТиповДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.EDBS);
	МассивТиповДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.DBW);
	
	ТекРазница = ДатаОкончания - ДатаНачала;
	
	Пока ТекРазница >= 0 Цикл
		
		КоэффПрироста = ?(ТекРазница > _30Суток, _30Суток, ТекРазница);
		
		СтруктураПараметров.dateFrom = ДатаНачала;
		СтруктураПараметров.dateTo = ДатаНачала + КоэффПрироста;
		
		Пока Истина Цикл 
			
	        Если КоличествоОшибок >= КоличествоПопытокЗапроса Тогда
				Текст = "Превышено количество ошибок запросов к API";
				ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				Возврат;
			КонецЕсли;
					
			РезультатЗапроса = ИС_ВБ_АПИ.СписокЗавершенныхЗаказовDBS(Профиль, ПараметрыЗапроса, СтруктураПараметров);
			
			Если РезультатЗапроса = Неопределено Тогда
				КоличествоОшибок = КоличествоОшибок + 1;
				Продолжить;
			КонецЕсли;
		
			Если Не РезультатЗапроса.Свойство("next") Тогда
				Прервать;
			КонецЕсли;
			
			Если РезультатЗапроса.orders.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураПараметров.next = РезультатЗапроса.next;
		
			Всего = Всего + РезультатЗапроса.orders.Количество();
			
			Для Каждого СборочноеЗадание Из РезультатЗапроса.orders Цикл	
				
				ДатаЗаказа = ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(СборочноеЗадание.createdAt);
				
			    Если ДатаЗаказа < ДатаНачала Тогда
			    	Продолжить;
				КонецЕсли;
			    
				СсылкаЗадания = СоздатьИлиОбновитьСборочноеЗадание(Профиль, СборочноеЗадание, МассивТиповДоставки);		
			
				Если Не СсылкаЗадания.Пустая() Тогда
					МассивЗагруженныхЗаказов.Добавить(СсылкаЗадания);
				КонецЕсли;
			
			КонецЦикла;
				
		КонецЦикла;
		
		ДатаНачала = ДатаНачала + КоэффПрироста;
		
		ТекРазница = ТекРазница - _30Суток;
		
	КонецЦикла;
		
	РезультатЗапроса = ИС_ВБ_АПИ.СписокНовыхЗаказовDBS(Профиль, ПараметрыЗапроса);
		
	Если РезультатЗапроса <> Неопределено И РезультатЗапроса.orders.Количество() > 0 Тогда
		
		Всего = Всего + РезультатЗапроса.orders.Количество();
	
		Для Каждого СборочноеЗадание Из РезультатЗапроса.orders Цикл	
		    
		    Если ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(СборочноеЗадание.createdAt) < ДатаНачала Тогда
		    	Продолжить;
		    КонецЕсли;
		    
			СсылкаЗадания = СоздатьИлиОбновитьСборочноеЗадание(Профиль, СборочноеЗадание, МассивТиповДоставки);		
		
			Если Не СсылкаЗадания.Пустая() Тогда
				МассивЗагруженныхЗаказов.Добавить(СсылкаЗадания);
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;
			
	Если МассивЗагруженныхЗаказов.Количество() > 0 Тогда
		ПроверитьФункциональныеОпцииЗаказов(Профиль, МассивЗагруженныхЗаказов);	
	КонецЕсли;
    
    Если Всего = 0 Тогда
		Текст = СтрШаблон("С %1 нет сборочных заданий для загрузки", ДатаНачала);
	Иначе
		Текст = СтрШаблон("Сборочные задания в количестве %1 успешно загружены", Всего);
	КонецЕсли;	
	
	Если ДатаОкончания = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(Текст); 
	КонецЕсли;
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 03.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 04.04.25 УА #96894
Процедура ОбновитьСтатусыЗаказовDBS(Профиль, МассивЗаказов = Неопределено)

	Событие = ИмяСобытия("ОбновитьСтатусыЗаказовDBS");
	
	СтатусыЗаказов = Новый Массив;
	
	СтатусыЗаказов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ПустаяСсылка());
	СтатусыЗаказов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.waiting);
	СтатусыЗаказов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sorted);
	СтатусыЗаказов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ready_for_pickup);
	
	ТипыДоставки = Новый Массив;
	
	ТипыДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.DBS);
	ТипыДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.EDBS);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус КАК Статус,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB КАК СтатусWB,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.ДатаДоставкиС КАК ДатаДоставкиС,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.ДатаДоставкиПо КАК ДатаДоставкиПо,
	|	ИС_WB_СборочноеЗадание.phone КАК phone
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Профиль = &Профиль)
	|			И ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	|			И (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB В (&МассивСтатусов))
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И ИС_WB_СборочноеЗадание.ТипДоставки В(&ТипДоставки)
	|	И &Условие";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("МассивСтатусов", СтатусыЗаказов);
	Запрос.УстановитьПараметр("ТипДоставки", ТипыДоставки);
		
	Если МассивЗаказов = Неопределено Тогда
		_7Суток = 604800;                          
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", "ИС_WB_СборочноеЗадание.Дата >= &Дата");
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса() - _7Суток);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", "ИС_WB_СборочноеЗадание.Ссылка В (&МассивСсылок)");
		Запрос.УстановитьПараметр("МассивСсылок", МассивЗаказов);
	КонецЕсли;
    	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЗаказов = РезультатЗапроса.Выгрузить();
	
	МассивДляЗапроса = ТаблицаЗаказов.ВыгрузитьКолонку("Номер");
	
	СоответствиеЗаказов = Новый Соответствие;
	
	ТаблицаЗаказов.Колонки.Добавить("ТребуетсяОбновление", Новый ОписаниеТипов("Булево"));
	
	РазбитыйМассив = ИС_МП_Сервер.РазбитьМассивПоNЭлементов(МассивДляЗапроса, 1000);
	
	Для Каждого ЭлементМассив Из РазбитыйМассив Цикл 
		
		ИнформацияОСтатусах = ПолучитьСтатусыЗаказовDBS(Профиль, ЭлементМассив);
		
		Если ИнформацияОСтатусах <> Неопределено Тогда
			
			Для Каждого Элемент Из ИнформацияОСтатусах Цикл
				
				НайденныеСтроки = ТаблицаЗаказов.НайтиСтроки(Новый Структура("Номер", Элемент.id));
				 
				Если НайденныеСтроки.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Статус = ЗначениеПеречисленияСтатусаЗаказа(Элемент.supplierStatus);
				СтатусWB = ЗначениеПеречисленияСтатусВСистемеWildBerries(Элемент.wbStatus);
				
				Если Не ЗначениеЗаполнено(НайденныеСтроки[0].phone) 
						И Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.confirm Тогда
					СоответствиеЗаказов.Вставить(НайденныеСтроки[0].Номер, НайденныеСтроки[0].Ссылка);	
				КонецЕсли;
				
				Если НайденныеСтроки[0].Статус = Статус И НайденныеСтроки[0].СтатусWB = СтатусWB Тогда
					Продолжить;
				КонецЕсли;
				
				НайденныеСтроки[0].ТребуетсяОбновление = Истина;
				НайденныеСтроки[0].Статус = Статус;
				НайденныеСтроки[0].СтатусWB = СтатусWB;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ИнформацияОДатах = ПолучитьДатуИВремяДоставкиDBS(Профиль, ЭлементМассив);
		
		Если ИнформацияОДатах = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
			
		Для Каждого Элемент Из ИнформацияОДатах Цикл
			
			НайденныеСтроки = ТаблицаЗаказов.НайтиСтроки(Новый Структура("Номер", Элемент.id));
			 
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Элемент.dTimeFrom = Неопределено Тогда
				Элемент.dTimeFrom = "00:00";
			КонецЕсли;
			
			Если Элемент.dTimeTo = Неопределено Тогда
				Элемент.dTimeTo = "00:00";
			КонецЕсли;
			
			ДатаС = ПреобразоватьВДатуИзЧастей(Элемент.dDate, Элемент.dTimeFrom);
			ДатаПо = ПреобразоватьВДатуИзЧастей(Элемент.dDate, Элемент.dTimeTo);
			
			Если НайденныеСтроки[0].ДатаДоставкиС = ДатаС И НайденныеСтроки[0].ДатаДоставкиПо = ДатаПо Тогда
				Продолжить;
			КонецЕсли;
			
			НайденныеСтроки[0].ТребуетсяОбновление = Истина;
			НайденныеСтроки[0].ДатаДоставкиС = ДатаС;
			НайденныеСтроки[0].ДатаДоставкиПо = ДатаПо;
			
		КонецЦикла;

	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаЗаказов Цикл
		
		Если Строка.ТребуетсяОбновление Тогда
			ЗаписатьСтатусыИДатыЗаказа(Профиль, Строка.Ссылка, Строка.Статус, 
				Строка.СтатусWB, Строка.ДатаДоставкиС, Строка.ДатаДоставкиПо); 	
		КонецЕсли;
		
	КонецЦикла;
	
	Если СоответствиеЗаказов.Количество() > 0 Тогда
		ЗаполнитьИнформациюОПокупателеDBS(Профиль, СоответствиеЗаказов);		
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 04.04.25 УА #96894
Функция ПолучитьСтатусыЗаказовDBS(Профиль, МассивСборочныхЗаданий) Экспорт

	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	ИнформацияОСтатусах = ИС_ВБ_АПИ.ПолучитьСтатусыЗаказовDBS(Профиль, ПараметрыЗапроса, МассивСборочныхЗаданий);
	
	Возврат ИнформацияОСтатусах;	

КонецФункции //- ИнфоСофт Ивонин К.А. 04.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 04.04.25 УА #96894
Функция ПолучитьДатуИВремяДоставкиDBS(Профиль, МассивСборочныхЗаданий) Экспорт

	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	ИнформацияОДатах = ИС_ВБ_АПИ.ПолучитьДатуИВремяДоставкиDBS(Профиль, ПараметрыЗапроса, МассивСборочныхЗаданий);
	
	Возврат ИнформацияОДатах;	

КонецФункции //- ИнфоСофт Ивонин К.А. 04.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 08.04.25 УА #96894
Процедура ЗаполнитьИнформациюОПокупателеDBS(Профиль, СоответствиеЗаказов) Экспорт
	
	Событие = ИмяСобытия("ЗаполнитьИнформациюОПокупателеDBS");
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");	
	
	МассивИдентификаторов = Новый Массив;
	
	Для Каждого Элемент Из СоответствиеЗаказов Цикл
		МассивИдентификаторов.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	ИнформацияОПокупателе = ИС_ВБ_АПИ.ИнформацияОПокупателеDBS(Профиль, ПараметрыЗапроса, МассивИдентификаторов);	
	
	Если ИнформацияОПокупателе = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из ИнформацияОПокупателе Цикл
		
		ЗаказОбъект = СоответствиеЗаказов[Элемент.orderID].ПолучитьОбъект();

		Если Элемент.Свойство("fullName") Тогда
			ЗаказОбъект.fio = Элемент.fullName;
		КонецЕсли;
		
		Если Элемент.Свойство("phone") Тогда
			ЗаказОбъект.phone = Элемент.phone;
		КонецЕсли;
		
		Если Элемент.Свойство("phoneCode") Тогда
			ЗаказОбъект.ДобавочныеКоды = Формат(Элемент.phoneCode, "ЧГ=") + "; ";
		КонецЕсли;
		
		Если Элемент.Свойство("additionalPhoneCodes") И ТипЗнч(Элемент.additionalPhoneCodes) = Тип("Массив") Тогда
			
			Для Каждого ДобКод Из Элемент.additionalPhoneCodes Цикл
				ЗаказОбъект.ДобавочныеКоды = ЗаказОбъект.ДобавочныеКоды + Формат(ДобКод, "ЧГ=") + "; ";	
			КонецЦикла; 
			
		КонецЕсли;
		
		Попытка
			ЗаказОбъект.Записать();
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ПеревестиЗаказНаСборкуDBS(Профиль, Номер)
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	ИС_ВБ_АПИ.ПеревестиЗаказНаСборкуDBS(Профиль, ПараметрыЗапроса, Номер);
КонецПроцедуры //+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ПеревестиЗаказВДоставкуDBS(Профиль, Номер)
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	ИС_ВБ_АПИ.ПеревестиЗаказВДоставкуDBS(Профиль, ПараметрыЗапроса, Номер);
КонецПроцедуры //+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Функция ПодтвердитьВыдачуЗаказаDBS(Профиль, Номер, Код) Экспорт
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	Результат = ИС_ВБ_АПИ.ПодтвердитьВыдачуЗаказаDBS(Профиль, ПараметрыЗапроса, Номер, Код);
	
	Если Результат = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Функция ПодтвердитьОтказОтЗаказаDBS(Профиль, Номер, Код) Экспорт
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	Результат = ИС_ВБ_АПИ.ПодтвердитьОтказОтЗаказаDBS(Профиль, ПараметрыЗапроса, Номер, Код);
	
	Если Результат = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ОтменитьЗаказDBS(Профиль, Номер)
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	ИС_ВБ_АПИ.ОтменитьЗаказDBS(Профиль, ПараметрыЗапроса, Номер);
КонецПроцедуры //+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

#КонецОбласти 

#Область ЗаказыCnC

//+ ИнфоСофт Ивонин К.А. 03.04.25 УА #96894
Процедура ЗагрузитьЗаказыCnC(Профиль, ДатаНачала, ДатаОкончания = Неопределено) Экспорт

	Событие = ИмяСобытия("ЗагрузитьЗаказыCnC");
    	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	КоличествоЭлементовНаЗапрос = ПараметрыЗапроса.КоличествоЭлементовНаЗапрос;
	КоличествоПопытокЗапроса = ПараметрыЗапроса.КоличествоПопытокЗапроса;
		
	СтруктураПараметров = ИС_ВБ_АПИ.СтруктураПараметровЗапросаСборочныхЗаданий();
	
	СтруктураПараметров.limit = КоличествоЭлементовНаЗапрос;
	
	_30Суток  = 2592000;
	
	Если ДатаОкончания = Неопределено Тогда
		ДатаОкончания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Всего = 0;
	КоличествоОшибок = 0;
		
	МассивЗагруженныхЗаказов = Новый Массив;
	
	ТекРазница = ДатаОкончания - ДатаНачала;
	
	Пока ТекРазница >= 0 Цикл
		
		КоэффПрироста = ?(ТекРазница > _30Суток, _30Суток, ТекРазница);
		
		СтруктураПараметров.dateFrom = ДатаНачала;
		СтруктураПараметров.dateTo = ДатаНачала + КоэффПрироста;
		
		Пока Истина Цикл 
			
	        Если КоличествоОшибок >= КоличествоПопытокЗапроса Тогда
				Текст = "Превышено количество ошибок запросов к API";
				ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				Возврат;
			КонецЕсли;
					
			РезультатЗапроса = ИС_ВБ_АПИ.СписокЗавершенныхЗаказовCnC(Профиль, ПараметрыЗапроса, СтруктураПараметров);
			
			Если РезультатЗапроса = Неопределено Тогда
				КоличествоОшибок = КоличествоОшибок + 1;
				Продолжить;
			КонецЕсли;
		
			Если Не РезультатЗапроса.Свойство("next") Тогда
				Прервать;
			КонецЕсли;
			
			Если РезультатЗапроса.orders.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураПараметров.next = РезультатЗапроса.next;
		
			Всего = Всего + РезультатЗапроса.orders.Количество();
			
			Для Каждого СборочноеЗадание Из РезультатЗапроса.orders Цикл	
				
				ДатаЗаказа = ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(СборочноеЗадание.createdAt);
				
			    Если ДатаЗаказа < ДатаНачала Тогда
			    	Продолжить;
				КонецЕсли;
							    
				СсылкаЗадания = СоздатьИлиОбновитьСборочноеЗадание(Профиль, СборочноеЗадание, Перечисления.ИС_ВБ_ТипыДоставки.CnC);		
			
				Если Не СсылкаЗадания.Пустая() Тогда
					МассивЗагруженныхЗаказов.Добавить(СсылкаЗадания);
				КонецЕсли;
			
			КонецЦикла;
				
		КонецЦикла;
		
		ДатаНачала = ДатаНачала + КоэффПрироста;
		
		ТекРазница = ТекРазница - _30Суток;
		
	КонецЦикла;
		
	РезультатЗапроса = ИС_ВБ_АПИ.СписокНовыхЗаказовCnC(Профиль, ПараметрыЗапроса);
		
	Если РезультатЗапроса <> Неопределено И РезультатЗапроса.orders.Количество() > 0 Тогда
		
		Всего = Всего + РезультатЗапроса.orders.Количество();
	
		Для Каждого СборочноеЗадание Из РезультатЗапроса.orders Цикл	
		    
		    Если ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(СборочноеЗадание.createdAt) < ДатаНачала Тогда
		    	Продолжить;
		    КонецЕсли;
		    
			СсылкаЗадания = СоздатьИлиОбновитьСборочноеЗадание(Профиль, СборочноеЗадание, Перечисления.ИС_ВБ_ТипыДоставки.CnC);		
		
			Если Не СсылкаЗадания.Пустая() Тогда
				МассивЗагруженныхЗаказов.Добавить(СсылкаЗадания);
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;
			
	Если МассивЗагруженныхЗаказов.Количество() > 0 Тогда
		ПроверитьФункциональныеОпцииЗаказов(Профиль, МассивЗагруженныхЗаказов);	
	КонецЕсли;
    
    Если Всего = 0 Тогда
		Текст = СтрШаблон("С %1 нет сборочных заданий для загрузки", ДатаНачала);
	Иначе
		Текст = СтрШаблон("Сборочные задания в количестве %1 успешно загружены", Всего);
	КонецЕсли;	
	
	Если ДатаОкончания = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(Текст); 
	КонецЕсли;
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 03.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 04.04.25 УА #96894
Процедура ОбновитьСтатусыЗаказовCnC(Профиль, МассивЗаказов = Неопределено)

	Событие = ИмяСобытия("ОбновитьСтатусыЗаказовCnC");
	
	СтатусыЗаказов = Новый Массив;
	
	СтатусыЗаказов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ПустаяСсылка());
	СтатусыЗаказов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.waiting);
	СтатусыЗаказов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sorted);
	СтатусыЗаказов.Добавить(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ready_for_pickup);
	
	ТипыДоставки = Перечисления.ИС_ВБ_ТипыДоставки.CnC;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус КАК Статус,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB КАК СтатусWB,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.ДатаДоставкиС КАК ДатаДоставкиС,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.ДатаДоставкиПо КАК ДатаДоставкиПо,
	|	ИС_WB_СборочноеЗадание.phone КАК phone
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Профиль = &Профиль)
	|			И ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	|			И (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB В (&МассивСтатусов))
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И ИС_WB_СборочноеЗадание.ТипДоставки = &ТипДоставки
	|	И &Условие";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("МассивСтатусов", СтатусыЗаказов);
	Запрос.УстановитьПараметр("ТипДоставки", ТипыДоставки);
		
	Если МассивЗаказов = Неопределено Тогда
		_7Суток = 604800;                          
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", "ИС_WB_СборочноеЗадание.Дата >= &Дата");
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса() - _7Суток);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", "ИС_WB_СборочноеЗадание.Ссылка В (&МассивСсылок)");
		Запрос.УстановитьПараметр("МассивСсылок", МассивЗаказов);
	КонецЕсли;
    	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЗаказов = РезультатЗапроса.Выгрузить();
	
	МассивДляЗапроса = ТаблицаЗаказов.ВыгрузитьКолонку("Номер");
	
	СоответствиеЗаказов = Новый Соответствие;
	
	ТаблицаЗаказов.Колонки.Добавить("ТребуетсяОбновление", Новый ОписаниеТипов("Булево"));
	
	РазбитыйМассив = ИС_МП_Сервер.РазбитьМассивПоNЭлементов(МассивДляЗапроса, 1000);
	
	Для Каждого ЭлементМассив Из РазбитыйМассив Цикл 
		
		ИнформацияОСтатусах = ПолучитьСтатусыЗаказовCnC(Профиль, ЭлементМассив);
		
		Если ИнформацияОСтатусах = Неопределено Тогда
			Продолжить;		
		КонецЕсли;
			
		Для Каждого Элемент Из ИнформацияОСтатусах Цикл
			
			НайденныеСтроки = ТаблицаЗаказов.НайтиСтроки(Новый Структура("Номер", Элемент.id));
			 
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Статус = ЗначениеПеречисленияСтатусаЗаказа(Элемент.supplierStatus);
			СтатусWB = ЗначениеПеречисленияСтатусВСистемеWildBerries(Элемент.wbStatus);
			
			Если Не ЗначениеЗаполнено(НайденныеСтроки[0].phone) 
					И (Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.confirm
					Или Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.prepare) Тогда
				СоответствиеЗаказов.Вставить(НайденныеСтроки[0].Номер, НайденныеСтроки[0].Ссылка);	
			КонецЕсли;

			Если НайденныеСтроки[0].Статус = Статус И НайденныеСтроки[0].СтатусWB = СтатусWB Тогда
				Продолжить;
			КонецЕсли;
			
			НайденныеСтроки[0].ТребуетсяОбновление = Истина;
			НайденныеСтроки[0].Статус = Статус;
			НайденныеСтроки[0].СтатусWB = СтатусWB;
			
		КонецЦикла;

	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаЗаказов Цикл
		
		Если Строка.ТребуетсяОбновление Тогда
			ЗаписатьСтатусыИДатыЗаказа(Профиль, Строка.Ссылка, Строка.Статус, 
				Строка.СтатусWB, Строка.ДатаДоставкиС, Строка.ДатаДоставкиПо); 	
		КонецЕсли;
		
	КонецЦикла;
	
	Если СоответствиеЗаказов.Количество() > 0 Тогда
		ЗаполнитьИнформациюОПокупателеCnC(Профиль, СоответствиеЗаказов);		
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 04.04.25 УА #96894
Функция ПолучитьСтатусыЗаказовCnC(Профиль, МассивСборочныхЗаданий) Экспорт

	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	ИнформацияОСтатусах = ИС_ВБ_АПИ.ПолучитьСтатусыЗаказовCnC(Профиль, ПараметрыЗапроса, МассивСборочныхЗаданий);
	
	Возврат ИнформацияОСтатусах;	

КонецФункции //- ИнфоСофт Ивонин К.А. 04.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 08.04.25 УА #96894
Процедура ЗаполнитьИнформациюОПокупателеCnC(Профиль, СоответствиеЗаказов) Экспорт
	
	Событие = ИмяСобытия("ЗаполнитьИнформациюОПокупателеCnC");
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");	
	
	МассивИдентификаторов = Новый Массив;
	
	Для Каждого Элемент Из СоответствиеЗаказов Цикл
		МассивИдентификаторов.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	ИнформацияОПокупателе = ИС_ВБ_АПИ.ИнформацияОПокупателеCnC(Профиль, ПараметрыЗапроса, МассивИдентификаторов);	
	
	Если ИнформацияОПокупателе = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из ИнформацияОПокупателе Цикл
		
		ЗаказОбъект = СоответствиеЗаказов[Элемент.orderID].ПолучитьОбъект();

		Если Элемент.Свойство("firstName") Тогда
			ЗаказОбъект.fio = Элемент.firstName;
		КонецЕсли;
		
		Если Элемент.Свойство("phone") Тогда
			ЗаказОбъект.phone = Элемент.phone;
		КонецЕсли;
		
		Если Элемент.Свойство("phoneCode") Тогда
			ЗаказОбъект.ДобавочныеКоды = Формат(Элемент.phoneCode, "ЧГ=");
		КонецЕсли;
		
		Попытка
			ЗаказОбъект.Записать();
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ПеревестиЗаказНаСборкуCnC(Профиль, Номер)
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	ИС_ВБ_АПИ.ПеревестиЗаказНаСборкуCnC(Профиль, ПараметрыЗапроса, Номер);
КонецПроцедуры //+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ПодтвердитьГотовностьКВыдачеЗаказовCnC(Профиль, Номер)
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	ИС_ВБ_АПИ.ПодтвердитьГотовностьКВыдачеЗаказовCnC(Профиль, ПараметрыЗапроса, Номер);
КонецПроцедуры //+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ПодтвердитьВыдачуЗаказаCnC(Профиль, Номер) Экспорт
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	ИС_ВБ_АПИ.ПодтвердитьВыдачуЗаказаCnC(Профиль, ПараметрыЗапроса, Номер);
КонецПроцедуры //+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ПодтвердитьОтказОтЗаказаCnC(Профиль, Номер) Экспорт
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	ИС_ВБ_АПИ.ПодтвердитьОтказОтЗаказаCnC(Профиль, ПараметрыЗапроса, Номер);
КонецПроцедуры //+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894
Процедура ОтменитьЗаказCnC(Профиль, Номер)
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	ИС_ВБ_АПИ.ОтменитьЗаказCnC(Профиль, ПараметрыЗапроса, Номер);
КонецПроцедуры //+ ИнфоСофт Ивонин К.А. 09.04.25 УА #96894

#КонецОбласти

#Область ЗаказыFBO

//+ ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
Процедура ЗагрузитьЗаказыFBO(Профиль, ДатаНачала, ТолькоЗаПереданнуюДату = Ложь) Экспорт

	Событие = ИмяСобытия("ЗагрузитьЗаказыFBO");
	    
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Статистика");
	
	КоличествоЭлементовНаЗапрос = ПараметрыЗапроса.КоличествоЭлементовНаЗапрос;
	КоличествоПопытокЗапроса = ПараметрыЗапроса.КоличествоПопытокЗапроса;	
		
	СтруктураПараметров = Новый Структура; 		
	СтруктураПараметров.Вставить("dateFrom", ИС_МП_РаботаСHTTPЗапросами.ЗаписатьДатуВJSON(ДатаНачала, 
		ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДата));	
	СтруктураПараметров.Вставить("flag", ?(ТолькоЗаПереданнуюДату, 1, 0));		
	
	Всего = 0;
	КоличествоОшибок = 0;
		
	МассивЗагруженныхЗаданий = Новый Массив;
	
	Пока Истина Цикл 
		
        Если КоличествоОшибок >= КоличествоПопытокЗапроса Тогда		
			Текст = "Превышено количество ошибок запросов к API";
			ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			Возврат;
		КонецЕсли;
				
		РезультатЗапроса = ИС_ВБ_АПИ.ПолучитьОтчетПоЗаказам(Профиль, ПараметрыЗапроса, СтруктураПараметров);
		
		Если РезультатЗапроса = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли;
	
		Если РезультатЗапроса.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;				
	
		Всего = Всего + РезультатЗапроса.Количество();
		
		Для Каждого Заказ Из РезультатЗапроса Цикл	
			
			СтруктураПараметров.dateFrom = Заказ.lastChangeDate;
			
			Если Заказ.warehouseType <> "Склад WB" Тогда
				Продолжить;
			КонецЕсли;
			
			Если ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(Заказ.date) < ДатаНачала Тогда
		    	Продолжить;
		    КонецЕсли;
		    
			СсылкаЗадания = СоздатьИлиОбновитьЗаказFBO(Профиль, Заказ);		
		
			Если СсылкаЗадания.Пустая() Тогда
				Продолжить;
			КонецЕсли;
			
			МассивЗагруженныхЗаданий.Добавить(СсылкаЗадания);
			
		КонецЦикла;
			
	КонецЦикла;
	
	Если МассивЗагруженныхЗаданий.Количество() > 0 Тогда
		ПроверитьФункциональныеОпцииЗаказов(Профиль, МассивЗагруженныхЗаданий);	
	КонецЕсли;
    
    Если Всего = 0 Тогда
		Текст = СтрШаблон("С %1 нет сборочных заданий для загрузки", ДатаНачала);
	Иначе
		Текст = СтрШаблон("Сборочные задания в количестве %1 успешно загружены", Всего);		
	КонецЕсли;	
	
	ОбщегоНазначения.СообщитьПользователю(Текст); 
			
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469

//+ ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
Функция СоздатьИлиОбновитьЗаказFBO(Профиль, Данные)
	
	Событие = ИмяСобытия("СоздатьИлиОбновитьЗаказFBO");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И ИС_WB_СборочноеЗадание.Номер = &Номер
	|	И ИС_WB_СборочноеЗадание.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ИС_ВБ_ТипыДоставки.FBO)";
	
	Запрос.УстановитьПараметр("Номер", Число(Данные.gNumber));
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказ = РезультатЗапроса.Выбрать();
	
	Если ВыборкаЗаказ.Следующий() Тогда
		Заказ = ВыборкаЗаказ.Ссылка.ПолучитьОбъект();
	Иначе
		Заказ = Документы.ИС_WB_СборочноеЗадание.СоздатьДокумент();
		Заказ.ДатаЗагрузки = ТекущаяДатаСеанса();	
	КонецЕсли; 

	ЗаполнитьЗначенияСвойств(Заказ, Данные);
	
	Заказ.Профиль = Профиль;
	Заказ.Номер = Число(Данные.gNumber); 
	Заказ.Дата = ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(Данные.date);
	Заказ.ТипДоставки = Перечисления.ИС_ВБ_ТипыДоставки.FBO;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_ВБ_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
	|ГДЕ
	|	ИС_ВБ_Склады.Профиль = &Профиль
	|	И ИС_ВБ_Склады.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ИС_ВБ_ТипыДоставки.FBO)";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	                             
	ВыборкаСкладВБ = РезультатЗапроса.Выбрать();
	
	Если ВыборкаСкладВБ.Следующий() Тогда
		Заказ.Склад = ВыборкаСкладВБ.Ссылка;
	КонецЕсли;                                 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_WB_ШтрихкодыРазмеров.Размер КАК РазмерWB,
	|	ИС_WB_ШтрихкодыРазмеров.Размер.Владелец КАК НоменклатураWB,
	|	ИС_WB_ШтрихкодыРазмеров.Размер.Владелец.ТипТовара КАК ТипТовара
	|ИЗ
	|	РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|ГДЕ
	|	ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль
	|	И ИС_WB_ШтрихкодыРазмеров.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Штрихкод", Данные.barcode);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТовара = РезультатЗапроса.Выбрать();
	
	Если ВыборкаТовара.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Заказ, ВыборкаТовара);		
	КонецЕсли;
	
	Заказ.rid = Данные.srid; 
			
	ВалютаУчета = ИС_МП_СерверЛокализация.ВалютаУправленческогоУчета(); 
	
	Заказ.price = Данные.finishedPrice;
	Заказ.convertedPrice = Данные.finishedPrice;
			
	Заказ.Валюта = Справочники.Валюты.НайтиПоКоду("643");	
	Заказ.ВалютаПродажи = Заказ.Валюта;	
	
	Если ЗначениеЗаполнено(Заказ.Валюта) И ВалютаУчета <> Заказ.Валюта Тогда
		Заказ.ЦенаВВалютеУчета = РаботаСКурсамиВалют.ПересчитатьВВалюту(Заказ.price, Заказ.ВалютаПродажи, ВалютаУчета, Заказ.Дата);	
		Текст = "Валюта управленческого учета отличается от валюты продавца. Сборочное задание: " + Заказ.Номер;
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);	
	Иначе
		Заказ.ЦенаВВалютеУчета = Данные.finishedPrice;	
	КонецЕсли;	
	
	Заказ.skus.Очистить();		
	
	НоваяСтрока = Заказ.skus.Добавить();
	НоваяСтрока.Штрихкод = Данные.barcode;	
	
	Результат = Документы.ИС_WB_СборочноеЗадание.ПустаяСсылка(); 
	
	Попытка	
		Заказ.Записать(РежимЗаписиДокумента.Запись);								
		Результат = Заказ.Ссылка;	
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);
	КонецПопытки;                                                       
	
	Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.receive;
	Если Данные.isCancel Тогда
		Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.cancel;
	КонецЕсли;
	
	ЗаписатьСтатусыИДатыЗаказа(Профиль, Заказ.Ссылка, Статус,
		Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ПустаяСсылка());
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469

//+ ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
Процедура ОбновитьСтатусыЗаказовFBO(Профиль, МассивЗаказов = Неопределено, 
		_15Дней = 1296000, ТолькоЗаПереданнуюДату = Ложь) Экспорт

	Событие = ИмяСобытия("ОбновитьСтатусыЗаказовFBO");       
	    
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Статистика");
	
	КоличествоЭлементовНаЗапрос = ПараметрыЗапроса.КоличествоЭлементовНаЗапрос;
	КоличествоПопытокЗапроса = ПараметрыЗапроса.КоличествоПопытокЗапроса;
	
	ДатаНачала = ТекущаяДатаСеанса() - _15Дней;
	
	Если ЗначениеЗаполнено(МассивЗаказов) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_WB_СборочноеЗадание.Дата КАК Дата
		|ИЗ
		|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
		|ГДЕ
		|	ИС_WB_СборочноеЗадание.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ИС_ВБ_ТипыДоставки.FBO)
		|	И ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		
		Запрос.УстановитьПараметр("МассивСсылок", МассивЗаказов);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДат = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДат.Следующий() Тогда
			ДатаНачала = ВыборкаДат.Дата;
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;	
	СтруктураПараметров.Вставить("dateFrom", ИС_МП_РаботаСHTTPЗапросами.ЗаписатьДатуВJSON(ДатаНачала, 
		ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДата));	
	СтруктураПараметров.Вставить("flag", ?(ТолькоЗаПереданнуюДату, 1, 0));		
	
	МассивНомеровЗаказов = Новый Массив;
	
	КоличествоОшибок = 0;
		
	Пока Истина Цикл 
		
        Если КоличествоОшибок = КоличествоПопытокЗапроса Тогда		
			Текст = "Превышено количество ошибок запросов к API";
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			Возврат;
		КонецЕсли;
				
		РезультатЗапроса = ИС_ВБ_АПИ.ПолучитьОтчетПоЗаказам(Профиль, ПараметрыЗапроса, СтруктураПараметров);
		
		Если РезультатЗапроса = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли;
	
		Если РезультатЗапроса.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;				
		
		Для Каждого Элемент Из РезультатЗапроса Цикл	
			
			СтруктураПараметров.dateFrom = Элемент.lastChangeDate;
			
			Если Элемент.warehouseType <> "Склад WB" Тогда
				Продолжить;
			КонецЕсли;  

			Если ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(Элемент.lastChangeDate) < ДатаНачала Тогда
		    	Продолжить;
		    КонецЕсли;
						
			Заказ = Документы.ИС_WB_СборочноеЗадание.НайтиПоНомеру(Число(Элемент.gNumber));	
				
			Если Заказ.Пустая() Тогда 
				Продолжить;
			КонецЕсли;
			
			Если Элемент.isCancel Тогда
				МассивНомеровЗаказов.Добавить(Число(Элемент.gNumber));
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЦикла;
	
	Если МассивНомеровЗаказов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус КАК Статус
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Профиль = &Профиль
	|				И ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Номер В(&МассивНомеров)
	|	И ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус = ЗНАЧЕНИЕ(Перечисление.ИС_WB_СтатусыСборочныхЗаданий.receive)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Профиль = &Профиль
	|				И ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Номер В(&МассивНомеров)
	|	И ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("МассивНомеров", МассивНомеровЗаказов);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказов = РезультатЗапроса.Выбрать();
	
	Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.cancel;
	
	Пока ВыборкаЗаказов.Следующий() Цикл
		ЗаписатьСтатусыИДатыЗаказа(Профиль, ВыборкаЗаказов.Ссылка, Статус,
			Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ПустаяСсылка());
	КонецЦикла;
			
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 03.02.25 УА #92406
Функция ИмяСобытия(Имя)
	Возврат "ИС.МП.ИС_ВБ_Сервер." + Имя;
КонецФункции //- ИнфоСофт Ивонин К.А. 03.02.25 УА #92406 

//+ ИнфоСофт Ивонин К.А. 05.02.25 УА #92406
Функция ЗначениеПеречисленияТипаДоставки(Значение)
	
	FBS = 1;
	DBS = 2;
	DBW = 3;
	// Не факт что так	
	CnC = 5;
	EDBS = 6;
	
	Если Значение = FBS Тогда
		Возврат Перечисления.ИС_ВБ_ТипыДоставки.FBS;
	КонецЕсли;
	
	Если Значение = DBS Тогда
		Возврат Перечисления.ИС_ВБ_ТипыДоставки.DBS;
	КонецЕсли;
	
	Если Значение = DBW Тогда
		Возврат Перечисления.ИС_ВБ_ТипыДоставки.DBW;
	КонецЕсли;
	
	Если Значение = EDBS Тогда
		Возврат Перечисления.ИС_ВБ_ТипыДоставки.EDBS;
	КонецЕсли;
	
	Если Значение = CnC Тогда
		Возврат Перечисления.ИС_ВБ_ТипыДоставки.CnC;
	КонецЕсли;
	
	Возврат Перечисления.ИС_ВБ_ТипыДоставки.ПустаяСсылка();
	
КонецФункции //- ИнфоСофт Ивонин К.А. 05.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 10.02.25 УА #92406
Процедура ЗаполнитьХарактеристикиКатегории(Поля, ТЧ, КешХарактеристикКатегорий, Перезаполнять)
		
	Для Каждого Элемент Из Поля Цикл
		
		Если Элемент.Свойство("name") Тогда
			ХарактеристикаКатегории = Справочники.ИС_WB_ХарактеристикиКатегорий.НайтиПоНаименованию(Элемент.name, Истина);
		Иначе
			Продолжить;
		КонецЕсли;
		
		НоваяХарактеристика = ТЧ.Добавить();
		
		Если ХарактеристикаКатегории.Пустая() Тогда		
			ХарактеристикаКатегории = Справочники.ИС_WB_ХарактеристикиКатегорий.СоздатьЭлемент();
			ХарактеристикаКатегории = ЗаполнитьСвойстваХарактеристики(ХарактеристикаКатегории, Элемент);						
		ИначеЕсли Перезаполнять Тогда
			
			Если КешХарактеристикКатегорий.Найти(ХарактеристикаКатегории) = Неопределено Тогда
				ХарактеристикаКатегории = ХарактеристикаКатегории.ПолучитьОбъект();
				ХарактеристикаКатегории = ЗаполнитьСвойстваХарактеристики(ХарактеристикаКатегории, Элемент);
				КешХарактеристикКатегорий.Добавить(НоваяХарактеристика);
			КонецЕсли;
				
		КонецЕсли;
		
		НоваяХарактеристика.Поле = ХарактеристикаКатегории;
		НоваяХарактеристика.Обязательное = ХарактеристикаКатегории.required;		
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 10.02.25 УА #92406
Функция ЗаполнитьСвойстваХарактеристики(Характеристика, ДанныеЗаполнения)
	
	Событие = ИмяСобытия("ЗаполнитьСвойстваХарактеристики");
		
	Характеристика.Наименование = ДанныеЗаполнения.name;
	ЗаполнитьЗначенияСвойств(Характеристика, ДанныеЗаполнения);
	
	Если ДанныеЗаполнения.name = "Цвет" Тогда
		Характеристика.dictionary = "colors";
	ИначеЕсли ДанныеЗаполнения.name = "Пол" Тогда
		Характеристика.dictionary = "kinds";	 
	ИначеЕсли ДанныеЗаполнения.name = "Страна производства" Тогда
		Характеристика.dictionary = "countries";	
	ИначеЕсли ДанныеЗаполнения.name = "Сезон" Тогда
		Характеристика.dictionary = "seasons";	
	ИначеЕсли ДанныеЗаполнения.name = "ТНВЭД" Тогда
		Характеристика.dictionary = "tnved";
	ИначеЕсли ДанныеЗаполнения.name = "Ставка НДС" Тогда
		Характеристика.dictionary = "vat";
	КонецЕсли;  
	
	Попытка		
		Характеристика.Записать();	
		Возврат Характеристика.Ссылка;		
	Исключение		
		Текст = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);				
	КонецПопытки;
	
	Возврат Справочники.ИС_WB_ХарактеристикиКатегорий.ПустаяСсылка();
	
КонецФункции //- ИнфоСофт Ивонин К.А. 10.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 10.02.25 УА #92406
Процедура НайтиИлиСоздатьХарактеристику(Профиль, ДанныеРазмера, Владелец)
	
	Событие = ИмяСобытия("НайтиИлиСоздатьХарактеристику");
	
	Размер = Справочники.ИС_WB_РазмерыНоменклатур.НайтиПоКоду(ДанныеРазмера["chrtID"]);
	
	Если Размер.Пустая() Тогда
		Размер = Справочники.ИС_WB_РазмерыНоменклатур.СоздатьЭлемент();		
	Иначе
		Размер = Размер.ПолучитьОбъект();					
	КонецЕсли;
	
	Размер.ПометкаУдаления = Ложь;
	Размер.Профиль = Профиль;
	Размер.Код = ДанныеРазмера["chrtID"];	
	Размер.Наименование = ДанныеРазмера["techSize"];
	
	Размер.techSize = ДанныеРазмера["techSize"];
	Размер.wbSize   = ДанныеРазмера["wbSize"];
	
	Размер.Владелец = Владелец;
			
	Если ДанныеРазмера["skus"].Количество() > 0 Тогда   
		Размер.Наименование = ДанныеРазмера["skus"][0];
	КонецЕсли;
			
	Попытка
		
		Размер.Записать();
		
		Если ДанныеРазмера["skus"].Количество() > 0 Тогда
			
			НаборЗаписей = РегистрыСведений.ИС_WB_ШтрихкодыРазмеров.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Профиль.Установить(Профиль);
			НаборЗаписей.Отбор.Размер.Установить(Размер.Ссылка);
			
			НаборЗаписей.Очистить(); 
			
			Для Каждого Элемент Из ДанныеРазмера["skus"] Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Профиль = Профиль;
				НоваяЗапись.Размер = Размер.Ссылка; 
				НоваяЗапись.Штрихкод = Элемент; 
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
		
	Исключение		
		Текст = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);		
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 18.03.25 УА #63915
Функция НайтиСкладПоКоду(Профиль, Код) 
	
	Реузльтат = Справочники.ИС_ВБ_Склады.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_ВБ_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
	|ГДЕ
	|	ИС_ВБ_Склады.Профиль = &Профиль
	|	И ИС_ВБ_Склады.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСкладов = РезультатЗапроса.Выбрать();
	
	Если ВыборкаСкладов.Следующий() Тогда
		Реузльтат = ВыборкаСкладов.Ссылка;
	КонецЕсли;
	
	Возврат Реузльтат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 18.03.25 УА #63915

//+ ИнфоСофт Ивонин К.А. 04.04.25 УА #96894
Функция СоздатьИлиОбновитьСборочноеЗадание(Профиль, Данные, ТипДоставки)

    Событие = ИмяСобытия("СоздатьИлиОбновитьСборочноеЗадание");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И ИС_WB_СборочноеЗадание.Номер = &Номер
	|	И ИС_WB_СборочноеЗадание.ТипДоставки В(&ТипДоставки)";
	
	Запрос.УстановитьПараметр("Номер", Данные.id);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("ТипДоставки", ТипДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказов = РезультатЗапроса.Выбрать();
	
	Если ВыборкаЗаказов.Следующий() Тогда
		СборочноеЗадание = ВыборкаЗаказов.Ссылка.ПолучитьОбъект();
	Иначе	
		СборочноеЗадание = Документы.ИС_WB_СборочноеЗадание.СоздатьДокумент();
		СборочноеЗадание.ДатаЗагрузки = ТекущаяДатаСеанса();	
	КонецЕсли;
			
	ЗаполнитьЗначенияСвойств(СборочноеЗадание, Данные);
	
	Если Данные.Свойство("address") И ТипЗнч(Данные.address) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(СборочноеЗадание, Данные.address);	
	КонецЕсли;
	
	Если Данные.Свойство("deliveryType") Тогда
		СборочноеЗадание.ТипДоставки = ОпределитьТипДоставкиСборочногоЗадания(Данные.deliveryType);
	Иначе
		СборочноеЗадание.ТипДоставки = ТипДоставки;
	КонецЕсли; 
	
	Если Данные.Свойство("cargoType") Тогда
		СборочноеЗадание.ТипТовара = ЗначениеПеречисленияТипаТовара(Данные.cargoType);
	КонецЕсли;
	
	СборочноеЗадание.Профиль = Профиль;
	СборочноеЗадание.Номер = Данные.id;
	СборочноеЗадание.Дата = ИС_МП_РаботаСHTTPЗапросами.ПрочитатьДатуИзJSON(Данные.createdAt);			
	СборочноеЗадание.Склад = НайтиСкладПоКоду(Профиль, Данные.warehouseId);
	СборочноеЗадание.НоменклатураWB = Справочники.ИС_WB_Номенклатура.НайтиПоКоду(Данные.nmId);
	СборочноеЗадание.РазмерWB = Справочники.ИС_WB_РазмерыНоменклатур.НайтиПоКоду(Данные.chrtId);
		
	КоличествоКопеекВРубле = 100;	
	
	ВалютаУчета = ИС_МП_СерверЛокализация.ВалютаУправленческогоУчета(); 
	
	СборочноеЗадание.price = СборочноеЗадание.price / КоличествоКопеекВРубле;
	СборочноеЗадание.convertedPrice = СборочноеЗадание.convertedPrice / КоличествоКопеекВРубле;
	
	КодВалюты = Формат(Данные.CurrencyCode, "ЧЦ=3; ЧВН=");
	СборочноеЗадание.ВалютаПродажи = Справочники.Валюты.НайтиПоКоду(КодВалюты);

	Если Данные.Свойство("ConvertedCurrencyCode") Тогда
		КодВалюты = Формат(Данные.ConvertedCurrencyCode, "ЧЦ=3; ЧВН=");	
	КонецЕсли;
	
	СборочноеЗадание.Валюта = Справочники.Валюты.НайтиПоКоду(КодВалюты);
	
	Если ВалютаУчета <> СборочноеЗадание.ВалютаПродажи Тогда	
		Если Не ЗначениеЗаполнено(СборочноеЗадание.ВалютаПродажи) Тогда
			Текст = СтрШаблон("Требуется обновить классификатор валют. Валюта продажи с кодом не найдена %1. Сборочное задание номер: %2", Данные.CurrencyCode, СборочноеЗадание.Номер);
			ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);	
			СборочноеЗадание.ЦенаВВалютеУчета = СборочноеЗадание.convertedPrice;
		ИначеЕсли ВалютаУчета <> СборочноеЗадание.Валюта Тогда
			СборочноеЗадание.ЦенаВВалютеУчета = РаботаСКурсамиВалют.ПересчитатьВВалюту(СборочноеЗадание.price, СборочноеЗадание.ВалютаПродажи, СборочноеЗадание.Валюта, СборочноеЗадание.Дата);	
			Текст = СтрШаблон("Валюта управленческого учета отличается от валюты продавца. Сборочное задание: %1", СборочноеЗадание.Номер);
			ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		Иначе
			СборочноеЗадание.ЦенаВВалютеУчета = РаботаСКурсамиВалют.ПересчитатьВВалюту(СборочноеЗадание.price, СборочноеЗадание.ВалютаПродажи, ВалютаУчета, СборочноеЗадание.Дата); 	
		КонецЕсли;		
	Иначе
		СборочноеЗадание.ЦенаВВалютеУчета = СборочноеЗадание.price;	
	КонецЕсли;	
		
	СборочноеЗадание.skus.Очистить();
	
	Если Данные.skus <> Неопределено Тогда
		
		Для Каждого Элемент Из Данные.skus Цикл	
			НоваяСтрока = СборочноеЗадание.skus.Добавить();
			НоваяСтрока.Штрихкод = Элемент;	
		КонецЦикла;
	
	КонецЕсли;
	
	СборочноеЗадание.offices.Очистить();
	
	Если Данные.Свойство("offices") И Данные.offices <> Неопределено Тогда
		
		Для Каждого Элемент Из Данные.offices Цикл	
			НоваяСтрока = СборочноеЗадание.offices.Добавить();
			НоваяСтрока.Имя = Элемент;	
		КонецЦикла;
	
	КонецЕсли;
	
	Попытка	
		
		СборочноеЗадание.Записать(РежимЗаписиДокумента.Запись);
		
		Если Данные.Свойство("supplyId") И ЗначениеЗаполнено(Данные.supplyId) Тогда
	         
			Поставка = НайтиИлиСоздатьПоставку(Профиль, Данные.supplyId);
			Если Не Поставка.Пустая() Тогда
				ЗаписатьПоставкуСборочногоЗадания(Профиль, СборочноеЗадание.Ссылка, Поставка);
			КонецЕсли; 
				
		КонецЕсли;
			
		Возврат СборочноеЗадание.Ссылка;		
	
	Исключение
		Текст = "Произошла ошибка при записи документа Сборочное задание WildBerries: " 
			+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	КонецПопытки;
	
	Возврат Документы.ИС_WB_СборочноеЗадание.ПустаяСсылка();

КонецФункции //- ИнфоСофт Ивонин К.А. 04.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 04.04.25 УА #96894
Функция ЗначениеПеречисленияСтатусаЗаказа(Статус)
    
    Событие = ИмяСобытия("ЗначениеПеречисленияСтатусаЗаказа");
    
    Результат = ИС_МП_Сервер.ЗначениеПеречисленияПоЗначению(Перечисления.ИС_WB_СтатусыСборочныхЗаданий, Статус);
    
    Если Результат.Пустая() Тогда
    	Текст = "Получен неизвестный статус заказа: " + Статус;
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
    КонецЕсли;	
	
	Возврат Результат;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 04.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 04.04.25 УА #96894
Функция ЗначениеПеречисленияСтатусВСистемеWildBerries(Статус)
    
    Событие = ИмяСобытия("ЗначениеПеречисленияСтатусВСистемеWildBerries");
    
    Результат = ИС_МП_Сервер.ЗначениеПеречисленияПоЗначению(
		Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries, Статус);
    
    Если Результат.Пустая() Тогда
    	Текст = "Получен неизвестный статус WB сборочного задания: " + Статус;
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
    КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 04.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 04.04.25 УА #96894
Процедура ЗаписатьСтатусыИДатыЗаказа(Профиль, Заказ, Статус, СтатусWB, ДатаС = '00010101', ДатаПо = '00010101')
    
    Событие = ИмяСобытия("ЗаписатьСтатусыЗаказа");
    
	МенеджерЗаписи = РегистрыСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.СборочноеЗадание = Заказ;
	
	МенеджерЗаписи.Прочитать();
	
	Замещать = МенеджерЗаписи.Выбран();
	
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.СборочноеЗадание = Заказ;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.СтатусWB = СтатусWB;
	МенеджерЗаписи.ДатаДоставкиС = ДатаС;
	МенеджерЗаписи.ДатаДоставкиПо = ДатаПо;
	
	Попытка
		МенеджерЗаписи.Записать(Замещать);	
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	КонецПопытки;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 04.04.25 УА #96894
Процедура ПроверитьФункциональныеОпцииЗаказов(Профиль, МассивЗаданий)

	ОбновитьСтатусыЗаказов(Профиль, МассивЗаданий);
	
	ФукнциональныеОпции = ИС_WB_СерверПовтИсп.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ФукнциональныеОпции.АвтоматическиСоздаватьЗаказы Тогда	
		ИС_WB_Сервер.СоздатьЗаказы(Профиль, МассивЗаданий);		
	КонецЕсли;
	
	Если ФукнциональныеОпции.АвтоматическиСоздаватьРеализации 
			И ФукнциональныеОпции.РежимСозданияЗаказов <> 2 Тогда	
		ИС_WB_Сервер.СоздатьРеализации(Профиль, МассивЗаданий);		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 07.04.25 УА #96894
Функция ПреобразоватьВДатуИзЧастей(Дата, Время)
	
	ЭлементыДаты = СтрРазделить(Дата, "-", Ложь);

	Если ЭлементыДаты.Количество() <> 3 Тогда
		Возврат Неопределено;	
	КонецЕсли;

	ЧастиВремени = СтрРазделить(Время, ":", Ложь);

	Если ЧастиВремени.Количество() <> 2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Дата(ЭлементыДаты[0], ЭлементыДаты[1], ЭлементыДаты[2], ЧастиВремени[0], ЧастиВремени[1], 0);
	
КонецФункции //- ИнфоСофт Ивонин К.А. 07.04.25 УА #96894

//+ ИнфоСофт Ивонин К.А. 27.03.25 УА #63915
Функция НайтиТоварПоШтрихкоду(Профиль, Штрихкод)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ИС_WB_СоответствиеРазмеров.Упаковка КАК Упаковка,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура//#ЭтоНабор КАК ЭтоНабор
	|ИЗ
	|	РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
	|			И ИС_WB_ШтрихкодыРазмеров.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
	|ГДЕ
	|	ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль
	|	И ИС_WB_ШтрихкодыРазмеров.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//#ЭтоНабор", ИС_МП_СерверЛокализация.ПризнакНабораВЗапросе());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат РезультатЗапроса.Выгрузить();

КонецФункции //- ИнфоСофт Ивонин К.А. 27.03.25 УА #63915

//+ ИнфоСофт Ивонин К.А. 31.03.25 УА #63915
Процедура СопоставитьТовары(Профиль, МассивТоваров, СопоставлятьПо)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_РазмерыНоменклатур.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
	|			И ИС_WB_РазмерыНоменклатур.Ссылка = ИС_WB_СоответствиеРазмеров.РазмерWB
	|ГДЕ
	|	ИС_WB_РазмерыНоменклатур.Владелец В(&Владелец)
	|	И ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Владелец", МассивТоваров);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;	
	КонецЕсли;
	
	ВыборкаРазмеров = РезультатЗапроса.Выбрать();
	
	МассивРазмеров = Новый Массив;
	
	Пока ВыборкаРазмеров.Следующий() Цикл
		МассивРазмеров.Добавить(ВыборкаРазмеров.Ссылка);
	КонецЦикла;
	
	Параметры = Новый Структура("СопоставлятьПо", СопоставлятьПо);
	
	РезультатПодбора = ПодобратьТовары(Профиль, МассивРазмеров, Параметры);
	
	Если РезультатПодбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатПодбора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из РезультатПодбора Цикл
		ДобавитьСопоставлениеТоваров(Профиль, Строка.ПолеСопоставления, Строка.Номенклатура,
			Строка.Характеристика, Строка.Упаковка);	
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.03.25 УА #63915

#КонецОбласти
