//+ ИнфоСофт Сумин Д.В. 08.08.2023 УА #60602
&НаКлиенте
Процедура ПутьКФайлуОтчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	ОчиститьСообщения(); 
	  
	РасширениеФайлаОтчетаZip = Ложь;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл отчета комиссионера";
	ДиалогВыбораФайла.МножественныйВыбор =  Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.Фильтр = "Архив ZIP (*.zip)|*.zip|Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Реквизит", "ПутьКФайлуОтчета");
	ДополнительныеПараметры.Вставить("Адрес", "АдресОтчетаВоВременномХранилище");  
	ДополнительныеПараметры.Вставить("ЭтоZip", "РасширениеФайлаОтчетаZip");
	ДополнительныеПараметры.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры));
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 08.08.2023 УА #60602

//+ ИнфоСофт Сумин Д.В. 08.08.2023 УА #60602
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеФайлы = ДиалогВыбораФайла.ВыбранныеФайлы;
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЭтотОбъект[ДополнительныеПараметры.Реквизит] = ВыбранныеФайлы[0];
		
		ВыбранныйФайл = Новый Файл(ВыбранныеФайлы[0]);
		Расширение = ВыбранныйФайл.Расширение;
		
		Если Расширение = ".zip" Тогда
			ЭтотОбъект[ДополнительныеПараметры.ЭтоZip] = Истина;			
		КонецЕсли;
		ПутьКФайлуВоВременномКаталоге = ВыбранныеФайлы[0];
		ПоместитьФайлНаСервер(ДополнительныеПараметры.Адрес);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 08.08.2023 УА #60602 

//+ ИнфоСофт Сумин Д.В. 08.08.2023 УА #60602
&НаКлиенте
Процедура ПоместитьФайлНаСервер(Адрес)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоместитьФайлНаСерверЗавершение", ЭтотОбъект, Новый Структура("Адрес", Адрес));
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , , , ПутьКФайлуВоВременномКаталоге, УникальныйИдентификатор);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 08.08.2023 УА #60602

&НаКлиенте
Процедура ПутьКФайлуОтчетаПриИзменении(Элемент)
	Если ПутьКФайлуОтчета = "" Тогда
		АдресОтчетаВоВременномХранилище = "";
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьКизИзФайла(Команда)
	ПолучитьКизИзФайлаНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПолучитьКизИзФайлаНаСервере()   
	
	Если РасширениеФайлаОтчетаZip Тогда  
		
		ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище); 
		Имя = ПолучитьИмяВременногоФайла("zip");
		ФайлВременногоХранилища.Записать(Имя);
		
		ВызватьОшибку = Истина;
		ТабличныйДокумент = ПрочитатьТабДокИзZIP(Имя, ВызватьОшибку);
		
		Если ВызватьОшибку Тогда
			ОбщегоНазначения.СообщитьПользователю("Был выбран некорректный файл для загрузки отчета комиссионера WildBerries, проверьте выбранный файл",,, "ПутьКФайлу");
		КонецЕсли;
		
	Иначе
		
		ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
		Имя = ПолучитьИмяВременногоФайла("xlsx");
		ФайлВременногоХранилища.Записать(Имя);
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Прочитать(Имя);		
		
	КонецЕсли;
	
	ТабличныйДокумент.Область().Разъединить();
	
	МассивКиз = Новый Массив;
	
	Для НомерСтроки = 13 По ТабличныйДокумент.ВысотаТаблицы Цикл
		Если ТабличныйДокумент.Область("R" + НомерСтроки + "C7").Текст = "Итого" Тогда
			Прервать;	
		КонецЕсли; 
		МассивКиз.Добавить(СокрЛП(ТабличныйДокумент.Область("R" + НомерСтроки + "C7").Текст));
	КонецЦикла;	
	
	ВывестиКИЗ(МассивКиз);
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьТабДокИзZIP(ИмяФайла, Отказ)
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ЧтениеZip = Новый ЧтениеZipФайла(ИмяФайла, "");
	
	Отказ = Истина;
	
	Для Каждого Элемент Из ЧтениеZip.Элементы Цикл
		
		Если Элемент.Расширение = "xlsx" Тогда
			Отказ = Ложь;
			ПутьКФайлуВоВременномКаталоге = КаталогВременныхФайлов();
			ЧтениеZip.Извлечь(Элемент, ПутьКФайлуВоВременномКаталоге, , "");					
			ПутьКФайлуВоВременномКаталоге = ПутьКФайлуВоВременномКаталоге + Элемент.Имя; 
			ТабличныйДокумент.Прочитать(ПутьКФайлуВоВременномКаталоге);
		КонецЕсли;
		
	КонецЦикла; 
	
	ЧтениеZip.Закрыть();
	
	Возврат ТабличныйДокумент;
	
КонецФункции  

&НаКлиенте
Процедура ПоместитьФайлНаСерверЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.ПомещениеФайлаОтменено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось поместить файл на сервер, попробуйте ещё раз...", , , "ПутьКФайлу");
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[Параметры.Адрес] = Результат.Адрес;          
	
КонецПроцедуры 

&НаСервере
Процедура ВывестиКИЗ(МассивКиз)   
	
	Для Каждого Элемент Из МассивКиз Цикл
		СтрокаТЗ = ДанныеФайла.Добавить();
		СтрокаТЗ.КИЗ = Элемент;
	КонецЦикла;	
	
КонецПроцедуры	

