
#Область ОбработчикиСобытий

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	
	Поставка = ПараметрКоманды;
	
	Если Не ЗначениеЗаполнено(Поставка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбрана Поставка", , , "СписокПоставок");
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх(НСтр("ru = 'Уверены что хотите закрыть поставку?'"), Режим);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
    Результат = ЗакрытьПоставкуНаСервере(Поставка);
	
	Если Не Результат Тогда
		Возврат;	
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Поставка успешно закрыта");
	ОповеститьОбИзменении(Тип("СправочникСсылка.ИС_ВБ_ПоставкиFBS"));
		
	МассивСборочныхЗаданийБезРеализаций = МассивСборочныхЗаданийБезРеализаций(Поставка);
	
	Если МассивСборочныхЗаданийБезРеализаций.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
		
	Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх(НСтр("ru = 'В поставке есть сборочные задания, по которым не созданы реализации, хотите создать?'"), Режим);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
    СозданиеРеализацийПослеПоставки(Поставка, МассивСборочныхЗаданийБезРеализаций);
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Реализации успешно созданы");
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

#КонецОбласти
                               
#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаСервере   
Функция ЗакрытьПоставкуНаСервере(Поставка)
	Профиль = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поставка, "Профиль");
	Возврат ИС_ВБ_Сервер.ПередатьПоставкуВДоставку(Профиль, Поставка);
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 18.02.25 УА #92887
&НаСервере   
Функция МассивСборочныхЗаданийБезРеализаций(Поставка)
	Возврат ИС_WB_Сервер.НесозданныеРеализации(Поставка);
КонецФункции //- ИнфоСофт Ивонин К.А. 18.02.25 УА #92887

//+ ИнфоСофт Заварин К.В. 23.05.24 УА #70964
&НаСервере   
Процедура СозданиеРеализацийПослеПоставки(Поставка,МассивСЗ)
	ИС_WB_Сервер.СоздатьРеализации(Поставка.Профиль, МассивСЗ);
КонецПроцедуры //- ИнфоСофт Заварин К.В. 23.05.24 УА #70964

#КонецОбласти 
