
#Область ОбработчикиСобытий

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	
	Поставка = ПараметрКоманды;
	
	Если Не ЗначениеЗаполнено(Поставка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбрана Поставка", , , "СписокПоставок");
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх(НСтр("ru = 'Уверены что хотите удалить поставку?'"), Режим);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	Результат = УдалитьПоставкуНаСервере(Поставка);
	
	Если Результат Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поставка успешно удалена");
		ОповеститьОбИзменении(Тип("СправочникСсылка.ИС_ВБ_ПоставкиFBS"));
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

#КонецОбласти
                               
#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 13.02.23 УА #53535
&НаСервере   
Функция УдалитьПоставкуНаСервере(Поставка)
	Профиль = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поставка, "Профиль");
	Возврат ИС_ВБ_Сервер.УдалитьПоставку(Профиль, Поставка);	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.23 УА #53535

#КонецОбласти 
