
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506
Функция ПолучитьПрименениеНДСОрганизации(Организация) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НастройкиУчетаНДС.ПрименяетсяОсвобождениеОтУплатыНДС
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НастройкиУчетаНДС.ПлательщикНДС
	|	КОНЕЦ КАК ПлательщикНДС
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(, ) КАК НастройкиУчетаНДС
	|ГДЕ
	|	НастройкиУчетаНДС.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.ПлательщикНДС;
		
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506

//+ ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506
Процедура ЗаполнитьСтавкуНДСПоОрганизацииНалогообложениеНДС(ОтчетКомиссионера, УчетНДСКэшированныеЗначенияПараметров = Неопределено) Экспорт
		                 
	ПараметрыЗаполнения = Документы.ОтчетКомиссионера.ПараметрыЗаполненияНалогообложенияНДСПродажи(ОтчетКомиссионера);
	УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(ОтчетКомиссионера.НалогообложениеНДС, ПараметрыЗаполнения, УчетНДСКэшированныеЗначенияПараметров);
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506

//+ ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506
Функция РассчитатьСтавкуНДС(Организация, Дата, НалогообложениеНДС, Номенклатура, ВидСтавкиНДСПоУмолчанию = Неопределено) Экспорт
	
	Версия = ИС_МП_Сервер.ВерсияБезРедакции();
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.20.46") >= 0 Тогда
		
		СтавкаНДС = УчетНДСУП.СтавкаНДСПоУмолчанию(Организация);
		
		СтавкаНДСНоменклатуры = УчетНДСУП.СтавкаНДСПоНоменклатуреИНалогообложению(Номенклатура, НалогообложениеНДС, Организация, Дата, Неопределено);
		
		Если СтавкаНДС = СтавкаНДСНоменклатуры Тогда
			Возврат СтавкаНДС;
		Иначе
			Возврат СтавкаНДСНоменклатуры;
		КонецЕсли; 
		
	ИначеЕсли ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.8.207") >= 0 Тогда
		
		СтавкаНДС = УчетНДСУП.СтавкаНДСПоУмолчанию(Организация);
		
		СтавкаНДСНоменклатуры = УчетНДСУП.СтавкаНДСПоНоменклатуреИНалогообложению(Номенклатура, НалогообложениеНДС, Организация, Дата);
		
		Если СтавкаНДС = СтавкаНДСНоменклатуры Тогда
			Возврат СтавкаНДС;
		Иначе
			Возврат СтавкаНДСНоменклатуры;
		КонецЕсли; 
		
	Иначе  
		
		СтавкаНДС = УчетНДСУП.СтавкаНДСПоУмолчанию();
		
		СтавкаНДСНоменклатуры = Номенклатура.СтавкаНДС; 
		
		УчетНДСУП.СкорректироватьСтавкуНДС(СтавкаНДСНоменклатуры, Дата);
		
		Если СтавкаНДС = СтавкаНДСНоменклатуры Тогда
			Возврат СтавкаНДС;
		Иначе
			Возврат СтавкаНДСНоменклатуры;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтавкаНДС;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506

//+ ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506
Функция РассчитатьСуммуНДС(Сумма, СтавкаНДС, СуммаВключаетНДС = Истина) Экспорт
	
	Если СуммаВключаетНДС И СтавкаНДС > 0 Тогда
		СуммаНДС = Окр(Сумма - 100 * Сумма / (100 + СтавкаНДС), 2, РежимОкругления.Окр15как20);
	Иначе
		СуммаНДС = Окр(Сумма * СтавкаНДС / 100, 2, РежимОкругления.Окр15как20);
	КонецЕсли;
	
	Возврат СуммаНДС;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 21.02.25 УА #92506

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
