
#Область ОписаниеПеременных

//+ ИнфоСофт Ивонин К.А. 29.03.24 УА #71892
&НаКлиенте
Перем ПоследняяСтраница; //- ИнфоСофт Ивонин К.А. 29.03.24 УА #71892

#КонецОбласти

#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
	ИС_МП_Сервер.ПриСозданииНаСервере(ЭтотОбъект);	
	Маркетплейс = "ВБ";	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 21.03.24 УА #71892
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОпределитьИнтегрируемыеМаркетплейсы();
		
	Если ЗначениеЗаполнено(Профиль) И ЗначениеЗаполнено(ЭтотОбъект[Маркетплейс + "Склад"]) Тогда
		ОбновитьСписокНаСервере();
		Элементы["ДекорацияНадписьСклад" + Маркетплейс].Заголовок = 
			СформироватьИнформациюОСкладе(Маркетплейс, ЭтотОбъект[Маркетплейс + "Склад"]);	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	
	ИС_МП_Клиент.ПриОткрытии(ЭтотОбъект, Отказ);
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["Страница" + Маркетплейс];
	ПоследняяСтраница = Элементы["Страница" + Маркетплейс];		
	УправлениеФормой();
	ЗаполнитьШапку();
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОчиститьСообщения();
		
	Элементы.ВыгрузитьОстатки.Доступность = Ложь;
	
	Маркетплейс = СтрЗаменить(ТекущаяСтраница.Имя, "Страница", "");
	ПоследняяСтраница = Элементы["Страница" + Маркетплейс];

	УстановитьВидимостьПолученияОстатков();
	ЗаполнитьШапку();
	
	Если ЗначениеЗаполнено(Профиль) И ЗначениеЗаполнено(ЭтотОбъект[Маркетплейс + "Склад"]) Тогда
		
		Если ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Количество() = 0 Тогда
			ОбновитьСписокНаСервере();
		КонецЕсли;
			
		ЗаполнитьИнформациюОСкладе();
			
		Если ЭтотОбъект[Маркетплейс + "ОтображатьТекущиеОстатки"] 
				И ЭтотОбъект[Маркетплейс + "ПолучатьТекущиеОстаткиАвтоматически"] Тогда
    	
    		НачатьПолучениеТекущихОстатков();
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Количество() > 0 Тогда
		Элементы.ВыгрузитьОстатки.Доступность = Истина;
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	
	ОпределитьИнтегрируемыеМаркетплейсы();
	ГруппаСтраницыПриСменеСтраницы(Элементы.ГруппаСтраницы, Элементы.ГруппаСтраницы.ТекущаяСтраница);
	
	Если ЗначениеЗаполнено(Профиль) Тогда
	
		ЭтотОбъект[Маркетплейс + "Склад"] = ПолучитьСкладПоУмолчанию(Маркетплейс, Профиль);
		ЗаполнитьШапку();
	
		Если ЗначениеЗаполнено(ЭтотОбъект[Маркетплейс + "Склад"]) Тогда
			ОбновитьСписокНаСервере();
			ЗаполнитьИнформациюОСкладе();
			Возврат;	
		КонецЕсли;
					
	КонецЕсли;
	
	ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Очистить();
	Элементы.ВыгрузитьОстатки.Доступность = Ложь;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	Если ЗначениеЗаполнено(ЭтотОбъект[Маркетплейс + "Склад"]) Тогда
		ОбновитьСписокНаСервере();
		ЗаполнитьИнформациюОСкладе();
	Иначе
		ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Очистить();
		Элементы.ВыгрузитьОстатки.Доступность = Ложь;
		Элементы["ДекорацияНадписьСклад" + Маркетплейс].Заголовок = "";	
	КонецЕсли;	                                                
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
&НаКлиенте
Процедура ОтображатьТекущиеОстаткиПриИзменении(Элемент)
    УстановитьВидимостьПолученияОстатков();	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 26.03.24 УА #71892
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда

		Отказ = Истина;

		Если ЗавершениеРаботы Тогда
			ТекстПредупреждения = НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'");
			Возврат;
		КонецЕсли;		
		
		Оповещение = Новый ОписаниеОповещения("НесохраненныеИзмененияЗавершение", 
			ЭтотОбъект, Новый Структура("Закрытие", Истина));
		
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
			НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'"), 
			РежимДиалогаВопрос.ДаНет);
	
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.03.24 УА #71892

//+ ИнфоСофт Власова И.С. 19.01.24 УА #66871
&НаКлиенте
Процедура ПутьКФайлуРучныхОстатковНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОчиститьСообщения(); 
	  
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл ручных остатков";
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.Фильтр = "Excel файлы(*.xlsx)|*.xlsx";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПутьКФайлуРучныхОстатковНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры); 
	
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 19.01.24 УА #66871

//+ ИнфоСофт Ивонин К.А. 31.03.24 УА #71892
&НаКлиенте
Процедура ПутьКФайлуРучныхОстатковОчистка(Элемент, СтандартнаяОбработка)
	АдресРучныхОстатковВоВременномХранилище = "";
	Элементы.ЗагрузитьРучныеОстатки.Доступность = Ложь;
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 31.03.24 УА #71892
&НаКлиенте
Процедура ПутьКФайлуРучныхОстатковПриИзменении(Элемент)
	
	ОчиститьСообщения();
		
	Если Не ЗначениеЗаполнено(ПутьКФайлуРучныхОстатков) Тогда
		АдресРучныхОстатковВоВременномХранилище = "";
		Элементы.ЗагрузитьРучныеОстатки.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(
		"Путь к файлу был изменен, чтобы выбрать другой файл воспользуйтесь кнопкой выбора");
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 27.05.24 УА #75485
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Для Каждого Строка Из ТаблицаФоновыхЗаданий Цикл
		ОтменитьФоновыеЗаданияНаСервере(Строка.ИдентификаторЗадания);	
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.05.24 УА #75485

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыВыгрузки

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
&НаКлиенте
Процедура ТаблицаВыгрузкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.ТолькоПросмотр Тогда
		ПоказатьЗначение( , Элемент.ТекущиеДанные[СтрЗаменить(Поле.Имя, Маркетплейс + "ТаблицаВыгрузки", "")]);
	КонецЕсли;	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
&НаКлиенте
Процедура ТаблицаВыгрузкиРучнойОстатокПриИзменении(Элемент)
	
	ТекДанные = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.РучнойОстатокИзменен = Истина;
	Модифицированность = Истина;
	Элементы.СохранитьИзменения.Видимость = Истина;
	
	ЗаголовокСтраницы = ИС_МП_Клиент.ПредставлениеМаркетплейса(Маркетплейс);
	Элементы["Страница" + Маркетплейс].Заголовок = ЗаголовокСтраницы + " *";
	
	ПересчитатьБудетВыгружено(ТекДанные);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
&НаКлиенте
Процедура ТаблицаВыгрузкиСкрываемыйОстатокПриИзменении(Элемент)

	ТекДанные = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.СкрываемыйОстатокИзменен = Истина;
	Модифицированность = Истина;
	Элементы.СохранитьИзменения.Видимость = Истина;
	ЗаголовокСтраницы = ИС_МП_Клиент.ПредставлениеМаркетплейса(Маркетплейс);
	Элементы["Страница" + Маркетплейс].Заголовок = ЗаголовокСтраницы + " *";
	
	ПересчитатьБудетВыгружено(ТекДанные);    	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
&НаКлиенте
Процедура ОтменитьВводРучногоОстатка(Команда)

	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ОбрабатываемаяСтрока = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка);
		ОбрабатываемаяСтрока.РучнойОстатокИзменен = Ложь;
		ОбрабатываемаяСтрока.РучнойОстаток = ОбрабатываемаяСтрока.КэшРучнойОстаток;
		ПересчитатьБудетВыгружено(ОбрабатываемаяСтрока);
	КонецЦикла;	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
&НаКлиенте
Процедура ОтменитьВводСкрываемогоОстатка(Команда)
	
	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ОбрабатываемаяСтрока = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка);
		ОбрабатываемаяСтрока.СкрываемыйОстатокИзменен = Ложь;
		ОбрабатываемаяСтрока.СкрываемыйОстаток = ОбрабатываемаяСтрока.КэшСкрываемыйОстаток;
		ПересчитатьБудетВыгружено(ОбрабатываемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
&НаКлиенте
Процедура ТаблицаВыгрузкиРучнойОстатокОчистка(Элемент, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    
	ТекДанные = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.РучнойОстатокИзменен = Ложь;
	ТекДанные.РучнойОстаток = ТекДанные.КэшРучнойОстаток;
	ПересчитатьБудетВыгружено(ТекДанные);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
&НаКлиенте
Процедура ТаблицаВыгрузкиСкрываемыйОстатокОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.СкрываемыйОстатокИзменен = Ложь;
	ТекДанные.СкрываемыйОстаток = ТекДанные.КэшСкрываемыйОстаток;
	ПересчитатьБудетВыгружено(ТекДанные);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
&НаКлиенте
Процедура УдалитьРучнойОстаток(Команда)
	
	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПолеСопоставление = ИС_МП_Клиент.ПолеСопоставленияОстатков(Маркетплейс);
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл

		ОбрабатываемаяСтрока = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка);
		УдалитьРучнойОстатокНаСервере(Профиль, Маркетплейс, 
			ЭтотОбъект[Маркетплейс + "Склад"], ОбрабатываемаяСтрока[ПолеСопоставление]);
		ОбрабатываемаяСтрока.ЕстьРучнойОстаток = Ложь;
		ОбрабатываемаяСтрока.РучнойОстатокИзменен = Ложь;
		ОбрабатываемаяСтрока.РучнойОстаток = 0;
		ПересчитатьБудетВыгружено(ОбрабатываемаяСтрока);

	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
&НаКлиенте
Процедура УдалитьСкрываемыйОстаток(Команда)
	
	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПолеСопоставление = ИС_МП_Клиент.ПолеСопоставленияОстатков(Маркетплейс);
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
	
		ОбрабатываемаяСтрока = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка);
		УдалитьСкрываемыйОстатокНаСервере(Профиль, Маркетплейс, 
			ЭтотОбъект[Маркетплейс + "Склад"], ОбрабатываемаяСтрока[ПолеСопоставление]);
		ОбрабатываемаяСтрока.СкрываемыйОстатокИзменен = Ложь;
		ОбрабатываемаяСтрока.ЕстьСкрываемыйОстаток = Ложь;
		ОбрабатываемаяСтрока.СкрываемыйОстаток = ЭтотОбъект[Маркетплейс + "СкрываемыйОстаток"];
        ПересчитатьБудетВыгружено(ОбрабатываемаяСтрока);
        
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект[Маркетплейс + "Склад"]) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Склад""", , , Маркетплейс + "Склад");
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Оповещение = Новый ОписаниеОповещения("НесохраненныеИзмененияЗавершение", ЭтотОбъект);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
			НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'"), 
			РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ОбновитьСписокНаСервере();
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
&НаКлиенте
Процедура ПолучитьТекущиеОстатки(Команда)

	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект[Маркетплейс + "Склад"]) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Склад""", , , Маркетплейс + "Склад");
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
    НачатьПолучениеТекущихОстатков();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	ИнтегрируемыеМаркетплейсы = ИС_МП_Клиент.ИнтегрируемыеМаркетплейсы();
	
	СохранитьИзмененияНаСервере(ИнтегрируемыеМаркетплейсы);

	Для Каждого МП Из ИнтегрируемыеМаркетплейсы Цикл
		ЗаголовокСтраницы = ИС_МП_Клиент.ПредставлениеМаркетплейса(МП);
		Элементы["Страница" + МП].Заголовок = ЗаголовокСтраницы;  
	КонецЦикла;
	
	Модифицированность = Ложь;
	Элементы.СохранитьИзменения.Видимость = Ложь;	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 19.03.24 УА #71892
&НаКлиенте
Процедура ОтметитьВсе(Команда)

	Для Каждого Строка Из ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"] Цикл
		Строка.Выгружать = Истина;
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 19.03.24 УА #71892
&НаКлиенте
Процедура ОтметитьВыделенные(Команда)

	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка).Выгружать = Истина;
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 19.03.24 УА #71892
&НаКлиенте
Процедура СнятьВыделенные(Команда)

	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка).Выгружать = Ложь;
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 19.03.24 УА #71892
&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого Строка Из ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"] Цикл
		Строка.Выгружать = Ложь;
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 20.03.24 УА #71892
&НаКлиенте
Процедура ЗаполнитьПоВыделенным(Команда)

	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ТекПоле = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ТекущийЭлемент;
	
	Если ТекПоле = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТекПоле = Элементы[Маркетплейс + "ТаблицаВыгрузкиРучнойОстаток"] Тогда
		Параметр = "РучнойОстаток";
	ИначеЕсли ТекПоле = Элементы[Маркетплейс + "ТаблицаВыгрузкиСкрываемыйОстаток"]	Тогда
		Параметр = "СкрываемыйОстаток";
	Иначе
		Возврат;
	КонецЕсли;
	    
    ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоВыделеннымЗавершение", ЭтотОбъект, Параметр);
	ПоказатьВводЧисла(ОписаниеОповещения, 0, "Заполнение ручных / скрываемых остатков", 10, 0);	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 31.03.24 УА #71892
&НаКлиенте
Процедура ЗагрузитьРучныеОстатки(Команда) 
	
	ОчиститьСообщения();
	
	Если ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресРучныхОстатковВоВременномХранилище) Тогда

		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Не выбран файл для загрузки ручных остатков", , , "ПутьКФайлуРучныхОстатков");

		Возврат;

	КонецЕсли;
	
	Результат = ЗагрузитьРучныеОстаткиНаСервере();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат > 0 Тогда 
		Модифицированность = Истина;
		Элементы.СохранитьИзменения.Видимость = Истина;
		ЗаголовокСтраницы = ИС_МП_Клиент.ПредставлениеМаркетплейса(Маркетплейс);
		Элементы["Страница" + Маркетплейс].Заголовок = ЗаголовокСтраницы + " *";
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Загрузка выполнена успешно, заполнено строк: " + Результат);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 31.03.24 УА #71892
&НаКлиенте
Процедура ВыгрузитьОстатки(Команда)
	
	ОчиститьСообщения();
   
	Если ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Тимофеева А.А. 10.04.2025 УА #97140
	Если Не НеПоказыватьВопросВыгрузкиОстатков Тогда
	//- ИнфоСофт Тимофеева А.А. 10.04.2025 УА #97140
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьОстаткиЗавершение", ЭтотОбъект);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
			"Уверены что хотите произвести выгрузку остатков маркетплейса " 
			+ ИС_МП_Клиент.ПредставлениеМаркетплейса(Маркетплейс) + "?", 
			РежимДиалогаВопрос.ДаНет);
	//+ ИнфоСофт Тимофеева А.А. 10.04.2025 УА #97140	
	Иначе 
		НачатьВыгрузкуОстатков();		
	КонецЕсли;
	//- ИнфоСофт Тимофеева А.А. 10.04.2025 УА #97140	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.03.24 УА #71892

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #86001
&НаСервере   
Процедура ОпределитьИнтегрируемыеМаркетплейсы()
	
	ИнтегрируемыеМаркетплейсы = ИС_МП_Сервер.ИнтегрируемыеМаркетплейсы();
		
	СтруктураНастроек = Новый Структура;
	
	Для Каждого Элемент Из ИнтегрируемыеМаркетплейсы Цикл
		СтруктураНастроек.Вставить(Элемент, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "Интеграция" + Элемент));	
	КонецЦикла;
	
	ТребуетсяСменаСтраницы = Ложь;
	ПерваяДоступнаяСтраница = Неопределено;
	
	Для Каждого Элемент Из СтруктураНастроек Цикл 
		
		ИмяСтраницы = "Страница" + Элемент.Ключ;
		Видимость = ?(Элемент.Значение = Неопределено, Ложь, Элемент.Значение);
		Элементы[ИмяСтраницы].Видимость = Видимость;
		
		Если Видимость И Не ЗначениеЗаполнено(ПерваяДоступнаяСтраница) Тогда
			ПерваяДоступнаяСтраница = ИмяСтраницы; 
		КонецЕсли;
		
		Если Не Видимость И Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[ИмяСтраницы] Тогда
			ТребуетсяСменаСтраницы = Истина;	
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТребуетсяСменаСтраницы Тогда 
		
		Если ЗначениеЗаполнено(ПерваяДоступнаяСтраница) Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[ПерваяДоступнаяСтраница];		
		Иначе
			
			// +#Удалить
			Для Каждого Страница Из Элементы.ГруппаСтраницы.ПодчиненныеЭлементы Цикл
				
				Если Страница.Видимость Тогда
					Элементы.ГруппаСтраницы.ТекущаяСтраница = Страница;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			// -#Удалить

		КонецЕсли;		
			
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #86001

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
// Отказываемся от асинхронности т.к. это основной функционал формы
&НаСервере   
Процедура ОбновитьСписокНаСервере()
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[Маркетплейс];
	
	ПолучитьИЗаполнитьФункциональныеОпцииОстатков(ПеречислениеМП);
	
	Таблица = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"];
	Таблица.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ИС_МП_УправлениеОстатками.ПолучитьТекстЗапросаОстатков(ПеречислениеМП);
	
	ИС_МП_УправлениеОстатками.УстановитьПараметрыЗапросаОстатков(
		ПеречислениеМП, Запрос, Профиль, ЭтотОбъект[Маркетплейс + "Склад"]);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОстатков = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаОстатков.Следующий() Цикл
		
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаОстатков);
		
		НоваяСтрока.КэшРучнойОстаток = НоваяСтрока.РучнойОстаток;
		НоваяСтрока.КэшСкрываемыйОстаток = НоваяСтрока.СкрываемыйОстаток;
		
		Если ВыборкаОстатков.ЕстьСопоставление Или ВыборкаОстатков.ЕстьРучнойОстаток Тогда
			НоваяСтрока.Выгружать = Истина;
		КонецЕсли;
		
		Если ВыборкаОстатков.ЕстьРучнойОстаток Тогда
			НоваяСтрока.БудетВыгружено = НоваяСтрока.РучнойОстаток;
			ПроверитьПоследнийВыгруженныйОстаток(НоваяСтрока);
			Продолжить;
		КонецЕсли;
		
		СкрываемыйОстаток = НоваяСтрока.СкрываемыйОстаток;
			
		Если ЭтотОбъект[Маркетплейс + "РежимСокрытияОстатков"] Тогда
			СкрываемыйОстаток = НоваяСтрока.Свободно * НоваяСтрока.СкрываемыйОстаток / 100;	
		КонецЕсли;
		
		НоваяСтрока.БудетВыгружено = 0;
					
		Если НоваяСтрока.Свободно > СкрываемыйОстаток Тогда
			НоваяСтрока.БудетВыгружено = НоваяСтрока.Свободно - СкрываемыйОстаток;				
		КонецЕсли;
		 										
		Если ЭтотОбъект[Маркетплейс + "ИспользоватьФиксированныйОстаток"] 
				И НоваяСтрока.БудетВыгружено > ЭтотОбъект[Маркетплейс + "ФиксированныйОстаток"] Тогда

			НоваяСтрока.БудетВыгружено = ЭтотОбъект[Маркетплейс + "ФиксированныйОстаток"];	 

		КонецЕсли;
		
        ПроверитьПоследнийВыгруженныйОстаток(НоваяСтрока);
	
	КонецЦикла;
	
	Если ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].Количество() > 0 Тогда
		Элементы.ВыгрузитьОстатки.Доступность = Истина;
	КонецЕсли;	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 08.04.24 УА #71892
&НаСервереБезКонтекста   
Процедура ПроверитьПоследнийВыгруженныйОстаток(Строка)
	
	//Если Не Строка.ЕстьРучнойОстаток И Строка.ЕстьПоследнийВыгруженныйОстаток 
	//		И Строка.БудетВыгружено = Строка.ПоследнийВыгруженныйОстаток Тогда
	//	Строка.Выгружать = Ложь;		
	//КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.04.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 27.03.24 УА #71892
&НаКлиенте
Процедура ПересчитатьБудетВыгружено(ТекДанные)
   
	Если ТекДанные.ЕстьРучнойОстаток Или ТекДанные.РучнойОстатокИзменен Тогда
		ТекДанные.БудетВыгружено = ТекДанные.РучнойОстаток;
		ТекДанные.Выгружать = Истина;
	Иначе
	
		СкрываемыйОстаток = ТекДанные.СкрываемыйОстаток;
			
		Если ЭтотОбъект[Маркетплейс + "РежимСокрытияОстатков"] Тогда
			СкрываемыйОстаток = ТекДанные.Свободно * ТекДанные.СкрываемыйОстаток / 100;
		КонецЕсли;
		
		ТекДанные.БудетВыгружено = 0;
					
		Если ТекДанные.Свободно > СкрываемыйОстаток Тогда
			ТекДанные.БудетВыгружено = ТекДанные.Свободно - СкрываемыйОстаток;  
		КонецЕсли;
		 										
		Если ЭтотОбъект[Маркетплейс + "ИспользоватьФиксированныйОстаток"] 
				И ТекДанные.БудетВыгружено > ЭтотОбъект[Маркетплейс + "ФиксированныйОстаток"] Тогда
				
			ТекДанные.БудетВыгружено = ЭтотОбъект[Маркетплейс + "ФиксированныйОстаток"];	 
			
		КонецЕсли;

	КонецЕсли;
	
	//Если Не ТекДанные.ЕстьРучнойОстаток И Не ТекДанные.РучнойОстатокИзменен 
	//		И ТекДанные.ЕстьПоследнийВыгруженныйОстаток 
	//		И ТекДанные.БудетВыгружено = ТекДанные.ПоследнийВыгруженныйОстаток Тогда
	//
	//	ТекДанные.Выгружать = Ложь;	
	//
	//КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.03.24 УА #71892

// + ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
//
// Параметры:
//  Маркетплейс	 - Строка - Строковое представление маркетплейса 
//  Профиль		 - СправочникСсылка.ИС_WB_Профили - Профиль по которому необходимо оперделить склад 
// 
// Возвращаемое значение:
//  Склад - Если у Профиля по выбранному Маркетплейсу только 1 склад возвращает его, иначе возвращает пустую ссылку
//
&НаСервереБезКонтекста
Функция ПолучитьСкладПоУмолчанию(Знач Маркетплейс, Знач Профиль)
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[Маркетплейс];
	Возврат ИС_МП_УправлениеОстатками.ПолучитьСкладПоУмолчанию(ПеречислениеМП, Профиль);	

КонецФункции //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
&НаКлиенте
Процедура УстановитьВидимостьПолученияОстатков()

    Видимость = ЭтотОбъект[Маркетплейс + "ОтображатьТекущиеОстатки"];
    
	Элементы[Маркетплейс + "ПолучатьТекущиеОстаткиАвтоматически"].Видимость = Видимость;
	Элементы[Маркетплейс + "ПолучитьТекущиеОстатки"].Видимость = Видимость;
	Элементы[Маркетплейс + "ТаблицаВыгрузкиОстатокНаМаркетплейсе"].Видимость = Видимость;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

// + ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
// 
// Возвращаемое значение:
//  Структура - Возвращает параметры ожидания для длительных операций
//
&НаКлиенте
Функция ПараметрыОжидания()

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.НавигационнаяСсылка = 
		"e1cib/command/Обработка.ИС_МП_УправлениеОстатками.Команда.ОткрытьФормуПанельНавигации";
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	Возврат ПараметрыОжидания;

КонецФункции //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
&НаКлиенте
Процедура НачатьПолучениеТекущихОстатков()
    
    НайденныеСтроки = ТаблицаФоновыхЗаданий.НайтиСтроки(Новый Структура("Маркетплейс", Маркетплейс));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
    
	ДлительнаяОперация = НачатьПолучениеОстатковНаСервере();
	
	Если ДлительнаяОперация.Свойство("ИдентификаторЗадания") 
			И ЗначениеЗаполнено(ДлительнаяОперация.ИдентификаторЗадания) Тогда
		
		НоваяСтрока = ТаблицаФоновыхЗаданий.Добавить();
		НоваяСтрока.ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
		НоваяСтрока.Маркетплейс = Маркетплейс;
			
		ДопПараметры = ДлительнаяОперация.ИдентификаторЗадания;
	
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучениеОстатковЗавершение", ЭтотОбъект, ДопПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
	
	Элементы[Маркетплейс + "КартинкаОжидание"].Видимость = Истина;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

// + ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
// 
// Возвращаемое значение:
//  Структура - Возвращает структуру сформированную в результате запуска фонового задания
//
&НаСервере   
Функция НачатьПолучениеОстатковНаСервере()
    
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[Маркетплейс];
    
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		"ИС_МП_УправлениеОстатками.ПолучитьОстаткиFBS", ПеречислениеМП, Профиль, ЭтотОбъект[Маркетплейс + "Склад"]);

КонецФункции //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
&НаКлиенте
Процедура ПолучениеОстатковЗавершение(Результат, ДополнительныеПараметры) Экспорт
       
    МП = Маркетплейс;
   
    Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
    	
    	НайденныеСтроки = ТаблицаФоновыхЗаданий.НайтиСтроки(
    			Новый Структура("ИдентификаторЗадания", ДополнительныеПараметры));
    	
    	Если НайденныеСтроки.Количество() > 0 Тогда
    		МП = НайденныеСтроки[0].Маркетплейс;
    		ТаблицаФоновыхЗаданий.Удалить(НайденныеСтроки[0]);
    	КонецЕсли;	
    	
    КонецЕсли;
    
    Элементы[МП + "КартинкаОжидание"].Видимость = Ложь;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
    
	Если Результат.Статус = "Выполнено" Тогда
	    ОбработатьРезультатПолученияОстатковНаСервере(Результат.АдресРезультата, МП);
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли;
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 01.04.24 УА #71892
&НаСервере   
Процедура ОбработатьРезультатПолученияОстатковНаСервере(Знач Адрес, Знач МП)

	Если МП = Неопределено Тогда
		МП = Маркетплейс;
	КонецЕсли;
	
	Остатки = ПолучитьИзВременногоХранилища(Адрес);
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[МП];
	
    ПолеСопоставления = 
    	ИС_МП_УправлениеОстатками.ПолучитьПолеСопоставленияОстатков(ПеречислениеМП);
    
    Таблица = ЭтотОбъект[МП + "ТаблицаВыгрузки"];
    
	Для Каждого Строка Из Таблица Цикл
		Строка.ОстатокНаМаркетплейсе = 0;
		Строка.ЕстьОстатокНаМаркетплейсе = Ложь;
	КонецЦикла;
	                                                    
	Для Каждого Строка Из Остатки Цикл
	
		НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура(ПолеСопоставления, Строка[ПолеСопоставления]));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].ОстатокНаМаркетплейсе = Строка.Остаток;
			НайденныеСтроки[0].ЕстьОстатокНаМаркетплейсе = Истина;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.04.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
&НаКлиенте
Процедура УправлениеФормой()
    
    Элементы.СохранитьИзменения.Видимость = Ложь;
    
	УстановитьВидимостьПолученияОстатков();

	Если ЭтотОбъект[Маркетплейс + "ОтображатьТекущиеОстатки"] 
			И ЭтотОбъект[Маркетплейс + "ПолучатьТекущиеОстаткиАвтоматически"] Тогда
	    
	    Если ЗначениеЗаполнено(Профиль) И ЗначениеЗаполнено(ЭтотОбъект[Маркетплейс + "Склад"]) Тогда
			НачатьПолучениеТекущихОстатков();
		КонецЕсли;
	
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
&НаСервере   
Процедура СохранитьИзмененияНаСервере(МассивМаркетплейсов)
	
	Для Каждого МП Из МассивМаркетплейсов Цикл 
		
		ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[МП];		
    
		ПолеСопоставление = ИС_МП_УправлениеОстатками.ПолучитьПолеСопоставленияОстатков(ПеречислениеМП);
	
		Для Каждого Строка Из ЭтотОбъект[МП + "ТаблицаВыгрузки"] Цикл
		    
			Если Строка.РучнойОстатокИзменен Тогда

				ИС_МП_УправлениеОстатками.ЗаписатьРучнойОстаток(
					Профиль, ПеречислениеМП, ЭтотОбъект[МП + "Склад"], Строка[ПолеСопоставление], Строка.РучнойОстаток);

				Строка.ЕстьРучнойОстаток = Истина;
				Строка.РучнойОстатокИзменен = Ложь;

			КонецЕсли;
			
			Если Строка.СкрываемыйОстатокИзменен Тогда
			
				ИС_МП_УправлениеОстатками.ЗаписатьСкрываемыйОстаток(
					Профиль, ПеречислениеМП, ЭтотОбъект[МП + "Склад"], Строка[ПолеСопоставление], Строка.СкрываемыйОстаток);
		
			    Строка.ЕстьСкрываемыйОстаток = Истина;
				Строка.СкрываемыйОстатокИзменен = Ложь;
			
			КонецЕсли;	
			
		КонецЦикла;
	
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892 

//+ ИнфоСофт Ивонин К.А. 20.03.24 УА #71892
&НаКлиенте
Процедура ЗаполнитьПоВыделеннымЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы[Маркетплейс + "ТаблицаВыгрузки"].ВыделенныеСтроки;
		
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		
		ТекСтрока = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"].НайтиПоИдентификатору(Строка);
		ТекСтрока[ДополнительныеПараметры] = Результат;
		ТекСтрока[ДополнительныеПараметры + "Изменен"] = Истина;
		
		ПересчитатьБудетВыгружено(ТекСтрока);

	КонецЦикла;
	
	Элементы.СохранитьИзменения.Видимость = Истина;
	ЗаголовокСтраницы = ИС_МП_Клиент.ПредставлениеМаркетплейса(Маркетплейс);
	Элементы["Страница" + Маркетплейс].Заголовок = ЗаголовокСтраницы + " *";

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 26.03.24 УА #71892
&НаКлиенте
Процедура НесохраненныеИзмененияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда
    	Возврат;
    КонецЕсли;
    
    Если Результат.Значение = КодВозвратаДиалога.Да Тогда
    	
    	Модифицированность = Ложь;
    	Элементы.СохранитьИзменения.Видимость = Ложь;
    	
    	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") 
    			И ДополнительныеПараметры.Свойство("Закрытие") 
    			И ДополнительныеПараметры.Закрытие Тогда 
    	
    		Закрыть();
    	
    	КонецЕсли;
    	
    	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
    	
    	Маркетплейс = СтрЗаменить(ТекущаяСтраница.Имя, "Страница", "");
		ПоследняяСтраница = Элементы["Страница" + Маркетплейс];

		УстановитьВидимостьПолученияОстатков();
		
		Если ЗначениеЗаполнено(Профиль) И ЗначениеЗаполнено(ЭтотОбъект[Маркетплейс + "Склад"]) Тогда
			ОбновитьСписокНаСервере();
			ЗаполнитьИнформациюОСкладе();
		КонецЕсли;
   
       	Возврат;
    			
    КонецЕсли;
    
    Элементы.ГруппаСтраницы.ТекущаяСтраница = ПоследняяСтраница;
    	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
&НаСервереБезКонтекста
Процедура УдалитьРучнойОстатокНаСервере(Знач Профиль, Знач Маркетплейс, Знач Склад, Знач КарточкаМП)
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[Маркетплейс];
	
	ИС_МП_УправлениеОстатками.УдалитьРучнойОстаток(
		Профиль, ПеречислениеМП, Склад, КарточкаМП);
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
&НаСервереБезКонтекста
Процедура УдалитьСкрываемыйОстатокНаСервере(Знач Профиль, Знач Маркетплейс, Знач Склад, Знач КарточкаМП)
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[Маркетплейс];
	
	ИС_МП_УправлениеОстатками.УдалитьСкрываемыйОстаток(
		Профиль, ПеречислениеМП, Склад, КарточкаМП);
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892  

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
&НаСервере  
Процедура ПолучитьИЗаполнитьФункциональныеОпцииОстатков(ПеречислениеМП)
	
	МассивНастроек = ИС_МП_УправлениеОстатками.МассивПараметровВыгрузкиОстатков();	
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивНастроек);
	
	Для Каждого Элемент Из Настройки Цикл
		
		Если Элемент.Значение <> Неопределено Тогда
			ЭтотОбъект[Маркетплейс + Элемент.Ключ] = Элемент.Значение;
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 30.03.24 УА #71892
&НаКлиенте
Процедура ЗаполнитьШапку()

	Если ЭтотОбъект[Маркетплейс + "ИспользоватьФиксированныйОстаток"] Тогда
		Элементы.ФиксированныйОстаток.Видимость = Истина;
		ФиксированныйОстаток = ЭтотОбъект[Маркетплейс + "ФиксированныйОстаток"];
	Иначе
		Элементы.ФиксированныйОстаток.Видимость = Ложь;
	КонецЕсли;
	
	РежимСокрытияОстатков = ЭтотОбъект[Маркетплейс + "РежимСокрытияОстатков"];

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 01.04.24 УА #71892
&НаКлиенте
Процедура ЗаполнитьИнформациюОСкладе()
	Элементы["ДекорацияНадписьСклад" + Маркетплейс].Заголовок = 
		СформироватьИнформациюОСкладе(Маркетплейс, ЭтотОбъект[Маркетплейс + "Склад"]);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.04.24 УА #71892

// + ИнфоСофт Ивонин К.А. 01.04.24 УА #71892
//
// Параметры:
//  Маркетплейс	 - Строка - Строковое представление маркетплейса 
//  Склад		 - ЛюбаяСсылка - Склад по которому необходимо получить информацию
// 
// Возвращаемое значение:
//  Строка - содержит текстовое описание параметров склада исходя из настроек
//
&НаСервереБезКонтекста
Функция СформироватьИнформациюОСкладе(Знач Маркетплейс, Знач Склад)
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[Маркетплейс];
	
	Возврат ИС_МП_УправлениеОстатками.ПолучитьИнформациюОСкладе(ПеречислениеМП, Склад);		

КонецФункции //- ИнфоСофт Ивонин К.А. 01.04.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ИнтегрируемыеМаркетплейсы = ИС_МП_Сервер.ИнтегрируемыеМаркетплейсы();
	
	// +#Удалить
	ИнтегрируемыеМаркетплейсы.Добавить("Ozon");
	ИнтегрируемыеМаркетплейсы.Добавить("Яндекс");
	ИнтегрируемыеМаркетплейсы.Добавить("Сбер");
	ИнтегрируемыеМаркетплейсы.Добавить("Aliexpress");
	// -#Удалить
	
	ТипЭлементОтбораКомпоновкиДанных = Тип("ЭлементОтбораКомпоновкиДанных");
	ОформлениеЦветТекста = "ЦветТекста";
	ОформлениеФормат = "Формат";
	ФорматНуля = "ЧН=0";
	
	Для Каждого Маркетплейс Из ИнтегрируемыеМаркетплейсы Цикл
	    
	    // Отсутствует сопоставление
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьСопоставление");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Ложь;

		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, ЦветаСтиля.ЦветОсобогоТекста);

		// Есть ручной остаток
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиРучнойОстаток");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьРучнойОстаток");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;

		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, ЦветаСтиля.ЦветАкцента);
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		// Есть скрываемый остаток
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиСкрываемыйОстаток");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьСкрываемыйОстаток");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;

		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, ЦветаСтиля.ЦветАкцента);
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		// Выыгружать
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиБудетВыгружено");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.Выгружать");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Ложь;

		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, ЦветаСтиля.ЦветФонаПоля);
		             		
		// Ручной остаток изменение
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиРучнойОстаток");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.РучнойОстатокИзменен");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
        
        Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, WebЦвета.СинеСерый);        
        Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ИС_MP_ШрифтПолужирный);		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
		// Скрываемый остаток изменение
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиСкрываемыйОстаток");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.СкрываемыйОстатокИзменен");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
        
        Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, WebЦвета.СинеСерый);        
        Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ИС_MP_ШрифтПолужирный);		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
        
        // Есть последний выгруженный остаток
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиПоследнийВыгруженныйОстаток");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
			Маркетплейс + "ТаблицаВыгрузки.ЕстьПоследнийВыгруженныйОстаток");
		
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
        
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
		
	    // Есть остаток маркетплейса
	    
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузкиОстатокНаМаркетплейсе");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Маркетплейс + "ТаблицаВыгрузки.ЕстьОстатокНаМаркетплейсе");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
        
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеФормат, ФорматНуля);
         			
	КонецЦикла;
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 31.03.24 УА #71892
&НаКлиенте
Процедура ПутьКФайлуРучныхОстатковНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	
	ВыбранныеФайлы = ДиалогВыбораФайла.ВыбранныеФайлы;
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлуРучныхОстатков = ВыбранныеФайлы[0];
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоместитьФайлНаСерверЗавершение", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , , , ПутьКФайлуРучныхОстатков, УникальныйИдентификатор);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.03.24 УА #71892

//+ ИнфоСофт Власова И.С. 19.01.24 УА #66871
&НаКлиенте
Процедура ПоместитьФайлНаСерверЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.ПомещениеФайлаОтменено Тогда
	
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Не удалось загрузить файл, попробуйте ещё раз...", , , "ПутьКФайлуРучныхОстатков");
	
		Возврат;
	
	КонецЕсли;
	
	АдресРучныхОстатковВоВременномХранилище = Результат.Адрес;
	Элементы.ЗагрузитьРучныеОстатки.Доступность = Истина;          
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 19.01.24 УА #66871

//+ ИнфоСофт Ивонин К.А. 31.03.24 УА #71892
&НаСервере
Функция ЗагрузитьРучныеОстаткиНаСервере()
	
	Если Не ЗначениеЗаполнено(АдресРучныхОстатковВоВременномХранилище) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РучныеОстаткиТЗ = ИС_MP_Сервер.ПолучитьТаблицуЗначенийИзExcel(АдресРучныхОстатковВоВременномХранилище);
	
	Если РучныеОстаткиТЗ = Неопределено Или РучныеОстаткиТЗ.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
    
	Если РучныеОстаткиТЗ.Колонки.Найти("Остаток") = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("В файле не найдена колонка ""Остаток"", проверьте корректность файла");
		Возврат Неопределено;
	КонецЕсли;
	                                 
	ПолеПоиска = Неопределено;
	ПолеСопоставления = Неопределено;
	
	Таблица = ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"];
	МассивСтрокВыгрузки = Новый Массив;
	МассивСтрокВыгрузки.Добавить(Таблица[0]);
	
	РеквизитыТаблицы = ПолучитьРеквизиты(Маркетплейс + "ТаблицаВыгрузки");
	
	ОпределитьПолеПоиска(РеквизитыТаблицы, РучныеОстаткиТЗ.Колонки, ПолеСопоставления, ПолеПоиска);
	
	Если ПолеПоиска = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("В файле не найдена колонка для сопоставлентя остатка по данному маркетплейсу");
		Возврат Неопределено;
	КонецЕсли;
	
	Счетчик = 0;
		
	Для Каждого Строка Из РучныеОстаткиТЗ Цикл
	
		НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура(ПолеПоиска, Строка[ПолеСопоставления]));
		    
		Если Строка.Остаток = "" Тогда
			Продолжить;
		КонецЕсли;
		    
		Если НайденныеСтроки.Количество() > 0 Тогда

			НайденныеСтроки[0].РучнойОстаток = Строка.Остаток;
			НайденныеСтроки[0].РучнойОстатокИзменен = Истина;
			НайденныеСтроки[0].БудетВыгружено = Строка.Остаток;
			Счетчик = Счетчик + 1;	
	
		КонецЕсли;	
	
	КонецЦикла;
	
	Возврат Счетчик;

КонецФункции //- ИнфоСофт Ивонин К.А. 31.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 08.04.24 УА #71892
&НаСервереБезКонтекста   
Процедура ОпределитьПолеПоиска(Знач РеквизитыТаблицы, Знач Колонки, ПолеСопоставления, ПолеПоиска)

	Для Каждого Колонка Из Колонки Цикл
		
		Если Колонка.Имя = "Остаток" Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Реквизит Из РеквизитыТаблицы Цикл
			
			Если Не Реквизит.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
				Продолжить;
			КонецЕсли;
			
			ПредставлениеЗаголовка = СтрЗаменить(Реквизит.Заголовок, " ", "");
			ПредставлениеЗаголовка = СтрЗаменить(ПредставлениеЗаголовка, ".", "_");
			
			Если ПредставлениеЗаголовка = Колонка.Имя Тогда
				ПолеПоиска = Реквизит.Имя;
				ПолеСопоставления = Колонка.Имя;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;		                                        
		
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.04.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 31.03.24 УА #71892
&НаКлиенте
Процедура ВыгрузитьОстаткиЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Тимофеева А.А. 10.04.2025 УА #97140
	НеПоказыватьВопросВыгрузкиОстатков = Результат.БольшеНеЗадаватьЭтотВопрос;
	//- ИнфоСофт Тимофеева А.А. 10.04.2025 УА #97140
	
	Если Результат.Значение = КодВозвратаДиалога.Да Тогда 
        НачатьВыгрузкуОстатков();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 01.04.24 УА #71892
&НаКлиенте
Процедура НачатьВыгрузкуОстатков()
	
	ДлительнаяОперация = НачатьВыгрузкуОстатковНаСервере();
	
	Если ДлительнаяОперация = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбрано ни одной строки для выгрузки");
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузкаОстатковЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
	
    Элементы.КартинкаОжидание.Видимость = Истина;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 01.04.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
// 
// Возвращаемое значение:
//  Структура - Возвращает структуру сформированную в результате запуска фонового задания
//
&НаСервере  
Функция НачатьВыгрузкуОстатковНаСервере()
    
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы[Маркетплейс];

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	ТаблицаВыгрузки = СформироватьТаблицуВыгрузки(ПеречислениеМП);
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "ИС_МП_УправлениеОстатками.ВыгрузитьОстатки", 
		ПеречислениеМП, Профиль, ЭтотОбъект[Маркетплейс + "Склад"], ТаблицаВыгрузки);

КонецФункции //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

// + ИнфоСофт Ивонин К.А. 01.04.24 УА #71892
//
// Параметры:
//  ПеречислениеМП	 - ПеречислниеСсылка.ИС_МП_Маркетплейсы	 - Маркетплейс по которому необходимо сформировать таблицу
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Сформированная таблица для выгрузки остатков на Маркетплейс
//
&НаСервере   
Функция СформироватьТаблицуВыгрузки(ПеречислениеМП)

	ТаблицаВыгрузки = Новый ТаблицаЗначений;
	
	ИС_МП_УправлениеОстатками.ЗаполнитьКолонкиТаблицыВыгрузкиОстатков(ПеречислениеМП, ТаблицаВыгрузки);
	
	МассивПараметров = ИС_МП_УправлениеОстатками.ПолучитьПоляДляВыгрузки(ПеречислениеМП);
	
	Для Каждого Строка Из ЭтотОбъект[Маркетплейс + "ТаблицаВыгрузки"] Цикл
	
		Если Не Строка.Выгружать Тогда
			Продолжить;
		КонецЕсли;
	              
		НоваяСтрока = ТаблицаВыгрузки.Добавить();
		
		Для Каждого Элемент Из МассивПараметров Цикл
			НоваяСтрока[Элемент] = Строка[Элемент];
		КонецЦикла;
		
		НоваяСтрока.Остаток = Строка.БудетВыгружено;

	КонецЦикла;
	
	Возврат ТаблицаВыгрузки;
	 
КонецФункции //- ИнфоСофт Ивонин К.А. 01.04.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
&НаКлиенте
Процедура ВыгрузкаОстатковЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы.КартинкаОжидание.Видимость = Ложь;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
    
    Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;		
	КонецЕсли;
    
	Если Результат.Статус = "Выполнено" Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка завершена");	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 27.05.24 УА #75485
&НаСервереБезКонтекста   
Процедура ОтменитьФоновыеЗаданияНаСервере(Знач ИдентификаторЗадания)
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.05.24 УА #75485

#КонецОбласти
 
