#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Ozon_Константы = ИС_Ozon_Сервер.ПолучитьНастройкиСопоставления();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Ozon_Константы);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МинимальныйВесПриИзменении(Элемент)
	РеквизитПутьКДанным = "ВесовойТовар_МинимальныйВес";
	
	СоответствиеПараметровЗаписи = Новый Соответствие;
	СоответствиеПараметровЗаписи.Вставить(РеквизитПутьКДанным, ЭтотОбъект[РеквизитПутьКДанным]);
		
	ЗаписатьНастройкиСопоставления(СоответствиеПараметровЗаписи);
	//Ozon_КонстантыКлиентСервер.ОбновитьЗначениеКонстанты("ВесовойТовар_МинимальныйВес", ВесовойТовар_МинимальныйВес);
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныйВесПриИзменении(Элемент) 
	РеквизитПутьКДанным = "ВесовойТовар_МаксимальныйВес";
	
	СоответствиеПараметровЗаписи = Новый Соответствие;
	СоответствиеПараметровЗаписи.Вставить(РеквизитПутьКДанным, ЭтотОбъект[РеквизитПутьКДанным]);
		
	ЗаписатьНастройкиСопоставления(СоответствиеПараметровЗаписи);
	//Ozon_КонстантыКлиентСервер.ОбновитьЗначениеКонстанты("ВесовойТовар_МаксимальныйВес", ВесовойТовар_МаксимальныйВес);
КонецПроцедуры

&НаКлиенте
Процедура ПризнакВесовогоТовараПриИзменении(Элемент) 
	РеквизитПутьКДанным = "ВесовойТовар_ПризнакВесовогоТовара";
	
	СоответствиеПараметровЗаписи = Новый Соответствие;
	СоответствиеПараметровЗаписи.Вставить(РеквизитПутьКДанным, ЭтотОбъект[РеквизитПутьКДанным]);
		
	ЗаписатьНастройкиСопоставления(СоответствиеПараметровЗаписи);
	//Ozon_КонстантыКлиентСервер.ОбновитьЗначениеКонстанты("ВесовойТовар_ПризнакВесовогоТовара",
	//	ВесовойТовар_ПризнакВесовогоТовара);
КонецПроцедуры

&НаКлиенте
Процедура КвантПриИзменении(Элемент) 
	РеквизитПутьКДанным = "ВесовойТовар_Квант";
	
	СоответствиеПараметровЗаписи = Новый Соответствие;
	СоответствиеПараметровЗаписи.Вставить(РеквизитПутьКДанным, ЭтотОбъект[РеквизитПутьКДанным]);
		
	ЗаписатьНастройкиСопоставления(СоответствиеПараметровЗаписи);
	//Ozon_КонстантыКлиентСервер.ОбновитьЗначениеКонстанты("ВесовойТовар_Квант", ВесовойТовар_Квант);
КонецПроцедуры

&НаКлиенте
Процедура МинимальноеКоличествоПриИзменении(Элемент)  
	РеквизитПутьКДанным = "ВесовойТовар_МинимальноеКоличество";
	
	СоответствиеПараметровЗаписи = Новый Соответствие;
	СоответствиеПараметровЗаписи.Вставить(РеквизитПутьКДанным, ЭтотОбъект[РеквизитПутьКДанным]);
		
	ЗаписатьНастройкиСопоставления(СоответствиеПараметровЗаписи);
	//Ozon_КонстантыКлиентСервер.ОбновитьЗначениеКонстанты("ВесовойТовар_МинимальноеКоличество",
	//ВесовойТовар_МинимальноеКоличество);
КонецПроцедуры  

&НаСервере
Процедура ЗаписатьНастройкиСопоставления(СоответствиеПараметровЗаписи)
	ИС_Ozon_Сервер.ЗаписатьНастройкиСопоставления(СоответствиеПараметровЗаписи);
КонецПроцедуры

#КонецОбласти