
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 30.05.23 УА #58360
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)		
	Настройки = ИС_МП_ОбновлениеМодуля.НастройкиАвтобновления();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.05.23 УА #58360

//+ ИнфоСофт Ивонин К.А. 09.08.24 УА #79145
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаНастройкиСоединения.Видимость = Ложь;
	
	Если Не ЗначениеЗаполнено(СерверАвтообновления) Тогда
		ЗаполнитьНастройкиСоединения();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.08.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 08.08.24 УА #79145
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'");
		
		Если ЗавершениеРаботы Тогда
			ТекстПредупреждения = ТекстСообщения;
			Возврат;
		КонецЕсли;		
		
		Оповещение = Новый ОписаниеОповещения("НесохраненныеИзмененияЗавершение", 
			ЭтотОбъект, Новый Структура("Закрытие", Истина));
		
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);	
		
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.08.24 УА #79145

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 30.05.23 УА #58360
&НаКлиенте
Процедура ТестПодключения(Команда)

	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен токен", , , "Токен");
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Перед проведение теста необходимо сохранить изменения");
		Возврат;	
	КонецЕсли;

	Результат = ТестПодключенияНаСервере();
		
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ТокенКорректный Тогда
		
		Если Результат.ПроверкаПройдена Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Тест подключения успешно пройден");	
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю("Данный токен, не зарегистрирован за данной базой");
		КонецЕсли;
	
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Неверный токен");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.05.23 УА #58360

//+ ИнфоСофт Ивонин К.А. 02.06.23 УА #58360
&НаКлиенте
Процедура Сохранить(Команда)
	
	ОчиститьСообщения();
		
	Результат = СохранитьНаСервере();
	
	Если Результат Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Данные сохранены");
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 02.06.23 УА #58360

//+ ИнфоСофт Ивонин К.А. 09.08.24 УА #79145
&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьНастройкиСоединения();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.08.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 09.08.24 УА #79145
&НаКлиенте
Процедура НастройкиСоединения(Команда)
	Элементы.ГруппаНастройкиСоединения.Видимость = Не Элементы.ГруппаНастройкиСоединения.Видимость;
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.08.24 УА #79145

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 09.08.24 УА #79145
&НаСервереБезКонтекста
Функция ТестПодключенияНаСервере()
	Возврат ИС_МП_ОбновлениеМодуля.ТестПодключения();	
КонецФункции //- ИнфоСофт Ивонин К.А. 09.08.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 02.06.23 УА #58360
&НаСервере   
Функция СохранитьНаСервере() 
	
	СтруктураНастроек = ИС_МП_ОбновлениеМодуля.СтруктураНастроек();
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ЭтотОбъект);
	
	Возврат ИС_МП_ОбновлениеМодуля.ЗаписатьНастройкиАвтообновления(СтруктураНастроек);
	
КонецФункции //- ИнфоСофт Ивонин К.А. 02.06.23 УА #58360

//+ ИнфоСофт Ивонин К.А. 08.08.24 УА #79145
&НаКлиенте
Процедура НесохраненныеИзмененияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда
    	Возврат;
    КонецЕсли;
    
    Если Результат.Значение = КодВозвратаДиалога.Да Тогда
    	Модифицированность = Ложь;
    	Закрыть();
    КонецЕсли;
    
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.08.24 УА #79145

//+ ИнфоСофт Ивонин К.А. 09.08.24 УА #79145
&НаКлиенте
Процедура ЗаполнитьНастройкиСоединения()
	СерверАвтообновления = "saas.is1c.ru";
	ПортАвтообновления = 443;
	ЗащищенноеСоединениеАвтообновления = Истина;
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 09.08.24 УА #79145

#КонецОбласти
