
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 15.02.23 УА #53535
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Отбор.Свойство("Профиль") Тогда
		Профиль = Параметры.Отбор.Профиль;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Профиль) Тогда
		Элементы.Профиль.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 15.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #71876
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Профиль", Профиль);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #71876

#КонецОбласти
