                                                                                                                                                                         
#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСФормами

//+ ИнфоСофт Ивонин К.А. 06.07.22 УА #46999
Процедура ПриСозданииНаСервере(ЭтотОбъект) Экспорт
	ЭтотОбъект.Профиль = ИС_WB_СерверПовтИсп.ПолучитьПрофильПоУмолчанию();	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 22.03.23 УА #55822
Функция ПолучитьТекстЗапросаСборочныхЗаданий() Экспорт
    
    ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
    КонецЕсли;
    
    Возврат ОбщийМодуль.ПолучитьТекстЗапросаСборочныхЗаданий();

КонецФункции //- ИнфоСофт Ивонин К.А. 22.03.23 УА #55822

#КонецОбласти

#Область РегламентныеЗадания

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
Процедура ВыполнитьКомандуРеглЗадания(Профиль, ИдентификаторКомандыОбработки) Экспорт
	
	Событие = ПолучитьИмяСобытия("ВыполнитьКомандуРеглЗадания");
	
	Если ИдентификаторКомандыОбработки = "ПолучениеКарточекТоваров" Тогда
		ИС_ВБ_Сервер.ЗагрузитьТовары(Профиль);
		Возврат;				
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ПолучениеСборочныхЗаданий" Тогда
		
		ДатаНачала = ИС_ВБ_Сервер.ДатаПоследнегоЗаказа(Профиль);
		
		Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
			ДатаНачала = НачалоДня(ТекущаяДатаСеанса());	
		КонецЕсли;
		
		//ПолучитьСписокСборочныхЗаданий(Профиль, ДатаНачала + 1);
		ИС_ВБ_Сервер.ВыполнитьЗагрузкуЗаказов(Профиль, ДатаНачала + 1);
		Возврат;				
	
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ОбновлениеСтатусовСборочныхЗаданий" Тогда
		//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
		ФукнциональныеОпции = ИС_WB_СерверПовтИсп.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
		
		//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
		АктивныйЗаказКлиента = ПолучитьАктивныйЗаказКлиента(Профиль);
		
		Если АктивныйЗаказКлиента <> Неопределено Тогда	
			ФукнциональныеОпции.Вставить("АктивныйЗаказКлиента", АктивныйЗаказКлиента);	
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
		
		Если ФукнциональныеОпции.КоличествоДнейОбновлениеСтатусов = 0 Тогда
			Период = 30 * 86400;
		Иначе
			Период = ФукнциональныеОпции.КоличествоДнейОбновлениеСтатусов * 86400;
		КонецЕсли;
		
		ИС_ВБ_Сервер.ОбновитьСтатусыЗаказов(Профиль, , Период);
		//ОбновитьСтатусыСборочныхЗаданий(Профиль);
		//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
		Возврат;				                    
		
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ОбновлениеПоставок" Тогда
		ИС_ВБ_Сервер.ОбновитьИнформациюОПоставках(Профиль);
		Возврат;				
	КонецЕсли;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 02.04.24 УА #72003
	Если ИдентификаторКомандыОбработки = "ВыгрузкаЦенИСкидок" Тогда
		ВыгрузитьЦены(Профиль);
		Возврат;				
	КонецЕсли;
	
	////+ ИнфоСофт Стояк Ю.К. 27.10.2023 УА #62964	
	//Если ИдентификаторКомандыОбработки = "ВыгрузкаСкидок" Тогда
	//	ВыгрузитьСкидки(Профиль);
	//	Возврат;				
	//КонецЕсли;                                  
	////- ИнфоСофт Стояк Ю.К. 27.10.2023 УА #62964
	//- ИнфоСофт Мурсалимов Д.Р. 02.04.24 УА #72003
	
	Если ИдентификаторКомандыОбработки = "ВыгрузкаОстатков" Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_ВБ_Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
		|ГДЕ
		|	НЕ ИС_ВБ_Склады.ПометкаУдаления
		|	И ИС_ВБ_Склады.Профиль = &Профиль
		|	И ИС_ВБ_Склады.ЗагруженИзЛК
		//+ ИнфоСофт Заварин К.В. 13.08.24 УА #81097
		|	И НЕ(ИС_ВБ_Склады.ОбщаяГруппаСкладов = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|				И ИС_ВБ_Склады.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|				И ИС_ВБ_Склады.ВыгружатьОстаткиИзГруппыСкладов = ЛОЖЬ)";
		//- ИнфоСофт Заварин К.В. 13.08.24 УА #81097
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ВыгрузитьОстатки(Профиль, Выборка.Ссылка);
		КонецЦикла;
	
		Возврат;				
	
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ЗакрыватьЗаказВТечениеДня" Тогда
		
		//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
		ВыполнитьЗакрытиеЗаказов(Профиль);
		Возврат;
		//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
		
	КонецЕсли;
	
	//+ ИнфоСофт Сумин Д.В. 23.05.2023 УА #58355 
	Если ИдентификаторКомандыОбработки = "ВыполнениеАлгоритмаПоОсновнойСхемеFbo" Тогда
		ВыполнитьАлгоритмПоОсновнойСхемеFbo(Профиль);	
		
		Возврат;
	КонецЕсли;	
	//- ИнфоСофт Сумин Д.В. 23.05.2023 УА #58355
		
	//+ ИнфоСофт Стояк Ю.К. 24.11.2023 УА #61986
	Если ИдентификаторКомандыОбработки = "ПолучитьОстаткиFBO" Тогда
		ИС_MP_Сервер.ПолучитьОстаткиFBO(Профиль);			
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 24.11.2023 УА #61986
	
	Если ИдентификаторКомандыОбработки = "ЗагружатьДанныеОК" Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_WB_ДанныеОтчетовРеализацииСрезПоследних.date_to КАК date_to
		|ИЗ
		|	РегистрСведений.ИС_WB_ДанныеОтчетовРеализации.СрезПоследних(, Профиль = &Профиль) КАК ИС_WB_ДанныеОтчетовРеализацииСрезПоследних";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ДатаНачала = Выборка.date_to;
			НеделяБезСекунды = 604799; 
			ДатаОкончания = Выборка.date_to + НеделяБезСекунды;
		Иначе
			ДатаНачала = НачалоНедели(ТекущаяДатаСеанса());
			ДатаОкончания = КонецНедели(ТекущаяДатаСеанса());
		КонецЕсли;
		
		ЗагрузитьДанныеОК(Профиль, ДатаНачала, ДатаОкончания);			
		Возврат;
	
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

#КонецОбласти

#Область Цены

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
Процедура ВыгрузитьЦены(Профиль, ТаблицаВыгрузки = Неопределено) Экспорт
	
	Событие = ПолучитьИмяСобытия("ВыгрузитьЦены");
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	//
	//ПараметрыЗапроса.Сервер = "discounts-prices-api.wb.ru";
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Цены");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ВБ;
	
	МассивПараметров = ПолучитьСписокПараметровЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, МассивПараметров);
	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
	
	РежимОкругленияЦен = СтруктураЦен.РежимОкругленияЦен;
	ИспользоватьПоследниеЦены = СтруктураЦен.ИспользоватьПоследниеЦены; 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #91535
	ВыгружатьНулевыеСкидки = СтруктураЦен.ВыгружатьНулевыеСкидки;
	//- ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #91535
	
	Если ТаблицаВыгрузки = Неопределено Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = ПолучитьТекстЗапросаЦен(); 
		
		УстановитьПараметрыЗапросаЦен(Запрос, Профиль);                                                       
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		ТаблицаВыгрузки = Новый ТаблицаЗначений;	
		
		ИС_МП_УправлениеЦенами.ЗаполнитьКолонкиТаблицыВыгрузкиЦен(ПеречислениеМП, ТаблицаВыгрузки);
		
		МассивПолей = ИС_МП_УправлениеЦенами.ПолучитьПоляДляВыгрузки(ПеречислениеМП);
		
		Пока Выборка.Следующий() Цикл
		
			Если Не Выборка.ЕстьСопоставление И Не Выборка.ЕстьРучнаяЦена И Не Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
		
			Для Каждого Элемент Из МассивПолей Цикл
				НоваяСтрока[Элемент] = Выборка[Элемент];
			КонецЦикла;
			
			ЭтоНабор = Выборка.ЭтоНабор;
			
			Если Выборка.ЕстьРучнаяЦена Тогда
				Цена = Выборка.РучнаяЦена;
			Иначе  
				Цена = Выборка.Цена;	
			КонецЕсли;
			
			Цена = Окр(Цена, 0, РежимОкругленияЦен);
			
			НоваяСтрока.Цена = Цена;
			
			Если Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
				ЦенаСоСкидкой = Выборка.РучнаяЦенаСоСкидкой;
			Иначе
				ЦенаСоСкидкой = Выборка.ЦенаСоСкидкой;	
			КонецЕсли;
				
			ЦенаСоСкидкой = Окр(ЦенаСоСкидкой, 0, РежимОкругленияЦен);
				
			Если ЦенаСоСкидкой = 0 Тогда
				Скидка = 0;	
			Иначе
				Скидка = ?(Цена = 0, 0, 100 - Окр(ЦенаСоСкидкой / Цена * 100, 0, РежимОкругленияЦен));
			КонецЕсли;
			
			//+ ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #91535 
			НоваяСтрока.ВыгружатьСкидку = Ложь;
	
			Если ВыгружатьНулевыеСкидки Тогда
				
				НоваяСтрока.Скидка 			= Скидка;
				НоваяСтрока.ВыгружатьСкидку = Истина;
				
			Иначе	
				
				Если ЗначениеЗаполнено(Скидка) И Скидка > 0 Тогда 
					
					НоваяСтрока.Скидка 			= Скидка;         
					НоваяСтрока.ВыгружатьСкидку = Истина;       
					
				КонецЕсли;
				
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #91535
			
			Если НоваяСтрока.Цена = 0 И НоваяСтрока.Скидка = 0 Тогда 
				ТаблицаВыгрузки.Удалить(НоваяСтрока);
			КонецЕсли;
			
			Если Не ИспользоватьПоследниеЦены Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не Выборка.ЕстьРучнаяЦена И Не Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
			
				Если Не ИС_МП_УправлениеЦенами.ПроверитьПоследниеЦены(ПеречислениеМП, Выборка, НоваяСтрока) Тогда				
					ТаблицаВыгрузки.Удалить(НоваяСтрока);
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	data = Новый Массив;
		
	Для Каждого Строка Из ТаблицаВыгрузки Цикл
		
		dataStructure = Новый Структура;
		dataStructure.Вставить("nmID", 		Строка.nmId);
		dataStructure.Вставить("price", 	Строка.Цена);
		
		//+ ИнфоСофт Стояк Ю.К. 07.10.2024 УА #84967		
		//dataStructure.Вставить("discount", 	Строка.Скидка);
		Если Строка.ВыгружатьСкидку Тогда
			dataStructure.Вставить("discount", 	Строка.Скидка);	
		КонецЕсли;
		//- ИнфоСофт Стояк Ю.К. 07.10.2024 УА #84967
		
		data.Добавить(dataStructure);		
		
	КонецЦикла;
		
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(data, 1000);
	
	БылиОшибкиВыгрузки = Ложь;
	
	Для Каждого Элемент Из РазбитыйМассив Цикл
	
		Результат = ИС_WB_API.ВыгрузитьЦеныИСкидки(Профиль, ПараметрыЗапроса, Элемент);	 
	
		Если ЗначениеЗаполнено(Результат) Тогда
			
		Иначе
			БылиОшибкиВыгрузки = Истина;	
			Текст = "Не удалось обновить цены товаров";			
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецЕсли;

	КонецЦикла;
	
	Если Не БылиОшибкиВыгрузки И ИспользоватьПоследниеЦены Тогда
		
		Для Каждого Строка Из ТаблицаВыгрузки Цикл	
			
			ИС_МП_УправлениеЦенами.ЗаписатьПоследнююВыгруженнуюЦену(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы.ВБ, Строка.РазмерWB, Строка.Цена, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦены);
			
			ИС_МП_УправлениеЦенами.ЗаписатьПоследнююВыгруженнуюЦену(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы.ВБ, Строка.РазмерWB, Строка.ЦенаСоСкидкой, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой);
			
		КонецЦикла;
		
	КонецЕсли;
						
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Ивонин К.А. 18.12.22 УА #52439
Функция ПолучитьТекстЗапросаЦен() Экспорт
    
    ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
    КонецЕсли;
    
    Возврат ОбщийМодуль.ПолучитьТекстЗапросаЦен();

КонецФункции //- ИнфоСофт Ивонин К.А. 18.12.22 УА #52439

//+ ИнфоСофт Мурсалимов Д.Р. 13.05.24 УА #66901
Процедура УстановитьПараметрыЗапросаЦен(Запрос, Профиль) Экспорт
    
    ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат;
    КонецЕсли;
    
    ОбщийМодуль.УстановитьПараметрыЗапросаЦен(Запрос, Профиль);
    		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 13.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьСписокПараметровЦен() Экспорт

	Результат = Новый Массив;
	
	Результат.Добавить("ВидЦены");
	Результат.Добавить("ВидЦеныСоСкидкой");
	Результат.Добавить("РежимОкругленияЦен");
	Результат.Добавить("ИспользоватьПоследниеЦены");
	
	//+ ИнфоСофт Заварин К.В. 15.08.24 УА #72696
	Результат.Добавить("КоличествоОстаткаДляПереходаНаFBS");
	Результат.Добавить("ИспользоватьИзменениеЦенFboFbs");
	Результат.Добавить("ВидЦеныFBO");
	//- ИнфоСофт Заварин К.В. 15.08.24 УА #72696   
	
	//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
	Результат.Добавить("ВидЦеныЗакупочная");
	//- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #91535
	Результат.Добавить("ВыгружатьНулевыеСкидки");
	//- ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #91535

    Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьСтруктуруПараметровЦен() Экспорт

	Результат = Новый Структура;
	
	Результат.Вставить("ВидЦены"							, Справочники.ВидыЦен.ПустаяСсылка());
	Результат.Вставить("ВидЦеныСоСкидкой"					, Справочники.ВидыЦен.ПустаяСсылка());
	Результат.Вставить("РежимОкругленияЦен"					, 0);
	Результат.Вставить("ИспользоватьПоследниеЦены"			, Ложь);
	
	//+ ИнфоСофт Заварин К.В. 15.08.24 УА #72696
	Результат.Вставить("КоличествоОстаткаДляПереходаНаFBS"	, 0);
	Результат.Вставить("ИспользоватьИзменениеЦенFboFbs"		, Ложь);
	Результат.Вставить("ВидЦеныFBO"							, Справочники.ВидыЦен.ПустаяСсылка());
	//- ИнфоСофт Заварин К.В. 15.08.24 УА #72696  
	
	//+ ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
	Результат.Вставить("ВидЦеныЗакупочная"					, Справочники.ВидыЦен.ПустаяСсылка());
	//- ИнфоСофт Мурсалимов Д.Р. 22.01.25 УА #67818
	
	//+ ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #91535
	Результат.Вставить("ВыгружатьНулевыеСкидки"				, Ложь);
	//- ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #91535

    Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

#КонецОбласти

#Область ПромокодыИСкидки
 
//+ ИнфоСофт Мурсалимов Д.Р. 16.05.24 УА #66901
Функция ПолучитьИнформациюОСкидках(Профиль, quantity) Экспорт
	
	ТаблицаТекущихЦен = ПолучитьЦеныFBS(Профиль);	
	
	Если ТаблицаТекущихЦен = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	
				
	ТаблицаЦен = Новый ТаблицаЗначений;

	ТаблицаЦен.Колонки.Добавить("nmId", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЦен.Колонки.Добавить("Цена", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЦен.Колонки.Добавить("Скидка", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)));
	
	Для Каждого Строка Из ТаблицаТекущихЦен Цикл 
		
		НоваяСтрока = ТаблицаЦен.Добавить();
		НоваяСтрока.nmId 	= Строка.nmId;
		НоваяСтрока.Цена 	= Строка.Цена;
		НоваяСтрока.Скидка 	= Строка.Скидка;	
		
	КонецЦикла;
	
	Возврат ТаблицаЦен; 	         
			
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 16.05.24 УА #66901

#КонецОбласти

#Область КонтентЗагрузка

//+ ИнфоСофт Ивонин К.А. 20.12.22 УА #52439
Функция ВыгрузитьКарточкиТоваров(Профиль, ТелоЗапроса) Экспорт
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Контент");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	РезультатЗапроса = ИС_WB_API.ВыгрузитьКарточкиТоваров(Профиль, ПараметрыЗапроса, ТелоЗапроса);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
			
	Возврат РезультатЗапроса;
			
КонецФункции //- ИнфоСофт Ивонин К.А. 20.12.22 УА #52439

#КонецОбласти

#Область КонтентПросмотр

//+ ИнфоСофт Ивонин К.А. 08.02.23 УА #53535
//+ ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #62628
//Добавил упаковку
//- ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #62628
Процедура ДобавитьСоответствиеРазмеров(Профиль, РазмерWB, Номенклатура, 
		Характеристика, Упаковка = Неопределено, ТекНоменклатура = Неопределено, ТекХарактеристика = Неопределено) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_WB_СоответствиеРазмеров.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Профиль.Установить(Профиль); 
	НаборЗаписей.Отбор.РазмерWB.Установить(РазмерWB);
		
	НаборЗаписей.Прочитать(); 
	
	ТребуетсяНоваяЗапись = Истина;	
	Если НаборЗаписей.Количество() > 0 Тогда 
		
		Для Каждого Запись Из НаборЗаписей Цикл
		
			Если Запись.Номенклатура = ТекНоменклатура И Запись.Характеристика = ТекХарактеристика Тогда
			
				Запись.Номенклатура 	= Номенклатура;
				Запись.Характеристика 	= Характеристика;
				Запись.Упаковка 		= Упаковка;
        		ТребуетсяНоваяЗапись 	= Ложь;
        		Прервать;
			
			КонецЕсли;
		
		КонецЦикла; 	
	
	КонецЕсли;
   
    Если ТребуетсяНоваяЗапись Тогда
	
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Профиль 			= Профиль; 
		НоваяЗапись.РазмерWB 			= РазмерWB;
		НоваяЗапись.Номенклатура 		= Номенклатура; 
		НоваяЗапись.Характеристика 		= Характеристика;
		НоваяЗапись.Упаковка 			= Упаковка;
		
	КонецЕсли;
				
	НаборЗаписей.Записывать = Истина; 
	
	НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.12.22 УА #52439
Функция СгенерироватьБаркоды(Профиль, Количество) Экспорт
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Контент");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	РезультатЗапроса = ИС_WB_API.СгенерироватьБаркоды(Профиль, ПараметрыЗапроса, Количество);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
							
	Возврат РезультатЗапроса;
			
КонецФункции //- ИнфоСофт Ивонин К.А. 19.12.22 УА #52439

#КонецОбласти

#Область КонтентКонфигуратор

//+ ИнфоСофт Ивонин К.А. 09.02.23 УА #53535
Функция ПолучитьСписокКатегорий(Профиль, ИдРодительскойКатегории) Экспорт
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Контент");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	СтруктураЗапроса = ИС_WB_API.ПолучитьСтруктуруПараметровЗапросаСпискаПредметов();
	СтруктураЗапроса.parentID = ИдРодительскойКатегории;
	
	offset = 0;
	
	Пока Истина Цикл
	    
	    СтруктураЗапроса.offset = offset; 
	    
		КатегорияТоваров = ИС_WB_API.ПолучитьКатегорию(Профиль, ПараметрыЗапроса, СтруктураЗапроса);
			
		Если КатегорияТоваров = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;	
				
		Если КатегорияТоваров.error Тогда
			ОбщегоНазначения.СообщитьПользователю("Ошибка при получении списка предметов: " + КатегорияТоваров.errorText);
			Возврат Неопределено;
		КонецЕсли;
		
		Если КатегорияТоваров.data.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;	
			
		Результат = Новый Соответствие;
					
		Для Каждого Элемент Из КатегорияТоваров.data Цикл
			
			// isVisible молча пропал из API
			//Если Элемент.Свойство("isVisible") И Элемент.isVisible Тогда 
			Результат.Вставить(Элемент.subjectName, Элемент.subjectID);
			//КонецЕсли;
			
		КонецЦикла;
		
		offset = offset + СтруктураЗапроса.limit;						
	
	КонецЦикла;
	
	Возврат Результат;	
						
КонецФункции //- ИнфоСофт Ивонин К.А. 09.02.23 УА #53535

//+ ИнфоСофт Власова И.С. 04.02.25 УА #92612
Функция ЗагрузитьКатегорию(Профиль, Имя, Перезаполнять = Ложь, КэшКатегорий = Неопределено, ИдентификаторПредмета = Неопределено) Экспорт
	
	Событие = ПолучитьИмяСобытия("ЗагрузитьКатегорию");
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Контент");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	СтруктураЗапроса = ИС_WB_API.ПолучитьСтруктуруПараметровЗапросаСпискаПредметов();
	СтруктураЗапроса.name = Имя;
		
	КатегорияТоваров = ИС_WB_API.ПолучитьКатегорию(Профиль, ПараметрыЗапроса, СтруктураЗапроса);
		
	Если КатегорияТоваров = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если КатегорияТоваров.error Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка при получении списка предметов: " + КатегорияТоваров.errorText);
		Возврат Неопределено;
	КонецЕсли;	
	
	//+ ИнфоСофт Власова И.С. 04.02.25 УА #92612
	//JSON = КатегорияТоваров.data[0];
	
	Если КатегорияТоваров.data.Количество() = 0 Тогда
		
		Если ИдентификаторПредмета = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		JSON = Новый Структура;
		JSON.Вставить("subjectName", Имя);
		JSON.Вставить("subjectID",   ИдентификаторПредмета);
		JSON.Вставить("parentName",  "");
		
	Иначе	
		JSON = КатегорияТоваров.data[0];
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 04.02.25 УА #92612
	
	Если Перезаполнять Тогда
		Категория = Справочники.ИС_WB_Категории.НайтиПоНаименованию(Имя, Истина);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Категория) Тогда
		Категория = Справочники.ИС_WB_Категории.СоздатьЭлемент();
	Иначе
		Категория = Категория.ПолучитьОбъект();
	КонецЕсли;
	
	Категория.Наименование = JSON.subjectName;
	//Категория.Код = JSON.subjectID; Поддержка обратной совместимости
	Категория.subjectID = JSON.subjectID;
	Категория.РодительскаяКатегория = JSON.parentName; 
	
	СписокХарактеристик = ИС_WB_API.ПолучитьСписокХарактеристик(Профиль, ПараметрыЗапроса, JSON.subjectID);
	
	Если СписокХарактеристик <> Неопределено Тогда
		Категория.Характеристики.Очистить();
		ЗаполнитьКатегориюХарактеристиками(СписокХарактеристик.data, Категория.Характеристики, Перезаполнять);
		Категория.Характеристики.Сортировать("Поле");
	КонецЕсли;
									
	Попытка	
		
		Категория.Записать();
		
		Если КэшКатегорий <> Неопределено Тогда
			КэшКатегорий.Добавить(Имя);
		КонецЕсли;
								
		Возврат Категория.Ссылка;	
	
	Исключение	
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Текст = СтрШаблон("Не удалось записать элемент справочника Предметы WildBerries: %1", ИнформацияОбОшибке.Описание);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);			
	КонецПопытки;
						
КонецФункции //- ИнфоСофт Власова И.С. 04.02.25 УА #92612

//+ ИнфоСофт Ивонин К.А. 09.02.23 УА #53535
Функция ПолучитьСписокРодительскихКатегорий(Профиль) Экспорт
    
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат Неопределено;
	//КонецЕсли;                               
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Контент");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	СписокРодительскихКатегорий = ИС_WB_API.ПолучитьСписокРодительскихКатегорий(Профиль, ПараметрыЗапроса);
		
	Если СписокРодительскихКатегорий = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
    
	Результат = Новый Соответствие;
					
	Для Каждого Элемент Из СписокРодительскихКатегорий Цикл
	
		Если Элемент.Свойство("isVisible") И Элемент.isVisible Тогда
			Результат.Вставить(Элемент.name, Элемент.id); 
		КонецЕсли;

	КонецЦикла;
					
	Возврат Результат;	

КонецФункции //- ИнфоСофт Ивонин К.А. 09.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 10.02.23 УА #53535
Функция ПолучитьЗначенияХарактеристики(Профиль, Справочник, Параметр1 = "", Параметр2 = "") Экспорт

	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Контент");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
			
	Если Справочник = "tnved" Тогда
		
		СписокЗначенийХарактеристики = ИС_WB_API.ПолучитьЗначенияХарактеристики(
			Профиль, ПараметрыЗапроса, Справочник, Параметр1, Параметр2);

	Иначе
		СписокЗначенийХарактеристики = ИС_WB_API.ПолучитьЗначенияХарактеристики(
			Профиль, ПараметрыЗапроса, Справочник);
	КонецЕсли;
		
	Если СписокЗначенийХарактеристики = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый СписокЗначений;
	
	Если Справочник = "tnved" Тогда  
			
		Для Каждого Элемент Из СписокЗначенийХарактеристики Цикл
			Результат.Добавить(Элемент.tnved);
		КонецЦикла;
	
	ИначеЕсли Справочник = "colors" Или Справочник = "countries" Тогда
		
		Для Каждого Элемент Из СписокЗначенийХарактеристики Цикл
			Результат.Добавить(Элемент.name);
		КонецЦикла;
		
	Иначе

		Для Каждого Элемент Из СписокЗначенийХарактеристики Цикл
			Результат.Добавить(Элемент);
		КонецЦикла;	

	КонецЕсли;
					
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 10.02.23 УА #53535

#КонецОбласти

#Область КонтентМедиафайлы

//+ ИнфоСофт Ивонин К.А. 26.11.21 УА #40333
Функция ЗагрузитьИзображениеНаWB(Профиль, ДанныеФайла, ДоичныеДанные, NMid) Экспорт

	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	//ПараметрыЗапроса.Сервер = "content-api.wildberries.ru";
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Контент");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159

	ПолеФормы = Новый Структура;
	ПолеФормы.Вставить("ИмяПоля",  "uploadfile");
	ПолеФормы.Вставить("ИмяФайла", ДанныеФайла.ИмяФайла);
	ПолеФормы.Вставить("Тип",      "image/" + ДанныеФайла.Расширение);
	ПолеФормы.Вставить("Тело",     ДоичныеДанные);
	
	ПоляФормы = Новый Массив;
	ПоляФормы.Добавить(ПолеФормы);
	
	ДанныеПреобразования = ИС_МП_РаботаСHTTPЗапросами.ДвоичныеДанныеPOSTЗапросаКакФорма(ПоляФормы);
	ТелоЗапроса = ДанныеПреобразования.ДвоичныеДанные;
	Размер      = ДанныеПреобразования.Размер;
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type",   "multipart/form-data; boundary=" + ДанныеПреобразования.Разделитель);
	ПараметрыЗапроса.Заголовки.Вставить("Content-Lenght", Формат(Размер, "ЧН=0; ЧГ=0;"));
	ПараметрыЗапроса.Заголовки.Вставить("X-Nm-Id", Формат(NMid, "ЧН=0; ЧГ=0;"));	
	ПараметрыЗапроса.Заголовки.Вставить("X-Photo-Number", 1);
	
	Результат = ИС_WB_API.ДобавитьМедиафайлы(Профиль, ПараметрыЗапроса, ТелоЗапроса);
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 26.11.21 УА #40333

#КонецОбласти

#Область MarketplaceСборочныеЗадания

#Область СборочныеЗадания

//+ ИнфоСофт Ивонин К.А. 25.01.23 УА #53535
Процедура ОтменитьСборочноеЗадание(Профиль, Задание) Экспорт
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	РезультатОтмены = ИС_WB_API.ОтменитьСборочноеЗадание(Профиль, ПараметрыЗапроса, Задание);
	Если РезультатОтмены <> Неопределено Тогда 
    	ОбщегоНазначения.СообщитьПользователю("Сборочное задание успешно отменено");
    КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 23.01.23 УА #53535
// Получает список сборочных заданий поставщика по переданным параметрам
//
// Параметры:
//  Профиль - СправочникСсылка.ИС_WB_Профили - профиль магазина поставщика WildBerries
//  ДатаНачала - Дата - дата с которой необходимо получить заказы
//  Статус	   - Число - число обозначающее статус в котором находится сборочное задание 
//  ИДЗадания  - Строка - идентификатор сборочного задания 
//  ПроверятьФО - Булево - признак обозначающий, что необходимо произвести действия в связи с функциональными опциями 
//
Процедура ПолучитьСписокСборочныхЗаданий(Профиль, ДатаНачала, ДатаОкончания = Неопределено) Экспорт

	Событие = ПолучитьИмяСобытия("ПолучитьСписокСборочныхЗаданий");

	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат;
	//КонецЕсли;
    	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	КоличествоЭлементовНаЗапрос = 100;
    КоличествоПопытокЗапроса = 10;
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
		
	СтруктураПараметров = ИС_WB_API.ПолучитьСтруктуруПараметровЗапросаСборочныхЗаданий();
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//СтруктураПараметров.limit = НастройкиСоединения.КоличествоЭлементовНаЗапрос;
	СтруктураПараметров.limit = КоличествоЭлементовНаЗапрос;
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	СтруктураПараметров.dateFrom = ДатаНачала;
	СтруктураПараметров.dateTo = ДатаОкончания;
	
	Всего = 0;
	КоличествоОшибок = 0;
	
	ДатаПоследнегоЗадания = ДатаНачала;	
	МассивЗагруженныхЗаданий = Новый Массив;
	
	Пока Истина Цикл 
	
		//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
		//Если КоличествоОшибок = НастройкиСоединения.КоличествоОшибокЗапросов Тогда
        Если КоличествоОшибок = КоличествоПопытокЗапроса Тогда
		//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
			Текст = "Превышено количество ошибок запросов к API";
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			Возврат;
		КонецЕсли;
				
		РезультатЗапроса = ИС_WB_API.ПолучитьСписокСборочныхЗаданий(Профиль, ПараметрыЗапроса, СтруктураПараметров);
		
		Если РезультатЗапроса = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли;
	
		Если Не РезультатЗапроса.Свойство("next") Тогда
			Прервать;
		КонецЕсли;
		
		Если РезультатЗапроса.orders.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		СтруктураПараметров.next = РезультатЗапроса.next;
	
		Всего = Всего + РезультатЗапроса.orders.Количество();
		
		Для Каждого СборочноеЗадание Из РезультатЗапроса.orders Цикл	
		    
		    Если ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(СборочноеЗадание.createdAt, ФорматДатыJSON.ISO) < ДатаНачала Тогда
		    	Продолжить;
		    КонецЕсли;
		    
			СсылкаЗадания = СоздатьИлиОбновитьСборочноеЗадание(Профиль, СборочноеЗадание, ДатаПоследнегоЗадания);		
		
			Если Не СсылкаЗадания.Пустая() Тогда
				МассивЗагруженныхЗаданий.Добавить(СсылкаЗадания);
			КонецЕсли;
		
		КонецЦикла;
			
	КонецЦикла;
	
	Если МассивЗагруженныхЗаданий.Количество() > 0 Тогда
		ПроверитьФункциональныеОпцииСборочныхЗаданий(Профиль, МассивЗагруженныхЗаданий);	
	КонецЕсли;
    
    Если Всего = 0 Тогда
		Текст = СтрШаблон("С %1 нет сборочных заданий для загрузки", ДатаНачала);
	Иначе
		Текст = СтрШаблон("Сборочные задания в количестве %1 успешно загружены", Всего);
		
		ПрофильОбъект = Профиль.ПолучитьОбъект();
		ПрофильОбъект.ДатаПоследнегоСборочногоЗадания = ДатаПоследнегоЗадания;
		ДатаНачала = ДатаПоследнегоЗадания;
		
		Попытка
			ПрофильОбъект.Записать();		
		Исключение
			ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = 
				СтрШаблон("Произошла ошибка при записи элемента Сборочное задание WildBerries: %1", ИнформацияОбОшибке);
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);
		КонецПопытки;
		
	КонецЕсли;	
	
	Если ДатаОкончания = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(Текст); 
	КонецЕсли;
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 23.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 23.01.23 УА #53535
Функция СоздатьИлиОбновитьСборочноеЗадание(Профиль, Данные, ДатаПоследнегоЗадания)

    Событие = "СоздатьИлиОбновитьСборочноеЗадание";
	
	СборочноеЗадание = Документы.ИС_WB_СборочноеЗадание.НайтиПоНомеру(Данные.id);
	
	Если СборочноеЗадание.Пустая() Тогда
		СборочноеЗадание = Документы.ИС_WB_СборочноеЗадание.СоздатьДокумент();
		СборочноеЗадание.ДатаЗагрузки = ТекущаяДатаСеанса();
	Иначе
		СборочноеЗадание = СборочноеЗадание.ПолучитьОбъект();
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(СборочноеЗадание, Данные);
	
	Если Данные.Свойство("address") И ТипЗнч(Данные.address) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(СборочноеЗадание, Данные.address);	
	КонецЕсли; 
	
	Если Данные.Свойство("deliveryType") Тогда
		СборочноеЗадание.ТипДоставки = ИС_ВБ_Сервер.ОпределитьТипДоставкиСборочногоЗадания(Данные.deliveryType);
	КонецЕсли; 
	
	Если Данные.Свойство("cargoType") Тогда
		СборочноеЗадание.ТипТовара = ИС_ВБ_Сервер.ЗначениеПеречисленияТипаТовара(Данные.cargoType);
	КонецЕсли;
	
	СборочноеЗадание.Профиль = Профиль;
	СборочноеЗадание.Номер = Данные.id;
	СборочноеЗадание.Дата = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные.createdAt, ФорматДатыJSON.ISO);			
	СборочноеЗадание.Склад = Справочники.ИС_ВБ_Склады.НайтиПоКоду(Данные.warehouseId);	
	СборочноеЗадание.НоменклатураWB = Справочники.ИС_WB_Номенклатура.НайтиПоКоду(Данные.nmId);
	СборочноеЗадание.РазмерWB = Справочники.ИС_WB_РазмерыНоменклатур.НайтиПоКоду(Данные.chrtId); 
		
	// TO DO Работа с карточкой
	
	КоличествоКопеекВРубле = 100;	
	
	//+ ИнфоСофт Сумин Д.В. 26.04.2024 УА #70825
	ВалютаУчета = Константы.ВалютаУправленческогоУчета.Получить(); 
	
	СборочноеЗадание.price = СборочноеЗадание.price / КоличествоКопеекВРубле;
	СборочноеЗадание.convertedPrice = СборочноеЗадание.convertedPrice / КоличествоКопеекВРубле;
	
	//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #78411
	КодВалюты = Формат(Данные.ConvertedCurrencyCode, "ЧЦ=3; ЧВН=");	
	СборочноеЗадание.Валюта = Справочники.Валюты.НайтиПоКоду(КодВалюты);
	КодВалюты = Формат(Данные.CurrencyCode, "ЧЦ=3; ЧВН=");
	СборочноеЗадание.ВалютаПродажи = Справочники.Валюты.НайтиПоКоду(КодВалюты);
	//- ИнфоСофт Ивонин К.А. 25.06.24 УА #78411
	
	Если ВалютаУчета <> СборочноеЗадание.ВалютаПродажи Тогда	
		Если Не ЗначениеЗаполнено(СборочноеЗадание.ВалютаПродажи) Тогда
			Текст = СтрШаблон("Требуется обновить классификатор валют. Валюта продажи с кодом не найдена %1. Сборочное задание номер: %2", Данные.CurrencyCode, СборочноеЗадание.Номер);
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);	
			СборочноеЗадание.ЦенаВВалютеУчета = СборочноеЗадание.convertedPrice;
		ИначеЕсли ВалютаУчета <> СборочноеЗадание.Валюта Тогда
			СборочноеЗадание.ЦенаВВалютеУчета = РаботаСКурсамиВалют.ПересчитатьВВалюту(СборочноеЗадание.price, СборочноеЗадание.ВалютаПродажи, СборочноеЗадание.Валюта, СборочноеЗадание.Дата);	
			Текст = СтрШаблон("Валюта управленческого учета отличается от валюты продавца. Сборочное задание: %1", СборочноеЗадание.Номер);
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		Иначе
			СборочноеЗадание.ЦенаВВалютеУчета = РаботаСКурсамиВалют.ПересчитатьВВалюту(СборочноеЗадание.price, СборочноеЗадание.ВалютаПродажи, ВалютаУчета, СборочноеЗадание.Дата); 	
		КонецЕсли;		
	Иначе
		СборочноеЗадание.ЦенаВВалютеУчета = СборочноеЗадание.price;	
	КонецЕсли;	
	
	//СборочноеЗадание.price = СборочноеЗадание.price / КоличествоКопеекВРубле;
	//СборочноеЗадание.convertedPrice = СборочноеЗадание.convertedPrice / КоличествоКопеекВРубле;
	//
	//СборочноеЗадание.Валюта = Справочники.Валюты.НайтиПоКоду(Данные.currencyCode);
	//СборочноеЗадание.ВалютаПродажи = Справочники.Валюты.НайтиПоКоду(Данные.convertedCurrencyCode);
	//- ИнфоСофт Сумин Д.В. 26.04.2024 УА #70825
	
	СборочноеЗадание.skus.Очистить();
	
	Если Данные.skus <> Неопределено Тогда
		
		Для Каждого Элемент Из Данные.skus Цикл	
			НоваяСтрока = СборочноеЗадание.skus.Добавить();
			НоваяСтрока.Штрихкод = Элемент;	
		КонецЦикла;
	
	КонецЕсли;
	
	//СборочноеЗадание.prioritySc.Очистить(); 
	//
	//Если Данные.prioritySc <> Неопределено Тогда
	//	
	//	Для Каждого Элемент Из Данные.prioritySc Цикл	
	//		НоваяСтрока = СборочноеЗадание.prioritySc.Добавить();
	//		НоваяСтрока.Имя = Элемент;	
	//	КонецЦикла;
	//
	//КонецЕсли;
	
	СборочноеЗадание.offices.Очистить();
	
	Если Данные.offices <> Неопределено Тогда
		
		Для Каждого Элемент Из Данные.offices Цикл	
			НоваяСтрока = СборочноеЗадание.offices.Добавить();
			НоваяСтрока.Имя = Элемент;	
		КонецЦикла;
	
	КонецЕсли;
	
	Попытка	
		СборочноеЗадание.Записать(РежимЗаписиДокумента.Запись);
		ДатаПоследнегоЗадания = СборочноеЗадание.Дата;
		
		Если Данные.Свойство("supplyId") И ЗначениеЗаполнено(Данные.supplyId) Тогда
	         
			Поставка = ИС_ВБ_Сервер.НайтиИлиСоздатьПоставку(Профиль, Данные.supplyId);
			Если Не Поставка.Пустая() Тогда
				ИС_ВБ_Сервер.ЗаписатьПоставкуСборочногоЗадания(Профиль, СборочноеЗадание.Ссылка, Поставка);
			КонецЕсли; 
				
		КонецЕсли;
			
		Возврат СборочноеЗадание.Ссылка;		
	
	Исключение
		ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Текст = СтрШаблон("Произошла ошибка при записи элемента Сборочное задание WildBerries: %1",	ИнформацияОбОшибке);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	КонецПопытки;
	
	Возврат Документы.ИС_WB_СборочноеЗадание.ПустаяСсылка();

КонецФункции //- ИнфоСофт Ивонин К.А. 23.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 24.01.23 УА #53535
Процедура ОбновитьСтатусыСборочныхЗаданий(Профиль, МассивЗаданий = Неопределено, _30Дней = 2592000) Экспорт
	
	Событие = ПолучитьИмяСобытия("ОбновитьСтатусыСборочныхЗаданий");
		
	Запрос = Новый Запрос;
	
	ТипДоставки = Новый Массив;
	ТипДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.FBS);
	ТипДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.DBW);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус КАК Статус,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB КАК СтатусWB
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И ИС_WB_СборочноеЗадание.ТипДоставки В(&ТипДоставки)
	|	И (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB ЕСТЬ NULL
	|			ИЛИ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB = ЗНАЧЕНИЕ(Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.waiting)
	|			ИЛИ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB = ЗНАЧЕНИЕ(Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.sorted)
	//+ ИнфоСофт Стояк Ю.К. 31.03.2025 УА #96862	
	|			ИЛИ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB = ЗНАЧЕНИЕ(Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ready_for_pickup)
	|			ИЛИ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB = ЗНАЧЕНИЕ(Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.postponed_delivery)
	//- ИнфоСофт Стояк Ю.К. 31.03.2025 УА #96862
	|			ИЛИ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB = ЗНАЧЕНИЕ(Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.ПустаяСсылка)
	|			ИЛИ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус = ЗНАЧЕНИЕ(Перечисление.ИС_WB_СтатусыСборочныхЗаданий.ПустаяСсылка))
	|	И %1";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("ТипДоставки", ТипДоставки);
		
	Если МассивЗаданий = Неопределено Тогда
		//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800		
		//_30Дней = 2592000;                          
		//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
		ТекстЗапроса = СтрШаблон(ТекстЗапроса, "ИС_WB_СборочноеЗадание.Дата >= &Дата");
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса() - _30Дней);
	Иначе
		ТекстЗапроса = СтрШаблон(ТекстЗапроса, "ИС_WB_СборочноеЗадание.Ссылка В (&МассивСсылок)");
		Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
	КонецЕсли;
    
    Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивДляЗапроса = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивДляЗапроса.Добавить(Выборка.Номер);
	КонецЦикла;
	
	Если МассивДляЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивДляЗапроса, 1000);
	
	Для Каждого ЭлементМассив Из РазбитыйМассив Цикл 
		
		ИнформацияОСтатусах = ПолучитьИнформациюПоСтатусамСборочныхЗаданий(Профиль, ЭлементМассив);
		
		Если ИнформацияОСтатусах <> Неопределено Тогда
			
			Выборка.Сбросить();
			
			Пока Выборка.Следующий() Цикл
				
				Для Итер = 0 по ИнформацияОСтатусах.ВГраница() Цикл
				
					Элемент = ИнформацияОСтатусах[Итер];
					
					Если Элемент.id = Выборка.Номер Тогда
						
						Статус = ПолучитьСтатусСборочногоЗадания(Элемент.supplierStatus);
						СтатусWB = ПолучитьСтатусВСистемеWildBerries(Элемент.wbStatus); 
						Если Статус <> Выборка.Статус Или СтатусWB <> Выборка.СтатусWB Тогда	
							ЗаписатьСтатусыСборочногоЗадания(Профиль, Выборка.Ссылка, Статус, СтатусWB);		
						КонецЕсли;
						//+ ИнфоСофт Заварин К.В. 1.04.24 УА #67778
						Если СтатусWB = Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.canceled
								Или СтатусWB = Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.declined_by_client
								//+ ИнфоСофт Власова И.С. 14.03.25 УА #84167
								//Или СтатусWB = Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.defect Тогда
								Тогда
								//- ИнфоСофт Власова И.С. 14.03.25 УА #84167
							ОтменитьЗаказ(Выборка.Ссылка, Профиль);
						КонецЕсли;
						//- ИнфоСофт Заварин К.В. 01.04.24 УА #67778
						ИнформацияОСтатусах.Удалить(Итер);						
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла; 
				
			КонецЦикла
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ПолучитьЭтикеткиСборочныхЗаданий(Профиль, МассивЗаданий);
	
	Если МассивЗаданий = Неопределено Тогда
		ИС_ВБ_Сервер.ОбновитьИнформациюОПоставках(Профиль);
	КонецЕсли;
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 24.01.23 УА #53535
Процедура ПолучитьЭтикеткиСборочныхЗаданий(Профиль, МассивЗаданий = Неопределено) Экспорт
	
	Событие = ПолучитьИмяСобытия("ПолучитьЭтикеткиСборочныхЗаданий");
	
	ТипыДоставки = Новый Массив;
	ТипыДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.FBS);
	ТипыДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.DBW);
	ТипыДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.DBS);
	ТипыДоставки.Добавить(Перечисления.ИС_ВБ_ТипыДоставки.EDBS);
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ИС_WB_СборочноеЗадание.Номер КАК Номер,
	|	ИС_WB_СборочноеЗадание.Дата КАК Дата,
	//+ ИнфоСофт Мурсалимов Д.Р. 31.10.23 УА #62063
	|	ИС_WB_СборочноеЗадание.Заказ КАК Заказ
	//- ИнфоСофт Мурсалимов Д.Р. 31.10.23 УА #62063
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание = ИС_WB_СборочноеЗадание.Ссылка)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.ТипДоставки В(&ТипДоставки)
	|	И %1
	|	И ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partA ЕСТЬ NULL
	|			ИЛИ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partA = """")";
	//+ ИнфоСофт Заварин К.В. 24.05.24 УА #69946
	//|	И НЕ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус = ЗНАЧЕНИЕ(Перечисление.ИС_WB_СтатусыСборочныхЗаданий.new)";
	//- ИнфоСофт Заварин К.В. 24.05.24 УА #69946	
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("ТипДоставки", ТипыДоставки);
	
	Если МассивЗаданий = Неопределено Тогда
		_30Дней = 2592000;
		ТекстЗапроса = СтрШаблон(ТекстЗапроса, "ИС_WB_СборочноеЗадание.Дата >= &Дата");
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса() - _30Дней);
	Иначе
		ТекстЗапроса = СтрШаблон(ТекстЗапроса, "ИС_WB_СборочноеЗадание.Ссылка В (&МассивСсылок)");
		Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивДляЗапроса = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивДляЗапроса.Добавить(Выборка.Номер);
	КонецЦикла;
	
	Если МассивДляЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивДляЗапроса, 100);
	
	Для Каждого ЭлементМассив Из РазбитыйМассив Цикл 
		
		ИнформацияПоЭтикеткам = ПолучитьИнформациюПоЭтикеткамСборочныхЗаданий(Профиль, ЭлементМассив);
		
		Если ИнформацияПоЭтикеткам <> Неопределено Тогда
			
			Выборка.Сбросить();
			
			Пока Выборка.Следующий() Цикл
				
				Для Итер = 0 По ИнформацияПоЭтикеткам.ВГраница() Цикл
					
					Элемент = ИнформацияПоЭтикеткам[Итер];
					Если Элемент.orderId = Выборка.Номер Тогда
							
						ЗаписатьЭтикеткуСборочногоЗадания(Профиль, Выборка.Ссылка, Элемент);			
						ИнформацияПоЭтикеткам.Удалить(Итер);
						
						//+ ИнфоСофт Мурсалимов Д.Р. 12.03.25 УА #95433
						Если ЗначениеЗаполнено(Выборка.Заказ) Тогда
							
							НомерЭтикетки = ИС_WB_Сервер.ПолучитьНомерЭтикеткиДляСборочногоЗадания(Выборка.Ссылка);							
							
							Заказ = Выборка.Заказ.ПолучитьОбъект();	
							
							Если СтрНайти(Заказ.Комментарий, НомерЭтикетки) = 0 Тогда
								Заказ.Комментарий = Заказ.Комментарий + НомерЭтикетки + ";";
							КонецЕсли;
							
							Попытка	
								Заказ.Записать();	
							Исключение	
								Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					        	ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);	
							КонецПопытки;
							
							//+ ИнфоСофт Заварин К.В. 17.02.25 УА #83515
							МассивРеализаций = ИС_MP_РаботаСЗаказами.ПолучитьРеализацииПоЗаказуМП(Профиль,Перечисления.ИС_МП_Маркетплейсы.ВБ, Выборка.Ссылка);
							
							Для	Каждого Реализация Из МассивРеализаций Цикл 
								
								Реализация = Реализация.ПолучитьОбъект();
								
								Реализация.Комментарий = Заказ.Комментарий;	
								
								Попытка	
									Реализация.Записать();	
								Исключение	
									Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
									ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);	
								КонецПопытки;
								
							КонецЦикла;
							//- ИнфоСофт Заварин К.В. 17.02.25 УА #83515
							
						КонецЕсли;
						//- ИнфоСофт Мурсалимов Д.Р. 12.03.25 УА #95433
						
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла; 
				
			КонецЦикла
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Функция ПолучитьИнформациюПоСтатусамСборочныхЗаданий(Профиль, МассивСборочныхЗаданий) Экспорт

	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	ИнформацияОСтатусах = ИС_WB_API.ПолучитьСтатусыСборочныхЗаданий(Профиль, ПараметрыЗапроса, МассивСборочныхЗаданий);
		
	Если ИнформацияОСтатусах = Неопределено Тогда
		Возврат Неопределено	
	КонецЕсли;
	
	Возврат ИнформацияОСтатусах;	

КонецФункции //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Функция ПолучитьИнформациюПоЭтикеткамСборочныхЗаданий(Профиль, МассивСборочныхЗаданий) Экспорт
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	ИнформацияПоЭтикеткам = ИС_WB_API.ПолучитьЭтикеткиСборочныхЗаданий(Профиль, ПараметрыЗапроса, МассивСборочныхЗаданий);
		
	Если ИнформацияПоЭтикеткам = Неопределено Тогда
		Возврат Неопределено	
	КонецЕсли;
	
	Возврат ИнформацияПоЭтикеткам.stickers;	

КонецФункции //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Процедура ЗаписатьСтатусыСборочногоЗадания(Профиль, СборочноеЗадание, Статус, СтатусWB)
    
    Событие = ПолучитьИмяСобытия("ЗаписатьСтатусыСборочногоЗадания");
    
	МенеджерЗаписи = РегистрыСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.СборочноеЗадание = СборочноеЗадание;
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.СборочноеЗадание = СборочноеЗадание;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.СтатусWB = СтатусWB;
	
	Попытка
		МенеджерЗаписи.Записать(Истина);	
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	КонецПопытки;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Процедура ЗаписатьЭтикеткуСборочногоЗадания(Профиль, СборочноеЗадание, СтруктураЭтикетки)
    
    Событие = ПолучитьИмяСобытия("ЗаписатьЭтикеткуСборочногоЗадания");
    
	МенеджерЗаписи = РегистрыСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.СборочноеЗадание = СборочноеЗадание;
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.СборочноеЗадание = СборочноеЗадание;
	МенеджерЗаписи.partA = СтруктураЭтикетки.partA;
	МенеджерЗаписи.partB = СтруктураЭтикетки.partB; 
	МенеджерЗаписи.barcode = СтруктураЭтикетки.barcode;
	МенеджерЗаписи.Этикетка = Новый ХранилищеЗначения(Base64Значение(СтруктураЭтикетки.file), Новый СжатиеДанных(9));
	
	Попытка
		МенеджерЗаписи.Записать(Истина);	
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	КонецПопытки;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
 
//+ ИнфоСофт Ивонин К.А. 24.01.23 УА #53535
Функция ПолучитьСтатусСборочногоЗадания(Статус)
    
    Событие = ПолучитьИмяСобытия("ПолучитьСтатусСборочногоЗадания");
    
    Результат = ИС_MP_Сервер.ПолучитьПеречислениеПоЗначению(Перечисления.ИС_WB_СтатусыСборочныхЗаданий, Статус);
    
    Если Результат.Пустая() Тогда
    	Текст = СтрШаблон("Получен неизвестный статус сборочного задания: %1", Статус);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
    КонецЕсли;	
	
	Возврат Результат;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 24.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 24.01.23 УА #53535
Функция ПолучитьСтатусВСистемеWildBerries(Статус)
    
    Событие = ПолучитьИмяСобытия("ПолучитьСтатусВСистемеWildBerries");
    
    Результат = ИС_MP_Сервер.ПолучитьПеречислениеПоЗначению(Перечисления.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries, Статус);
    
    Если Результат.Пустая() Тогда
    	Текст = СтрШаблон("Получен неизвестный статус WB сборочного задания: %1", Статус);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
    КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 24.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
Процедура ПроверитьФункциональныеОпцииСборочныхЗаданий(Профиль, МассивЗаданий)

	ОбновитьСтатусыСборочныхЗаданий(Профиль, МассивЗаданий);
	
	ФукнциональныеОпции = ИС_WB_СерверПовтИсп.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	АктивныйЗаказКлиента = ПолучитьАктивныйЗаказКлиента(Профиль);
	
	Если АктивныйЗаказКлиента <> Неопределено Тогда	
		ФукнциональныеОпции.Вставить("АктивныйЗаказКлиента", АктивныйЗаказКлиента);	
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ФукнциональныеОпции.АвтоматическиДобавлятьВПоставку Тогда	
		ИС_ВБ_Сервер.СписокПоставок(Профиль);
		РазбитьСборочныеЗаданияПоПоставкам(Профиль, МассивЗаданий);		
	КонецЕсли;
	
	Если ФукнциональныеОпции.АвтоматическиСоздаватьЗаказы Тогда	
		СоздатьЗаказы(Профиль, МассивЗаданий);		
	КонецЕсли;
	
	Если ФукнциональныеОпции.АвтоматическиСоздаватьРеализации 
		И ФукнциональныеОпции.РежимСозданияЗаказов <> 2 Тогда	
		СоздатьРеализации(Профиль, МассивЗаданий);		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
Процедура РазбитьСборочныеЗаданияПоПоставкам(Профиль, МассивЗаданий)
		
	Событие = ПолучитьИмяСобытия("РазбитьСборочныеЗаданияПоПоставкам");
	
	//+ ИнфоСофт Стояк Ю.К. 24.09.2024 УА #72283	
	Если Профиль.РежимСозданияЗаказов <> 2 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
		|	ИС_WB_СборочноеЗадание.Склад КАК Склад,
		|	ИС_WB_СборочноеЗадание.Склад.ТипТовара КАК ТипТовара,
		|	ЕСТЬNULL(ИС_ВБ_АктивныеПоставки.ПоставкаWB, ЗНАЧЕНИЕ(Справочник.ИС_ВБ_ПоставкиFBS.ПустаяСсылка)) КАК ПоставкаWB,
		|	ЕСТЬNULL(ИС_ВБ_АктивныеПоставки.ПоставкаWB.done, ИСТИНА) КАК Закрыта
		|ИЗ
		|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ВБ_АктивныеПоставки КАК ИС_ВБ_АктивныеПоставки
		|		ПО (ИС_WB_СборочноеЗадание.Склад = ИС_ВБ_АктивныеПоставки.СкладWB)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
		|		ПО (ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание)
		|ГДЕ
		|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
		|	И ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Поставка = ЗНАЧЕНИЕ(Справочник.ИС_ВБ_ПоставкиFBS.ПустаяСсылка)	
		|ИТОГИ ПО
		|	ТипТовара,
		|	Склад";
		
		Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаКГТ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТипТовара");
		
		Пока ВыборкаКГТ.Следующий() Цикл		
			
			ВыборкаСклад = ВыборкаКГТ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Склад");				
			
			Пока ВыборкаСклад.Следующий() Цикл			
				
				ВыборкаДетальныеЗаписи = ВыборкаСклад.Выбрать();  
				
				Поставка = Неопределено;
				МассивСсылок = Новый Массив;
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если ВыборкаДетальныеЗаписи.Закрыта И Не ЗначениеЗаполнено(Поставка) Тогда
						Поставка = ИС_ВБ_Сервер.СоздатьНовуюПоставку(Профиль, СтрШаблон("%1 (%2) от %3", 
							ВыборкаДетальныеЗаписи.Склад, ВыборкаДетальныеЗаписи.ТипТовара,	Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yy")));		
						
						ЗаписатьПоставкуПоСкладу(ВыборкаДетальныеЗаписи.Склад, Поставка);
					ИначеЕсли Не ВыборкаДетальныеЗаписи.Закрыта Тогда
						Поставка = ВыборкаДетальныеЗаписи.ПоставкаWB;
					КонецЕсли;
					
					МассивСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
					
				КонецЦикла;                                              
				
				Если ЗначениеЗаполнено(Поставка) Тогда 
					ИС_ВБ_Сервер.ДобавитьСборочныеЗаданияВПоставку(Профиль, Поставка, МассивСсылок);
				КонецЕсли;
				
			КонецЦикла;                                                        
			
		КонецЦикла;
		
	Иначе
		
		// МГТ
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
		|ГДЕ
		|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
		|	И ИС_WB_СборочноеЗадание.ТипТовара = ЗНАЧЕНИЕ(Перечисление.ИС_ВБ_ТипыТоваров.МГТ)";
		
		Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Если Не ЗначениеЗаполнено(Профиль.АктивныйЗаказКлиента) Тогда
				
				Поставка = ИС_ВБ_Сервер.СоздатьНовуюПоставку(Профиль, СтрШаблон("МГТ от %1", Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yy")));	
				
				Если Поставка <> Неопределено Тогда
					
					Выборка = РезультатЗапроса.Выбрать();
					
					МассивСсылок = Новый Массив;
					
					Пока Выборка.Следующий() Цикл
						МассивСсылок.Добавить(Выборка.Ссылка);
					КонецЦикла;
					
					ИС_ВБ_Сервер.ДобавитьСборочныеЗаданияВПоставку(Профиль, Поставка, МассивСсылок);
					
					ПрофильОбъект = Профиль.ПолучитьОбъект();
					ПрофильОбъект.Поставка = Поставка;
					
					Попытка
						ПрофильОбъект.Записать();
					Исключение
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
					КонецПопытки;
					
				КонецЕсли;
				
			Иначе
				
				Если Профиль.Поставка <> Справочники.ИС_ВБ_ПоставкиFBS.ПустаяСсылка() Тогда
					
					Выборка = РезультатЗапроса.Выбрать();
					
					МассивСсылок = Новый Массив;
					
					Пока Выборка.Следующий() Цикл
						МассивСсылок.Добавить(Выборка.Ссылка);
					КонецЦикла;
					
					ИС_ВБ_Сервер.ДобавитьСборочныеЗаданияВПоставку(Профиль, Профиль.Поставка, МассивСсылок);
					
				Иначе  
					
					Поставка = ИС_ВБ_Сервер.СоздатьНовуюПоставку(Профиль, СтрШаблон("МГТ от %1", Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yy")));	
					
					Если Поставка <> Неопределено Тогда
						
						Выборка = РезультатЗапроса.Выбрать();
						
						МассивСсылок = Новый Массив;
						
						Пока Выборка.Следующий() Цикл
							МассивСсылок.Добавить(Выборка.Ссылка);
						КонецЦикла;
						
						ИС_ВБ_Сервер.ДобавитьСборочныеЗаданияВПоставку(Профиль, Поставка, МассивСсылок);
						
						ПрофильОбъект = Профиль.ПолучитьОбъект();
						ПрофильОбъект.Поставка = Поставка;
						
						Попытка
							ПрофильОбъект.Записать();
						Исключение
							ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
						КонецПопытки;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// КГТ
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
		|ГДЕ
		|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
		|	И ИС_WB_СборочноеЗадание.ТипТовара = ЗНАЧЕНИЕ(Перечисление.ИС_ВБ_ТипыТоваров.КГТ)";
		
		Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Если Не ЗначениеЗаполнено(Профиль.АктивныйЗаказКлиента) Тогда
				
				Поставка = ИС_ВБ_Сервер.СоздатьНовуюПоставку(Профиль, СтрШаблон("КГТ+ от %1", Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yy")));	
				
				Если Поставка <> Неопределено Тогда
					
					Выборка = РезультатЗапроса.Выбрать();
					
					МассивСсылок = Новый Массив;
					
					Пока Выборка.Следующий() Цикл
						МассивСсылок.Добавить(Выборка.Ссылка);
					КонецЦикла;
					
					ИС_ВБ_Сервер.ДобавитьСборочныеЗаданияВПоставку(Профиль, Поставка, МассивСсылок);
					
					ПрофильОбъект = Профиль.ПолучитьОбъект();
					ПрофильОбъект.ПоставкаКГТ = Поставка;
					
					Попытка
						ПрофильОбъект.Записать();
					Исключение
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
					КонецПопытки;
					
				КонецЕсли;
				
			Иначе
				
				Если Профиль.ПоставкаКГТ <> Справочники.ИС_ВБ_ПоставкиFBS.ПустаяСсылка() Тогда
					
					Выборка = РезультатЗапроса.Выбрать();
					
					МассивСсылок = Новый Массив;
					
					Пока Выборка.Следующий() Цикл
						МассивСсылок.Добавить(Выборка.Ссылка);
					КонецЦикла;
					
					ИС_ВБ_Сервер.ДобавитьСборочныеЗаданияВПоставку(Профиль, Профиль.ПоставкаКГТ, МассивСсылок);
					
				Иначе  
					
					Поставка = ИС_ВБ_Сервер.СоздатьНовуюПоставку(Профиль, СтрШаблон("КГТ+ от %1", Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yy")));	
					
					Если Поставка <> Неопределено Тогда
						
						Выборка = РезультатЗапроса.Выбрать();
						
						МассивСсылок = Новый Массив;
						
						Пока Выборка.Следующий() Цикл
							МассивСсылок.Добавить(Выборка.Ссылка);
						КонецЦикла;
						
						ИС_ВБ_Сервер.ДобавитьСборочныеЗаданияВПоставку(Профиль, Поставка, МассивСсылок);
						
						ПрофильОбъект = Профиль.ПолучитьОбъект();
						ПрофильОбъект.ПоставкаКГТ = Поставка;
						
						Попытка
							ПрофильОбъект.Записать();
						Исключение
							ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
						КонецПопытки;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// СГТ
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
		|ГДЕ
		|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
		|	И ИС_WB_СборочноеЗадание.ТипТовара = ЗНАЧЕНИЕ(Перечисление.ИС_ВБ_ТипыТоваров.СГТ)";
		
		Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Если Не ЗначениеЗаполнено(Профиль.АктивныйЗаказКлиента) Тогда
				
				Поставка = ИС_ВБ_Сервер.СоздатьНовуюПоставку(Профиль, СтрШаблон("СГТ от %1", Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yy")));	
				
				Если Поставка <> Неопределено Тогда
					
					Выборка = РезультатЗапроса.Выбрать();
					
					МассивСсылок = Новый Массив;
					
					Пока Выборка.Следующий() Цикл
						МассивСсылок.Добавить(Выборка.Ссылка);
					КонецЦикла;
					
					ИС_ВБ_Сервер.ДобавитьСборочныеЗаданияВПоставку(Профиль, Поставка, МассивСсылок);
					
					ПрофильОбъект = Профиль.ПолучитьОбъект();
					ПрофильОбъект.ПоставкаСГТ = Поставка;
					
					Попытка
						ПрофильОбъект.Записать();
					Исключение
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
					КонецПопытки;
					
				КонецЕсли;
				
			Иначе
				
				Если Профиль.ПоставкаСГТ <> Справочники.ИС_ВБ_ПоставкиFBS.ПустаяСсылка() Тогда
					
					Выборка = РезультатЗапроса.Выбрать();
					
					МассивСсылок = Новый Массив;
					
					Пока Выборка.Следующий() Цикл
						МассивСсылок.Добавить(Выборка.Ссылка);
					КонецЦикла;
					
					ИС_ВБ_Сервер.ДобавитьСборочныеЗаданияВПоставку(Профиль, Профиль.ПоставкаСГТ, МассивСсылок);
					
				Иначе  
					
					Поставка = ИС_ВБ_Сервер.СоздатьНовуюПоставку(Профиль, СтрШаблон("СГТ от %1", Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yy")));	
					
					Если Поставка <> Неопределено Тогда
						
						Выборка = РезультатЗапроса.Выбрать();
						
						МассивСсылок = Новый Массив;
						
						Пока Выборка.Следующий() Цикл
							МассивСсылок.Добавить(Выборка.Ссылка);
						КонецЦикла;
						
						ИС_ВБ_Сервер.ДобавитьСборочныеЗаданияВПоставку(Профиль, Поставка, МассивСсылок);
						
						ПрофильОбъект = Профиль.ПолучитьОбъект();
						ПрофильОбъект.ПоставкаСГТ = Поставка;
						
						Попытка
							ПрофильОбъект.Записать();
						Исключение
							ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
						КонецПопытки;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 24.09.2024 УА #72283
		
	ИС_ВБ_Сервер.ОбновитьИнформациюОПоставках(Профиль);	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
Процедура СоздатьЗаказы(Профиль, МассивЗаданий) Экспорт
	
	Если Не ПроверитьЗаполненностьОбязательныхРеквизитов(Профиль) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат;
    КонецЕсли;
    
    ОбщийМодуль.СоздатьЗаказы(Профиль, МассивЗаданий);
     	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
Процедура СоздатьРеализации(Профиль, МассивЗаданий) Экспорт
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат;
    КонецЕсли;
    
    ОбщийМодуль.СоздатьРеализации(Профиль, МассивЗаданий);
    	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 23.03.23 УА #55822
Функция ЗакрепитьКиЗыСборочногоЗадания(Профиль, Задание, МассивСтруктур) Экспорт
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	//+ ИнфоСофт Сумин Д.В. 09.02.2024 УА #70157	
	СтруктураДляВыгрузки = Новый Структура;
	СтруктураДляВыгрузки.Вставить("sgtins", МассивСтруктур);
	
	РезультатПрикрепления = ИС_WB_API.ЗакрепитьКиЗыСборочногоЗадания(Профиль, ПараметрыЗапроса, Задание, МассивСтруктур);
	//МассивДляВыгрузки = Новый Массив;
	//Для Каждого Элемент Из МассивСтруктур Цикл
	//
	//	СтруктураДляВыгрузки = Новый Структура;
	//	СтруктураДляВыгрузки.Вставить("code", Элемент.КодМаркировки);
	//	
	//	Если Элемент.ИдентификаторМДЛП > 0 Тогда
	//		СтруктураДляВыгрузки.Вставить("sid", Элемент.ИдентификаторМДЛП);
	//	КонецЕсли;
	//	
	//	Если Элемент.ЧислительУпаковки > 0 Тогда
	//		СтруктураДляВыгрузки.Вставить("numerator", Элемент.ЧислительУпаковки);
	//	КонецЕсли;
	//	
	//	Если Элемент.ЗнаминательУпаковки > 0 Тогда
	//		СтруктураДляВыгрузки.Вставить("denominator", Элемент.ЗнаминательУпаковки);
	//	КонецЕсли;    
	//			
	//	МассивДляВыгрузки.Добавить(СтруктураДляВыгрузки);
	//
	//КонецЦикла;
	//РезультатПрикрепления = ИС_WB_API.ЗакрепитьКиЗыСборочногоЗадания(Профиль, ПараметрыЗапроса, Задание, МассивДляВыгрузки);
	//- ИнфоСофт Сумин Д.В. 09.02.2024 УА #70157
		
	Если РезультатПрикрепления = Неопределено Тогда
		Возврат Неопределено	
	КонецЕсли;
	
	Возврат РезультатПрикрепления;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 23.03.23 УА #55822

//+ ИнфоСофт Сумин Д.В. 05.05.23 УА #58023
Процедура СоздатьРеализациюПоЗакрытиюЗаказа(Профиль, АктивныйЗаказКлиента) 
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
	Если ОбщийМодуль = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщийМодуль.СоздатьРеализациюПоЗакрытиюЗаказа(Профиль, АктивныйЗаказКлиента);
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 05.05.23 УА #58023

//+ ИнфоСофт Тюменцев А.А. 26.07.23 УА #60918
Функция ПолучитьНомерЭтикеткиДляСборочногоЗадания(СборочноеЗадание) Экспорт
	
	ВозвращаемыйНомер = " Номер этикетки: не найден";
	
	Запрос = Новый Запрос;
	Запрос.Текст =                             
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫРАЗИТЬ(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partA КАК СТРОКА) КАК partA,
	|	ВЫРАЗИТЬ(ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partB КАК СТРОКА) КАК partB,
	|	"" Номер этикетки: "" + ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partA + ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partB КАК НомерЭтикетки
	|ИЗ
	|	РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ПО ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание = ИС_WB_СборочноеЗадание.Ссылка
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка = &Ссылка";
	
	
	Запрос.УстановитьПараметр("Ссылка", СборочноеЗадание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	
	Пока Выборка.Следующий() Цикл			
		ВозвращаемыйНомер = Выборка.НомерЭтикетки;		
	КонецЦикла;
	
	Возврат ВозвращаемыйНомер;
	
КонецФункции //- ИнфоСофт Тюменцев А.А. 26.07.23 УА #60918

//+ ИнфоСофт Стояк Ю.К. 24.09.2024 УА #72283
Процедура ЗаписатьПоставкуПоСкладу(Склад, Поставка) Экспорт

	МенеджерЗаписи = РегистрыСведений.ИС_ВБ_АктивныеПоставки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СкладWB = Склад;	
	МенеджерЗаписи.Прочитать();
			
	МенеджерЗаписи.СкладWB = Склад;	
	МенеджерЗаписи.ПоставкаWB = Поставка;	

	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.09.2024 УА #72283

//+ ИнфоСофт Конышев А.Е. 28.11.24 УА #72929
Процедура УдалитьСборочныеЗадания(Профиль, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Дата >= &НачалоПериода
	|	И ИС_WB_СборочноеЗадание.Дата <= &КонецПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	ЗаписьРС = РегистрыСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СоздатьМенеджерЗаписи();
	
	Для Каждого СборочноеЗадание из РезультатЗапроса Цикл
		
		ЗаписьРС.Профиль = Профиль;
	    ЗаписьРС.СборочноеЗадание = СборочноеЗадание.Ссылка;
		ЗаписьРС.Удалить();
		
		ДокументОбъект = СборочноеЗадание.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Конышев А.Е. 28.11.24 УА #72929

//+ ИнфоСофт Заварин К.В. 22.05.24 УА #70964  
Функция НесозданныеРеализации(Поставка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание КАК Ссылка,
	|	ИС_WB_СборочноеЗадание.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_СборочныеЗадания
	|ИЗ
	|	РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ПО (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание = ИС_WB_СборочноеЗадание.Ссылка)
	|ГДЕ
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Поставка.Ссылка = &Поставка
	|	И НЕ ИС_WB_СборочноеЗадание.Заказ = &ЗаказПустаяСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СборочныеЗадания.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Реализация
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ВТ_СборочныеЗадания.Заказ = ПередачаТоваровХранителю.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_СборочныеЗадания.Ссылка,
	|	ВЫБОР
	|		КОГДА ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО ВТ_СборочныеЗадания.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_СборочныеЗадания.Ссылка,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_СборочныеЗадания.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_СборочныеЗадания.Ссылка,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИЗ
	|	ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_СборочныеЗадания.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Ссылка КАК Ссылка,
	|	СУММА(ВТ_Реализации.Реализация) КАК Реализация
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Ссылка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_Реализации.Реализация) = 0";

	Запрос.УстановитьПараметр("Поставка", Поставка);
	Запрос.УстановитьПараметр("ЗаказПустаяСсылка", ИС_MP_СерверЛокализация.ПустаяСсылкаЗаказа());

	Выборка = Запрос.Выполнить().Выбрать();
	
    МассивСЗ = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивСЗ.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат	МассивСЗ;
	
КонецФункции //- ИнфоСофт Заварин К.В. 22.05.24 УА #70964

//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
Процедура ВыполнитьЗакрытиеЗаказов(Профиль) 
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
	Если ОбщийМодуль = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщийМодуль.ВыполнитьЗакрытиеЗаказов(Профиль);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	
#КонецОбласти

#КонецОбласти

#Область MarketplaceОстатки
 
//+ ИнфоСофт Ивонин К.А. 02.03.23 УА #53535
Процедура ВыгрузитьОстатки(Профиль, Склад, ТаблицаВыгрузки = Неопределено) Экспорт
	
	Событие = ПолучитьИмяСобытия("ВыгрузитьОстатки");
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ВБ;
	
	МассивНастроек = ИС_МП_УправлениеОстатками.МассивПараметровВыгрузкиОстатков();	
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивНастроек);
		
	ИспользоватьПоследниеОстатки = Ложь;
	
	Если Настройки.ИспользоватьПоследниеОстатки <> Неопределено Тогда
		ИспользоватьПоследниеОстатки = Настройки.ИспользоватьПоследниеОстатки;
	КонецЕсли;
		
	Если ТаблицаВыгрузки = Неопределено Тогда		
		ТаблицаВыгрузки = ИС_МП_УправлениеОстатками.СформироватьТаблицуВыгрузки(Профиль, Склад, ПеречислениеМП, Настройки);		
	КонецЕсли;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	data = Новый Массив;
		
	Для Каждого Строка Из ТаблицаВыгрузки Цикл
		
		dataStructure = Новый Структура;
		dataStructure.Вставить("sku", Строка.Штрихкод);
		dataStructure.Вставить("amount", Строка.Остаток); 
		
		data.Добавить(dataStructure);		
		
	КонецЦикла;
		
	РазбитыйМассив = ИС_МП_Сервер.РазбитьМассивПоNЭлементов(data, 1000);
	
	БылиОшибкиВыгрузки = Ложь;
	
	//+ ИнфоСофт Заварин К.В. 05.08.24 УА #80998
	СчетчикПаузы = 0;
	//- ИнфоСофт Заварин К.В. 05.08.24 УА #80998 
	
	Для Каждого Элемент Из РазбитыйМассив Цикл
		
	    //+ ИнфоСофт Заварин К.В. 03.08.24 УА #80998
		Если СчетчикПаузы = 298 Тогда
			ИС_МП_Сервер.Пауза(60);
			СчетчикПаузы = 0;
		КонецЕсли;
		СчетчикПаузы = СчетчикПаузы + 1;
		//- ИнфоСофт Заварин К.В. 03.08.24 УА #80998
		
		Результат = ИС_WB_API.ОбновитьОстатки(Профиль, ПараметрыЗапроса, Склад.Код, Элемент);	 
	
		Если Результат = Неопределено Тогда
			БылиОшибкиВыгрузки = Истина;
		КонецЕсли;

	КонецЦикла;
	
	Если Не ИспользоватьПоследниеОстатки Тогда
		Возврат;
	КонецЕсли;
	
	Если Не БылиОшибкиВыгрузки Тогда
		
		Для Каждого Строка Из ТаблицаВыгрузки Цикл
			ИС_МП_УправлениеОстатками.ЗаписатьПоследнийВыгруженныйОстаток(Профиль, 
				ПеречислениеМП, Склад, Строка.РазмерWB, Строка.Остаток);
		КонецЦикла;
	
	КонецЕсли;
						
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 31.10.212 УА #51150    

//+ ИнфоСофт Ивонин К.А. 16.03.23 УА #55822
Процедура ЗаписатьРучнойОстаток(Профиль, Склад, Размер, Остаток) Экспорт

	МенеджерЗаписи = РегистрыСведений.ИС_WB_РучныеОстатки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.РазмерWB = Размер;
	МенеджерЗаписи.Прочитать();
			
	МенеджерЗаписи.Профиль = Профиль;	
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.РазмерWB = Размер;
	МенеджерЗаписи.Остаток = Остаток;

	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.03.23 УА #55822

//+ ИнфоСофт Ивонин К.А. 16.03.23 УА #55822
Процедура ЗаписатьСкрываемыйОстаток(Профиль, Склад, Размер, Остаток) Экспорт

	МенеджерЗаписи = РегистрыСведений.ИС_WB_ОграничениеОстатков.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.РазмерWB = Размер;
	МенеджерЗаписи.Прочитать();
			
	МенеджерЗаписи.Профиль = Профиль;	
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.РазмерWB = Размер;
	МенеджерЗаписи.Количество = Остаток;

	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 16.03.23 УА #55822

//+ ИнфоСофт Ивонин К.А. 26.01.23 УА #53535
Функция ПолучитьИнфорамциюОбОстаткахFBS(Профиль) Экспорт
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ВБ_Склады.Наименование КАК Наименование,
	|	ИС_ВБ_Склады.Код КАК Код
	|ИЗ
	|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
	|ГДЕ
	|	НЕ ИС_ВБ_Склады.ПометкаУдаления
	|	И ИС_ВБ_Склады.ЗагруженИзЛК
	|	И ИС_ВБ_Склады.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСклады = РезультатЗапроса.Выбрать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_РазмерыНоменклатур.Владелец.object КАК subject,
	|	ИС_WB_НоменклатураХарактеристики.Значение КАК brand,
	|	ИС_WB_РазмерыНоменклатур.Владелец.Код КАК nmId,
	|	МАКСИМУМ(ИС_WB_ШтрихкодыРазмеров.Штрихкод) КАК barcode,
	|	ИС_WB_РазмерыНоменклатур.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_Номенклатура.Характеристики КАК ИС_WB_НоменклатураХарактеристики
	|		ПО (ИС_WB_РазмерыНоменклатур.Владелец = ИС_WB_НоменклатураХарактеристики.Ссылка)
	|			И (ИС_WB_НоменклатураХарактеристики.Поле.Наименование = ""Бренд"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО (ИС_WB_РазмерыНоменклатур.Ссылка = ИС_WB_ШтрихкодыРазмеров.Размер)
	|ГДЕ
	|	ИС_WB_РазмерыНоменклатур.Профиль = &Профиль
	|	И НЕ ИС_WB_ШтрихкодыРазмеров.Штрихкод = """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_РазмерыНоменклатур.Владелец.object,
	|	ИС_WB_НоменклатураХарактеристики.Значение,
	|	ИС_WB_РазмерыНоменклатур.Владелец.Код,
	|	ИС_WB_РазмерыНоменклатур.Ссылка";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаШтрихкоды = РезультатЗапроса.Выбрать();
	
	МассивSKU = Новый Массив;
	
	Пока ВыборкаШтрихкоды.Следующий() Цикл
		МассивSKU.Добавить(ВыборкаШтрихкоды.barcode);
	КонецЦикла;
	
	Результат = Новый ТаблицаЗначений; 
	КвалификаторыЧисла = Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный);
	//+ ИнфоСофт Стояк Ю.К. 15.03.2024 УА #72261	
	//КвалификаторыСтроки = Новый КвалификаторыСтроки(20);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(80);
	//- ИнфоСофт Стояк Ю.К. 15.03.2024 УА #72261

	Результат.Колонки.Добавить("Предмет", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	Результат.Колонки.Добавить("Бренд", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	Результат.Колонки.Добавить("ИД", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	Результат.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	Результат.Колонки.Добавить("Склад", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	Результат.Колонки.Добавить("НаСкладе", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	Результат.Колонки.Добавить("ТипСклада", Новый ОписаниеТипов("Число", КвалификаторыЧисла));	
	//+ ИнфоСофт Стояк Ю.К. 16.02.2024 УА #70683                                                
	Результат.Колонки.Добавить("ФБС", Новый ОписаниеТипов("Булево"));
	//Результат.Колонки.Добавить("КодСклада", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	//- ИнфоСофт Стояк Ю.К. 16.02.2024 УА #70683
		
	Пока ВыборкаСклады.Следующий() Цикл
		
		МассивДляВыгрузки = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивSKU, 1000);
		
		Для Каждого Массив Из МассивДляВыгрузки Цикл
			
			ОстаткиТоваров = ИС_WB_API.ПолучитьОстаткиТоваров(Профиль, ПараметрыЗапроса, ВыборкаСклады.Код, Массив);
				
			Если ОстаткиТоваров = Неопределено Тогда
				Продолжить;
			КонецЕсли;
	        
	        ВыборкаШтрихкоды.Сбросить();
	        
	        Пока ВыборкаШтрихкоды.Следующий() Цикл
			
				Для Каждого Элемент Из ОстаткиТоваров.stocks Цикл
			   
			    	Если Элемент.sku = ВыборкаШтрихкоды.barcode Тогда
			    	
			    		НоваяСтрока = Результат.Добавить();
						НоваяСтрока.Предмет = ВыборкаШтрихкоды.subject;
						НоваяСтрока.Бренд = ВыборкаШтрихкоды.brand;
						НоваяСтрока.ИД = ВыборкаШтрихкоды.nmId;
						НоваяСтрока.Штрихкод = ВыборкаШтрихкоды.barcode;
						НоваяСтрока.Склад = ВыборкаСклады.Наименование;
						НоваяСтрока.НаСкладе = Элемент.amount;
						НоваяСтрока.ТипСклада = 0;
						//+ ИнфоСофт Стояк Ю.К. 16.02.2024 УА #70683						
						НоваяСтрока.ФБС = Истина;
						//НоваяСтрока.КодСклада = ВыборкаСклады.Код;  
						//- ИнфоСофт Стояк Ю.К. 16.02.2024 УА #70683

			    	КонецЕсли;
				
				КонецЦикла;        
	        
	        КонецЦикла;
	        
		КонецЦикла; 
						
	КонецЦикла;
	
	Возврат Результат;			
	
КонецФункции //- ИнфоСофт Ивонин К.А. 26.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 02.03.23 УА #53535
//+ ИнфоСофт Стояк Ю.К. 20.10.2023 УА #62749
//Добавил реквизит ВыгружатьПоОрганизации
//- ИнфоСофт Стояк Ю.К. 20.10.2023 УА #62749
Функция ПолучитьТекстЗапросаОстатков() Экспорт
    
    ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
    КонецЕсли;
    
    Возврат ОбщийМодуль.ПолучитьТекстЗапросаОстатков();
    		
КонецФункции //- ИнфоСофт Ивонин К.А. 02.03.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 16.03.23 УА #55822
Функция УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад) Экспорт
    
    ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
    КонецЕсли;
    
    ОбщийМодуль.УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад);
    		
КонецФункции //- ИнфоСофт Ивонин К.А. 16.03.23 УА #55822

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
Функция ПолучитьСкладПоУмолчанию(Профиль) Экспорт

	Результат = Справочники.ИС_ВБ_Склады.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ИС_ВБ_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
	|ГДЕ
	|	ИС_ВБ_Склады.Профиль = &Профиль
	|	И НЕ ИС_ВБ_Склады.ПометкаУдаления";

	Запрос.УстановитьПараметр("Профиль", Профиль);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
Функция ПолучитьОстаткиFBS(Профиль, Склад) Экспорт
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	//ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Маркетплейс");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ВБ_Склады.Код КАК Код,
	|	ИС_ВБ_Склады.ТипТовара КАК ТипТовара,
	|	ИС_ВБ_Склады.ИспользоватьКГТ КАК ИспользоватьКГТ
	|ИЗ
	|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
	|ГДЕ
	|	ИС_ВБ_Склады.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать();
	
	ВыборкаСклад.Следующий();
	
	warehouseId = Формат(ВыборкаСклад.Код, "ЧГ=0");
	
	ТипТовара = Новый Массив;
	ТипТовара.Добавить(ВыборкаСклад.ТипТовара);
	
	Если ВыборкаСклад.ИспользоватьКГТ Тогда
		ТипТовара.Добавить(Перечисления.ИС_ВБ_ТипыТоваров.КГТ);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_НоменклатураWB
	|ИЗ
	|	Справочник.ИС_WB_Номенклатура КАК ИС_WB_Номенклатура
	|ГДЕ
	|	НЕ ИС_WB_Номенклатура.ПометкаУдаления
	|	И ИС_WB_Номенклатура.Профиль = &Профиль
	|	И ИС_WB_Номенклатура.ТипТовара В (&ТипТовара)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_РазмерыНоменклатур.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_РазмерыWB
	|ИЗ
	|	Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|ГДЕ
	|	ИС_WB_РазмерыНоменклатур.Владелец В
	|			(ВЫБРАТЬ
	|				ВТ.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_НоменклатураWB КАК ВТ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РазмерыWB.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ИС_WB_ШтрихкодыРазмеров.Штрихкод) КАК Штрихкод
	|ИЗ
	|	ВТ_РазмерыWB КАК ВТ_РазмерыWB
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО ВТ_РазмерыWB.Ссылка = ИС_WB_ШтрихкодыРазмеров.Размер
	|ГДЕ
	|	НЕ ИС_WB_ШтрихкодыРазмеров.Штрихкод = """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РазмерыWB.Ссылка";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("ТипТовара", ТипТовара);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаШтрихкоды = РезультатЗапроса.Выбрать();
	
	МассивSKU = Новый Массив;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("РазмерWB");
	Результат.Колонки.Добавить("Штрихкод");
	Результат.Колонки.Добавить("Остаток");
	
	Пока ВыборкаШтрихкоды.Следующий() Цикл
	
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.РазмерWB = ВыборкаШтрихкоды.Ссылка;
		НоваяСтрока.Штрихкод = ВыборкаШтрихкоды.Штрихкод;
		
		МассивSKU.Добавить(ВыборкаШтрихкоды.Штрихкод);
	
	КонецЦикла;
			
	МассивДляВыгрузки = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивSKU, 1000);

	Для Каждого Массив Из МассивДляВыгрузки Цикл
		
		ОстаткиТоваров = ИС_WB_API.ПолучитьОстаткиТоваров(Профиль, ПараметрыЗапроса, warehouseId, Массив);
			
		Если ОстаткиТоваров = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Элемент Из ОстаткиТоваров.stocks Цикл
		
			НайденныеСтроки = Результат.НайтиСтроки(Новый Структура("Штрихкод", Элемент.sku));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].Остаток = Элемент.amount;	
			КонецЕсли;
		
		КонецЦикла;	
                
	КонецЦикла; 
							
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 01.04.24 УА #71892
Функция ПолучитьИнформациюОСкладе(Склад) Экспорт

	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
	"ВЫБРАТЬ
	|	ИС_ВБ_Склады.Ссылка КАК Ссылка,
	|	ИС_ВБ_Склады.ТипТовара КАК ТипТовара,
	|	ИС_ВБ_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_ВБ_Склады.Склад КАК Склад,	
	|	ИС_ВБ_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_ВБ_СкладыГруппаСкладов.Склад КАК СкладГруппы
	|ИЗ
	|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ВБ_Склады.ГруппаСкладов КАК ИС_ВБ_СкладыГруппаСкладов
	|		ПО ИС_ВБ_Склады.Ссылка = ИС_ВБ_СкладыГруппаСкладов.Ссылка
	|ГДЕ
	|	ИС_ВБ_Склады.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Результат = "";
		
	Пока ВыборкаСклад.Следующий() Цикл
		
		Результат = Результат + "ТипТовара: " + ВыборкаСклад.ТипТовара + Символы.ПС;				
				
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
		    
		    Результат = Результат + "Группа складов: " + Символы.ПС;
		    
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
		
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
			
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда
			    	Результат = Результат + Символы.Таб + " - " + ВыборкаГруппаСкладов.СкладГруппы + Символы.ПС;
			    КонецЕсли;
			    
			КонецЦикла;				
		
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			Результат = Результат + "Общая группа складов: " + ВыборкаСклад.ОбщаяГруппаСкладов + Символы.ПС;
		Иначе
			Результат = Результат + "Склад: " + ВыборкаСклад.Склад + Символы.ПС;		
		КонецЕсли;
	
	КонецЦикла;
    
    Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 01.04.24 УА #71892

#КонецОбласти

#Область Статистика

//+ ИнфоСофт Ивонин К.А. 26.01.23 УА #53535
Функция ПолучитьИнфорамциюОбОстаткахFBO(Профиль) Экспорт
		
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаСтатистики(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Статистика");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
			
	Результат = Новый ТаблицаЗначений;
	КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный);
	//+ ИнфоСофт Стояк Ю.К. 15.03.2024 УА #72261	
	//КвалификаторыСтроки = Новый КвалификаторыСтроки(20);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(80);
	//- ИнфоСофт Стояк Ю.К. 15.03.2024 УА #72261
	
	Результат.Колонки.Добавить("Предмет", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	Результат.Колонки.Добавить("Бренд", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	Результат.Колонки.Добавить("ИД", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	Результат.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	Результат.Колонки.Добавить("Склад", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	Результат.Колонки.Добавить("НаСкладе", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177	
	Результат.Колонки.Добавить("ВПутиДо", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	Результат.Колонки.Добавить("ВПутиОт", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	//- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177
	Результат.Колонки.Добавить("ТипСклада", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	//+ ИнфоСофт Стояк Ю.К. 31.01.2024 УА #69344	
	ОстаткиТоваров = ИС_WB_API.ПолучитьСтатистикуПоСкладу(Профиль, ПараметрыЗапроса, УниверсальноеВремя(НачалоГода(ДобавитьМесяц(ТекущаяДатаСеанса(), -12))));
	//ОстаткиТоваров = ИС_WB_API.ПолучитьСтатистикуПоСкладу(Профиль, ПараметрыЗапроса, УниверсальноеВремя(НачалоГода(ТекущаяДатаСеанса())));
	//- ИнфоСофт Стояк Ю.К. 31.01.2024 УА #69344
			
	Если ОстаткиТоваров = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;		                       

	Для Каждого Элемент Из ОстаткиТоваров Цикл	
				
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Предмет = Элемент.subject;
		НоваяСтрока.Бренд = Элемент.brand;
		НоваяСтрока.ИД = Элемент.nmId;
		НоваяСтрока.Штрихкод = Элемент.barcode;
		НоваяСтрока.Склад = Элемент.warehouseName;
		НоваяСтрока.НаСкладе = Элемент.quantity;
		//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177
		НоваяСтрока.ВПутиДо = Элемент.inWayToClient;
		НоваяСтрока.ВПутиОт = Элемент.inWayFromClient;
		//- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #68177
		НоваяСтрока.ТипСклада = 1;                  			
			
	КонецЦикла;
						
	Возврат Результат;	 		
			
КонецФункции //- ИнфоСофт Ивонин К.А. 26.01.23 УА #53535

//+ ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987
Функция ПолучитьДанныеОК(Профиль, ДатаНачала, ДатаКонца) Экспорт
	
	Событие = ПолучитьИмяСобытия("ПолучитьДанныеОК");
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Статистика");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159 
	
	rrdid = 0;
	ОтчетОПродажахПоРеализации = Новый Массив;
	
	Пока Истина Цикл

		Результат = ИС_WB_API.ПолучитьОтчетОПродажахПоРеализации(Профиль, ПараметрыЗапроса, ДатаНачала, ДатаКонца, , rrdid);	
	
		Если Результат = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для Каждого Элемент Из Результат Цикл
			ОтчетОПродажахПоРеализации.Добавить(Элемент);
		КонецЦикла; 
	    
	    Если Результат.Количество() = 100000 Тогда
	    	rrdid = Результат[Результат.ВГраница()].rrd_id;
	    Иначе
	    	Прервать;		
	    КонецЕсли;
	    
	КонецЦикла; 
	
	ПоследнийНомер 	= 0;
	Российский 		= Истина;
	
	ТаблицаЗначенийРезультирующая = Новый ТаблицаЗначений;
	
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("НоменклатураWB", 		Новый ОписаниеТипов("СправочникСсылка.ИС_WB_Номенклатура"));			
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("РазмерWB", 				Новый ОписаниеТипов("СправочникСсылка.ИС_WB_РазмерыНоменклатур"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Баркод", 				Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Количество", 			Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("ЦенаРозничная", 		Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("СуммаПродажи",			Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("ЦенаПродажи", 			Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("РазмерыНоменклатурWB", 	Новый ОписаниеТипов("СправочникСсылка.ИС_WB_РазмерыНоменклатур"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Код", 					Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Бренд", 				Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Название", 				Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Размер", 				Новый ОписаниеТипов("Строка")); 
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Штрихкод", 				Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Номер", 				Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("СтранаПродажи", 		Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Артикул", 				Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("РазмерПоставщика", 		Новый ОписаниеТипов("Строка"));
	
	СуммаБрака = 0;
	
	Для Каждого Элемент Из ОтчетОПродажахПоРеализации Цикл
		
		Коэффициент = -1;
		
		Если Нрег(Элемент.doc_type_name) = "продажа" Тогда
			Коэффициент = 1;
		КонецЕсли;
		
		Если Элемент.report_type = 2 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Нрег(Элемент.supplier_oper_name) 		= "оплата брака" 
			Или Нрег(Элемент.supplier_oper_name) 	= "частичная компенсация брака" Тогда        
			
			СуммаБрака = СуммаБрака + Число(Элемент.retail_amount) * Коэффициент;
			Продолжить;
			
		КонецЕсли;
		
		Если Нрег(Элемент.supplier_oper_name) 		= "компенсация брака" 
			Или Нрег(Элемент.supplier_oper_name) 	= "компенсация подмененного товара" 
			Или Нрег(Элемент.supplier_oper_name) 	= "компенсация потерянного товара"
			Или Нрег(Элемент.supplier_oper_name) 	= "компенсация ущерба"
			Или Нрег(Элемент.supplier_oper_name) 	= "добровольная компенсация при возврате" Тогда
			
			СуммаБрака = СуммаБрака + Число(Элемент.ppvz_for_pay) * Коэффициент;
			Продолжить;
			
		КонецЕсли;
		
		Если Элемент.quantity = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Нрег(Элемент.supplier_oper_name) = "возмещение издержек по перевозке" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Нрег(Элемент.supplier_oper_name) = "возмещение издержек по перевозке/по складским операциям с товаром" Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.ИС_WB_ДанныеОК.СоздатьМенеджерЗаписи();
		
		Если ПоследнийНомер <> Элемент.realizationreport_id Тогда 
			ПоследнийНомер = Элемент.realizationreport_id;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаЗначенийРезультирующая.Добавить();
		НоваяСтрока.Номер 				= Число(Элемент.realizationreport_id);
		НоваяСтрока.СтранаПродажи 		= Элемент.site_country;   
		
		НоваяСтрока.Код 				= Число(Элемент.nm_id);
		НоваяСтрока.Бренд 				= Элемент.brand_name;
		НоваяСтрока.Название 			= Элемент.subject_name;
		НоваяСтрока.Размер 				= Элемент.ts_name;
		НоваяСтрока.Баркод 				= Элемент.barcode;
		НоваяСтрока.Количество 			= Коэффициент * Число(Элемент.quantity);
		НоваяСтрока.ЦенаРозничная 		= Число(Элемент.retail_price); 
		НоваяСтрока.СуммаПродажи 		= Коэффициент * Число(Элемент.retail_amount);	   	
		НоваяСтрока.ЦенаПродажи 		= ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.СуммаПродажи / НоваяСтрока.Количество);
		НоваяСтрока.Штрихкод 			= Элемент.shk_id;
		НоваяСтрока.Артикул 			= Элемент.sa_name;
		НоваяСтрока.РазмерПоставщика 	= Элемент.ts_name;
		
		МенеджерЗаписи.НомерОтчета 		= НоваяСтрока.Номер;
		МенеджерЗаписи.СтранаПродажи 	= НоваяСтрока.СтранаПродажи;
		МенеджерЗаписи.КодНоменклатуры 	= НоваяСтрока.Код; 
		МенеджерЗаписи.НачалоПериода 	= ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Элемент.date_from, ФорматДатыJSON.ISO);
		МенеджерЗаписи.КонецПериода 	= ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Элемент.date_to, ФорматДатыJSON.ISO);
		МенеджерЗаписи.srId 			= Элемент.srId;
		МенеджерЗаписи.Бренд 			= НоваяСтрока.Бренд;
		МенеджерЗаписи.Название 		= НоваяСтрока.Название;
		МенеджерЗаписи.Размер 			= НоваяСтрока.Размер;
		МенеджерЗаписи.Баркод 			= НоваяСтрока.Баркод;
		МенеджерЗаписи.Количество 		= НоваяСтрока.Количество;
		МенеджерЗаписи.ЦенаРозничная 	= НоваяСтрока.ЦенаРозничная;
		МенеджерЗаписи.СуммаПродажи 	= НоваяСтрока.СуммаПродажи;
		МенеджерЗаписи.ЦенаПродажи 		= НоваяСтрока.ЦенаПродажи;
		МенеджерЗаписи.Штрихкод 		= НоваяСтрока.Штрихкод; 
		
		МенеджерЗаписи.Записать();	
		
	КонецЦикла;
		
	Результат = Новый Структура;
	
	Результат.Вставить("Таблица", 	ТаблицаЗначенийРезультирующая); 
	Результат.Вставить("НомерРФ", 	ПоследнийНомер);
	Результат.Вставить("Брак", 		СуммаБрака);
	
	Возврат Результат;	 				
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 28.02.25 УА #74987 

//+ ИнфоСофт Ивонин К.А. 27.10.23 УА #61512
Процедура ЗагрузитьДанныеОК(Профиль, ДатаНачала, ДатаКонца) Экспорт
	
	Событие = ПолучитьИмяСобытия("ЗагрузитьДанныеОК");
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаСтатистики(ПараметрыЗапроса, НастройкиСоединения);
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Статистика");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	rrdid = 0;
	
	Кэш = Новый Структура;
	Исключения = Новый Структура;
	
	ЗаполчитьКэшПараметров(Кэш, Исключения);
	
	Пока Истина Цикл
		
		Результат = ИС_WB_API.ПолучитьОтчетОПродажахПоРеализации(Профиль, ПараметрыЗапроса, ДатаНачала, ДатаКонца, , rrdid);
		
		Если Результат = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если Результат.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Для Каждого Структура Из Результат Цикл
			
			Если Структура.Свойство("rrd_id") Тогда
				rrd_id = Структура.rrd_id;
			Иначе
				ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , "Не найдено поле rrd_id");
				Продолжить;
			КонецЕсли;
						
			Если Структура.Свойство("realizationreport_id") Тогда
				realizationreport_id = Структура.realizationreport_id;
			Иначе
				ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , "Не найдено поле realizationreport_id");
				Продолжить;
			КонецЕсли; 
			
			Если Структура.Свойство("date_from") Тогда
				date_from = Структура.date_from;
			Иначе
				ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , "Не найдено поле date_from");
				Продолжить;
			КонецЕсли;
			
			Если Структура.Свойство("date_to") Тогда
				date_to = Структура.date_to;
			Иначе
				ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , "Не найдено поле date_to");
				Продолжить;
			КонецЕсли;
			
			Если Структура.Свойство("create_dt") Тогда
				create_dt = Структура.create_dt;
			Иначе
				ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , "Не найдено поле create_dt");
				Продолжить;
			КонецЕсли;
			
			Если Структура.Свойство("site_country") Тогда
			
				Если ЗначениеЗаполнено(Структура.site_country) И Структура.site_country <> "RU" Тогда 
					Иностранные = Истина; 
				Иначе
					Иностранные = Ложь;
				КонецЕсли;
				
			Иначе
				ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , "Не найдено поле site_country");
				Продолжить;
			КонецЕсли;
						
			date_from = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(date_from, ФорматДатыJSON.ISO);
			date_to = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(date_to, ФорматДатыJSON.ISO);
			create_dt = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(create_dt, ФорматДатыJSON.ISO);
			
			НаборЗаписей = РегистрыСведений.ИС_WB_ДанныеОтчетовРеализации.СоздатьНаборЗаписей();
            	
            НаборЗаписей.Отбор.Период.Установить(date_from);
            НаборЗаписей.Отбор.Профиль.Установить(Профиль);
            НаборЗаписей.Отбор.rrd_id.Установить(rrd_id);
			            
            Для Каждого Элемент Из Структура Цикл
                
                Если Исключения.Свойство(Элемент.Ключ) Тогда
                	Продолжить;	
                КонецЕсли;
                
                Если Кэш.Свойство(Элемент.Ключ) Тогда
                	Параметр = Кэш[Элемент.Ключ];
                Иначе
                	
                	НовыйЭлемент = Справочники.ИС_WB_ПараметрыОтчетовРеализации.СоздатьЭлемент();
                	НовыйЭлемент.Наименование = Элемент.Ключ;
                	
                	Попытка
                		НовыйЭлемент.Записать();
                	Исключение
                		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
                		Продолжить;
                	КонецПопытки;
                	
                	Кэш.Вставить(Элемент.Ключ, НовыйЭлемент.Ссылка);
                	Параметр = НовыйЭлемент.Ссылка;
                		
				КонецЕсли; 								
                            	
            	НоваяЗапись = НаборЗаписей.Добавить();
            	НоваяЗапись.Период = date_from;
            	НоваяЗапись.rrd_id = rrd_id;
            	НоваяЗапись.Иностранные = Иностранные;
            	НоваяЗапись.realizationreport_id = realizationreport_id;
            	НоваяЗапись.date_to = date_to;
            	НоваяЗапись.create_dt = create_dt;
            	НоваяЗапись.Параметр = Параметр;
				//+ ИнфоСофт Стояк Ю.К. 08.12.2023 УА #61698				
				НоваяЗапись.Профиль = Профиль;
				Если Элемент.Ключ = "sale_dt" И ЗначениеЗаполнено(Элемент.Значение) Тогда
					sale_dt = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Элемент.Значение, ФорматДатыJSON.ISO);
					НоваяЗапись.Значение = sale_dt;         
				Иначе
					НоваяЗапись.Значение = Элемент.Значение;
				КонецЕсли;
				//- ИнфоСофт Стояк Ю.К. 08.12.2023 УА #61698            	    	   
            
            КонецЦикла;
            
            НаборЗаписей.Записать(Истина);
            		
		КонецЦикла;
	
		rrdid = Результат[Результат.Количество() - 1].rrd_id;
			
	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.10.23 УА #61512

#КонецОбласти 

#Область Аналитика

//+ ИнфоСофт Заварин К.В. 28.10.24 УА #67824
Функция ПолучитьПродажиПоРегионам(Профиль) Экспорт 
	
	Событие = ПолучитьИмяСобытия("ПолучитьПродажиПоРегионам");
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//
	//ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	//
	//ЗаполнитьПараметрыЗапросаАналитики(ПараметрыЗапроса);
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Аналитика");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
		
	ТаблицаПоставок = Новый ТаблицаЗначений;	
				
	ТаблицаПоставок.Колонки.Добавить("Город", 			   Новый ОписаниеТипов("Строка"));
	ТаблицаПоставок.Колонки.Добавить("Страна", 			   Новый ОписаниеТипов("Строка"));
	ТаблицаПоставок.Колонки.Добавить("ФедеральныйОкруг",   Новый ОписаниеТипов("Строка"));
	ТаблицаПоставок.Колонки.Добавить("АртикулWB", 		   Новый ОписаниеТипов("Число"));
	ТаблицаПоставок.Колонки.Добавить("Регион", 			   Новый ОписаниеТипов("Строка"));
	ТаблицаПоставок.Колонки.Добавить("АртикулПродавца",    Новый ОписаниеТипов("Строка"));
	ТаблицаПоставок.Колонки.Добавить("КПеречислению", 	   Новый ОписаниеТипов("Число")); 
	ТаблицаПоставок.Колонки.Добавить("Доля", 			   Новый ОписаниеТипов("Число"));
	ТаблицаПоставок.Колонки.Добавить("Выкупили", 		   Новый ОписаниеТипов("Число")); 
	
	ТаблицаПоставок.Колонки.Добавить("НоменклатураWB", 	   Новый ОписаниеТипов("СправочникСсылка.ИС_WB_Номенклатура")); 
	
	_30Дней = 2592000;
	ДатаОкончания = ТекущаяДатаСеанса();
	ДатаНачала 	  = ДатаОкончания - 2592000; 
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("dateFrom", ДатаНачала);
	СтруктураПараметров.Вставить("dateTo",   ДатаОкончания);
	
	СписокПоставок = ИС_WB_API.ПолучитьПродажиПоРегионам(Профиль, ПараметрыЗапроса, СтруктураПараметров);
	
	Если СписокПоставок = Неопределено Тогда 
		
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, "Не удалось получить продажи по регионам за 30 дней");
		
		Возврат ТаблицаПоставок;
	КонецЕсли;
	
	Для Каждого Элемент Из СписокПоставок.report Цикл
		
		НоваяСтрока = ТаблицаПоставок.Добавить(); 
		
		НоваяСтрока.Город 			  = Элемент.cityName;
		НоваяСтрока.Страна 			  = Элемент.countryName;
		НоваяСтрока.ФедеральныйОкруг  = Элемент.foName;
		НоваяСтрока.АртикулWB 		  = Элемент.nmID;
		НоваяСтрока.Регион  		  = Элемент.regionName;
		НоваяСтрока.АртикулПродавца   = Элемент.sa;
		НоваяСтрока.КПеречислению  	  = Элемент.saleInvoiceCostPrice;
		НоваяСтрока.Доля   			  = Элемент.saleInvoiceCostPricePerc;  
		НоваяСтрока.Выкупили	      = Элемент.saleItemInvoiceQty;
		НоваяСтрока.НоменклатураWB    = Справочники.ИС_WB_Номенклатура.НайтиПоРеквизиту("vendorCode", Элемент.sa);
	КонецЦикла;	
	
	Возврат ТаблицаПоставок;
	
КонецФункции //- ИнфоСофт Заварин К.В. 28.10.24 УА #67824 

#КонецОбласти

#Область ЦеныИСкидки

//+ ИнфоСофт Мурсалимов Д.Р. 31.03.24 УА #72003
Процедура ВыгрузитьЦеныИСкидки(Профиль, ТаблицаВыгрузки = Неопределено) Экспорт
	
	Событие = ПолучитьИмяСобытия("ВыгрузитьЦеныИСкидки");
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	////ПараметрыЗапроса.Сервер = "discounts-prices-api-sandbox.wildberries.ru";
	//ПараметрыЗапроса.Сервер = "discounts-prices-api.wb.ru";
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Цены");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	Если ТаблицаВыгрузки = Неопределено Тогда
	
		Настройки = ИС_WB_СерверПовтИсп.ПолучитьПараметрыВыгрузкиЦен(Профиль);
		
		Если Настройки = Неопределено Тогда
			ВызватьИсключение("Не удалость получить настройки для выгрузки цен и скидок");
		КонецЕсли;	
	
		ВидЦен = Настройки.ВидЦены;              
		ВидЦеныСоСкидкой = Настройки.ВидЦеныСоСкидкой;		
	
		Запрос = Новый Запрос;			
		Запрос.Текст = ПолучитьТекстЗапросаЦен();   		
		
		Запрос.УстановитьПараметр("ВидЦены", ВидЦен);
		Запрос.УстановитьПараметр("ВидЦеныСоСкидкой", ВидЦеныСоСкидкой);		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		//+ ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		//Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
		//- ИнфоСофт Заварин К.В. 16.05.24 УА #76023
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		ТаблицаВыгрузки = Новый ТаблицаЗначений;		
		ТаблицаВыгрузки.Колонки.Добавить("НоменклатураWB");
		ТаблицаВыгрузки.Колонки.Добавить("nmId");
		ТаблицаВыгрузки.Колонки.Добавить("Цена");
		ТаблицаВыгрузки.Колонки.Добавить("Скидка");

		Пока Выборка.Следующий() Цикл
			
			Если Не Выборка.ЕстьСопоставление И Не Выборка.ЕстьРучнаяЦена Тогда	
				Продолжить;	
			КонецЕсли;
			
			Если Выборка.ЕстьРучнаяЦена Тогда
				Цена = Выборка.РучнаяЦена;
			Иначе
				Цена = Выборка.Цена;	
			КонецЕсли;
			
			Цена = Окр(Цена, 0, Настройки.РежимОкругленияЦен);
			
			Если Выборка.ЦенаСоСкидкой = 0 Тогда
				Скидка = 0;	
			Иначе
				Скидка = ?(Цена = 0, 0, 100 - Окр(Выборка.ЦенаСоСкидкой / Цена * 100, 0, Настройки.РежимОкругленияЦен));
			КонецЕсли;
			
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
			НоваяСтрока.НоменклатураWB = Выборка.НоменклатураWB;
			НоваяСтрока.nmId = Выборка.nmId;
			НоваяСтрока.Цена = Цена;
			НоваяСтрока.Скидка = Скидка;				
				
		КонецЦикла;
	
	КонецЕсли;
	
	data = Новый Массив;
	 
	Для Каждого Строка Из ТаблицаВыгрузки Цикл
		
		dataStructure = Новый Структура;		
		dataStructure.Вставить("nmId", Строка.nmId);
		dataStructure.Вставить("price", Строка.Цена);
		dataStructure.Вставить("discount", Строка.Скидка);
			  
		data.Добавить(dataStructure);
		
	КонецЦикла;
	
	Если data.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(data, 1000);
	
	Для Каждого Элемент Из РазбитыйМассив Цикл
    
    	РезультатВыгрузки = ИС_WB_API.ВыгрузитьЦеныИСкидки(Профиль, ПараметрыЗапроса, Элемент);
	
		Если РезультатВыгрузки = Неопределено Тогда
			Продолжить;
		КонецЕсли;  
		
		Если РезультатВыгрузки.Свойство("id") Тогда
			
			Если РезультатВыгрузки.alreadyExists Тогда
				
				ОбщегоНазначения.СообщитьПользователю("Все передаваемые цены и скидки уже установлены"); 
				Возврат;
				
			КонецЕсли;
			
		Иначе
			
			Текст = СтрШаблон("Не удалось выгрузить цены и скидки!");
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат;
			
		КонецЕсли;		
		
		ОбщегоНазначения.СообщитьПользователю("Загрузка цен и скидок создана, id: " + Формат(РезультатВыгрузки.id, "ЧГ=0"));	

    КонецЦикла;					
			
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 31.03.24 УА #72003

//+ ИнфоСофт Мурсалимов Д.Р. 29.03.24 УА #72003
Функция ПолучитьЦеныFBS(Профиль) Экспорт
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	//НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	//	
	//Если НастройкиСоединения.Количество() = 0 Тогда
	//	ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	//КонецЕсли;  
	//	
	//ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	//РезультатПроверки = ПроверитьИЗаполнитьПараметрыЗапросаДляСервисаAPI(ПараметрыЗапроса, НастройкиСоединения);
	//
	////ПараметрыЗапроса.Сервер = "discounts-prices-api-sandbox.wildberries.ru";
	//ПараметрыЗапроса.Сервер = "discounts-prices-api.wb.ru";
	//
	//Если Не РезультатПроверки Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Цены");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	СтруктураЗапроса = ИС_WB_API.ПолучитьСтруктуруПараметровЗапросаСпискаПредметов();
	
	ТаблицаЦенСкидок = Новый ТаблицаЗначений;
	
	ТаблицаЦенСкидок.Колонки.Добавить("nmId", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЦенСкидок.Колонки.Добавить("РазмерWB", Новый ОписаниеТипов("СправочникСсылка.ИС_WB_РазмерыНоменклатур"));                       
	ТаблицаЦенСкидок.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаЦенСкидок.Колонки.Добавить("Скидка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)));                       
	ТаблицаЦенСкидок.Колонки.Добавить("ЦенаСоСкидкой", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13, 0, ДопустимыйЗнак.Неотрицательный)));
	
	offset = 0;
	
	Пока Истина Цикл
		
		СтруктураЗапроса.offset = offset;
		
		ИнформацияЦеныСкидки = ИС_WB_API.ПолучитьИнформациюОЦенахИСкидках(Профиль, ПараметрыЗапроса, СтруктураЗапроса);
		
		Если ИнформацияЦеныСкидки = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли; 
		
		Если ИнформацияЦеныСкидки.error Тогда
			ОбщегоНазначения.СообщитьПользователю("Ошибка при получении списка цен и скидок: " + ИнформацияЦеныСкидки.errorText);
			Возврат Неопределено;
		КонецЕсли;
		
		Если ИнформацияЦеныСкидки.data.listGoods = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если ИнформацияЦеныСкидки.data.listGoods.Количество() = 0 Тогда
			Прервать;
		КонецЕсли; 		
		
		Для Каждого Элемент Из ИнформацияЦеныСкидки.data.listGoods Цикл 
			
			Для Каждого ЭлементРазмер Из Элемент.sizes Цикл
				
				НоваяСтрока = ТаблицаЦенСкидок.Добавить();
				
				НоваяСтрока.nmId 			= Элемент.nmID;
				НоваяСтрока.РазмерWB 		= Справочники.ИС_WB_РазмерыНоменклатур.НайтиПоКоду(ЭлементРазмер.sizeID);
				НоваяСтрока.Цена			= ЭлементРазмер.price;
				НоваяСтрока.Скидка			= Элемент.discount;	
				НоваяСтрока.ЦенаСоСкидкой 	= ЭлементРазмер.discountedPrice;							
				
			КонецЦикла;
			
		КонецЦикла;
		
		offset = offset + СтруктураЗапроса.limit;
		
	КонецЦикла;	
	
	Возврат ТаблицаЦенСкидок; 	
			
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 29.03.24 УА #72003

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 29.09.22 УА #49591
Процедура ЗаполнитьКатегориюХарактеристиками(Поля, ТЧ, Перезаполнять)
	
	Событие = "ЗаполнитьКатегориюХарактеристиками";
	
	Для Каждого Элемент Из Поля Цикл
		
		Если Элемент.Свойство("name") Тогда
			ХарактеристикаКатегории = Справочники.ИС_WB_ХарактеристикиКатегорий.НайтиПоНаименованию(Элемент.name, Истина);
		Иначе
			Продолжить;
		КонецЕсли;
		
		НоваяХарактеристика = ТЧ.Добавить();
		
		Если ХарактеристикаКатегории.Пустая() Тогда		
			ХарактеристикаКатегории = Справочники.ИС_WB_ХарактеристикиКатегорий.СоздатьЭлемент();
			ХарактеристикаКатегории = ЗаполнитьСвойстваХарактеристики(ХарактеристикаКатегории, Элемент);						
		Иначе
			
			Если Перезаполнять Тогда
				ХарактеристикаКатегории = ХарактеристикаКатегории.ПолучитьОбъект();
				ХарактеристикаКатегории = ЗаполнитьСвойстваХарактеристики(ХарактеристикаКатегории, Элемент);
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяХарактеристика.Поле = ХарактеристикаКатегории;
		НоваяХарактеристика.Обязательное = ХарактеристикаКатегории.required;		
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.09.22 УА #49591

//+ ИнфоСофт Ивонин К.А. 10.02.23 УА #53535
Функция ЗаполнитьСвойстваХарактеристики(Характеристика, ДанныеЗаполнения)
	
	Событие = ПолучитьИмяСобытия("ЗаполнитьСвойстваХарактеристики");
	
	Результат = Справочники.ИС_WB_ХарактеристикиКатегорий.ПустаяСсылка();
	
	Характеристика.Наименование = ДанныеЗаполнения.name;
	//Характеристика.Код = ДанныеЗаполнения.charcID; Неуникальные коды у одинаковых параметров
	Характеристика.charcID = ДанныеЗаполнения.charcID;
	ЗаполнитьЗначенияСвойств(Характеристика, ДанныеЗаполнения);
	
	Если ДанныеЗаполнения.name = "Цвет" Тогда
		Характеристика.dictionary = "colors";
	ИначеЕсли ДанныеЗаполнения.name = "Пол" Тогда
		Характеристика.dictionary = "kinds";	 
	ИначеЕсли ДанныеЗаполнения.name = "Страна производства" Тогда
		Характеристика.dictionary = "countries";	
	ИначеЕсли ДанныеЗаполнения.name = "Сезон" Тогда
		Характеристика.dictionary = "seasons";	
	ИначеЕсли ДанныеЗаполнения.name = "ТНВЭД" Тогда
		Характеристика.dictionary = "tnved";
	ИначеЕсли ДанныеЗаполнения.name = "Ставка НДС" Тогда
		Характеристика.dictionary = "vat";
	КонецЕсли;  
	
	Попытка		
		Характеристика.Записать();	
		Результат = Характеристика.Ссылка;		
	Исключение		
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);				
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 10.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 29.03.23 УА #55822
Функция ПроверитьЗаполненностьОбязательныхРеквизитов(Профиль)
	
	Событие = ПолучитьИмяСобытия("ПроверитьЗаполненностьОбязательныхРеквизитов");
	
	ФункциональныеОпции = ИС_WB_СерверПовтИсп.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);

	//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	АктивныйЗаказКлиента = ПолучитьАктивныйЗаказКлиента(Профиль);
	
	Если АктивныйЗаказКлиента <> Неопределено Тогда	
		ФункциональныеОпции.Вставить("АктивныйЗаказКлиента", АктивныйЗаказКлиента);	
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	
	Результат = Истина;
	
	Если ФункциональныеОпции.Количество() = 0 Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Сообщение = "Не заполнены параметры Профиля: ";
	
	Если Не ЗначениеЗаполнено(ФункциональныеОпции.Организация) Тогда
		Сообщение = Сообщение + "Организация; ";
		Результат = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФункциональныеОпции.Партнер) Тогда
		Сообщение = Сообщение + "Партнер; ";
		Результат = Ложь;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 25.04.2023 УА #58008
	Если Константы.ИспользоватьСоглашенияСКлиентами.Получить() Тогда	
		Если Не ЗначениеЗаполнено(ФункциональныеОпции.Соглашение) Тогда
			Сообщение = Сообщение + "Соглашение; ";
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	Если Константы.ИспользоватьДоговорыСКлиентами.Получить() Тогда
		Если Не ЗначениеЗаполнено(ФункциональныеОпции.Договор) Тогда
			Сообщение = Сообщение + "Договор; ";
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Константы.ИспользоватьРасширенныеВозможностиЗаказаКлиента.Получить() Тогда
		Если Не ЗначениеЗаполнено(ФункциональныеОпции.СтатусЗаказаКлиента) Тогда
			Сообщение = Сообщение + "Статус Заказа Клиента; ";
			Результат = Ложь;
		КонецЕсли;  
	КонецЕсли;
	
	Если Константы.ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента.Получить() Тогда
		Если Не ЗначениеЗаполнено(ФункциональныеОпции.ВариантОбеспечения) Тогда
			Сообщение = Сообщение + "Вариант Обеспечения; ";
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 25.04.2023 УА #58008
	
	Если Не Результат Тогда
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Сообщение);
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции //- ИнфоСофт Ивонин К.А. 29.03.23 УА #55822

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Функция ПолучитьИмяСобытия(Имя)
	Возврат СтрШаблон("ИС.МП.ИС_WB_Сервер.%1", Имя);
КонецФункции //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

//+ ИнфоСофт Мурсалимов Д.Р. 16.12.24 УА #67818
Функция ПолучитьТекстЗапросаОК() Экспорт 
	
	Текст =
	"ВЫБРАТЬ
	|	ДанныеТЗ.Баркод КАК Баркод,
	|	ДанныеТЗ.Название КАК Название,
	|	ДанныеТЗ.Количество КАК Количество,
	|	ДанныеТЗ.ЦенаРозничная КАК ЦенаРозничная,
	|	ДанныеТЗ.СуммаПродажи КАК СуммаПродажи,
	|	ДанныеТЗ.ЦенаПродажи КАК ЦенаПродажи,
	|	ДанныеТЗ.Код КАК Код,
	|	ДанныеТЗ.Номер КАК Номер,
	|	ДанныеТЗ.Артикул КАК Артикул,
	|	ДанныеТЗ.РазмерПоставщика КАК РазмерПоставщика
	|ПОМЕСТИТЬ ВТ_ДанныеПродаж
	|ИЗ
	|	&ДанныеТЗ КАК ДанныеТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПродаж.Баркод КАК Баркод,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_ШтрихкодыРазмеров.Размер, ЗНАЧЕНИЕ(Справочник.ИС_WB_РазмерыНоменклатур.ПустаяСсылка))) КАК Размер
	|ПОМЕСТИТЬ ВТ_Размеры
	|ИЗ
	|	ВТ_ДанныеПродаж КАК ВТ_ДанныеПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО ВТ_ДанныеПродаж.Баркод = ИС_WB_ШтрихкодыРазмеров.Штрихкод
	|			И (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПродаж.Баркод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Размеры.Баркод КАК Баркод,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК Характеристика,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЭтоНабор,
	|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL
	|					ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель = 0
	|				ТОГДА 1
	|			ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель
	|		КОНЕЦ / ВЫБОР
	|			КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL
	|					ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель = 0
	|				ТОГДА 1
	|			ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель
	|		КОНЕЦ) КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	ВТ_Размеры КАК ВТ_Размеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ВТ_Размеры.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
	|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Размеры.Баркод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Размеры.Размер КАК Размер,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка,
	|	ВТ_Сопоставление.КоэффициентУпаковки КАК КоэффициентУпаковки,
	|	ВТ_ДанныеПродаж.ЦенаРозничная КАК ЦенаРозничная,
	|	ВТ_ДанныеПродаж.Название КАК Название,
	|	ВТ_ДанныеПродаж.СуммаПродажи КАК СуммаПродажи,
	|	ВТ_ДанныеПродаж.ЦенаПродажи КАК ЦенаПродажи,
	|	ВТ_ДанныеПродаж.Номер КАК Номер,
	|	ВТ_ДанныеПродаж.Баркод КАК Баркод,
	|	ВТ_ДанныеПродаж.Артикул КАК Артикул,
	|	ВТ_ДанныеПродаж.РазмерПоставщика КАК РазмерПоставщика,
	|	ВТ_ДанныеПродаж.Код КАК Код,
	|	ВТ_ДанныеПродаж.Количество КАК Количество
	|ИЗ
	|	ВТ_ДанныеПродаж КАК ВТ_ДанныеПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Размеры КАК ВТ_Размеры
	|		ПО ВТ_ДанныеПродаж.Баркод = ВТ_Размеры.Баркод
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ПО ВТ_ДанныеПродаж.Баркод = ВТ_Сопоставление.Баркод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
	Возврат Текст;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 16.12.24 УА #67818

//+ ИнфоСофт Сумин Д.В. 02.03.23 УА #55086
Функция СоздатьОтчетКомиссионера(Данные, Профиль, ЗаголовокСтруктура) Экспорт
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
    КонецЕсли;
    
    Возврат ОбщийМодуль.СоздатьОтчетКомиссионера(Данные, Профиль, ЗаголовокСтруктура);	
КонецФункции //- ИнфоСофт Сумин Д.В. 02.03.23 УА #55086	 

//+ ИнфоСофт Сумин Д.В. 03.03.23 УА #55086
Функция СоздатьДокументРеализацияУслуг(Профиль, СуммаБрака, ЗаголовокСтруктура) Экспорт
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.СоздатьДокументРеализацияУслуг(Профиль, СуммаБрака, ЗаголовокСтруктура);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 03.03.23 УА #55086	

//+ ИнфоСофт Стояк Ю.К. 05.05.2023 УА #58008
Функция СоздатьДокументПриобретенияУслуг(Профиль, СуммаБрака, ЗаголовокСтруктура) Экспорт
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.СоздатьДокументПриобретенияУслуг(Профиль, СуммаБрака, ЗаголовокСтруктура);
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 05.05.2023 УА #58008

//+ Инфософт Бычихин В.С. 14.12.2020
Функция РассчитатьСуммуНДС(Сумма, СтавкаНДС, СуммаВключаетНДС = Истина) Экспорт
	
	Если СуммаВключаетНДС Тогда
		СуммаНДС = Окр(Сумма - 100 * Сумма / (100 + СтавкаНДС), 2, РежимОкругления.Окр15как20);
	Иначе
		СуммаНДС = Окр(Сумма * СтавкаНДС / 100, 2, РежимОкругления.Окр15как20);
	КонецЕсли;
	
	Возврат СуммаНДС;
	
КонецФункции //- Инфософт Бычихин В.С. 14.12.2020

//+ ИнфоСофт Ивонин К.А. 21.07.21 УА #36708
// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект
// см. ОбщегоНазначения.ЗначениеРеквизитаОбъекта()
// Если полученное значение не имеет тип булево, возвращается значение Ложь.
//
Функция ЗначениеРеквизитаОбъектаТипаБулево(Ссылка, ИмяРеквизита) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	Если ТипЗнч(Результат) <> Тип("Булево") Тогда
		Результат = Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);	
	
	Возврат Результат
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.07.21 УА #36708

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
Функция СоздатьДокументПриобретения(Профиль, ДанныеДокумента, ЗаголовокСтруктура) Экспорт 
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
	Если ОбщийМодуль = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.СоздатьДокументПриобретения(Профиль, ДанныеДокумента, ЗаголовокСтруктура);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086	

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
Функция СоздатьДокументВзаимозачетЗадолженности(Профиль, ДокументПриобретения, ДокументОтчет) Экспорт 
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
	Если ОбщийМодуль = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.СоздатьДокументВзаимозачетЗадолженности(Профиль, ДокументПриобретения, ДокументОтчет);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
Функция СоздатьДокументВозвратТоваров(Профиль, ДанныеДокумента, ЗаголовокСтруктура, КомиссионнаяОперация, ПараметрыСебестоимости = Неопределено, Основание = Неопределено) Экспорт 
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
	Если ОбщийМодуль = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.СоздатьДокументВозвратТоваров(Профиль, ДанныеДокумента, ЗаголовокСтруктура, КомиссионнаяОперация, ПараметрыСебестоимости, Основание);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086	

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
Функция ПолучитьРезультирующиюТаблицуИнПродаж(Данные, Профиль) Экспорт 
	
	ТаблицаЗначенийРезультирующая = Новый ТаблицаЗначений;
	
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("НоменклатураWB", Новый ОписаниеТипов("СправочникСсылка.ИС_WB_Номенклатура"));			
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Баркод", Новый ОписаниеТипов("Строка"));
	//+ ИнфоСофт Стояк Ю.К. 07.09.2023 УА #62429	
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Название", Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	//- ИнфоСофт Стояк Ю.К. 07.09.2023 УА #62429
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("КПеречислениюПродавцуЗаРеализованныйТовар", Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("ВайлдберризРеализовалТовар_Пр_", Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("РазмерыНоменклатурWB", Новый ОписаниеТипов("СправочникСсылка.ИС_WB_РазмерыНоменклатур"));
	//+ ИнфоСофт Сумин Д.В. 29.05.23 УА #59046
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	//- ИнфоСофт Сумин Д.В. 29.05.23 УА #59046
	//+ ИнфоСофт Стояк Ю.К. 31.08.2023 УА #61879
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Код", Новый ОписаниеТипов("Число"));
	//- ИнфоСофт Стояк Ю.К. 31.08.2023 УА #61879
	//+ ИнфоСофт Сумин Д.В. 02.11.2023 УА #64784
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("УслугиПоДоставкеТовараПокупателю", Новый ОписаниеТипов("Число"));
	//- ИнфоСофт Сумин Д.В. 02.11.2023 УА #64784
	//+ ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("РазмерПоставщика", Новый ОписаниеТипов("Строка"));
	//- ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
	
	Для Каждого Строка Из Данные Цикл		
		НоваяСтрока = ТаблицаЗначенийРезультирующая.Добавить();
		НоваяСтрока.Баркод = Строка.Баркод;
		НоваяСтрока.Количество = Число(Строка.Кол_во);
		НоваяСтрока.Код = Строка.КодНоменклатуры;
		НоваяСтрока.КПеречислениюПродавцуЗаРеализованныйТовар = Число(Строка.КПеречислениюПродавцуЗаРеализованныйТовар); 
		НоваяСтрока.ВайлдберризРеализовалТовар_Пр_ = Число(Строка.ВайлдберризРеализовалТовар_Пр_);	   	 
		//+ ИнфоСофт Стояк Ю.К. 06.09.2023 УА #62429
		НоваяСтрока.Название = Строка.Название;
		НоваяСтрока.Номер = Строка._;
		//- ИнфоСофт Стояк Ю.К. 06.09.2023 УА #62429
		//+ ИнфоСофт Сумин Д.В. 02.11.2023 УА #64784
		НоваяСтрока.УслугиПоДоставкеТовараПокупателю = Число(Строка.УслугиПоДоставкеТовараПокупателю);
		//- ИнфоСофт Сумин Д.В. 02.11.2023 УА #64784
		//+ ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
		НоваяСтрока.Артикул = Строка.АртикулПоставщика;
		НоваяСтрока.РазмерПоставщика = Строка.Размер;
		//- ИнфоСофт Мурсалимов Д.Р. 14.12.23 УА #64799
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	//+ ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ДанныеТЗ.Баркод КАК СТРОКА(50)) КАК Баркод,
	|	ВЫРАЗИТЬ(ДанныеТЗ.Название КАК СТРОКА(100)) КАК Название,
	|	ВЫРАЗИТЬ(ДанныеТЗ.Количество КАК ЧИСЛО(15, 2)) КАК Количество,
	|	ВЫРАЗИТЬ(ДанныеТЗ.Код КАК ЧИСЛО(15, 2)) КАК Код,
	|	ВЫРАЗИТЬ(ДанныеТЗ.Номер КАК СТРОКА(50)) КАК Номер,
	|	ВЫРАЗИТЬ(ДанныеТЗ.УслугиПоДоставкеТовараПокупателю КАК ЧИСЛО(15, 2)) КАК УслугиПоДоставкеТовараПокупателю,
	|	ВЫРАЗИТЬ(ДанныеТЗ.КПеречислениюПродавцуЗаРеализованныйТовар КАК ЧИСЛО(15, 2)) КАК КПеречислениюПродавцуЗаРеализованныйТовар,
	|	ВЫРАЗИТЬ(ДанныеТЗ.ВайлдберризРеализовалТовар_Пр_ КАК ЧИСЛО(15, 2)) КАК ВайлдберризРеализовалТоварПр,
	|	ВЫРАЗИТЬ(ДанныеТЗ.Артикул КАК СТРОКА(50)) КАК Артикул,
	|	ВЫРАЗИТЬ(ДанныеТЗ.РазмерПоставщика КАК СТРОКА(50)) КАК РазмерПоставщика
	|ПОМЕСТИТЬ ВТ_ДанныеТЗ
	|ИЗ
	|	&ДанныеТЗ КАК ДанныеТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеТЗ.Баркод КАК Баркод,
	|	МАКСИМУМ(ВТ_ДанныеТЗ.Артикул) КАК Артикул,
	|	МАКСИМУМ(ВТ_ДанныеТЗ.РазмерПоставщика) КАК РазмерПоставщика,
	|	МАКСИМУМ(ВТ_ДанныеТЗ.Название) КАК Название,
	|	СУММА(ВТ_ДанныеТЗ.Количество) КАК Количество,
	|	МАКСИМУМ(ВТ_ДанныеТЗ.Код) КАК Код,
	|	МАКСИМУМ(ВТ_ДанныеТЗ.Номер) КАК Номер,
	|	СУММА(ВТ_ДанныеТЗ.ВайлдберризРеализовалТоварПр) КАК ВайлдберризРеализовалТоварПр,
	|	СУММА(ВТ_ДанныеТЗ.КПеречислениюПродавцуЗаРеализованныйТовар - ВТ_ДанныеТЗ.УслугиПоДоставкеТовараПокупателю) КАК КПеречислениюПродавцуЗаРеализованныйТовар
	|ПОМЕСТИТЬ ВТ_ГруппировкаСумма
	|ИЗ
	|	ВТ_ДанныеТЗ КАК ВТ_ДанныеТЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеТЗ.Баркод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГруппировкаСумма.Количество КАК Количество,
	|	ВТ_ГруппировкаСумма.КПеречислениюПродавцуЗаРеализованныйТовар КАК КПеречислениюПродавцуЗаРеализованныйТовар,
	|	ВТ_ГруппировкаСумма.ВайлдберризРеализовалТоварПр КАК ВайлдберризРеализовалТоварПр,
	|	ЕСТЬNULL(ИС_WB_ШтрихкодыРазмеров.Размер, ЗНАЧЕНИЕ(Справочник.ИС_WB_РазмерыНоменклатур.ПустаяСсылка)) КАК Размер,
	|	ИС_WB_ШтрихкодыРазмеров.Профиль КАК Профиль,
	|	ВТ_ГруппировкаСумма.Баркод КАК Баркод,
	|	ВТ_ГруппировкаСумма.Название КАК Название,
	|	ВТ_ГруппировкаСумма.Номер КАК Номер,
	|	ВТ_ГруппировкаСумма.Код КАК Код,
	|	ВТ_Упаковка.Упаковка КАК Упаковка,
	|	ВТ_ГруппировкаСумма.Артикул КАК Артикул,
	|	ВТ_ГруппировкаСумма.РазмерПоставщика КАК РазмерПоставщика
	|ПОМЕСТИТЬ ВТ_Размер
	|ИЗ
	|	ВТ_ГруппировкаСумма КАК ВТ_ГруппировкаСумма
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО (ВТ_ГруппировкаСумма.Баркод = ИС_WB_ШтрихкодыРазмеров.Штрихкод)
	|			И (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
	|			И (ВТ_ГруппировкаСумма.Код = ИС_WB_ШтрихкодыРазмеров.Размер.Владелец.Код)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Упаковка КАК ВТ_Упаковка
	|		ПО (ВТ_ГруппировкаСумма.Баркод = ВТ_Упаковка.Баркод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Размер.Количество КАК Количество,
	|	ВТ_Размер.КПеречислениюПродавцуЗаРеализованныйТовар КАК КПеречислениюПродавцуЗаРеализованныйТовар,
	|	ВТ_Размер.ВайлдберризРеализовалТоварПр КАК ВайлдберризРеализовалТоварПр,
	|	ВТ_Размер.Размер КАК Размер,
	|	ВТ_Размер.Название КАК Название,
	|	ВТ_Размер.Номер КАК Номер,
	|	ВТ_Размер.Баркод КАК Баркод,
	|	ВТ_Размер.Артикул КАК Артикул,
	|	ВТ_Размер.РазмерПоставщика КАК РазмерПоставщика,
	|	ВТ_Размер.Код КАК Код,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоНабор,
	|	ИС_WB_СоответствиеРазмеров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель
	|	КОНЕЦ КАК КоэффициентУпаковки
	|ИЗ
	|	ВТ_Размер КАК ВТ_Размер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ВТ_Размер.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
	|			И ВТ_Размер.Профиль = ИС_WB_СоответствиеРазмеров.Профиль
	|ГДЕ
	|	ВТ_Размер.КПеречислениюПродавцуЗаРеализованныйТовар > 0";
	//- ИнфоСофт Мурсалимов Д.Р. 05.09.24 УА #82005
	
	Запрос.УстановитьПараметр("Профиль", 	Профиль);
	Запрос.УстановитьПараметр("ДанныеТЗ", 	ТаблицаЗначенийРезультирующая);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();	
	
КонецФункции //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086

//+ ИнфоСофт Сумин Д.В. 04.03.23 УА #55086
Функция СоздатьДокументРТУ(Профиль, ДанныеДокумента, ЗаголовокСтруктура, КомиссионнаяОперация) Экспорт  
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
	Если ОбщийМодуль = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.СоздатьДокументРТУ(Профиль, ДанныеДокумента, ЗаголовокСтруктура, КомиссионнаяОперация);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 04.03.23 УА #55086

//+ ИнфоСофт Макарова Н.Е. 11.04.2025 УА #94883 
Процедура ВыполнитьАлгоритмПоОсновнойСхемеFbo(Профиль) 
	
	// получение остатков ВБ
	Попытка
		ОстаткиFBO = ПолучитьИнфорамциюОбОстаткахFBO(Профиль); 
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ИС.WB.ВыполнениеАлгоритмаПоОсновнойСхемеFbo", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		Возврат;
	КонецПопытки;
	
	Если ОстаткиFBO.Количество() = 0 Тогда
		Текст = "Wildberries не предоставляет информацию по остаткам. Проверьте корректность токена статистики. Если токен корректный, необходимо обратиться в техническую поддержку Wildberries для уточнения сроков исправления неисправностей.";
		ЗаписьЖурналаРегистрации("ИС.WB.ВыполнениеАлгоритмаПоОсновнойСхемеFbo", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		Возврат;	
	КонецЕсли;	
	
	ОстаткиFBO.Свернуть("Штрихкод", "НаСкладе");
	
	МассивПараметров = ПолучитьСписокПараметровЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, МассивПараметров);
	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
	
	КоличествоОстаткаДляПереходаНаFBS = СтруктураЦен.КоличествоОстаткаДляПереходаНаFBS;
	ВидЦены    						  = СтруктураЦен.ВидЦены;
	ВидЦеныFBO 						  = СтруктураЦен.ВидЦеныFBO;
	ИспользоватьИзменениеЦенFboFbs 	  = СтруктураЦен.ИспользоватьИзменениеЦенFboFbs;
	
	// цены
	МассивДляУстановкиЦен = Новый Массив;	
	
	Для Каждого Элемент Из ОстаткиFBO Цикл
		
		Если ИспользоватьИзменениеЦенFboFbs И Элемент.НаСкладе > КоличествоОстаткаДляПереходаНаFBS Тогда
			МассивДляУстановкиЦен.Добавить(Элемент.Штрихкод); 
		КонецЕсли;
			
	КонецЦикла;	
	
	Если ИспользоватьИзменениеЦенFboFbs Тогда
		Если МассивДляУстановкиЦен.Количество() > 0 И НЕ ВидЦеныFBO = Справочники.ВидыЦен.ПустаяСсылка() Тогда	
			ПерезаписатьЦеныWBПоМассивуШтихкодов(Профиль, МассивДляУстановкиЦен, ВидЦеныFBO);	
		КонецЕсли;		
	КонецЕсли;
	
	// остатки
	ЗапросСклады = Новый Запрос;
	ЗапросСклады.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИС_ВБ_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
	|ГДЕ
	|	ИС_ВБ_Склады.Профиль = &Профиль
	|	И ИС_ВБ_Склады.ЗагруженИзЛК";
	
	ЗапросСклады.УстановитьПараметр("Профиль", Профиль);
	РезультатЗапросаСклады = ЗапросСклады.Выполнить();
	
	Если РезультатЗапросаСклады.Пустой() Тогда
		Текст = "В информационной базе не найден ни один склад fbs. Выполните загрузку складов.";
		ЗаписьЖурналаРегистрации("ИС.WB.ВыполнениеАлгоритмаПоОсновнойСхемеFbo", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		Возврат;	
	КонецЕсли;
	
	ВыборкаСклады = РезультатЗапросаСклады.Выбрать();
	
	МассивСкладов = Новый Массив;
	
	Пока ВыборкаСклады.Следующий() Цикл
		
		МассивСкладов.Добавить(ВыборкаСклады.Ссылка);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиFBO.НаСкладе КАК НаСкладе,
	|	ОстаткиFBO.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	&ОстаткиFBO КАК ОстаткиFBO
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_ШтрихкодыРазмеров.Размер КАК Размер,
	|	ИС_ВБ_Склады.Ссылка КАК Склад
	|ИЗ
	|	РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ИС_WB_ШтрихкодыРазмеров.Штрихкод = ВТ_Остатки.Штрихкод,
	|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
	|ГДЕ
	|	ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль
	|	И ИС_ВБ_Склады.Ссылка В(&МассивСкладов)
	|	И ВЫБОР
	|			КОГДА ИС_ВБ_Склады.КоличествоОстаткаДляПереходаНаFBS > 0
	|				ТОГДА ВТ_Остатки.НаСкладе > ИС_ВБ_Склады.КоличествоОстаткаДляПереходаНаFBS
	|			ИНАЧЕ ВТ_Остатки.НаСкладе > ИС_ВБ_Склады.КоличествоОстаткаДляПереходаНаFBS
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_ШтрихкодыРазмеров.Размер,
	|	ИС_ВБ_Склады.Ссылка
	|ИТОГИ ПО
	|	Склад";
	
	Запрос.УстановитьПараметр("ТЗ_Остатки", ОстаткиFBO);
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Склад");
	
	Пока ВыборкаСклад.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ИС_MP_РучныеОстатки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Профиль.Установить(Профиль);
		НаборЗаписей.Отбор.Маркетплейс.Установить(Перечисления.ИС_МП_Маркетплейсы.ВБ);
		НаборЗаписей.Отбор.Склад.Установить(ВыборкаСклад.Склад);
		НаборЗаписей.Записать();
	
		ВыборкаДетальныеЗаписи = ВыборкаСклад.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ИС_МП_УправлениеОстатками.ЗаписатьРучнойОстаток(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, ВыборкаСклады.Ссылка, ВыборкаДетальныеЗаписи.Размер, 0);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Макарова Н.Е. 11.04.2025 УА #94883	 

//+ ИнфоСофт Сумин Д.В. 30.06.2023 УА #60267
Функция СтрокаВЧисло(Знач Значение) Экспорт
	
	Значение  = СтрЗаменить(Значение, " ", "");
	Если СтрНачинаетсяС(Значение, "(") Тогда
		Значение = СтрЗаменить(Значение, "(", "-");
		Значение = СтрЗаменить(Значение, ")", "");
	КонецЕсли; 
	
	Значение = СтрЗаменить(Значение, "руб.", ""); 
	Значение = СтрЗаменить(Значение, ".", "");
	
	СтрокаБезНулей = СтрЗаменить(Значение, "0", "");
	Если ПустаяСтрока(СтрокаБезНулей) Или СтрокаБезНулей = "-" Тогда
		Возврат 0;
	КонецЕсли;
	
	ТипЧисло  = Новый ОписаниеТипов("Число");
	Результат = ТипЧисло.ПривестиЗначение(Значение);
	
	Возврат ?(Результат <> 0 И Не ПустаяСтрока(СтрокаБезНулей), Результат, Неопределено);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 30.06.2023 УА #60267

//+ ИнфоСофт Ивонин К.А. 30.10.23 УА #61512
Процедура ЗаполчитьКэшПараметров(Кэш, Исключения)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_ПараметрыОтчетовРеализации.Ссылка КАК Ссылка,
	|	ИС_WB_ПараметрыОтчетовРеализации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ИС_WB_ПараметрыОтчетовРеализации КАК ИС_WB_ПараметрыОтчетовРеализации
	|ГДЕ
	|	ИС_WB_ПараметрыОтчетовРеализации.ПометкаУдаления = ЛОЖЬ
	|	И ИС_WB_ПараметрыОтчетовРеализации.Исключать";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИсключения = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаИсключения.Следующий() Цикл
		Исключения.Вставить(ВыборкаИсключения.Наименование, ВыборкаИсключения.Ссылка);		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_ПараметрыОтчетовРеализации.Ссылка КАК Ссылка,
	|	ИС_WB_ПараметрыОтчетовРеализации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ИС_WB_ПараметрыОтчетовРеализации КАК ИС_WB_ПараметрыОтчетовРеализации
	|ГДЕ                                          
	|	ИС_WB_ПараметрыОтчетовРеализации.ПометкаУдаления = ЛОЖЬ
	|	И ИС_WB_ПараметрыОтчетовРеализации.Исключать = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКэш = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаКэш.Следующий() Цикл
		Кэш.Вставить(ВыборкаКэш.Наименование, ВыборкаКэш.Ссылка);		
	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.10.23 УА #61512

//+ ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163
Функция Комплектующие(Параметры, ДополнительныеПараметры) Экспорт 
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
	Если ОбщийМодуль = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.Комплектующие(Параметры, ДополнительныеПараметры);
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163

//+ ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107
Функция СоздатьИлиОбновитьНомерациюОтчета(СтруктураДанных)
	
	ЭлементСправочника = Справочники.ИС_WB_НомерацияОтчетовОПродажах.НайтиПоРеквизиту("НомерОтчета", СтруктураДанных.ДанныеОтчета.НомерОтчета);
	
	Если Не ЗначениеЗаполнено(ЭлементСправочника) Тогда
		ЭлементСправочника = Справочники.ИС_WB_НомерацияОтчетовОПродажах.СоздатьЭлемент();
	Иначе
		ЭлементСправочника = ЭлементСправочника.ПолучитьОбъект();	
	КонецЕсли;
	
	ЭлементСправочника.Профиль		  = СтруктураДанных.Профиль;
	ЭлементСправочника.Наименование   = СтруктураДанных.ДанныеОтчета.Комментарий;
	ЭлементСправочника.НомерОтчета    = СтруктураДанных.ДанныеОтчета.НомерОтчета;
	ЭлементСправочника.ДатаНачала     = СтруктураДанных.ДанныеОтчета.НачалоПериода;
	ЭлементСправочника.ДатаОкончания  = СтруктураДанных.ДанныеОтчета.КонецПериода; 
	
	Если СтруктураДанных.ДанныеОтчета.РоссийскиеПродажи Тогда
		ВидОтчета = Перечисления.ИС_WB_ВидыОтчетов.Российский;	
	Иначе
		ВидОтчета = Перечисления.ИС_WB_ВидыОтчетов.Иностранный;	
	КонецЕсли;	
	
	ЭлементСправочника.ВидОтчета = ВидОтчета;
	
	//Заполнение данных по услугам	
	Если СтруктураДанных.ДанныеУслуг <> Неопределено Тогда
		//+ ИнфоСофт Сумин Д.В. 27.02.2024 УА #73531	
		ЭлементСправочника.ДополнительнаяИнформация.Очистить(); 
		//- ИнфоСофт Сумин Д.В. 27.02.2024 УА #73531
		Для Каждого Элемент Из СтруктураДанных.ДанныеУслуг Цикл
			
			НоваяСтрока = ЭлементСправочника.ДополнительнаяИнформация.Добавить();
			
			Если Элемент.Свойство("Наименование") Тогда
				
				//+ ИнфоСофт Мурсалимов Д.Р. 27.05.24 УА #76549
				Услуга = Справочники.ИС_WB_НаименованиеУслугИзОтчетаWildberries.НайтиПоНаименованию(Элемент.Наименование);
	
				Если Услуга.Пустая() Тогда
					Услуга = Справочники.ИС_WB_НаименованиеУслугИзОтчетаWildberries.СоздатьЭлемент();
				Иначе
					Услуга = Услуга.ПолучитьОбъект();
				КонецЕсли;
				
				НоваяСтрока.Услуга = Услуга;
				//- ИнфоСофт Мурсалимов Д.Р. 27.05.24 УА #76549
						
			КонецЕсли;
			
			Если Элемент.Свойство("Сумма") Тогда
				НоваяСтрока.Сумма = Элемент.Сумма;		
			КонецЕсли;
			
			Если Элемент.Свойство("ТипДокумента") Тогда
				НоваяСтрока.ТипДокумента = Элемент.ТипДокумента;		
			КонецЕсли;
			
			Если Элемент.Свойство("ОбоснованиеДляОплаты") Тогда
				НоваяСтрока.ОбоснованиеДляОплаты = Элемент.ОбоснованиеДляОплаты;		
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
	
	ЭлементСправочника.Записать(); 
	
	Возврат ЭлементСправочника.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107 

//+ ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107
Функция ОбработатьДанныеОПродажах(ДанныеПродаж) Экспорт
		
	НомерОтчета = СоздатьИлиОбновитьНомерациюОтчета(ДанныеПродаж.СтруктураДанных); 
	
	ПроверитьИлиСоздатьПараметрыОтчетов(ДанныеПродаж.СтруктураДанных.Детализация);
	
	СтруктураДанных = Новый Структура;	
	СтруктураДанных.Вставить("Детализация", ДанныеПродаж.СтруктураДанных.Детализация);
	СтруктураДанных.Вставить("НомерОтчета", НомерОтчета);
	СтруктураДанных.Вставить("Профиль", ДанныеПродаж.СтруктураДанных.Профиль);
	
	Возврат ЗаписатьДанныеПродаж(СтруктураДанных);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107	

//+ ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107
Процедура ПроверитьИлиСоздатьПараметрыОтчетов(Детализация)
	
	НаименованиеКолонок = Новый ТаблицаЗначений; 
	НаименованиеКолонок.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	
	Для Каждого Элемент Из Детализация.Колонки Цикл 
		НоваяСтрока = НаименованиеКолонок.Добавить();
		НоваяСтрока.ИмяКолонки = Элемент.Имя;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаименованиеКолонок.ИмяКолонки КАК ИмяКолонки
	|ПОМЕСТИТЬ ВТ_НаименованияКолонок
	|ИЗ
	|	&НаименованиеКолонок КАК НаименованиеКолонок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НаименованияКолонок.ИмяКолонки КАК ИмяКолонки,
	|	ЕСТЬNULL(ИС_WB_ПараметрыОтчетовОПродажах.Наименование, 0) КАК ЕстьВБазе
	|ПОМЕСТИТЬ ВТ_Результирующая
	|ИЗ
	|	ВТ_НаименованияКолонок КАК ВТ_НаименованияКолонок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_ПараметрыОтчетовОПродажах КАК ИС_WB_ПараметрыОтчетовОПродажах
	|		ПО ВТ_НаименованияКолонок.ИмяКолонки = ИС_WB_ПараметрыОтчетовОПродажах.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результирующая.ИмяКолонки КАК ИмяКолонки
	|ИЗ
	|	ВТ_Результирующая КАК ВТ_Результирующая
	|ГДЕ
	|	ВТ_Результирующая.ЕстьВБазе = 0";
	
	Запрос.УстановитьПараметр("НаименованиеКолонок", НаименованиеКолонок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоздатьПараметрОтчетаОПродажах(ВыборкаДетальныеЗаписи.ИмяКолонки);	
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107
Процедура СоздатьПараметрОтчетаОПродажах(ИмяКолонки)
	ЭлементСправочника = Справочники.ИС_WB_ПараметрыОтчетовОПродажах.СоздатьЭлемент();
	ЭлементСправочника.Наименование = ИмяКолонки;
	ЭлементСправочника.Записать();
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107
Функция ЗаписатьДанныеПродаж(СтруктураДанных)
	
	Событие = ПолучитьИмяСобытия("ЗаписатьДанныеПродаж");
	
	Профиль = СтруктураДанных.Профиль; 
	НомерОтчета = СтруктураДанных.НомерОтчета; 
	Детализация = СтруктураДанных.Детализация;
	
	НачатьТранзакцию();
	
	Попытка
						
		ПараметрыОтчета = ПолучитьПараметрыОтчета();
		
		Для Каждого Элемент Из ПараметрыОтчета Цикл
			
			Если Детализация.Колонки.Найти(Элемент.Наименование) = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			    
			НаборЗаписей = РегистрыСведений.ИС_WB_ДанныеОтчетовОПродажах.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Профиль.Установить(Профиль); 
			НаборЗаписей.Отбор.НомерОтчета.Установить(НомерОтчета);
			НаборЗаписей.Отбор.Параметр.Установить(Элемент.Параметр);
		   
		   	СтрокаНомер = 0;
		    
		    Для Каждого Строка Из Детализация Цикл

				НоваяЗапись = НаборЗаписей.Добавить(); 
				
				НоваяЗапись.Профиль = Профиль;
				НоваяЗапись.НомерОтчета = НомерОтчета;
				НоваяЗапись.Параметр = Элемент.Параметр;
				НоваяЗапись.ЗначениеПараметра = Строка[Элемент.Наименование];
				НоваяЗапись.СтрокаНомер = СтрокаНомер; 
				
				СтрокаНомер = СтрокаНомер + 1; 
			
			КонецЦикла; 
			
			НаборЗаписей.Записать();
					
		КонецЦикла; 
		
		ЗафиксироватьТранзакцию(); 
		
		Результат = Новый Структура;
		
		Результат.Вставить("НомерСтраницы", 1);
		
		Возврат Результат; 
		
	Исключение
	
		ОтменитьТранзакцию();
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		Возврат Неопределено;

	КонецПопытки;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107

//+ ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107
Функция ПолучитьПараметрыОтчета()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_ПараметрыОтчетовОПродажах.Наименование КАК Наименование,
	|	ИС_WB_ПараметрыОтчетовОПродажах.Ссылка КАК Параметр
	|ИЗ
	|	Справочник.ИС_WB_ПараметрыОтчетовОПродажах КАК ИС_WB_ПараметрыОтчетовОПродажах";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ДанныеПараметра = Новый Структура;
		ДанныеПараметра.Вставить("Наименование", Выборка.Наименование);
		ДанныеПараметра.Вставить("Параметр", Выборка.Параметр);
		
		Результат.Добавить(ДанныеПараметра);  
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 27.02.2024 УА #71107

//+ ИнфоСофт Заварин К.В. 01.04.24 УА #67778
Процедура ОтменитьЗаказ(Заказ, Профиль) Экспорт 
	
	Событие = ПолучитьИмяСобытия("ОтменитьЗаказ");
	
	ФункциональныеОпции = ИС_WB_СерверПовтИсп.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	АктивныйЗаказКлиента = ПолучитьАктивныйЗаказКлиента(Профиль);
	
	Если АктивныйЗаказКлиента <> Неопределено Тогда
		ФункциональныеОпции.Вставить("АктивныйЗаказКлиента", АктивныйЗаказКлиента);	
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	
	Если ФункциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81140	
	//Если ФункциональныеОпции.РежимСозданияЗаказов > 0 Тогда
	//	Возврат;
	//КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81140
	
	Если Не ФункциональныеОпции.УдалятьРТУ Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьПричины = Ложь;
	
	Если Константы.ИспользоватьПричиныОтменыЗаказовКлиентов.Получить() Тогда
		ИспользоватьПричины = Истина;
		Если Не ЗначениеЗаполнено(ФункциональныеОпции.ПричинаОтмены) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ПередачаТоваровХранителю.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ИС_WB_СборочноеЗадание.Заказ = ПередачаТоваровХранителю.ЗаказКлиента
	|			И (НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И ИС_WB_СборочноеЗадание.Ссылка = &Ссылка 
	|	И НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка,
	|	ПередачаТоваровХранителюТовары.Ссылка
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО ИС_WB_СборочноеЗадание.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента
	|			И (НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И ИС_WB_СборочноеЗадание.Ссылка = &Ссылка
	|	И НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка,
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ИС_WB_СборочноеЗадание.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
	|			И (НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И ИС_WB_СборочноеЗадание.Ссылка = &Ссылка
	|	И НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка,
	|			РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ИС_WB_СборочноеЗадание.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
	|			И (НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И ИС_WB_СборочноеЗадание.Ссылка = &Ссылка
	|	И НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВТ_Реализации.Реализация) КАК Реализация,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_КоличествоРеализаций
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Ссылка
	|;
	|
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК РасходныйОрдер
	|ПОМЕСТИТЬ ВТ_РасходныйОрдер1
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание 
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ПО (ИС_WB_СборочноеЗадание.Заказ = (ВЫРАЗИТЬ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Документ.ЗаказКлиента))) 
	|			И (НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(Документ.Заказклиента.ПустаяСсылка))
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И ИС_WB_СборочноеЗадание.Ссылка = &Ссылка
	|	И НЕ ИС_WB_СборочноеЗадание.Заказ = ЗНАЧЕНИЕ(документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасходныйОрдер1.Ссылка КАК Ссылка,
	|	ВТ_РасходныйОрдер1.РасходныйОрдер КАК РасходныйОрдер,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) КАК РазличныхРаспоряжений
	|ПОМЕСТИТЬ ВТ_РасходныйОрдер
	|ИЗ
	|	ВТ_РасходныйОрдер1 КАК ВТ_РасходныйОрдер1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ПО ВТ_РасходныйОрдер1.РасходныйОрдер = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
    |
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасходныйОрдер1.Ссылка,
	|	ВТ_РасходныйОрдер1.РасходныйОрдер
	|;
	|
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ДокументИС_WB_СборочноеЗадание.ПометкаУдаления КАК ПометкаУдаления,
	|	ДокументИС_WB_СборочноеЗадание.Заказ КАК Заказ1С,
	|	ВТ_КоличествоРеализаций.Реализация КАК РТУ,      
	//+ ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81140	
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
	|	ИС_WB_СоответствиеРазмеров.Упаковка КАК Упаковка,               
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,		
	|	ДокументИС_WB_СборочноеЗадание.convertedPrice КАК convertedPrice,
	//- ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81140
	//+ ИнфоСофт Стояк Ю.К. 03.09.2024 УА #82955
	|	NULL КАК НоменклатураВНаборе,
	|	NULL КАК ХарактеристикаНабора,
	|	NULL КАК Количество,
	//- ИнфоСофт Стояк Ю.К. 03.09.2024 УА #82955
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|	ВТ_РасходныйОрдер.РасходныйОрдер КАК РасходныйОрдер,
	|   ВТ_РасходныйОрдер.РазличныхРаспоряжений КАК РазличныхРаспоряжений
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ДокументИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_СоответствиеРазмеров.РазмерWB = ДокументИС_WB_СборочноеЗадание.РазмерWB)
	|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО ДокументИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	|			И (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Профиль = &Профиль)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоРеализаций КАК ВТ_КоличествоРеализаций
	|		ПО ДокументИС_WB_СборочноеЗадание.Ссылка = ВТ_КоличествоРеализаций.Ссылка
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныйОрдер КАК ВТ_РасходныйОрдер		
	|       ПО ДокументИС_WB_СборочноеЗадание.Ссылка = ВТ_РасходныйОрдер.Ссылка
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|ГДЕ
	|	ДокументИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И ДокументИС_WB_СборочноеЗадание.Ссылка = &Ссылка	
	//+ ИнфоСофт Стояк Ю.К. 03.09.2024 УА #82955
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДокументИС_WB_СборочноеЗадание.Ссылка,
	|	ДокументИС_WB_СборочноеЗадание.ПометкаУдаления,
	|	ДокументИС_WB_СборочноеЗадание.Заказ,
	|	ВТ_КоличествоРеализаций.Реализация,      
	|	ИС_WB_СоответствиеРазмеров.Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика,
	|	ИС_WB_СоответствиеРазмеров.Упаковка,               
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор),		
	|	ДокументИС_WB_СборочноеЗадание.convertedPrice,	
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество,
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|	ВТ_РасходныйОрдер.РасходныйОрдер КАК РасходныйОрдер,
	|   ВТ_РасходныйОрдер.РазличныхРаспоряжений КАК РазличныхРаспоряжений
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ДокументИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_СоответствиеРазмеров.РазмерWB = ДокументИС_WB_СборочноеЗадание.РазмерWB)
	|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль) 
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|			ПО (ИС_WB_СоответствиеРазмеров.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|					И ИС_WB_СоответствиеРазмеров.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО ДокументИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	|			И (ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Профиль = &Профиль)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоРеализаций КАК ВТ_КоличествоРеализаций
	|		ПО ДокументИС_WB_СборочноеЗадание.Ссылка = ВТ_КоличествоРеализаций.Ссылка
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныйОрдер КАК ВТ_РасходныйОрдер		
	|       ПО ДокументИС_WB_СборочноеЗадание.Ссылка = ВТ_РасходныйОрдер.Ссылка
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|ГДЕ
	|	ДокументИС_WB_СборочноеЗадание.Профиль = &Профиль
	|	И ДокументИС_WB_СборочноеЗадание.Ссылка = &Ссылка";
	//- ИнфоСофт Стояк Ю.К. 03.09.2024 УА #82955";
	
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//+ ИнфоСофт Стояк Ю.К. 11.10.2024 УА #84967		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РТУ) И ФункциональныеОпции.РежимСозданияЗаказов = 0 Тогда 
		//Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РТУ) И ФункциональныеОпции.УдалятьРТУ Тогда 
		//- ИнфоСофт Стояк Ю.К. 11.10.2024 УА #84967
			
			РТУ = ВыборкаДетальныеЗаписи.РТУ.ПолучитьОбъект();	
			
			Попытка	
				РТУ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение 
				
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				Возврат;
				
			КонецПопытки;
			
			РТУ.ПометкаУдаления = Истина; 			
			
			Попытка	
				РТУ.Записать();
			Исключение 
				
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				Возврат;
				
			КонецПопытки; 
			
		КонецЕсли;
		
		//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РасходныйОрдер)
			И ФункциональныеОпции.РежимСозданияЗаказов = 0 Тогда 
		
			РО = ВыборкаДетальныеЗаписи.РасходныйОрдер.ПолучитьОбъект();
	
			Если ВыборкаДетальныеЗаписи.РазличныхРаспоряжений = 1 Тогда   
				
				Попытка	
					РО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение 	
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
					Возврат;	
				КонецПопытки;
				
				РО.ПометкаУдаления = Истина;
				
				Попытка	
					РО.Записать();
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
					Возврат;	
				КонецПопытки; 	
				
			Иначе
				
				Отбор = Новый Структура(); 
				Отбор.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
				Отбор.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);
				
				НайденныеСтрокиОтгружаемые = РО.ОтгружаемыеТовары.НайтиСтроки(Отбор);
				
				Отбор.Вставить("Распоряжение", ВыборкаДетальныеЗаписи.Заказ1С);
				
				НайденныеСтрокиПоРаспоряжениям = РО.ТоварыПоРаспоряжениям.НайтиСтроки(Отбор);
				
				Если НайденныеСтрокиПоРаспоряжениям.Количество() > 0 Тогда
								
					РО.ТоварыПоРаспоряжениям.Удалить(НайденныеСтрокиПоРаспоряжениям[0]);
					
					НайденныеСтрокиОтгружаемые[0].Действие = 
					Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать;
						
					Попытка			
						РО.Записать(РежимЗаписиДокумента.Проведение);	
					Исключение 
						РО.Записать();			
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);	
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;							
			
		КонецЕсли;
		//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Заказ1С) Тогда
			
			Заказ1С = ВыборкаДетальныеЗаписи.Заказ1С.ПолучитьОбъект();
			Попытка
				Заказ1С.Заблокировать();    
			Исключение   
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, "Заказ " + Заказ1С.Ссылка + " заблокирован для изменения данных");     
				Продолжить;
			КонецПопытки;                               
			
			//+ ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81140			
			Если ФункциональныеОпции.РежимСозданияЗаказов <> 0 Тогда
				
				Если ВыборкаДетальныеЗаписи.ЭтоНабор Тогда
					Отбор = Новый Структура();							
					Отбор.Вставить("НоменклатураНабора", ВыборкаДетальныеЗаписи.Номенклатура);
					Отбор.Вставить("ХарактеристикаНабора", ВыборкаДетальныеЗаписи.Характеристика); 
					Отбор.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.НоменклатураВНаборе);
					Отбор.Вставить("Характеристика", ВыборкаДетальныеЗаписи.ХарактеристикаНабора);
					//+ ИнфоСофт Стояк Ю.К. 10.04.2025 УА #98469
					Отбор.Вставить("Количество", ВыборкаДетальныеЗаписи.Количество);
					//- ИнфоСофт Стояк Ю.К. 10.04.2025 УА #98469
					
					НайденныеСтроки = Заказ1С.Товары.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() > 0 Тогда	
											
						НайденныеСтроки[0].Отменено = Истина;
						Если ИспользоватьПричины Тогда		
							НайденныеСтроки[0].ПричинаОтмены = ФункциональныеОпции.ПричинаОтмены;	
						КонецЕсли;  
						
					КонецЕсли; 
					
				Иначе
					Отбор = Новый Структура();							
					Отбор.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					Отбор.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);					
					
					НайденныеСтроки = Заказ1С.Товары.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() > 0 Тогда 
						
						НайденныеСтроки[0].Отменено = Истина;
						Если ИспользоватьПричины Тогда		
							НайденныеСтроки[0].ПричинаОтмены = ФункциональныеОпции.ПричинаОтмены;	
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЕсли;                                                       
				
			Иначе 
				
				Для Каждого Товар Из Заказ1С.Товары Цикл
					Товар.Отменено = Истина;
					Если ИспользоватьПричины Тогда		
						Товар.ПричинаОтмены = ФункциональныеОпции.ПричинаОтмены;	
					КонецЕсли;	
				КонецЦикла;
				
			КонецЕсли; 			
			//Для Каждого Товар Из Заказ1С.Товары Цикл
			//	Товар.Отменено = Истина;
			//	Если ИспользоватьПричины Тогда		
			//		Товар.ПричинаОтмены = ФункциональныеОпции.ПричинаОтмены;	
			//	КонецЕсли;	
			//КонецЦикла;
			//- ИнфоСофт Стояк Ю.К. 09.08.2024 УА #81140
						
			ЗаказМП = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ЗаказМП.Заказ = Документы.ЗаказКлиента.ПустаяСсылка();
			
			Попытка
				ЗаказМП.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			КонецПопытки;
			
			Попытка	
				Заказ1С.Записать(РежимЗаписиДокумента.Проведение);
			Исключение 
				
				Заказ1С.Записать();			
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				
			КонецПопытки; 
			
		КонецЕсли;		
	
	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 01.04.24 УА #67778

//+ ИнфоСофт Заварин К.В. 14.08.24 УА #72696
Процедура ПерезаписатьЦеныWBПоМассивуШтихкодов(Профиль, МассивДляУстановкиЦен, ВидЦеныFBO)
	
	Настройки = ИС_WB_СерверПовтИсп.ПолучитьПараметрыВыгрузкиЦен(Профиль);
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ВБ;

	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаЦен(); 
	
	УстановитьПараметрыЗапросаЦен(Запрос, Профиль);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		
		Текст = "Ошибка получения цен.";
		ЗаписьЖурналаРегистрации("ИС.WB.ВыполнениеАлгоритмаПоОсновнойСхемеFbo", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		Возврат; 
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТаблицаВыгрузкиЦен = Новый ТаблицаЗначений;
	ТаблицаВыгрузкиЦен.Колонки.Добавить("Штрихкод");
	ТаблицаВыгрузкиЦен.Колонки.Добавить("Размер");
	ТаблицаВыгрузкиЦен.Колонки.Добавить("Цена");
	ТаблицаВыгрузкиЦен.Колонки.Добавить("ЦенаFBO");
	
	Пока Выборка.Следующий() Цикл 
		
		ЭтоНабор = Выборка.ЭтоНабор;
		
		Если ЭтоНабор Тогда
			
			ЦеныНаборов = ИС_МП_УправлениеЦенами.РассчитатьЦеныНаборов(Профиль, ПеречислениеМП, Выборка);	
			ТекущаяЦенаFBO = Окр(ЦеныНаборов.ЦенаFBO, 0, Настройки.РежимОкругленияЦен);
			ТекущаяЦена    = Окр(ЦеныНаборов.Цена, 0, Настройки.РежимОкругленияЦен);
			
		Иначе
			
			ТекущаяЦенаFBO = Окр(Выборка.ЦенаFBO, 0, Настройки.РежимОкругленияЦен);
			ТекущаяЦена    = Окр(Выборка.Цена, 0, Настройки.РежимОкругленияЦен);
			
		КонецЕсли;
		
		Если ТекущаяЦенаFBO <> 0 И МассивДляУстановкиЦен.Найти(Выборка.Штрихкод) <> Неопределено Тогда
			
			НоваяСтрока = ТаблицаВыгрузкиЦен.Добавить();
			
			НоваяСтрока.Штрихкод = Выборка.Штрихкод;
			НоваяСтрока.Размер   = Выборка.РазмерWB;
			НоваяСтрока.ЦенаFBO  = ТекущаяЦенаFBO;
			НоваяСтрока.Цена  	 = ТекущаяЦена;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.ИС_МП_РучныеЦены.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Профиль.Установить(Профиль);
	НаборЗаписей.Отбор.Маркетплейс.Установить(Перечисления.ИС_МП_Маркетплейсы.ВБ);
	НаборЗаписей.Записать();
	
	Если ТаблицаВыгрузкиЦен.Количество() > 0 Тогда	
		
		Для Каждого Строка Из ТаблицаВыгрузкиЦен Цикл
			
			ИС_МП_УправлениеЦенами.ЗаписатьРучнуюЦену(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, Строка.Размер, Строка.ЦенаFBO, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой); 
			ИС_МП_УправлениеЦенами.ЗаписатьРучнуюЦену(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, Строка.Размер, Строка.Цена, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦены);  	
			
		КонецЦикла;
		
	КонецЕсли;			
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 14.08.24 УА #72696

//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
Функция ПолучитьАктивныйЗаказКлиента(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_Профили.АктивныйЗаказКлиента КАК АктивныйЗаказКлиента
	|ИЗ
	|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
	|ГДЕ
	|	ИС_WB_Профили.Ссылка = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.АктивныйЗаказКлиента;	
	Иначе	
		Результат = Неопределено;	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
//- ИнфоСофт Макарова Н.Е. 04.04.2025 УА #88298

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
Функция СоздатьИзменитьВзаимозачетЗадолженности(Профиль, ДанныеДокумента, ДопПараметры = Неопределено) Экспорт
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.СоздатьИзменитьВзаимозачетЗадолженности(Профиль, ДанныеДокумента, ДопПараметры);
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
Функция ПолучитьСтруктуруВзаимозачетаЗадолженности() Экспорт
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.ПолучитьСтруктуруВзаимозачетаЗадолженности();
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Власова И.С. 08.04.25 УА #78061
Функция ЗаполнитьДанныеВзаимозачетЗадолженности(Профиль, ДокументыДебитор, ДокументыКредитор, ЭтоПродажиЮрЛицам = Ложь) Экспорт
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.ЗаполнитьДанныеВзаимозачетЗадолженности(Профиль, ДокументыДебитор, ДокументыКредитор, ЭтоПродажиЮрЛицам);
	
КонецФункции //- ИнфоСофт Власова И.С. 08.04.25 УА #78061

//+ ИнфоСофт Сумин Д.В. 09.12.2021 УА #40614
Функция ПолучитьПроцентНДС(НДС) Экспорт
	
	Если НДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Возврат 20;
		
	ИначеЕсли НДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Возврат 20;
		
	ИначеЕсли НДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Возврат 10;
		
	ИначеЕсли НДС = Перечисления.СтавкиНДС.НДС10_110 Тогда	
		Возврат 10;
		
	ИначеЕсли НДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Возврат 18;
		
	ИначеЕсли НДС = Перечисления.СтавкиНДС.НДС18_118 Тогда	
		Возврат 18;
		
	ИначеЕсли НДС = Перечисления.СтавкиНДС.НДС0 Тогда	
		Возврат 0;
		
	Иначе
		Возврат Неопределено
		
	КонецЕсли;	
		
КонецФункции //- ИнфоСофт Сумин Д.В. 09.12.2021 УА #40614  

//+ ИнфоСофт Власова И.С. 26.08.24 УА #61503
Функция ПроверитьЗаполнениеНастроекЗакупки(Профиль) Экспорт 
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
	Если ОбщийМодуль = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.ПроверитьЗаполнениеНастроекЗакупки(Профиль);
	
КонецФункции //- ИнфоСофт Власова И.С. 26.08.24 УА #61503

//+ ИнфоСофт Власова И.С. 26.08.24 УА #61503
Функция ПроверитьЗаполнениеНастроекКомиссии(Профиль) Экспорт 
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
	Если ОбщийМодуль = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.ПроверитьЗаполнениеНастроекКомиссии(Профиль);
	
КонецФункции //- ИнфоСофт Власова И.С. 26.08.24 УА #61503

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
Функция СоздатьИзменитьКорректировкуЗадолженности(Профиль, ДанныеДокумента, ДопПараметры) Экспорт
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.СоздатьИзменитьКорректировкуЗадолженности(Профиль, ДанныеДокумента, ДопПараметры);
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Власова И.С. 14.03.25 УА #68471
Функция ПолучитьСтруктуруКорректировкиЗадолженности() Экспорт
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.ПолучитьСтруктуруКорректировкиЗадолженности();
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #68471

//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
//Добавлено Основание
//+ ИнфоСофт Сумин Д.В. 06.03.23 УА #55086
Функция СоздатьДокументЗаявкаНаВозврат(Профиль, Даныне, ЗаголовокСтруктура, Основание = Неопределено) Экспорт
//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 01.11.24 УА #86746
	//Возврат ОбщийМодуль.СоздатьДокументЗаявкаНаВозврат(Профиль, Даныне, ЗаголовокСтруктура); 
	Возврат ОбщийМодуль.СоздатьДокументЗаявкаНаВозврат(Профиль, Даныне, ЗаголовокСтруктура, Основание);
	//- ИнфоСофт Заварин К.В. 01.11.24 УА #86746
	
КонецФункции //- ИнфоСофт Сумин Д.В. 06.03.23 УА #55086  

//+ ИнфоСофт Сумин Д.В. 06.03.23 УА #55086
Функция СоздатьДокументПоступлениеТоваровОтХранителя(Профиль, Даныне, ЗаголовокСтруктура, ДокументЗаявкаНаВозвратКомиссия) Экспорт
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.СоздатьДокументПоступлениеТоваровОтХранителя(ДокументЗаявкаНаВозвратКомиссия, Профиль, Даныне, ЗаголовокСтруктура);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 06.03.23 УА #55086

//+ ИнфоСофт Сумин Д.В. 06.03.23 УА #55086
Функция СоздатьСчетФактуру(ДокументРТУ) Экспорт
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.СоздатьСчетФактуру(ДокументРТУ);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 06.03.23 УА #55086

//+ ИнфоСофт Сумин Д.В. 06.03.23 УА #55086
Функция СоздатьПередачуТоваровНаХранение(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура) Экспорт
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.СоздатьПередачуТоваровНаХранение(Профиль, ТаблицаРезультирующаяПродажи, ЗаголовокСтруктура);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 06.03.23 УА #55086

//+ ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130
//Пока обрабатываем только Российские продажи по Api
Функция ПолучитьДанныеОтчетаКомиссионераApi(Профиль, ДатаНачала, ДатаКонца) Экспорт
	
	Событие = ПолучитьИмяСобытия("ПолучитьДанныеОК");
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Статистика");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159 
	
	rrdid = 0;
	ОтчетОПродажахПоРеализации = Новый Массив;
	
	Пока Истина Цикл
		
		Результат = ИС_WB_API.ПолучитьОтчетОПродажахПоРеализации(Профиль, ПараметрыЗапроса, ДатаНачала, ДатаКонца, , rrdid);	
		
		Если Результат = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для Каждого Элемент Из Результат Цикл
			ОтчетОПродажахПоРеализации.Добавить(Элемент);
		КонецЦикла; 
		
		Если Результат.Количество() = 100000 Тогда
			rrdid = Результат[Результат.ВГраница()].rrd_id;
		Иначе
			Прервать;		
		КонецЕсли;
		
	КонецЦикла; 
	
	МассивОтчетов = Новый Массив;
	ПоследнийНомер = 0;
	Российский = Истина;
	
	ТаблицаЗначенийРезультирующая = Новый ТаблицаЗначений;
	
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("НоменклатураWB", 		Новый ОписаниеТипов("СправочникСсылка.ИС_WB_Номенклатура"));			
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("РазмерWB", 				Новый ОписаниеТипов("СправочникСсылка.ИС_WB_РазмерыНоменклатур"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Баркод", 				Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("АртикулWB", 			Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Количество", 			Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("ЦенаРозничная", 		Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("СуммаПродажи", 			Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Комиссия", 				Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Логистика", 			Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Штрафы", 				Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("ЦенаПродажи", 			Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("ЦенаПередачи", 			Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Код", 					Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Бренд", 				Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Название", 				Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Размер",				Новый ОписаниеТипов("Строка")); 
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Штрихкод", 				Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Номер", 				Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("СтранаПродажи", 		Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("Артикул", 				Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("РазмерПоставщика", 		Новый ОписаниеТипов("Строка"));
	ТаблицаЗначенийРезультирующая.Колонки.Добавить("ЗаказМП", 				Новый ОписаниеТипов("ДокументСсылка.ИС_WB_СборочноеЗадание"));
	
	СуммаБрака = 0;
	
	Для Каждого Элемент Из ОтчетОПродажахПоРеализации Цикл
		
		Коэффициент = -1;
		
		Если Нрег(Элемент.doc_type_name) = "продажа" Тогда
			Коэффициент = 1;
		КонецЕсли;

		Если Элемент.report_type = 2 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Нрег(Элемент.supplier_oper_name) = "хранение" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Нрег(Элемент.supplier_oper_name) = "удержание" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Нрег(Элемент.supplier_oper_name) = "возмещение издержек по перевозке" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Нрег(Элемент.supplier_oper_name) = "возмещение издержек по перевозке/по складским операциям с товаром" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПоследнийНомер <> Элемент.realizationreport_id Тогда 
			ПоследнийНомер = Элемент.realizationreport_id;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаЗначенийРезультирующая.Добавить();
		НоваяСтрока.Номер 				= Число(Элемент.realizationreport_id);
		НоваяСтрока.СтранаПродажи 		= Элемент.site_country;   
		
		НоваяСтрока.Код 				= Число(Элемент.nm_id);
		НоваяСтрока.Бренд 				= Элемент.brand_name;
		НоваяСтрока.Название 			= Элемент.subject_name;
		НоваяСтрока.Размер 				= Элемент.ts_name;
		НоваяСтрока.Баркод 				= Элемент.barcode;
		НоваяСтрока.Количество 			= Коэффициент * Число(Элемент.quantity);
		НоваяСтрока.ЦенаРозничная 		= Число(Элемент.retail_price); 
		НоваяСтрока.СуммаПродажи 		= Коэффициент * Число(Элемент.retail_amount);	   	
		НоваяСтрока.ЦенаПродажи 		= ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.СуммаПродажи / НоваяСтрока.Количество);
		НоваяСтрока.Штрихкод 			= Элемент.shk_id;
		НоваяСтрока.Артикул 			= Элемент.sa_name;
		НоваяСтрока.РазмерПоставщика 	= Элемент.ts_name; 
		НоваяСтрока.АртикулWB			= Элемент.nm_id; 
		
		НоваяСтрока.ЦенаПередачи		= Элемент.ppvz_for_pay;
		НоваяСтрока.Комиссия			= Элемент.ppvz_vw + Элемент.ppvz_vw_nds;
		НоваяСтрока.Логистика 			= Элемент.delivery_rub;
		НоваяСтрока.Штрафы 				= Элемент.penalty;	
		
		НоваяСтрока.НоменклатураWB 		= Справочники.ИС_WB_Номенклатура.НайтиПоКоду(НоваяСтрока.АртикулWB);
		
		НоваяСтрока.ЗаказМП 			= Документы.ИС_WB_СборочноеЗадание.НайтиПоНомеру(Элемент.assembly_id);
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.ЗаказМП) Тогда
			НоваяСтрока.ЗаказМП 		= Документы.ИС_WB_СборочноеЗадание.НайтиПоРеквизиту("rid", Элемент.srid);
		КонецЕсли;
		
	КонецЦикла;   					 
	
	Результат = Новый Структура;
	
	Результат.Вставить("Таблица", 	ТаблицаЗначенийРезультирующая); 
	Результат.Вставить("НомерРФ", 	ПоследнийНомер);
	Результат.Вставить("Брак", 		СуммаБрака);
	
	Возврат Результат;	 				
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130

//+ ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130
Функция ПолучитьТекстЗапросаОтчетаКомиссионера() Экспорт 
	
	ИспользуетсяЦенообразование25 = Константы.ИспользуетсяЦенообразование25.Получить();
	
	Если ИспользуетсяЦенообразование25 Тогда
		
		Текст =
		"ВЫБРАТЬ
		|	ДанныеТЗ.ЗаказМП КАК ЗаказМП,
		|	ДанныеТЗ.РазмерWB КАК РазмерWB,
		|	ДанныеТЗ.Баркод КАК Баркод,
		|	ДанныеТЗ.Название КАК Название,
		|	ДанныеТЗ.Количество КАК Количество,
		|	ДанныеТЗ.ЦенаРозничная КАК ЦенаРозничная,
		|	ДанныеТЗ.СуммаПродажи КАК СуммаПродажи,
		|	ДанныеТЗ.ЦенаПродажи КАК ЦенаПродажи,
		|	ДанныеТЗ.ЦенаПередачи КАК ЦенаПередачи,
		|	ДанныеТЗ.Код КАК Код,
		|	ДанныеТЗ.Номер КАК Номер,
		|	ДанныеТЗ.Артикул КАК Артикул,
		|	ДанныеТЗ.АртикулWB КАК АртикулWB,
		|	ДанныеТЗ.РазмерПоставщика КАК РазмерПоставщика,
		|	ДанныеТЗ.Комиссия КАК Комиссия,
		|	ДанныеТЗ.Логистика КАК Логистика,
		|	ДанныеТЗ.Штрафы КАК Штрафы
		|ПОМЕСТИТЬ ВТ_ДанныеПродаж
		|ИЗ
		|	&ДанныеТЗ КАК ДанныеТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеПродаж.Баркод КАК Баркод,
		|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_ШтрихкодыРазмеров.Размер, ЗНАЧЕНИЕ(Справочник.ИС_WB_РазмерыНоменклатур.ПустаяСсылка))) КАК Размер
		|ПОМЕСТИТЬ ВТ_Размеры
		|ИЗ
		|	ВТ_ДанныеПродаж КАК ВТ_ДанныеПродаж
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
		|		ПО ВТ_ДанныеПродаж.Баркод = ИС_WB_ШтрихкодыРазмеров.Штрихкод
		|			И (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДанныеПродаж.Баркод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Размеры.Баркод КАК Баркод,
		|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК Номенклатура,
		|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка))) КАК Характеристика,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЭтоНабор,
		|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Упаковка) КАК Упаковка,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL
		|					ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель = 0
		|				ТОГДА 1
		|			ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель
		|		КОНЕЦ / ВЫБОР
		|			КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL
		|					ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель = 0
		|				ТОГДА 1
		|			ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель
		|		КОНЕЦ) КАК КоэффициентУпаковки
		|ПОМЕСТИТЬ ВТ_Сопоставление
		|ИЗ
		|	ВТ_Размеры КАК ВТ_Размеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО ВТ_Размеры.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
		|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Размеры.Баркод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_Размеры.Размер, ВТ_ДанныеПродаж.РазмерWB) КАК РазмерWB,
		|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		|	ВТ_Сопоставление.Характеристика КАК Характеристика,
		|	ВТ_Сопоставление.ЭтоНабор КАК ЭтоНабор,
		|	ВТ_Сопоставление.Упаковка КАК Упаковка,
		|	ВТ_Сопоставление.КоэффициентУпаковки КАК КоэффициентУпаковки,
		|	ВТ_ДанныеПродаж.ЗаказМП КАК ЗаказМП,
		|	ВТ_ДанныеПродаж.ЦенаРозничная КАК ЦенаРозничная,
		|	ВТ_ДанныеПродаж.Название КАК Название,
		|	ВТ_ДанныеПродаж.СуммаПродажи КАК СуммаПродажи,
		|	ВТ_ДанныеПродаж.ЦенаПродажи КАК ЦенаПродажи,
		|	ВТ_ДанныеПродаж.ЦенаПередачи КАК ЦенаПередачи,
		|	ВТ_ДанныеПродаж.Номер КАК Номер,
		|	ВТ_ДанныеПродаж.Баркод КАК Баркод,
		|	ВТ_ДанныеПродаж.Артикул КАК Артикул,
		|	ВТ_ДанныеПродаж.АртикулWB КАК АртикулWB,
		|	ВТ_ДанныеПродаж.РазмерПоставщика КАК РазмерПоставщика,
		|	ВТ_ДанныеПродаж.Код КАК Код,
		|	ВТ_ДанныеПродаж.Количество КАК Количество,
		|	ВТ_ДанныеПродаж.Комиссия КАК Комиссия,
		|	ВТ_ДанныеПродаж.Логистика КАК Логистика,
		|	ВТ_ДанныеПродаж.Штрафы КАК Штрафы
		|ИЗ
		|	ВТ_ДанныеПродаж КАК ВТ_ДанныеПродаж
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Размеры КАК ВТ_Размеры
		|		ПО ВТ_ДанныеПродаж.Баркод = ВТ_Размеры.Баркод
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сопоставление КАК ВТ_Сопоставление
		|		ПО ВТ_ДанныеПродаж.Баркод = ВТ_Сопоставление.Баркод
		|
		|УПОРЯДОЧИТЬ ПО
		|	РазмерWB";
		
	Иначе
		
		Текст =
		"ВЫБРАТЬ
		|	ДанныеТЗ.ЗаказМП КАК ЗаказМП,
		|	ДанныеТЗ.РазмерWB КАК РазмерWB,
		|	ДанныеТЗ.Баркод КАК Баркод,
		|	ДанныеТЗ.Название КАК Название,
		|	ДанныеТЗ.Количество КАК Количество,
		|	ДанныеТЗ.ЦенаРозничная КАК ЦенаРозничная,
		|	ДанныеТЗ.СуммаПродажи КАК СуммаПродажи,
		|	ДанныеТЗ.ЦенаПродажи КАК ЦенаПродажи,
		|	ДанныеТЗ.ЦенаПередачи КАК ЦенаПередачи,
		|	ДанныеТЗ.Код КАК Код,
		|	ДанныеТЗ.Номер КАК Номер,
		|	ДанныеТЗ.Артикул КАК Артикул,
		|	ДанныеТЗ.АртикулWB КАК АртикулWB,
		|	ДанныеТЗ.РазмерПоставщика КАК РазмерПоставщика,
		|	ДанныеТЗ.Комиссия КАК Комиссия,
		|	ДанныеТЗ.Логистика КАК Логистика,
		|	ДанныеТЗ.Штрафы КАК Штрафы
		|ПОМЕСТИТЬ ВТ_ДанныеПродаж
		|ИЗ
		|	&ДанныеТЗ КАК ДанныеТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеПродаж.Баркод КАК Баркод,
		|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_ШтрихкодыРазмеров.Размер, ЗНАЧЕНИЕ(Справочник.ИС_WB_РазмерыНоменклатур.ПустаяСсылка))) КАК Размер
		|ПОМЕСТИТЬ ВТ_Размеры
		|ИЗ
		|	ВТ_ДанныеПродаж КАК ВТ_ДанныеПродаж
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
		|		ПО ВТ_ДанныеПродаж.Баркод = ИС_WB_ШтрихкодыРазмеров.Штрихкод
		|			И (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДанныеПродаж.Баркод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Размеры.Баркод КАК Баркод,
		|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК Номенклатура,
		|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК Характеристика,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЭтоНабор,
		|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Упаковка) КАК Упаковка,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL
		|					ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель = 0
		|				ТОГДА 1
		|			ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Числитель
		|		КОНЕЦ / ВЫБОР
		|			КОГДА ИС_WB_СоответствиеРазмеров.Упаковка ЕСТЬ NULL
		|					ИЛИ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель = 0
		|				ТОГДА 1
		|			ИНАЧЕ ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель
		|		КОНЕЦ) КАК КоэффициентУпаковки
		|ПОМЕСТИТЬ ВТ_Сопоставление
		|ИЗ
		|	ВТ_Размеры КАК ВТ_Размеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО ВТ_Размеры.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
		|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Размеры.Баркод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_Размеры.Размер, ВТ_ДанныеПродаж.РазмерWB) КАК РазмерWB,
		|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		|	ВТ_Сопоставление.Характеристика КАК Характеристика,
		|	ВТ_Сопоставление.ЭтоНабор КАК ЭтоНабор,
		|	ВТ_Сопоставление.Упаковка КАК Упаковка,
		|	ВТ_Сопоставление.КоэффициентУпаковки КАК КоэффициентУпаковки,
		|	ВТ_ДанныеПродаж.ЗаказМП КАК ЗаказМП,
		|	ВТ_ДанныеПродаж.ЦенаРозничная КАК ЦенаРозничная,
		|	ВТ_ДанныеПродаж.Название КАК Название,
		|	ВТ_ДанныеПродаж.СуммаПродажи КАК СуммаПродажи,
		|	ВТ_ДанныеПродаж.ЦенаПродажи КАК ЦенаПродажи,
		|	ВТ_ДанныеПродаж.ЦенаПередачи КАК ЦенаПередачи,
		|	ВТ_ДанныеПродаж.Номер КАК Номер,
		|	ВТ_ДанныеПродаж.Баркод КАК Баркод,
		|	ВТ_ДанныеПродаж.Артикул КАК Артикул,
		|	ВТ_ДанныеПродаж.АртикулWB КАК АртикулWB,
		|	ВТ_ДанныеПродаж.РазмерПоставщика КАК РазмерПоставщика,
		|	ВТ_ДанныеПродаж.Код КАК Код,
		|	ВТ_ДанныеПродаж.Количество КАК Количество,
		|	ВТ_ДанныеПродаж.Комиссия КАК Комиссия,
		|	ВТ_ДанныеПродаж.Логистика КАК Логистика,
		|	ВТ_ДанныеПродаж.Штрафы КАК Штрафы
		|ИЗ
		|	ВТ_ДанныеПродаж КАК ВТ_ДанныеПродаж
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Размеры КАК ВТ_Размеры
		|		ПО ВТ_ДанныеПродаж.Баркод = ВТ_Размеры.Баркод
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сопоставление КАК ВТ_Сопоставление
		|		ПО ВТ_ДанныеПродаж.Баркод = ВТ_Сопоставление.Баркод
		|
		|УПОРЯДОЧИТЬ ПО
		|	РазмерWB";
		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 17.03.25 УА #96130

//+ ИнфоСофт Мурсалимов Д.Р. 27.01.25 УА #67818
Функция СоздатьОтчетПлатногоХранения(Профиль, Период) Экспорт
	
	ДатаНачала 			= НачалоДня(Период.ДатаНачала);
	ДатаОкончания 		= КонецДня(Период.ДатаОкончания);
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159	
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Аналитика");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	Результат 			= ИС_WB_API.СоздатьОтчетПлатногоХранения(Профиль, ПараметрыЗапроса, ДатаНачала, ДатаОкончания);
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не Результат.Свойство("taskId") Тогда
		Возврат Неопределено;
	КонецЕсли;  
	
	Пока Истина Цикл
		
		Статус = ИС_WB_Сервер.ПроверитьСтатусОтчетаПлатногоХранения(Профиль, Результат.taskId);	
		
		Если Статус = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если Статус.Свойство("status") Тогда
			
			СтатусОтчета = Статус.status;
			
			ИС_MP_Сервер.Пауза(5);
			
		КонецЕсли; 
		
		Если СтатусОтчета = "done" Тогда			
			Прервать;	
		КонецЕсли;
		
		Если СтатусОтчета = "purged" Тогда			
			Возврат Неопределено;
		КонецЕсли;
		
		Если СтатусОтчета = "canceled" Тогда			
			Возврат Неопределено;	
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат Результат.taskId;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 27.01.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 27.01.25 УА #67818
Функция ПроверитьСтатусОтчетаПлатногоХранения(Профиль, taskId) Экспорт
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Аналитика");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	Результат = ИС_WB_API.ПроверитьСтатусОтчетаПлатногоХранения(Профиль, ПараметрыЗапроса, taskId);
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Возврат Результат;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 27.01.25 УА #67818

//+ ИнфоСофт Мурсалимов Д.Р. 27.01.25 УА #67818
Функция ЗагрузитьОтчетПлатногоХранения(Профиль, taskId) Экспорт
	
	//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	ПараметрыЗапроса = ИС_ВБ_Сервер.ПараметрыHTTPЗапроса(Профиль, "Аналитика");
	//- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
	
	Результат = ИС_WB_API.ПолучитьОтчетПлатногоХранения(Профиль, ПараметрыЗапроса, taskId);
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 27.01.25 УА #67818

//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
Функция СоздатьИзменитьОтчетОСписанииТоваровУХранителя(Профиль, ДанныеДокумента, ДопПараметры = Неопределено) Экспорт
	
	ИмяМодуля = ИС_MP_Сервер.ПолучитьИмяМодуляКонфигурации();
    ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
    
    Если ОбщийМодуль = Неопределено Тогда
    	Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщийМодуль.СоздатьИзменитьОтчетОСписанииТоваровУХранителя(Профиль, ДанныеДокумента, ДопПараметры);
	
КонецФункции //- ИнфоСофт Власова И.С. 14.03.25 УА #83865

#КонецОбласти
