
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстанавливатьОтбор = Истина;
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		УстанавливатьОтбор = Ложь;
	Иначе
		ИС_MP_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура ПриОткрытии(Отказ)	

	Если УстанавливатьОтбор Тогда
		УстрановитьОтборПоПрофилю();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	
	УстрановитьОтборПоПрофилю();
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ТекДанные = Элемент.ТекущиеДанные; 
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ОткрытьНаЛамода Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПерейтиПоНавигационнойСсылке("https://www.lamoda.ru/p/" + Формат(ТекДанные.Код, "ЧГ="));
			
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаСервере
Процедура УстрановитьОтборПоПрофилю()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Профиль", Профиль);
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

#КонецОбласти
