
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() И Не Параметры.ЗначенияЗаполнения.Свойство("Владелец") Тогда
		ОбщегоНазначения.СообщитьПользователю("Токен можно создать только из справочника Профили");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 27.01.25 УА #89159
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 27.01.25 УА #89159
&НаКлиенте
Процедура ТокенОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	
	Если Объект.Маркетплейс <> ПредопределенноеЗначение("Перечисление.ИС_МП_Маркетплейсы.ВБ") Тогда
		Возврат;
	КонецЕсли;
	
	Текст = СокрЛП(Текст);
	
	Объект.СвойстваТокенаВБ.Очистить();
	
	СтруктураРасшифровки = РасшифроватьНаСервере(Текст);
	
	Если СтруктураРасшифровки = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Возможно некорректный токен", , , "Токен");
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Объект.СвойстваТокенаВБ.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураРасшифровки);
	
	Объект.Токен = Текст;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 27.01.25 УА #89159
&НаКлиенте
Процедура МаркетплейсПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 17.02.25 УА #89159
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.02.25 УА #89159

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 27.01.25 УА #89159
&НаКлиенте
Процедура УправлениеФормой()
	Элементы.СвойстваТокенаВБ.Видимость = 
		Объект.Маркетплейс = ПредопределенноеЗначение("Перечисление.ИС_МП_Маркетплейсы.ВБ");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 27.01.25 УА #89159
&НаСервереБезКонтекста   
Функция РасшифроватьНаСервере(Токен)
	Возврат ИС_ВБ_Сервер.ДанныеТокена(Токен);
КонецФункции //- ИнфоСофт Ивонин К.А. 27.01.25 УА #89159

#КонецОбласти
