#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОсобыйРежимЗакрытия = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;

	Если ОсобыйРежимЗакрытия Тогда
		ОсобыйРежимЗакрытия = Ложь;
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		ПодключитьОбработчикОжидания("ЗакрытьФорму", 0.1, Истина);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКатегорий

&НаКлиенте
Процедура СписокКатегорийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Элементы.СписокКатегорийИспользуется Тогда

		СтандартнаяОбработка = Ложь;

		ТекущиеДанные = Элементы.СписокКатегорий.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			Если ТекущиеДанные.Используется Тогда

				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Категория", ТекущиеДанные.Категория);

				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаУдалитьЗаписиВРегистре", ЭтотОбъект,
					СтруктураПараметров);

				ЗаголовокВопроса = "Удаление записий в регистрах по категории";
				ТекстВопроса 	 = "Удалить значения характеристик и сопоставления значений характеристик в регистрах сведений для категории?";

				ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);

			КонецЕсли;

			УстановитьПризнак(ТекущиеДанные.Категория, Не ТекущиеДанные.Используется, ТекущиеДанные.ЭтоГруппа);

		КонецЕсли;

	КонецЕсли;

	Элементы.СписокКатегорий.Обновить();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УстановитьПризнак(Категория, Используется, ЭтоГруппа)

	ЕстьИзменения = Истина;

	Если ЭтоГруппа Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Ozon_КатегорииТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_Ozon_КатегорииТоваров КАК Ozon_КатегорииТоваров
		|ГДЕ
		|	Ozon_КатегорииТоваров.Родитель В ИЕРАРХИИ(&Категория)
		| 	ИЛИ Ozon_КатегорииТоваров.Ссылка = &Категория";

		Запрос.УстановитьПараметр("Категория", Категория);

		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() Цикл
			ОбКатегория = Выборка.Ссылка.ПолучитьОбъект();
			ОбКатегория.Используется =  Используется;
			ОбКатегория.Записать();
		КонецЦикла;

	Иначе
		ОбКатегория = Категория.ПолучитьОбъект();
		ОбКатегория.Используется =  Используется;
		ОбКатегория.Записать();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()

	Закрыть(ЕстьИзменения);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаУдалитьЗаписиВРегистре(Результат, СтруктураПараметров) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда  
		УдалитьЗаписи(СтруктураПараметров.Категория);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписи(Категория)
	ИС_Ozon_Сервер.УдалитьЗаписиВрегистрахПоКатегории(Категория);	
КонецПроцедуры

#КонецОбласти