
#Область ПрограммныйИнтерфейс

#Область Авторизация                        

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
Функция ПолучитьТокен(Профиль, ПараметрыЗапроса, ТелоСтруктура, refreshToken = "") Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		              
	ПараметрыЗапроса.АдресРесурса = "/api/v3/auth/realms/master/openid-connect/token";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
 
	Если ЗначениеЗаполнено(refreshToken) Тогда
		ТелоСтруктура.Вставить("grantType", "REFRESH_TOKEN");
		ТелоСтруктура.Вставить("refreshToken", refreshToken);
	Иначе
		ТелоСтруктура.Вставить("grantType", "CLIENT_CREDENTIALS");
	КонецЕсли;
	
	ПараметрыЗапроса.ТелоСтрока = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(ТелоСтруктура);
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 200 Тогда
	
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если ТипЗнч(JSON) = Тип("Структура") Тогда				
			Возврат JSON;	
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
		 	ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
         
        Текст = "Ошибка в запросе: " + РезультатЗапроса.Ответ; 
  		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
		
	КонецЕсли;
			
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

#КонецОбласти

#Область Цены

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция ВыгрузитьЦены(Профиль, ПараметрыЗапроса, МассивОстатков) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		              
	ПараметрыЗапроса.АдресРесурса = "/public/api/task/stocks";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ПараметрыЗапроса.ТелоСтрока = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(МассивОстатков);
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;
	
	Если РезультатЗапроса.КодОтвета = 200 Тогда
	
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если ТипЗнч(JSON) = Тип("Структура") Тогда				
			Возврат JSON.id;	
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
		 	ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
         
        Текст = "Ошибка в запросе: " + РезультатЗапроса.Ответ; 
  		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 403 Тогда
         
        Текст = "Недостаточно прав: " + РезультатЗапроса.Ответ; 
  		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
		
	КонецЕсли;
			
	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
	
#КонецОбласти

#Область Остатки

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция ВыгрузитьОстатки(Профиль, ПараметрыЗапроса, МассивОстатков) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		              
	ПараметрыЗапроса.АдресРесурса = "/public/api/task/stocks";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ПараметрыЗапроса.ТелоСтрока = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(МассивОстатков);
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;

	Если РезультатЗапроса.КодОтвета = 200 Тогда
	
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если ТипЗнч(JSON) = Тип("Структура") Тогда				
			Возврат JSON.id;	
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
		 	ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
         
        Текст = "Ошибка в запросе: " + РезультатЗапроса.Ответ; 
  		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 403 Тогда
         
        Текст = "Недостаточно прав: " + РезультатЗапроса.Ответ; 
  		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
		
	КонецЕсли;

	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
	
#КонецОбласти

#Область Задачи

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция ИнформацияОЗадаче(Профиль, ПараметрыЗапроса, МассивОстатков) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		              
	ПараметрыЗапроса.АдресРесурса = "/public/api/task/stocks";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ПараметрыЗапроса.ТелоСтрока = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(МассивОстатков);
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;

	Если РезультатЗапроса.КодОтвета = 200 Тогда
	
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если ТипЗнч(JSON) = Тип("Структура") Тогда				
			Возврат JSON.id;	
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
		 	ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
         
        Текст = "Ошибка в запросе: " + РезультатЗапроса.Ответ; 
  		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 403 Тогда
         
        Текст = "Недостаточно прав: " + РезультатЗапроса.Ответ; 
  		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
		
	КонецЕсли;

	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция ИндикаторВыполнения(Профиль, ПараметрыЗапроса, МассивОстатков) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		              
	ПараметрыЗапроса.АдресРесурса = "/public/api/task/stocks";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ПараметрыЗапроса.ТелоСтрока = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(МассивОстатков);
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;

	Если РезультатЗапроса.КодОтвета = 200 Тогда
	
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если ТипЗнч(JSON) = Тип("Структура") Тогда				
			Возврат JSON.id;	
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
		 	ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
         
        Текст = "Ошибка в запросе: " + РезультатЗапроса.Ответ; 
  		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 403 Тогда
         
        Текст = "Недостаточно прав: " + РезультатЗапроса.Ответ; 
  		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
		
	КонецЕсли;

	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция ДетализацияОшибок(Профиль, ПараметрыЗапроса, МассивОстатков) Экспорт
	
	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		              
	ПараметрыЗапроса.АдресРесурса = "/public/api/task/stocks";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	ПараметрыЗапроса.ТелоСтрока = ИС_МП_РаботаСHTTPЗапросами.ПолучитьСтрокуJSON(МассивОстатков);
		
	РезультатЗапроса = ИС_МП_РаботаСHTTPЗапросами.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 
		Возврат Неопределено;	
	КонецЕсли;

	Если РезультатЗапроса.КодОтвета = 200 Тогда
	
		JSON = ИС_МП_РаботаСHTTPЗапросами.ПолучитьОбъектJSON(РезультатЗапроса.Ответ);
		
		Если ТипЗнч(JSON) = Тип("Структура") Тогда				
			Возврат JSON.id;	
		Иначе
			Текст = "Получен нераспознанный ответ от сервера: " + РезультатЗапроса.Ответ;
		 	ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
         
        Текст = "Ошибка в запросе: " + РезультатЗапроса.Ответ; 
  		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 403 Тогда
         
        Текст = "Недостаточно прав: " + РезультатЗапроса.Ответ; 
  		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
		
	КонецЕсли;

	РазобратьHTTPОтветПоКоду(РезультатЗапроса);
	Возврат Неопределено;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 08.02.24 УА #70082
Процедура ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса)
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type", "application/json");
	ПараметрыЗапроса.Заголовки.Вставить("Accept", "application/json");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.02.24 УА #70082

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
Процедура РазобратьHTTPОтветПоКоду(СтруктураОтвета)

	Если СтруктураОтвета.КодОтвета = 500 Тогда
		
		Текст = "Произошла внутренняя ошибка сервера, код ответа: 500, ошибка: " + СтруктураОтвета.Ответ;			
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
	Иначе
		Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
			СтруктураОтвета.КодОтвета, СтруктураОтвета.Ответ);			
		ОбщегоНазначения.СообщитьПользователю(Текст);				
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 27.06.22 УА #46999
Процедура ЗаписатьДанныеОтладки(Профиль, ПараметрыЗапроса, РезультатЗапроса)
       
	Если Не ПараметрыЗапроса.РежимОтладки Тогда
		Возврат;
	КонецЕсли;
		
	ИС_МП_Сервер.ЗаписатьДанныеОтладки(Профиль, 
		Перечисления.ИС_МП_Маркетплейсы.МВМ, ПараметрыЗапроса, РезультатЗапроса);	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.06.22 УА #46999

#КонецОбласти
