
#Область СлужебныйПрограммныйИнтерфейс

#Область Настройки

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ПолучитьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияОзон Тогда
		Возврат;
	КонецЕсли;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон; 
	
	//МассивНастроек = МассивНастроекПодключения();	
	МассивНастроек = Новый Массив;
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	//+ ИнфоСофт Стояк Ю.К. 11.03.2025 УА #93469	
	//МассивНастроек.Добавить("ЗагружатьЗаказыПоСхемеФБО");
	МассивНастроек = МассивНастроекЗаказов(МассивНастроек);
	//- ИнфоСофт Стояк Ю.К. 11.03.2025 УА #93469
	//МассивНастроек = МассивНастроекЦен(МассивНастроек);
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, МассивНастроек);

	СтруктураПараметров = Новый Структура;

	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить("Озон" + Элемент.Ключ, Элемент.Значение);	
	КонецЦикла;
		
	ЗаполнитьЗначенияСвойств(Форма, СтруктураПараметров);
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ЗаписатьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияОзон Тогда
		Возврат;
	КонецЕсли;
	
	//МассивНастроек = МассивНастроекПодключения();
	МассивНастроек = Новый Массив;
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	МассивНастроек.Добавить("ЗагружатьЗаказыПоСхемеФБО");
	//МассивНастроек = МассивНастроекЦен(МассивНастроек);
	
	СтруктураНастроек = Новый Структура;
	
	Для Каждого Элемент Из МассивНастроек Цикл
		СтруктураНастроек.Вставить("Озон" + Элемент, Неопределено);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, Форма);
	
	СтруктураПараметров = Новый Структура;
	
	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить(СтрЗаменить(Элемент.Ключ, "Озон", ""), Элемент.Значение);	
	КонецЦикла;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон;
	
	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, СтруктураПараметров);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция МассивНастроекОстатков(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("РассчитыватьНесобранныеКомплекты");
	МассивНастроек.Добавить("ВыгружатьОстаткиВРазрезеОрганизации");
	МассивНастроек.Добавить("ИспользоватьПоследниеОстатки");	
	МассивНастроек.Добавить("ИспользоватьФиксированныйОстаток");
	МассивНастроек.Добавить("ФиксированныйОстаток");
	МассивНастроек.Добавить("РежимСокрытияОстатков");
	МассивНастроек.Добавить("СкрываемыйОстаток");
	
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Стояк Ю.К. 11.03.2025 УА #93469
Функция МассивНастроекЗаказов(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("ЗагружатьЗаказыПоСхемеФБО");
	
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 11.03.2025 УА #93469

#КонецОбласти

#Область РегламентныеЗадания

//+ ИнфоСофт Ивонин К.А. 11.11.23 УА #55166
Процедура ВыполнитьКомандуРеглЗадания(Профиль, ИдентификаторКомандыОбработки) Экспорт
    
	Событие = ПолучитьИмяСобытия("ВыполнитьКомандуРеглЗадания");
	
	Если ИдентификаторКомандыОбработки = "ВыгрузкаЦенOzon" Тогда
		ВыгрузитьЦены(Профиль);
		Возврат;				
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ВыгрузкаОстатковOzon" Тогда		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 

		"ВЫБРАТЬ
		|	ИС_Ozon_Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_Ozon_Склады КАК ИС_Ozon_Склады
		|ГДЕ
		|	ИС_Ozon_Склады.Профиль = &Профиль
		|	И НЕ ИС_Ozon_Склады.ПометкаУдаления
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
		|	И НЕ ИС_Ozon_Склады.СкладДляЗаказовФБО
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
		//+ ИнфоСофт Заварин К.В. 13.08.24 УА #81097
		|	И НЕ(ИС_Ozon_Склады.ОбщаяГруппаСкладов = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|				И ИС_Ozon_Склады.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|				И ИС_Ozon_Склады.ВыгружатьОстаткиИзГруппыСкладов = ЛОЖЬ)";
		//- ИнфоСофт Заварин К.В. 13.08.24 УА #81097
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			ВыгрузитьОстатки(Профиль, Выборка.Ссылка);	
		КонецЦикла;
	
		Возврат;
		
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ПолучениеСборочныхЗаданийOzon" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_Ozon_Заказ.Дата КАК Дата
		|ИЗ
		|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
		|ГДЕ
		|	ИС_Ozon_Заказ.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДатаНачала = ВыборкаДетальныеЗаписи.Дата;
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
			ДатаНачала = НачалоДня(ТекущаяДатаСеанса());	
		КонецЕсли;
		
		ПолучитьЗаказы(Профиль, ДатаНачала + 1);
		
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
		МассивНаименованийПараметров = Новый Массив;  		
		МассивНаименованийПараметров.Добавить("ЗагружатьЗаказыПоСхемеФБО");
		
		Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, МассивНаименованийПараметров);
		
		Если Настройки.ЗагружатьЗаказыПоСхемеФБО <> Неопределено Тогда
			ЗагружатьЗаказыПоСхемеФБО = Настройки.ЗагружатьЗаказыПоСхемеФБО;
		Иначе
			ЗагружатьЗаказыПоСхемеФБО = Ложь;
		КонецЕсли;			
		
		Если ЗагружатьЗаказыПоСхемеФБО Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИС_Ozon_Заказ.Дата КАК Дата
			|ИЗ
			|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
			|ГДЕ
			|	ИС_Ozon_Заказ.Профиль = &Профиль
			|	И ИС_Ozon_Заказ.ЗаказФБО
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата УБЫВ";
			
			Запрос.УстановитьПараметр("Профиль", Профиль);
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ДатаНачала = ВыборкаДетальныеЗаписи.Дата;
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
				ДатаНачала = НачалоДня(ТекущаяДатаСеанса());	
			КонецЕсли;
		
			ПолучитьЗаказыФБО(Профиль, ДатаНачала);	
		КонецЕсли;
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
		
		Возврат;				
	
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ОбновлениеСтатусовСборочныхЗаданийOzon" Тогда
		//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800	
		ФункциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
		
		//+ ИнфоСофт Стояк Ю.К. 03.12.2024 УА #88503		
		//Если ЗначениеЗаполнено(ФункциональныеОпции) Тогда
		Если ФункциональныеОпции.OzonКоличествоДнейОбновлениеСтатусов <> 0 Тогда
		//- ИнфоСофт Стояк Ю.К. 03.12.2024 УА #88503
			Период = ФункциональныеОпции.OzonКоличествоДнейОбновлениеСтатусов * 86400;
		Иначе
			Период = 604800;
		КонецЕсли;	
		
		ОбновитьСтатусыСборочныхЗаданий(Профиль, Период);
		//ОбновитьСтатусыСборочныхЗаданий(Профиль);
		//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
		
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469	
		МассивНаименованийПараметров = Новый Массив;  		
		МассивНаименованийПараметров.Добавить("ЗагружатьЗаказыПоСхемеФБО");
		
		Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, МассивНаименованийПараметров);
		
		Если Настройки.ЗагружатьЗаказыПоСхемеФБО <> Неопределено Тогда
			ЗагружатьЗаказыПоСхемеФБО = Настройки.ЗагружатьЗаказыПоСхемеФБО;
		Иначе
			ЗагружатьЗаказыПоСхемеФБО = Ложь;
		КонецЕсли;
		
		Если ЗагружатьЗаказыПоСхемеФБО Тогда
			ОбновитьСтатусыСборочныхЗаданийФБО(Профиль, Период);	
		КонецЕсли;                                  
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
		
		Возврат;				
	КонецЕсли; 
	
	Если ИдентификаторКомандыОбработки = "ЗакрыватьЗаказВТечениеДняOzon" Тогда 
        ВыполнитьЗакрытиеЗаказов(Профиль);
		Возврат;					
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ВыполнениеАлгоритмаПоОсновнойСхемеFboOzon" Тогда
		ВыполнитьАлгоритмПоОсновнойСхемеFBO(Профиль);			
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ЗагружатьДанныеУслугOzon" Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_Ozon_ДанныеУслугСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ИС_Ozon_ДанныеУслуг.СрезПоследних КАК ИС_Ozon_ДанныеУслугСрезПоследних
		|ГДЕ
		|	ИС_Ozon_ДанныеУслугСрезПоследних.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИС_Ozon_ДанныеУслугСрезПоследних.Период УБЫВ";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ДатаНачала = Выборка.Период;
			ДвеНедели = 2 * 604800; 
			ДатаОкончания = Выборка.Период + ДвеНедели;
		Иначе
			ДатаНачала = НачалоНедели(ТекущаяДатаСеанса() - 604800);
			ДатаОкончания = КонецНедели(ТекущаяДатаСеанса());
		КонецЕсли;
		
		ДатаТело = Новый Структура;
		ДатаТело.Вставить("from", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ДатаНачала, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата));
		ДатаТело.Вставить("to", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ДатаОкончания, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата));
		
		ЗагрузитьДанныеУслуг(Профиль, ДатаТело);			
		Возврат;
	
	КонецЕсли;
	
	Если ИдентификаторКомандыОбработки = "ЗагружатьДанныеУслугOzon" Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_Ozon_ДанныеУслугСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ИС_Ozon_ДанныеУслуг.СрезПоследних КАК ИС_Ozon_ДанныеУслугСрезПоследних
		|ГДЕ
		|	ИС_Ozon_ДанныеУслугСрезПоследних.Профиль = &Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИС_Ozon_ДанныеУслугСрезПоследних.Период УБЫВ";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ДатаНачала = Выборка.Период;
			ДвеНедели = 2 * 604800; 
			ДатаОкончания = Выборка.Период + ДвеНедели;
		Иначе
			ДатаНачала = НачалоНедели(ТекущаяДатаСеанса() - 604800);
			ДатаОкончания = КонецНедели(ТекущаяДатаСеанса());
		КонецЕсли;
		
		ДатаТело = Новый Структура;
		ДатаТело.Вставить("from", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ДатаНачала, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата));
		ДатаТело.Вставить("to", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ДатаОкончания, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата));
		
		ЗагрузитьДанныеУслуг(Профиль, ДатаТело);			
		Возврат;
	
	КонецЕсли;
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 11.11.23 УА #55166

//+ ИнфоСофт Сумин Д.В. 30.05.2023 УА #59231
Процедура ВыполнитьЗакрытиеЗаказов(Профиль) 
	
	Событие = ПолучитьИмяСобытия("ВыполнитьЗакрытиеЗаказовОзон");
		
	//+ ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Если ФукнциональныеОпции.ФормироватьЕдиныйЗаказБезРазбиенияOzon 
		И НЕ ФукнциональныеОпции.ИспользоватьРазбиениеПоСкладамOzon Тогда // без разбиения, создается только 1 заказ
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		
		Если Не ЗначениеЗаполнено(ФукнциональныеОпции.АктивныйЗаказКлиентаOzon) Тогда
			Возврат;
		КонецЕсли;
		
		МассивЗаданий = Новый Массив;
		//+ ИнфоСофт Стояк Ю.К. 22.10.2024 УА #86120		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_Ozon_Заказ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
		|ГДЕ
		|	ИС_Ozon_Заказ.Заказ = &Заказ";
		
		Запрос.УстановитьПараметр("Заказ", ФукнциональныеОпции.АктивныйЗаказКлиентаOzon);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивЗаданий.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
		//МассивЗаданий.Добавить(ФукнциональныеОпции.АктивныйЗаказКлиентаOzon);
		//- ИнфоСофт Стояк Ю.К. 22.10.2024 УА #86120
		
		Если ФукнциональныеОпции.АвтоматическиСоздаватьРеализацииOzon Тогда
			СоздатьРеализации(Профиль, МассивЗаданий);
		КонецЕсли;
		
		СоответствиеПараметровЗаписи = Новый Соответствие;
		СоответствиеПараметровЗаписи.Вставить("АктивныйЗаказКлиентаOzon", Документы.ЗаказКлиента.ПустаяСсылка());
		ИС_MP_Сервер.ЗаписатьНастройкиСправочника(Профиль.Ссылка, СоответствиеПараметровЗаписи); 
		
		Возврат;  
		
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146  
	
	//+ ИнфоСофт Стояк Ю.К. 28.03.2024 УА #72576
	Комиссия25 = ФукнциональныеОпции.ДоговорOzon.КомиссионныеПродажи25;
	//- ИнфоСофт Стояк Ю.К. 28.03.2024 УА #72576
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	//|	ИС_Ozon_ЗаказыВТеченииДня.Склад КАК Склад,
	|	ИС_Ozon_ЗаказыВТеченииДня.СкладМП КАК СкладМП,
	//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	|	ИС_Ozon_ЗаказыВТеченииДня.Профиль КАК Профиль,
	|	ИС_Ozon_ЗаказыВТеченииДня.ЗаказКлиента КАК ЗаказКлиента,
	|	ИС_Ozon_ЗаказыВТеченииДня.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЕСТЬNULL(ИС_Ozon_Заказ.Склад.АвтоматическиСоздаватьОрдерНаОтгрузку, ЛОЖЬ) КАК АвтоматическиСоздаватьОрдерНаОтгрузку
	|ПОМЕСТИТЬ ВТ_УникальныеЗаписи
	|ИЗ
	|	РегистрСведений.ИС_Ozon_ЗаказыВТеченииДня КАК ИС_Ozon_ЗаказыВТеченииДня
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|		ПО ИС_Ozon_ЗаказыВТеченииДня.ЗаказКлиента = ИС_Ozon_Заказ.Заказ
	|ГДЕ
	|	ИС_Ozon_ЗаказыВТеченииДня.Профиль = &Профиль
	|	И ИС_Ozon_ЗаказыВТеченииДня.ЗаказОткрыт
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_Ozon_ЗаказыВТеченииДня.СкладМП,
	|	ИС_Ozon_ЗаказыВТеченииДня.Профиль,
	|	ИС_Ozon_ЗаказыВТеченииДня.ЗаказКлиента,
	|	ИС_Ozon_ЗаказыВТеченииДня.ДатаОтгрузки,
	|	ЕСТЬNULL(ИС_Ozon_Заказ.Склад.АвтоматическиСоздаватьОрдерНаОтгрузку, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	//|	ВТ_УникальныеЗаписи.Склад КАК Склад,
	|	ВТ_УникальныеЗаписи.СкладМП КАК СкладМП,
	//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	|	ВТ_УникальныеЗаписи.Профиль КАК Профиль,
	|	ВТ_УникальныеЗаписи.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_УникальныеЗаписи.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВТ_УникальныеЗаписи.АвтоматическиСоздаватьОрдерНаОтгрузку КАК АвтоматическиСоздаватьОрдерНаОтгрузку,
	|	ВТ_УникальныеЗаписи.ЗаказКлиента.Комментарий КАК Комментарий
	|ИЗ
	|	ВТ_УникальныеЗаписи КАК ВТ_УникальныеЗаписи";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	//+ ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981
	ПорядокОформленияНакладныхРасходныхОрдеров = Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить();
	//- ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981
	
	//+ ИнфоСофт Заварин К.В. 21.10.24 УА #85948
	АвтоматическиСоздаватьРеализации = ФукнциональныеОпции.АвтоматическиСоздаватьРеализацииOzon;
	//- ИнфоСофт Заварин К.В. 21.10.24 УА #85948
	
	Пока Выборка.Следующий() Цикл
		
		//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
		Если ФукнциональныеОпции.ЗакрытиеЗаказаПоДатеОтгрузкиOzon и НачалоДня(Выборка.ДатаОтгрузки) <> НачалоДня(ТекущаяДатаСеанса()) Тогда
			Продолжить;	
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175

		МенеджерЗаписи = РегистрыСведений.ИС_Ozon_ЗаказыВТеченииДня.СоздатьМенеджерЗаписи(); 
		
		//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
		МенеджерЗаписи.СкладМП = Выборка.СкладМП;
		//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
		
		МенеджерЗаписи.Профиль = Выборка.Профиль;
		МенеджерЗаписи.ЗаказКлиента = Выборка.ЗаказКлиента;
		МенеджерЗаписи.ДатаОтгрузки = Выборка.ДатаОтгрузки;
		
		МенеджерЗаписи.ЗаказОткрыт = Ложь;
		
		МенеджерЗаписи.Записать();
		
		//+ ИнфоСофт Заварин К.В. 21.10.24 УА #85948
		Если Не АвтоматическиСоздаватьРеализации Тогда
			Продолжить;	
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 21.10.24 УА #85948
		
		//+ ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981
		Если ПорядокОформленияНакладныхРасходныхОрдеров 
			= Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные Тогда
			
			СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25);
						
			Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.ЗаказКлиента.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
				ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.ЗаказКлиента
															, Выборка.СтатусРасходногоОрдера
															, Выборка.СтатусСтрокиРасходногоОрдера);	
			КонецЕсли;			
					
		Иначе
						
			Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.ЗаказКлиента.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
				ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.ЗаказКлиента
															, Выборка.СтатусРасходногоОрдера
															, Выборка.СтатусСтрокиРасходногоОрдера);	
			КонецЕсли;			
			
			СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25);
			
		КонецЕсли;
		
		//+ ИнфоСофт Стояк Ю.К. 28.03.2024 УА #72576
		//ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		
		//Если Комиссия25 Тогда
		//	ДокументРеализация = Документы.ПередачаТоваровХранителю.СоздатьДокумент();	
		//Иначе
		//	ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		//КонецЕсли; 
		//
		//Попытка
		//	ДокументРеализация.Заполнить(Выборка.ЗаказКлиента);
		//Исключение						
		//	Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//	ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);			                                                      			
		//	Продолжить;
		//КонецПопытки;
		//
		////ДокументРеализация.Заполнить(Выборка.ЗаказКлиента);
		////- ИнфоСофт Стояк Ю.К. 28.03.2024 УА #72576			
		//
		//ДокументРеализация.Дата = Выборка.ДатаОтгрузки;	
		//ДокументРеализация.Комментарий = Выборка.Комментарий;
		//ДокументРеализация.СкидкиРассчитаны = Истина;
		//
		//ЗаписыватьДокумент = Ложь;
		//Если ФукнциональныеОпции.ПроводитьРеализацииOzon Тогда
		//	
		//	Попытка
		//		ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
		//	Исключение
		//		ЗаписыватьДокумент = Истина;
		//		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//	КонецПопытки;
		//	
		//Иначе
		//	ЗаписыватьДокумент = Истина;	
		//КонецЕсли;
		//
		//Если ЗаписыватьДокумент Тогда	
		//	
		//	Попытка
		//		ДокументРеализация.Записать();			
		//	Исключение
		//		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);				
		//	КонецПопытки;
		//	
		//КонецЕсли;		
		//- ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981
		
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 30.05.2023 УА #59231

//+ ИнфоСофт Сумин Д.В. 23.05.2023 УА #58355 
Процедура ВыполнитьАлгоритмПоОсновнойСхемеFBO(Профиль) 
	
	Событие = ПолучитьИмяСобытия("ВыполнитьАлгоритмПоОсновнойСхемеFBO");
	
	Настройки = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
		
	Попытка
		Остатки = ПолучитьИнформациюОбОстатках(Профиль);
		ОстаткиFBO = Остатки.FBO;
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , Текст);
		Возврат;
	КонецПопытки;
	
	Если ОстаткиFBO.Количество() = 0 Тогда
		Текст = "Ozon не предоставляет информацию по остаткам. Проверьте корректность токена статистики. Если токен корректный, необходимо обратиться в техническую поддержку Wildberries для уточнения сроков исправления неисправностей.";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , Текст);
		Возврат;	
	КонецЕсли;
	
	МассивId = Новый Массив;
	
	Для Каждого Элемент Из ОстаткиFBO Цикл
		Если Элемент.НаСкладе > 0 Тогда
			МассивId.Добавить(Элемент.nmId);	
		КонецЕсли;	
	КонецЦикла;
	
	//Добавим записи ручных остатков по тем позициям, которых нет на fbo
	ЗапросСклады = Новый Запрос;
	ЗапросСклады.Текст =
	"ВЫБРАТЬ
	|	ИС_Ozon_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_Ozon_Склады КАК ИС_Ozon_Склады
	|ГДЕ
	|	ИС_Ozon_Склады.Профиль = &Профиль
	|	И ИС_Ozon_Склады.ЗагруженИзЛК
	|	И ИС_Ozon_Склады.ИспользоватьСхемуFBO";	
	
	ЗапросСклады.УстановитьПараметр("Профиль", Профиль);
	РезультатЗапросаСклады = ЗапросСклады.Выполнить();  
	
	Если РезультатЗапросаСклады.Пустой() Тогда
		Текст = "В информационной базе не найден ни один склад fbs с включенной опцией.";
		ЗаписьЖурналаРегистрации("ИС.Ozon.ВыполнениеАлгоритмаПоОсновнойСхемеFbo", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		Возврат;	
	КонецЕсли;
	
	ВыборкаСклады = РезультатЗапросаСклады.Выбрать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|ГДЕ
	|	ИС_Ozon_Номенклатура.Профиль = &Профиль
	|	И ИС_Ozon_Номенклатура.offer_id В(&offer_id)";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("offer_id", МассивId);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	ТаблицаВыгрузки = РезультатЗапроса.Выгрузить();	
	
	Пока ВыборкаСклады.Следующий() Цикл
		
		//Выполним очистку всех записей регистра ручных остатков
		
		//+ ИнфоСофт Заварин К.В. 01.08.24 УА #80754
		//НаборЗаписей = РегистрыСведений.ИС_Ozon_Остатки.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.СкладOzon.Установить(ВыборкаСклады.Ссылка);
		//НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.ИС_MP_РучныеОстатки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Профиль.Установить(Профиль);
		НаборЗаписей.Отбор.Маркетплейс.Установить(Перечисления.ИС_МП_Маркетплейсы.Озон);
		НаборЗаписей.Отбор.Склад.Установить(ВыборкаСклады.Ссылка);
		НаборЗаписей.Записать();
	    //- ИнфоСофт Заварин К.В. 01.08.24 УА #80754
		
		Для Каждого Строка Из ТаблицаВыгрузки Цикл
			
			//+ ИнфоСофт Заварин К.В. 01.08.24 УА #80754
			ИС_МП_УправлениеОстатками.ЗаписатьРучнойОстаток(Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, ВыборкаСклады.Ссылка, Строка.Номенклатура, 0);
			
			//НаборЗаписейОстатоков = РегистрыСведений.ИС_Ozon_Остатки.СоздатьНаборЗаписей();
			//НаборЗаписейОстатоков.Отбор.Период.Установить(ТекущаяДатаСеанса());			
			//НоваяЗапись = НаборЗаписейОстатоков.Добавить();	
			//НоваяЗапись.НоменклатураOzon = Строка.Номенклатура;
			//НоваяЗапись.СкладOzon = ВыборкаСклады.Ссылка; 
			//НоваяЗапись.Остаток = 0;
			//НоваяЗапись.Период = ТекущаяДатаСеанса(); 
			//НаборЗаписейОстатоков.Записать(Ложь);
			//- ИнфоСофт Заварин К.В. 01.08.24 УА #80754 
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 23.05.2023 УА #58355

#КонецОбласти

//+ ИнфоСофт Сумин Д.В. 15.12.2023 УА #65730
Функция ПолучитьСписокТранзакций(Профиль, Период) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
		
	Если НастройкиСоединения = Неопределено Тогда
		ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	КонецЕсли;  
		
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
		
	СтруктураТела = Новый Структура;
	
	СтруктураДат = Новый Структура;
	СтруктураДат.Вставить("from", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(Период.ДатаНачала, ФорматДатыJSON.ISO
		, ВариантЗаписиДатыJSON.УниверсальнаяДата));
	СтруктураДат.Вставить("to", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(Период.ДатаНачала, ФорматДатыJSON.ISO
		, ВариантЗаписиДатыJSON.УниверсальнаяДата));

	
	Фильтр = Новый Структура;
	Фильтр.Вставить("date", СтруктураДат);
	Фильтр.Вставить("operation_type", Новый Массив);
	Фильтр.Вставить("posting_number", "");
	Фильтр.Вставить("transaction_type", "all");
	
	СтруктураТела.Вставить("filter", Фильтр);
	СтруктураТела.Вставить("page", 1);   	
	СтруктураТела.Вставить("page_size", 1000);
	
	Результат = ИС_Ozon_API.ПолучитьСписокТранзакций(Профиль, ПараметрыЗапроса, СтруктураТела);
	
	ТаблицаУслуг = ОбработатьРезультат(Результат.operations);
	
КонецФункции //- ИнфоСофт Сумин Д.В. 15.12.2023 УА #65730

#КонецОбласти
                                    
#Область КарточкиТоваров                                

//+ ИнфоСофт Ивонин К.А. 03.03.25 УА #92887
Функция КоличествоТоваров(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество
	|ИЗ
	|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|ГДЕ
	|	ИС_Ozon_Номенклатура.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКоличества = РезультатЗапроса.Выбрать();
	
	Если ВыборкаКоличества.Следующий() Тогда
		Возврат ВыборкаКоличества.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 03.03.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 07.02.25 УА #92406
Функция ОбработатьДопПараметрыЗагрузкиТоваров(ДопПараметры) Экспорт
	Возврат ДопПараметры;
КонецФункции //- ИнфоСофт Ивонин К.А. 07.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
Функция ОбновитьСписокТоваров(Профиль, Перезаполнять = Ложь, ДопПараметры = Неопределено) Экспорт

	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);

	СтруктураЗапроса = ИС_Ozon_API.ПолучитьСтруктуруПараметровЗапросаСпискаТоваров(1);
	
	РезультатЗапроса = ИС_Ozon_API.ПолучитьСписокТоваров(Профиль, ПараметрыЗапроса, СтруктураЗапроса);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КоличествоТоваров = РезультатЗапроса["total"];
	
	КоличествоЭлементовНаЗапрос = НастройкиСоединения["КоличествоЭлементовНаЗапрос"];
	КоличествоПопытокЗапроса = НастройкиСоединения["КоличествоОшибокЗапросов"];

	last_id = "";
	ТекущаяСтраница = 1;
	КоличествоОшибок = 0;

	МассивДляПолучения = Новый Массив;
	
	Пока Истина Цикл
	    
	    Если КоличествоОшибок > КоличествоПопытокЗапроса Тогда
	    	ОбщегоНазначения.СообщитьПользователю("Превышено количество ошибок запросов");
	    	Возврат Неопределено;
	    КонецЕсли;
	    
	    СтруктураЗапроса = ИС_Ozon_API.ПолучитьСтруктуруПараметровЗапросаСпискаТоваров(
	    	КоличествоЭлементовНаЗапрос, last_id);
	    	
	    РезультатЗапроса = ИС_Ozon_API.ПолучитьСписокТоваров(Профиль, ПараметрыЗапроса, СтруктураЗапроса);
	
		Если РезультатЗапроса = Неопределено Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
			Продолжить;
		КонецЕсли;
	    
	    last_id = РезультатЗапроса["last_id"];
	    
	    Для Каждого Элемент Из РезультатЗапроса["items"] Цикл
	    	МассивДляПолучения.Добавить(Элемент["offer_id"]);	
	    КонецЦикла;
	    
		Если last_id = "" Тогда
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивДляПолучения, 1000);
	
	Для Каждого МассивOfferId Из РазбитыйМассив Цикл
	
		РезультатЗапроса = ИС_Ozon_API.ПолучитьСписокТоваровПоИдентификаторам(Профиль, ПараметрыЗапроса, МассивOfferId);
		Если РезультатЗапроса = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЭлементТовар Из РезультатЗапроса["items"] Цикл
			СоздатьИлиОбновитьНоменклатуру(Профиль, ЭлементТовар, Перезаполнять);
		КонецЦикла;
	
	КонецЦикла;
	
	Возврат "Загрузка завершена";
	
КонецФункции //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
Процедура СоздатьИлиОбновитьНоменклатуру(Профиль, СтруктураНоменклатуры, Перезаполнять = Ложь)
	
	//+ ИнфоСофт Стояк Ю.К. 04.03.2025 УА #95041	
	//OzonНоменклатура = Справочники.ИС_Ozon_Номенклатура.НайтиПоКоду(СтруктураНоменклатуры["id"]);
	OzonНоменклатура = Справочники.ИС_Ozon_Номенклатура.НайтиПоКоду(Формат(СтруктураНоменклатуры["id"], "ЧГ=0"));
	//- ИнфоСофт Стояк Ю.К. 04.03.2025 УА #95041
    
    Если OzonНоменклатура.Пустая() Тогда
    	OzonНоменклатура = Справочники.ИС_Ozon_Номенклатура.СоздатьЭлемент();
    Иначе
    		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_Номенклатура.updated_at КАК updated_at
		|ИЗ
		|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
		|ГДЕ
		|	ИС_Ozon_Номенклатура.Ссылка = &Ссылка
		|	И ИС_Ozon_Номенклатура.Профиль = &Профиль";
		
		Запрос.УстановитьПараметр("Ссылка", OzonНоменклатура); 
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДаты = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДаты.Следующий() Тогда
			ПоследнееИзменение = ВыборкаДаты.updated_at;
		Иначе
			Возврат;
		КонецЕсли;
	
    	ДатаПоследнегоИзменеия = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(СтруктураНоменклатуры["updated_at"], ФорматДатыJSON.ISO);
    	Если Перезаполнять Или ДатаПоследнегоИзменеия > ПоследнееИзменение Тогда
    		OzonНоменклатура = OzonНоменклатура.ПолучитьОбъект();
    	Иначе
    		Возврат;
    	КонецЕсли;	
    
    КонецЕсли;
	
	OzonНоменклатура.Профиль = Профиль;
	
	//+ ИнфоСофт Заварин К.В. 20.02.25 УА #94229
	//OzonНоменклатура.Код = СтруктураНоменклатуры["id"];   
	OzonНоменклатура.Код = Формат(СтруктураНоменклатуры["id"], "ЧГ=0");
	//- ИнфоСофт Заварин К.В. 20.02.25 УА #94229 
	
	OzonНоменклатура.Наименование = СтруктураНоменклатуры["name"];
	OzonНоменклатура.offer_id = СтруктураНоменклатуры["offer_id"]; 			
	
	//+ ИнфоСофт Мурсалимов Д.Р. 07.02.25 УА #92643
	//OzonНоменклатура.Штрихкод = СтруктураНоменклатуры["barcode"];
	
	Штрихкоды = СтруктураНоменклатуры["barcodes"];
	
	Если Штрихкоды <> Неопределено И Штрихкоды.Количество() > 0 Тогда
	
		Для Каждого Элемент Из Штрихкоды Цикл
			
			OzonНоменклатура.Штрихкод = Элемент;
			Продолжить;                             
			
		КонецЦикла;		
		
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 07.02.25 УА #92643                                 

    //OzonНоменклатура.buybox_price = СтруктураНоменклатуры.buybox_price; Цена главного предложения на Ozon.
    //OzonНоменклатура.category_id = СтруктураНоменклатуры.category_id; Идентификатор категории.
    OzonНоменклатура.ДатаСоздания = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(СтруктураНоменклатуры["created_at"], ФорматДатыJSON.ISO);
    
    OzonНоменклатура.Изображения.Очистить();
    Для Каждого Элемент Из СтруктураНоменклатуры["images"] Цикл
    	НоваяСтрока = OzonНоменклатура.Изображения.Добавить();
    	НоваяСтрока.АдресИзображения = Элемент;
    КонецЦикла; 
    
    OzonНоменклатура.ЦенаАкции = ?(СтруктураНоменклатуры["marketing_price"] = "", 0, Число(СтруктураНоменклатуры["marketing_price"]));
    //OzonНоменклатура.min_ozon_price = ?(СтруктураНоменклатуры.min_ozon_price = "", 0, Число(СтруктураНоменклатуры.min_ozon_price)); Минимальная цена на аналогичный товар на Ozon.
    OzonНоменклатура.ЦенаБезУчетаСкидок = ?(СтруктураНоменклатуры["old_price"] = "", 0, Число(СтруктураНоменклатуры["old_price"]));   
	//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698	
	//OzonНоменклатура.ЦенаПремиум = ?(СтруктураНоменклатуры["premium_price"] = "", 0, Число(СтруктураНоменклатуры["premium_price"]));
	//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
	OzonНоменклатура.Цена = ?(СтруктураНоменклатуры["price"] = "", 0, Число(СтруктураНоменклатуры["price"]));			
	//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
	//OzonНоменклатура.РекомендованнаяЦена = ?(СтруктураНоменклатуры["recommended_price"] = "", 0, Число(СтруктураНоменклатуры["recommended_price"]));
	//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
	//+ ИнфоСофт Украинцева А.А. 20.11.2023 УА #61911  
	OzonНоменклатура.min_price = ?(СтруктураНоменклатуры["min_price"] = "", 0, Число(СтруктураНоменклатуры["min_price"])); //Минимальная цена товара после применения всех акций.    
	OzonНоменклатура.description_category_id = ?(СтруктураНоменклатуры["description_category_id"] = "", 0, Число(СтруктураНоменклатуры["description_category_id"]));
	//OzonНоменклатура.КатегорияТовара = Справочники.ИС_Ozon_Категории.НайтиПоКоду(OzonНоменклатура.description_category_id);   
	//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698	
	//OzonНоменклатура.has_discounted_item =  СтруктураНоменклатуры["has_discounted_item"];
	//OzonНоменклатура.primary_image =  СтруктураНоменклатуры["primary_image"]; 
	//+ ИнфоСофт Стояк Ю.К. 10.02.2025 УА #93369	
	Если Не СтруктураНоменклатуры["primary_image"].Количество() = 0 Тогда
		OzonНоменклатура.primary_image =  СтруктураНоменклатуры["primary_image"][0]; 
	КонецЕсли;
	//OzonНоменклатура.primary_image =  СтруктураНоменклатуры["primary_image"][0]; 
	//- ИнфоСофт Стояк Ю.К. 10.02.2025 УА #93369
	//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
	OzonНоменклатура.is_discounted =  СтруктураНоменклатуры["is_discounted"];
    OzonНоменклатура.min_price =  ?(СтруктураНоменклатуры["min_price"] = "", 0, Число(СтруктураНоменклатуры["min_price"]));  
	
	//СоответствиеСтавокНДС = ИС_Ozon_СерверПовтИсп.СоответствиеСтавокНДС();
	//OzonНоменклатура.vat = СоответствиеСтавокНДС.Получить(СтруктураНоменклатуры["vat"]);
    //- ИнфоСофт Украинцева А.А. 20.11.2023 УА #61911
    
    OzonНоменклатура.sku = 0;
    
	Если СтруктураНоменклатуры["sources"] <> Неопределено Тогда
	
		Для Каждого Элемент Из СтруктураНоменклатуры["sources"] Цикл
			
			//+ ИнфоСофт Стояк Ю.К. 11.02.2025 УА #93356						
			//Если Элемент["source"] = "fbs" Тогда      
			Если Элемент["source"] = "sds" Тогда      			
				OzonНоменклатура.sku = Элемент["sku"];
				Продолжить;                             
			КонецЕсли;	
			
			Если Элемент["source"] = "fbo" Тогда      			
				OzonНоменклатура.sku_fbo = Элемент["sku"];
				Продолжить;                             
			КонецЕсли;
			
			Если Элемент["source"] = "fbs" Тогда      			
				OzonНоменклатура.sku_fbs = Элемент["sku"];
				Продолжить;                             
			КонецЕсли;						
						
		КонецЦикла;		
		
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(OzonНоменклатура.sku) Тогда
	//	OzonНоменклатура.sku = СтруктураНоменклатуры["fbs_sku"];
	//КонецЕсли;
	//	
	//Если Не ЗначениеЗаполнено(OzonНоменклатура.sku) Тогда
	//	OzonНоменклатура.sku = СтруктураНоменклатуры["sku"]; 
	//КонецЕсли;                  
	//- ИнфоСофт Стояк Ю.К. 11.02.2025 УА #93356
	
	//"stocks": {
	//"coming": 0,
	//"present": 68,
	//"reserved": 0
	//},
	//"errors": [],
    //"vat": "0.200000",
	//"visible": true,
	//"visibility_details": {
	//    "has_price": false,
	//    "has_stock": true,
	//    "active_product": false,
	//    "reasons": {}
	//},
	//"price_index": "1.11",
	//"images360": [],
	//"color_image": "",
	//"primary_image": "https://cdn1.ozone.ru/s3/multimedia-h/6493276373.jpg",
	//"status": {
	//    "state": "price_sent",
	//    "state_failed": "",
	//    "moderate_status": "approved",
	//    "decline_reasons": [],
	//    "validation_state": "success",
	//    "state_name": "Продается",
	//    "state_description": "",
	//    "is_failed": false,
	//    "is_created": true,
	//    "state_tooltip": "",
	//    "item_errors": [],
	//    "state_updated_at": "2022-12-12T10:01:43.909902Z"
	//},
	//"state": "",
	//"service_type": "IS_CODE_SERVICE",
	//"currency_code": "RUB",
	OzonНоменклатура.is_kgt = СтруктураНоменклатуры["is_kgt"];
	//"rating": "",
	//"discounted_stocks": {
	//    "coming": 0,
	//    "present": 0,
	//    "reserved": 0
	//},
	//"is_discounted": false,
	//"has_discounted_item": false,
	//"barcodes": [
	//    "8699272140440",
	//    "OZN195344971"
	//], 
	//+ ИнфоСофт Мурсалимов Д.Р. 21.08.23 УА #61952
	//Добавил обработку реквизита "update_at"
	OzonНоменклатура.updated_at = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(СтруктураНоменклатуры["updated_at"], ФорматДатыJSON.ISO);
	//- ИнфоСофт Мурсалимов Д.Р. 21.08.23 УА #61952
	//"price_indexes": {
	//    "price_index": "NON_PROFIT",
	//    "external_index_data": {
	//        "minimal_price": "24990.0000",
	//        "minimal_price_currency": "RUB",
	//        "price_index_value": 1
	//    },
	//    "ozon_index_data": {
	//        "minimal_price": "16995.0000",
	//        "minimal_price_currency": "RUB",
	//        "price_index_value": 1.32
	//    },
	//    "self_marketplaces_index_data": {
	//        "minimal_price": "24990.0000",
	//        "minimal_price_currency": "RUB",
	//        "price_index_value": 1
	//    }
	//}
	
	//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698	
	//OzonНоменклатура.ЕстьЦена = СтруктураНоменклатуры["visibility_details"]["active_product"];
	//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
	OzonНоменклатура.ДоступенНаСкладе = СтруктураНоменклатуры["visibility_details"]["has_price"];
	OzonНоменклатура.ДоступенДляПокупки = СтруктураНоменклатуры["visibility_details"]["has_stock"];	
		
	Попытка
		OzonНоменклатура.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Для Каждого Штрихкод Из СтруктураНоменклатуры["barcodes"] Цикл 
		
		// Переделать на регистр
		
		//+ ИнфоСофт Мурсалимов Д.Р. 21.08.24 УА #81200
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_Штрихкоды.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_Ozon_Штрихкоды КАК ИС_Ozon_Штрихкоды
		|ГДЕ
		|	ИС_Ozon_Штрихкоды.Наименование = &Штрихкод
		|	И ИС_Ozon_Штрихкоды.ЛичныйКабинет = &Профиль";
		
		Запрос.УстановитьПараметр("Штрихкод", Штрихкод); 
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаХарактеристикиOzon = РезультатЗапроса.Выбрать();
		
		Если ВыборкаХарактеристикиOzon.Следующий() Тогда
			ХарактеристикаOzon = ВыборкаХарактеристикиOzon.Ссылка.ПолучитьОбъект();
		Иначе
			ХарактеристикаOzon = Справочники.ИС_Ozon_Штрихкоды.СоздатьЭлемент();
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 21.08.24 УА #81200  
		
		ХарактеристикаOzon.Карточка = OzonНоменклатура.Ссылка;
		ХарактеристикаOzon.Владелец = OzonНоменклатура.Ссылка;
		ХарактеристикаOzon.Наименование = Штрихкод;
		ХарактеристикаOzon.ЛичныйКабинет = Профиль;
		
		Попытка
			ХарактеристикаOzon.Записать();
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;				
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
Функция СоздатьИзменитьНоменклатуруПоИдентификаторам(Профиль, МассивИдентификаторов, Перезаполнять = Ложь) Экспорт

	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса    = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивИдентификаторов, 1000);
	
	МассивНоменклатуры = Новый Массив;
	
	Для Каждого МассивOfferId Из РазбитыйМассив Цикл
	
		РезультатЗапроса = ИС_Ozon_API.ПолучитьСписокТоваровПоИдентификаторам(Профиль, ПараметрыЗапроса, МассивOfferId);
		Если РезультатЗапроса = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураНоменклатура = Новый Структура("НоменклатураОзон, offer_id");
		
		Для Каждого ЭлементТовар Из РезультатЗапроса["items"] Цикл
			
			НоменклатураОзон = СоздатьОбновитьНоменклатуру(Профиль, ЭлементТовар, Перезаполнять);
			
			Если Не НоменклатураОзон.Пустая() Тогда	
				
				СтруктураНоменклатура.НоменклатураОзон = НоменклатураОзон;
				СтруктураНоменклатура.offer_id         = ЭлементТовар.id;
				
				МассивНоменклатуры.Добавить(СтруктураНоменклатура);
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
Функция СоздатьОбновитьНоменклатуру(Профиль, СтруктураНоменклатуры, Перезаполнять = Ложь) Экспорт

	OzonНоменклатура = Справочники.ИС_Ozon_Номенклатура.НайтиПоКоду(СтруктураНоменклатуры["id"]);
    
    Если OzonНоменклатура.Пустая() Тогда
    	OzonНоменклатура = Справочники.ИС_Ozon_Номенклатура.СоздатьЭлемент();
    Иначе
    		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_Номенклатура.updated_at КАК updated_at
		|ИЗ
		|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
		|ГДЕ
		|	ИС_Ozon_Номенклатура.Ссылка = &Ссылка
		|	И ИС_Ozon_Номенклатура.Профиль = &Профиль";
		
		Запрос.УстановитьПараметр("Ссылка", OzonНоменклатура); 
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДаты = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДаты.Следующий() Тогда
			ПоследнееИзменение = ВыборкаДаты.updated_at;
		Иначе
			//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
			Возврат OzonНоменклатура;
			//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
		КонецЕсли;
	
    	ДатаПоследнегоИзменеия = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(СтруктураНоменклатуры["updated_at"], ФорматДатыJSON.ISO);
		
		Если Перезаполнять Или ДатаПоследнегоИзменеия > ПоследнееИзменение Тогда
    		OzonНоменклатура = OzonНоменклатура.ПолучитьОбъект();
		Иначе
			//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
    		Возврат OzonНоменклатура;
			//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
    	КонецЕсли;	
    
    КонецЕсли;
	
	OzonНоменклатура.Профиль = Профиль;
	OzonНоменклатура.Код = СтруктураНоменклатуры["id"];
	OzonНоменклатура.Наименование = СтруктураНоменклатуры["name"];
	OzonНоменклатура.offer_id = СтруктураНоменклатуры["offer_id"]; 			
	OzonНоменклатура.Штрихкод = СтруктураНоменклатуры["barcode"];                                 

    //OzonНоменклатура.buybox_price = СтруктураНоменклатуры.buybox_price; Цена главного предложения на Ozon.
    //OzonНоменклатура.category_id = СтруктураНоменклатуры.category_id; Идентификатор категории.
    OzonНоменклатура.ДатаСоздания = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(СтруктураНоменклатуры["created_at"], ФорматДатыJSON.ISO);
    
    OzonНоменклатура.Изображения.Очистить();
    Для Каждого Элемент Из СтруктураНоменклатуры["images"] Цикл
    	НоваяСтрока = OzonНоменклатура.Изображения.Добавить();
    	НоваяСтрока.АдресИзображения = Элемент;
    КонецЦикла; 
    
    OzonНоменклатура.ЦенаАкции = ?(СтруктураНоменклатуры["marketing_price"] = "", 0, Число(СтруктураНоменклатуры["marketing_price"]));
    //OzonНоменклатура.min_ozon_price = ?(СтруктураНоменклатуры.min_ozon_price = "", 0, Число(СтруктураНоменклатуры.min_ozon_price)); Минимальная цена на аналогичный товар на Ozon.
    OzonНоменклатура.ЦенаБезУчетаСкидок = ?(СтруктураНоменклатуры["old_price"] = "", 0, Число(СтруктураНоменклатуры["old_price"]));
	
	//+ ИнфоСофт Мурсалимов Д.Р. 21.04.25 УА #96982
	//OzonНоменклатура.ЦенаПремиум = ?(СтруктураНоменклатуры["premium_price"] = "", 0, Число(СтруктураНоменклатуры["premium_price"]));
	//- ИнфоСофт Мурсалимов Д.Р. 21.04.25 УА #96982
	
	OzonНоменклатура.Цена = ?(СтруктураНоменклатуры["price"] = "", 0, Число(СтруктураНоменклатуры["price"]));			
	OzonНоменклатура.РекомендованнаяЦена = ?(СтруктураНоменклатуры["recommended_price"] = "", 0, Число(СтруктураНоменклатуры["recommended_price"]));
	//+ ИнфоСофт Украинцева А.А. 20.11.2023 УА #61911  
	OzonНоменклатура.min_price = ?(СтруктураНоменклатуры["min_price"] = "", 0, Число(СтруктураНоменклатуры["min_price"])); //Минимальная цена товара после применения всех акций.    
	OzonНоменклатура.description_category_id = ?(СтруктураНоменклатуры["description_category_id"] = "", 0, Число(СтруктураНоменклатуры["description_category_id"]));
	//OzonНоменклатура.КатегорияТовара = Справочники.ИС_Ozon_Категории.НайтиПоКоду(OzonНоменклатура.description_category_id);   
	OzonНоменклатура.has_discounted_item =  СтруктураНоменклатуры["has_discounted_item"];
	OzonНоменклатура.primary_image =  СтруктураНоменклатуры["primary_image"]; 
	OzonНоменклатура.is_discounted =  СтруктураНоменклатуры["is_discounted"];
    OzonНоменклатура.min_price =  ?(СтруктураНоменклатуры["min_price"] = "", 0, Число(СтруктураНоменклатуры["min_price"]));  
	
	//СоответствиеСтавокНДС = ИС_Ozon_СерверПовтИсп.СоответствиеСтавокНДС();
	//OzonНоменклатура.vat = СоответствиеСтавокНДС.Получить(СтруктураНоменклатуры["vat"]);
    //- ИнфоСофт Украинцева А.А. 20.11.2023 УА #61911
    
    OzonНоменклатура.sku = 0;
    
	Если СтруктураНоменклатуры["sources"] <> Неопределено Тогда
	
		Для Каждого Элемент Из СтруктураНоменклатуры["sources"] Цикл
		
			Если Элемент["source"] = "fbs" Тогда
				OzonНоменклатура.sku = Элемент["sku"];
				Продолжить;
			КонецЕсли;
						
		КонецЦикла;		
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(OzonНоменклатура.sku) Тогда
		OzonНоменклатура.sku = СтруктураНоменклатуры["fbs_sku"];
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(OzonНоменклатура.sku) Тогда
		OzonНоменклатура.sku = СтруктураНоменклатуры["sku"]; 
	КонецЕсли;
	
	//"stocks": {
	//"coming": 0,
	//"present": 68,
	//"reserved": 0
	//},
	//"errors": [],
    //"vat": "0.200000",
	//"visible": true,
	//"visibility_details": {
	//    "has_price": false,
	//    "has_stock": true,
	//    "active_product": false,
	//    "reasons": {}
	//},
	//"price_index": "1.11",
	//"images360": [],
	//"color_image": "",
	//"primary_image": "https://cdn1.ozone.ru/s3/multimedia-h/6493276373.jpg",
	//"status": {
	//    "state": "price_sent",
	//    "state_failed": "",
	//    "moderate_status": "approved",
	//    "decline_reasons": [],
	//    "validation_state": "success",
	//    "state_name": "Продается",
	//    "state_description": "",
	//    "is_failed": false,
	//    "is_created": true,
	//    "state_tooltip": "",
	//    "item_errors": [],
	//    "state_updated_at": "2022-12-12T10:01:43.909902Z"
	//},
	//"state": "",
	//"service_type": "IS_CODE_SERVICE",
	//"currency_code": "RUB",
	OzonНоменклатура.is_kgt = СтруктураНоменклатуры["is_kgt"];
	//"rating": "",
	//"discounted_stocks": {
	//    "coming": 0,
	//    "present": 0,
	//    "reserved": 0
	//},
	//"is_discounted": false,
	//"has_discounted_item": false,
	//"barcodes": [
	//    "8699272140440",
	//    "OZN195344971"
	//], 
	//+ ИнфоСофт Мурсалимов Д.Р. 21.08.23 УА #61952
	//Добавил обработку реквизита "update_at"
	OzonНоменклатура.updated_at = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(СтруктураНоменклатуры["updated_at"], ФорматДатыJSON.ISO);
	//- ИнфоСофт Мурсалимов Д.Р. 21.08.23 УА #61952
	//"price_indexes": {
	//    "price_index": "NON_PROFIT",
	//    "external_index_data": {
	//        "minimal_price": "24990.0000",
	//        "minimal_price_currency": "RUB",
	//        "price_index_value": 1
	//    },
	//    "ozon_index_data": {
	//        "minimal_price": "16995.0000",
	//        "minimal_price_currency": "RUB",
	//        "price_index_value": 1.32
	//    },
	//    "self_marketplaces_index_data": {
	//        "minimal_price": "24990.0000",
	//        "minimal_price_currency": "RUB",
	//        "price_index_value": 1
	//    }
	//}

	OzonНоменклатура.ЕстьЦена = СтруктураНоменклатуры["visibility_details"]["active_product"];
	OzonНоменклатура.ДоступенНаСкладе = СтруктураНоменклатуры["visibility_details"]["has_price"];
	OzonНоменклатура.ДоступенДляПокупки = СтруктураНоменклатуры["visibility_details"]["has_stock"];	
		
	Попытка
		OzonНоменклатура.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
		Возврат Неопределено;
		//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
	КонецПопытки;
	
	Для Каждого Штрихкод Из СтруктураНоменклатуры["barcodes"] Цикл 
		
		// Переделать на регистр
		
		//+ ИнфоСофт Мурсалимов Д.Р. 21.08.24 УА #81200
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_Штрихкоды.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_Ozon_Штрихкоды КАК ИС_Ozon_Штрихкоды
		|ГДЕ
		|	ИС_Ozon_Штрихкоды.Наименование = &Штрихкод
		|	И ИС_Ozon_Штрихкоды.ЛичныйКабинет = &Профиль";
		
		Запрос.УстановитьПараметр("Штрихкод", Штрихкод); 
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаХарактеристикиOzon = РезультатЗапроса.Выбрать();
		
		Если ВыборкаХарактеристикиOzon.Следующий() Тогда
			ХарактеристикаOzon = ВыборкаХарактеристикиOzon.Ссылка.ПолучитьОбъект();
		Иначе
			ХарактеристикаOzon = Справочники.ИС_Ozon_Штрихкоды.СоздатьЭлемент();
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 21.08.24 УА #81200  
		
		ХарактеристикаOzon.Карточка = OzonНоменклатура.Ссылка;
		ХарактеристикаOzon.Владелец = OzonНоменклатура.Ссылка;
		ХарактеристикаOzon.Наименование = Штрихкод;
		ХарактеристикаOzon.ЛичныйКабинет = Профиль;
		
		Попытка
			ХарактеристикаOzon.Записать();
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;				
		
	КонецЦикла;
	
	//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
	Возврат OzonНоменклатура.Ссылка;
	//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
	
КонецФункции //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

//+ ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628
Функция СоздатьНоменклатуру(ТаблицаТоваров, СтруктураСвойств) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Для Каждого товар Из ТаблицаТоваров Цикл
		
		ЗаписатьСопоставление = Истина;
		КодНоменклатуры = Формат(товар.product_id, "ЧГ=0");

		СозданнаяНоменклатура = Справочники["Номенклатура"].НайтиПоКоду(КодНоменклатуры);
		Если ЗначениеЗаполнено(СозданнаяНоменклатура) Тогда
			Номенклатура = СозданнаяНоменклатура.ПолучитьОбъект();
			ЗаписатьСопоставление = Ложь;
		Иначе
			Номенклатура = Справочники["Номенклатура"].СоздатьЭлемент();
		КонецЕсли;

		Номенклатура.ПометкаУдаления	= Ложь;
		Номенклатура.Родитель			= СтруктураСвойств.ГруппаНоменклатуры;
		Номенклатура.Наименование 		= товар.Наименование;
		Номенклатура.НаименованиеПолное = товар.Наименование;
		Номенклатура.Артикул 			= товар.Артикул;
		Номенклатура.Код 		 		= КодНоменклатуры;
		Номенклатура.Качество 			= ПредопределенноеЗначение("Перечисление.ГрадацииКачества.Новый");
		Номенклатура.ВидНоменклатуры 	= СтруктураСвойств.ВидНоменклатуры;  		

		Справочники["Номенклатура"].ЗаполнитьРеквизитыПоВидуНоменклатуры(Номенклатура);
		Номенклатура.СтавкаНДС = СтруктураСвойств.СтавкаНДС;
		
		СоздатьШтрихкод = Ложь;
		
		
		Попытка

			Номенклатура.Записать();
			Упаковка = УпаковкаНоменклатурыПоУмолчанию(Номенклатура.Ссылка);
			Если ЗначениеЗаполнено(товар.Штрихкод) Тогда
				СоздатьШтрихкод = Истина;
			КонецЕсли;			
			товар.Номенклатура = Номенклатура.Ссылка;
			
		Исключение
			
			ЗаписатьСопоставление = Ложь;
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			КомментарийКраткий = СтрШаблон(
				"Не удалось записать номенклатуру для товара: %1 артикул: %2 по причине: %3", товар.Наименование,
				товар.Артикул, КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
			КомментарийПодробный = СтрШаблон(
				"Не удалось записать номенклатуру для товара: %1 артикул: %2 по причине: %3", товар.Наименование,
				товар.Артикул, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("СозданиеНоменклатурыOzon", КомментарийПодробный);
			ОбщегоНазначения.СообщитьПользователю(КомментарийКраткий);

		КонецПопытки;
		
		Если СоздатьШтрихкод Тогда
			МенеджерЗаписи = РегистрыСведений["ШтрихкодыНоменклатуры"].СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Штрихкод 		= товар.Штрихкод; 
			МенеджерЗаписи.Номенклатура 	= Номенклатура.Ссылка;			
			МенеджерЗаписи.Упаковка 		= Упаковка;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
		Если ЗаписатьСопоставление Тогда
			МенеджерЗаписи = РегистрыСведений.ИС_Ozon_СоответствиеХарактеристик.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.НоменклатураOzon = товар.НоменклатураOzon; 
			МенеджерЗаписи.Номенклатура 	= Номенклатура.Ссылка;						
			МенеджерЗаписи.Записать();	
		КонецЕсли;
		
	КонецЦикла;

	Возврат ТаблицаТоваров;

КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628

//+ ИнфоСофт Ивонин К.А. 20.03.24 УА #71892
Функция ЗагрузитьЛимитыСозданияИОбновленияТоваров(Профиль) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	Возврат ИС_Ozon_API.ЛимитыНаАссортиментСозданиеИОбновлениеТоваров(ПараметрыЗапроса);  
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.03.24 УА #71892

#Область ЗагрузкаСтруктурДляВыгрукзи

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура ЗагрузитьКатегорииТоваров(Профиль) Экспорт 
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);

	МассивКатегорииТоваров = ИС_Ozon_API.ПолучитьДеревоКатегорий(ПараметрыЗапроса);

	Если МассивКатегорииТоваров = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КатегорииСОбязательнымиСертификатами = КатегорииСОбязательнымиСертификатами(ПараметрыЗапроса);
	МассивАктуальныхКатегорий = Новый Массив;
	ОбработатьКатегорииТоваров(МассивКатегорииТоваров, МассивАктуальныхКатегорий, КатегорииСОбязательнымиСертификатами);
	УдалитьУстаревшиеКатегорииТоваров(МассивАктуальныхКатегорий);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура ЗагрузитьХарактеристикиКатегорий(Профиль, Категория = Неопределено) Экспорт 
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);

	МассивКатегорииТоваров = КатегорииТоваров(Категория);

	СписокХарактеристикКатегорий = ИС_Ozon_API.ПолучитьАтрибутыДляКатегорииТоваров(ПараметрыЗапроса,
		МассивКатегорииТоваров);

	Для Каждого ХарактеристикиКатегории Из СписокХарактеристикКатегорий Цикл

		category_id = ХарактеристикиКатегории.type_id;
		МассивХарактеристик = ХарактеристикиКатегории.attributes;
		ОбработатьХарактеристикиКатегории(МассивХарактеристик, category_id);

	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура ЗагрузитьЗначенияХарактеристик(Профиль, Характеристики = Неопределено, Категории = Неопределено, ЗагружатьЗначения = Ложь) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);

	ДеревоХарактеристик = ХарактеристикиКатегорий(Характеристики, Категории, ЗагружатьЗначения);

	Для Каждого Характеристика Из ДеревоХарактеристик.Строки Цикл

		КатегорииИспользующиеХарактеристику = Характеристика.Строки;
		Если Характеристика.ЗначенияЗависятОтКатегории Тогда
			УдалитьЗаписиВРегистрахЗначенияХарактеристикПоКатегориям(Характеристика.Характеристика);
			//УдалитьЗаписиВРегистрахАктуальностьЗначенийХарактеристик(Характеристика.Характеристика);
		КонецЕсли;

		Для Каждого стр Из КатегорииИспользующиеХарактеристику Цикл

			ЗначенияХарактеристики = ИС_Ozon_API.ПолучитьЗначенияАтрибутаКатегории(ПараметрыЗапроса,
				стр.КодКатегории, стр.КодХарактеристики, стр.КодВладельцаКатегории);

			Если стр.ЗначенияЗависятОтКатегории Тогда
				ОбработатьЗначенияХарактеристики(стр.Характеристика, ЗначенияХарактеристики, стр.Категория);
			Иначе

				МассивКатегорий = КатегорииИспользующиеХарактеристику.ВыгрузитьКолонку("Категория");
				НаборЗаписей = РегистрыСведений.ИС_Ozon_ЗначенияХарактеристикПоКатегориям.СоздатьНаборЗаписей();
				//НаборДатаАктуальности = РегистрыСведений.Ozon_АктуальностьЗначенийХарактеристик.СоздатьНаборЗаписей();
				Для Каждого Категория Из МассивКатегорий Цикл

					НаборЗаписей.Отбор.Категория.Установить(Категория);
					НаборЗаписей.Отбор.Характеристика.Установить(стр.Характеристика);
					НаборЗаписей.Записать(Истина);

					//НаборДатаАктуальности.Отбор.Категория.Установить(Категория);
					//НаборДатаАктуальности.Отбор.Характеристика.Установить(стр.Характеристика);
					//НаборДатаАктуальности.Записать(Истина);

				КонецЦикла;

				ОбработатьЗначенияХарактеристики(стр.Характеристика, ЗначенияХарактеристики, ПредопределенноеЗначение(
					"Справочник.ИС_Ozon_КатегорииТоваров.ПустаяСсылка"));

				Прервать;

			КонецЕсли;

			ОбщегоНазначенияБТС.Пауза(1);

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ХарактеристикаПоКоду(ИдСтрокой) Экспорт

	Характеристика = Справочники.ИС_Ozon_Характеристики.НайтиПоКоду(Число(ИдСтрокой), Истина);

	Возврат Характеристика;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ХарактеристикиКатегорииНеЗагружены(Категория) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ozon_КатегорииТоваровХарактеристики.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ИС_Ozon_КатегорииТоваров.Характеристики КАК Ozon_КатегорииТоваровХарактеристики
	|ГДЕ
	|	Ozon_КатегорииТоваровХарактеристики.Ссылка = &Категория";

	Возврат Запрос.Выполнить().Пустой();

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ЗначенияХарактеристикиOzonИзСтроки(ЗначенияСтрокой) Экспорт

	Результат = Новый Массив;

	МассивСтрок = СтрРазделить(ЗначенияСтрокой, ";", Ложь);
	Для Каждого стр Из МассивСтрок Цикл
		Если СтрДлина(стр) = 36 Тогда
			ЗначениеХарактеристики = Справочники.ИС_Ozon_ЗначенияХарактеристик.ПолучитьСсылку(
				Новый УникальныйИдентификатор(стр));
			Если ЗначениеЗаполнено(ЗначениеХарактеристики) Тогда
				Результат.Добавить(ЗначениеХарактеристики);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура УдалитьЗаписиВрегистрахПоКатегории(Категория) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ozon_КатегорииТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_Ozon_КатегорииТоваров КАК Ozon_КатегорииТоваров
	|ГДЕ
	|	НЕ Ozon_КатегорииТоваров.ЭтоГруппа
	|	И Ozon_КатегорииТоваров.Ссылка В ИЕРАРХИИ(&Категория)";

	Запрос.УстановитьПараметр("Категория", Категория);

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда

		НаборыЗаписей = Новый Массив;
		НаборыЗаписей.Добавить(РегистрыСведений.ИС_Ozon_ЗначенияХарактеристикПоКатегориям.СоздатьНаборЗаписей());
		НаборыЗаписей.Добавить(РегистрыСведений.ИС_Ozon_СоответствиеЗначенийХарактеристик.СоздатьНаборЗаписей());
		НаборыЗаписей.Добавить(РегистрыСведений.ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.СоздатьНаборЗаписей());		

		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл

			Для Каждого НаборЗаписей Из НаборыЗаписей Цикл

				НаборЗаписей.Отбор.Категория.Установить(Выборка.Ссылка);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				НаборЗаписей.Записать();

			КонецЦикла;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура УдалитьЗаписиВРегистрахЗначенияХарактеристикПоКатегориям(Характеристика, Знач Категория = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Категория) Тогда
		Категория = ПредопределенноеЗначение("Справочник.ИС_Ozon_КатегорииТоваров.ПустаяСсылка");
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.ИС_Ozon_ЗначенияХарактеристикПоКатегориям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.Характеристика.Установить(Характеристика);
	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура ОбработатьКатегорииТоваров(МассивКатегорииТоваров, МассивАктуальныхКатегорий,
	КатегорииСОбязательнымиСертификатами, Родитель = Неопределено)

	Для Каждого ДанныеКатегории Из МассивКатегорииТоваров Цикл
		
		//+ ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269
		Если ДанныеКатегории.Свойство("type_id") Тогда
			Категория = Справочники.ИС_Ozon_КатегорииТоваров.НайтиПоКоду(ДанныеКатегории.type_id); //.category_id
		Иначе
			Категория = Справочники.ИС_Ozon_КатегорииТоваров.НайтиПоКоду(ДанныеКатегории.description_category_id); //.category_id
		КонецЕсли;
		//- ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269
		Если ЗначениеЗаполнено(Категория) Тогда
			Если ТребуетсяОбновитьДанные(Категория, ДанныеКатегории, КатегорииСОбязательнымиСертификатами, Родитель) Тогда
				Категория = СоздатьОбновитьКатегориюТоваров(ДанныеКатегории, КатегорииСОбязательнымиСертификатами,
					Родитель, Категория);
			КонецЕсли;
		Иначе
			Категория = СоздатьОбновитьКатегориюТоваров(ДанныеКатегории, КатегорииСОбязательнымиСертификатами, Родитель);
		КонецЕсли;

		МассивАктуальныхКатегорий.Добавить(Категория);

		Если ДанныеКатегории.children.Количество() Тогда
			ОбработатьКатегорииТоваров(ДанныеКатегории.children, МассивАктуальныхКатегорий,
				КатегорииСОбязательнымиСертификатами, Категория);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция СоздатьОбновитьКатегориюТоваров(ДанныеКатегории, КатегорииСОбязательнымиСертификатами, Родитель = Неопределено,
	КатегорияСсылка = Неопределено)

	Если КатегорияСсылка = Неопределено Тогда
		Если ДанныеКатегории.children.Количество() Тогда
			КатегорияОбъект = Справочники.ИС_Ozon_КатегорииТоваров.СоздатьГруппу();
		Иначе
			КатегорияОбъект = Справочники.ИС_Ozon_КатегорииТоваров.СоздатьЭлемент();
		КонецЕсли;
	Иначе
		КатегорияОбъект = КатегорияСсылка.ПолучитьОбъект();
	КонецЕсли;   
	
	//+ ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269	
	Если ДанныеКатегории.Свойство("type_id") Тогда                                           
		КатегорияОбъект.Код 			= ДанныеКатегории.type_id; 
		КатегорияОбъект.type_id 		= Истина;                   
		КатегорияОбъект.Наименование 	= ДанныеКатегории.type_name; 
	Иначе
		КатегорияОбъект.Код 			= ДанныеКатегории.description_category_id; //.category_id		
		КатегорияОбъект.Наименование 	= ДанныеКатегории.category_name; //.title
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269   
	
	Если Не КатегорияОбъект.ЭтоГруппа Тогда
		КатегорияОбъект.Сертифицируется = КатегорииСОбязательнымиСертификатами.Получить(КатегорияОбъект.Наименование);
	КонецЕсли;

	Если Родитель <> Неопределено Тогда
		КатегорияОбъект.Родитель 	= Родитель;
	КонецЕсли;

	Попытка
		КатегорияОбъект.Записать();
	Исключение
		ИмяСобытия = "ЗагрузкаКатегорийТоваров";
		Комментарий = "Не удалось записать категорию товаров: " + КатегорияОбъект.НаименованиеПолное + Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
	КонецПопытки;

	Возврат КатегорияОбъект.Ссылка;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ТребуетсяОбновитьДанные(Категория, ДанныеКатегории, КатегорииСОбязательнымиСертификатами,
	Родитель = Неопределено)

	Результат = Ложь;

	Если Родитель = Неопределено Тогда
		Родитель = ПредопределенноеЗначение("Справочник.ИС_Ozon_КатегорииТоваров.ПустаяСсылка");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КатегорииТоваров.Наименование КАК Наименование,
	|	КатегорииТоваров.Код КАК Код,
	|	КатегорииТоваров.Родитель КАК Родитель,
	|	КатегорииТоваров.Сертифицируется КАК Сертифицируется
	|ИЗ
	|	Справочник.ИС_Ozon_КатегорииТоваров КАК КатегорииТоваров
	|ГДЕ
	|	КатегорииТоваров.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Категория);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		
		//+ ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269		
		Если ДанныеКатегории.Свойство("type_id") Тогда 
			
			Результат = Выборка.Наименование <> ДанныеКатегории.type_name Или Выборка.Код 
			<> ДанныеКатегории.type_id Или Выборка.Родитель <> Родитель 
			Или (КатегорииСОбязательнымиСертификатами.Получить(Выборка.Наименование) <> Неопределено
			И КатегорииСОбязательнымиСертификатами.Получить(Выборка.Наименование) <> Выборка.Сертифицируется);
			
		Иначе
			
			Результат = Выборка.Наименование <> ДанныеКатегории.category_name Или Выборка.Код //.title
			<> ДанныеКатегории.description_category_id Или Выборка.Родитель <> Родитель //.category_id
			Или (КатегорииСОбязательнымиСертификатами.Получить(Выборка.Наименование) <> Неопределено
			И КатегорииСОбязательнымиСертификатами.Получить(Выборка.Наименование) <> Выборка.Сертифицируется);
			
		КонецЕсли;
		//- ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269

	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция КатегорииТоваров(Категория)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОтборПоКатегории", ЗначениеЗаполнено(Категория));
	Запрос.УстановитьПараметр("Категория", Категория);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ozon_КатегорииТоваров.Код КАК type_id,
	|	Ozon_КатегорииТоваров.Родитель.Код КАК Код
	|ИЗ
	|	Справочник.ИС_Ozon_КатегорииТоваров КАК Ozon_КатегорииТоваров
	|ГДЕ
	|	НЕ Ozon_КатегорииТоваров.ПометкаУдаления
	|	И НЕ Ozon_КатегорииТоваров.ЭтоГруппа
	|	И Ozon_КатегорииТоваров.Используется
	|	И ВЫБОР
	|			КОГДА &ОтборПоКатегории
	|				ТОГДА Ozon_КатегорииТоваров.Ссылка В ИЕРАРХИИ (&Категория)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура ОбработатьХарактеристикиКатегории(МассивХарактеристик, category_id)

	Категория = Справочники.ИС_Ozon_КатегорииТоваров.НайтиПоКоду(category_id).ПолучитьОбъект();

	ТаблицаХарактеристик = Категория.Характеристики.Выгрузить();

	Категория.Характеристики.Очистить();

	Для Каждого ДанныеХарактеристики Из МассивХарактеристик Цикл

		стрХарактеристики = Категория.Характеристики.Добавить();

		Характеристика = Справочники.ИС_Ozon_Характеристики.НайтиПоКоду(ДанныеХарактеристики.id);
		Характеристика = СоздатьОбновитьХарактеристику(ДанныеХарактеристики, Характеристика);

		стрХарактеристики.Характеристика = Характеристика;
		стрХарактеристики.Обязательная	 = ДанныеХарактеристики.is_required;
		стрХарактеристики.Аспектная		 = ДанныеХарактеристики.is_aspect;
		Если стрХарактеристики.Обязательная Тогда
			стрХарактеристики.НеИспользовать = Ложь;
		Иначе
			староеЗначение = ТаблицаХарактеристик.Найти(Характеристика, "Характеристика");
			Если Не староеЗначение = Неопределено Тогда
				стрХарактеристики.НеИспользовать = староеЗначение.НеИспользовать;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	СравнитьМодельХарактеристик(Категория.Ссылка, Категория.Характеристики.Выгрузить());

	Попытка

		Если МассивХарактеристик.Количество() Тогда
			Категория.Записать();			
		КонецЕсли;
	Исключение
		ИмяСобытия = "ЗагрузитьХарактеристикиКатегорий";
		Комментарий = "Не удалось записать категорию товаров: " + Категория.Наименование + Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция СоздатьОбновитьХарактеристику(ДанныеХарактеристики, Характеристика = Неопределено)

	Если ЗначениеЗаполнено(Характеристика) Тогда
		ХарактеристикаОбъект = Характеристика.ПолучитьОбъект();
	Иначе
		ХарактеристикаОбъект = Справочники.ИС_Ozon_Характеристики.СоздатьЭлемент();
	КонецЕсли;

	ХарактеристикаОбъект.Код 								= ДанныеХарактеристики.id;
	ХарактеристикаОбъект.Наименование 						= ДанныеХарактеристики.name;
	ХарактеристикаОбъект.Описание       					= ДанныеХарактеристики.description;
	ХарактеристикаОбъект.ИДСправочникаЗначенийХарактеристики = ДанныеХарактеристики.dictionary_id;
	ХарактеристикаОбъект.ИдентификаторГруппы  				= ДанныеХарактеристики.group_id;
	ХарактеристикаОбъект.НаименованиеГруппы 				= ДанныеХарактеристики.group_name;
	ХарактеристикаОбъект.НаборЗначений  					= ДанныеХарактеристики.is_collection;
	ХарактеристикаОбъект.ТипХарактеристики 					= ДанныеХарактеристики.type;
	ХарактеристикаОбъект.ЗначенияЗависятОтКатегории			= ДанныеХарактеристики.category_dependent;
	//+ ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269
	ХарактеристикаОбъект.attribute_complex_id 				= ДанныеХарактеристики.attribute_complex_id;
	ХарактеристикаОбъект.max_value_count					= ДанныеХарактеристики.max_value_count;
	//- ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269

	Попытка
		ХарактеристикаОбъект.Записать();
	Исключение
		ИмяСобытия = "ЗагрузитьХарактеристикиКатегорий";
		Комментарий = "Не удалось записать характеристику категории: " + ХарактеристикаОбъект.НаименованиеПолное
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
	КонецПопытки;

	Возврат ХарактеристикаОбъект.Ссылка;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ХарактеристикиКатегорий(Характеристики, Категории, ЗагружатьЗначения = Ложь)

	Запрос = Новый Запрос;
	//+ ИнфоСофт Стояк Ю.К. 22.03.2024 УА #72805	
	//Запрос.УстановитьПараметр("ЗагружатьЗначения", Ложь);
	Запрос.УстановитьПараметр("ЗагружатьЗначения", ЗагружатьЗначения);
	//- ИнфоСофт Стояк Ю.К. 22.03.2024 УА #72805
	Запрос.УстановитьПараметр("ОтборПоХарактеристикам", ЗначениеЗаполнено(Характеристики));
	Запрос.УстановитьПараметр("Характеристики", Характеристики);
	Запрос.УстановитьПараметр("ОтборПоКатегориям", ЗначениеЗаполнено(Категории));
	Запрос.УстановитьПараметр("Категории", Категории);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ozon_КатегорииТоваров.Ссылка КАК Категория,
	|	Ozon_КатегорииТоваров.Код КАК КодКатегории,
	|	Ozon_КатегорииТоваровХарактеристики.Характеристика КАК Характеристика,
	|	Ozon_Характеристики.Код КАК КодХарактеристики,
	|	Ozon_Характеристики.ЗначенияЗависятОтКатегории КАК ЗначенияЗависятОтКатегории,
	|	Ozon_КатегорииТоваров.Родитель.Код КАК КодВладельцаКатегории
	|ПОМЕСТИТЬ ВТ_КатегорииХарактеристики
	|ИЗ
	|	Справочник.ИС_Ozon_КатегорииТоваров КАК Ozon_КатегорииТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_КатегорииТоваров.Характеристики КАК Ozon_КатегорииТоваровХарактеристики
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Характеристики КАК Ozon_Характеристики
	|			ПО Ozon_КатегорииТоваровХарактеристики.Характеристика = Ozon_Характеристики.Ссылка
	|		ПО Ozon_КатегорииТоваров.Ссылка = Ozon_КатегорииТоваровХарактеристики.Ссылка
	|ГДЕ
	|	Ozon_КатегорииТоваров.Используется
	|	И НЕ Ozon_КатегорииТоваров.ЭтоГруппа
	|	И НЕ Ozon_КатегорииТоваров.ПометкаУдаления
	|	И Ozon_Характеристики.ИДСправочникаЗначенийХарактеристики > 0
	|	И (Ozon_КатегорииТоваровХарактеристики.Обязательная
	|			ИЛИ Ozon_Характеристики.ЗагружатьЗначенияХарактеристики
	|			ИЛИ &ЗагружатьЗначения)
	|	И ВЫБОР
	|			КОГДА &ОтборПоХарактеристикам
	|				ТОГДА Ozon_Характеристики.Ссылка В (&Характеристики)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ Ozon_КатегорииТоваровХарактеристики.НеИспользовать
	|	И ВЫБОР
	|			КОГДА &ОтборПоКатегориям
	|				ТОГДА Ozon_КатегорииТоваров.Ссылка В ИЕРАРХИИ (&Категории)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КатегорииХарактеристики.Категория КАК Категория,
	|	ВТ_КатегорииХарактеристики.КодКатегории КАК КодКатегории,
	|	ВТ_КатегорииХарактеристики.Характеристика КАК Характеристика,
	|	ВТ_КатегорииХарактеристики.КодХарактеристики КАК КодХарактеристики,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаАктуальности,
	|	ВТ_КатегорииХарактеристики.ЗначенияЗависятОтКатегории КАК ЗначенияЗависятОтКатегории,
	|	ВТ_КатегорииХарактеристики.КодВладельцаКатегории КАК КодВладельцаКатегории
	|ИЗ
	|	ВТ_КатегорииХарактеристики КАК ВТ_КатегорииХарактеристики
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаАктуальности
	|ИТОГИ
	|	МАКСИМУМ(ЗначенияЗависятОтКатегории)
	|ПО
	|	Характеристика";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

	Возврат РезультатЗапроса;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура ОбработатьЗначенияХарактеристики(Характеристика, МассивЗначений, Категория)

	Если Не ЗначениеЗаполнено(МассивЗначений) Тогда
		// Значения характеристик, по какой то прчиине, не были загружены
		// Выходим отсюда, дальше тут делать нечего
		Возврат;
	КонецЕсли;

	ТабЗнач = Новый ТаблицаЗначений;
	ТабЗнач.Колонки.Добавить("id", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(9, 0,
		ДопустимыйЗнак.Неотрицательный)));
	ТабЗнач.Колонки.Добавить("value", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150,
		ДопустимаяДлина.Переменная)));
	ТабЗнач.Колонки.Добавить("Владелец", Новый ОписаниеТипов("СправочникСсылка.ИС_Ozon_Характеристики"));
	ТабЗнач.Колонки.Добавить("Категория", Новый ОписаниеТипов("СправочникСсылка.ИС_Ozon_КатегорииТоваров"));
	ТабЗнач.Колонки.Добавить("picture", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная)));
	
	Для Каждого Значение Из МассивЗначений Цикл
		НоваяСтрока = ТабЗнач.Добавить();
		НоваяСтрока.Категория 	= Категория;
		НоваяСтрока.Владелец 	= Характеристика;
		НоваяСтрока.id 			= Значение.id;
		НоваяСтрока.value 		= Значение.value;
		НоваяСтрока.picture		= ?(Значение.picture = Неопределено, "", Значение.picture);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабЗнач.id КАК id,
	|	ТабЗнач.value КАК value,
	|	ТабЗнач.picture КАК picture,
	|	ТабЗнач.Категория КАК Категория,
	|	ТабЗнач.Владелец КАК Владелец
	|ПОМЕСТИТЬ вт_ЗагруженныеЗначения
	|ИЗ
	|	&ТабЗнач КАК ТабЗнач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ЗагруженныеЗначения.id КАК id,
	|	вт_ЗагруженныеЗначения.value КАК value,
	|	вт_ЗагруженныеЗначения.picture КАК picture,
	|	вт_ЗагруженныеЗначения.Категория КАК Категория,
	|	вт_ЗагруженныеЗначения.Владелец КАК Характеристика,
	|	ЕСТЬNULL(Ozon_ЗначенияХарактеристик.Ссылка, ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)) КАК
	|		ЗначениеХарактеристики,
	|	Ozon_ЗначенияХарактеристик.Наименование КАК Наименование,
	|	Ozon_ЗначенияХарактеристик.АдресКартинки
	|ИЗ
	|	вт_ЗагруженныеЗначения КАК вт_ЗагруженныеЗначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_ЗначенияХарактеристик КАК Ozon_ЗначенияХарактеристик
	|		ПО вт_ЗагруженныеЗначения.Владелец = Ozon_ЗначенияХарактеристик.Владелец
	|		И вт_ЗагруженныеЗначения.id = Ozon_ЗначенияХарактеристик.Код";

	Запрос.УстановитьПараметр("Ссылка", ПредопределенноеЗначение("Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка"));
	Запрос.УстановитьПараметр("ТабЗнач", ТабЗнач);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	НаборЗаписей = РегистрыСведений.ИС_Ozon_ЗначенияХарактеристикПоКатегориям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.Характеристика.Установить(Характеристика);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	Пока Выборка.Следующий() Цикл

		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, Выборка);

		СсылкаЗаполнена = ЗначениеЗаполнено(Выборка.ЗначениеХарактеристики);
		Если Не СсылкаЗаполнена Или Выборка.value <> Выборка.Наименование
			Или Выборка.picture <> Выборка.АдресКартинки Тогда

			Если СсылкаЗаполнена Тогда
				ЗначениеХарактеристики = Выборка.ЗначениеХарактеристики.ПолучитьОбъект();
			Иначе
				ЗначениеХарактеристики = Справочники.ИС_Ozon_ЗначенияХарактеристик.СоздатьЭлемент();
			КонецЕсли;

			ЗначениеХарактеристики.Владелец 		= Выборка.Характеристика;
			ЗначениеХарактеристики.Код 				= Выборка.id;
			ЗначениеХарактеристики.Наименование 	= Выборка.value;
			ЗначениеХарактеристики.АдресКартинки 	= Выборка.picture;
			
			ЗначениеХарактеристики.Записать();

			ЗаписьНабора.ЗначениеХарактеристики = ЗначениеХарактеристики.Ссылка;

		КонецЕсли;

	КонецЦикла;

	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура СравнитьМодельХарактеристик(Категория, ОбновленнаяМодель)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбновленнаяМодель.Характеристика КАК Характеристика,
	|	ОбновленнаяМодель.Обязательная КАК Обязательная
	|ПОМЕСТИТЬ вт_ОбновленнаяМодель
	|ИЗ
	|	&ОбновленнаяМодель КАК ОбновленнаяМодель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ozon_КатегорииТоваровХарактеристики.Характеристика КАК Характеристика,
	|	Ozon_КатегорииТоваровХарактеристики.Обязательная КАК Обязательная,
	|	Ozon_КатегорииТоваровХарактеристики.НеИспользовать КАК НеИспользовать
	|ПОМЕСТИТЬ вт_СтараяМодель
	|ИЗ
	|	Справочник.ИС_Ozon_КатегорииТоваров.Характеристики КАК Ozon_КатегорииТоваровХарактеристики
	|ГДЕ
	|	Ozon_КатегорииТоваровХарактеристики.Ссылка = &Категория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ОбновленнаяМодель.Характеристика КАК ОбновленнаяМодельХарактеристика,
	|	вт_ОбновленнаяМодель.Обязательная КАК ОбновленнаяМодельОбязательная,
	|	вт_СтараяМодель.Характеристика КАК СтараяМодельХарактеристика,
	|	вт_СтараяМодель.Обязательная КАК СтараяМодельОбязательная,
	|	вт_СтараяМодель.НеИспользовать КАК НеИспользовать
	|ПОМЕСТИТЬ вт_Объединение
	|ИЗ
	|	вт_ОбновленнаяМодель КАК вт_ОбновленнаяМодель
	|		ПОЛНОЕ СОЕДИНЕНИЕ вт_СтараяМодель КАК вт_СтараяМодель
	|		ПО вт_ОбновленнаяМодель.Характеристика = вт_СтараяМодель.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Объединение.ОбновленнаяМодельХарактеристика КАК ОбновленнаяМодельХарактеристика,
	|	вт_Объединение.ОбновленнаяМодельОбязательная КАК ОбновленнаяМодельОбязательная,
	|	вт_Объединение.СтараяМодельХарактеристика КАК СтараяМодельХарактеристика,
	|	вт_Объединение.СтараяМодельОбязательная КАК СтараяМодельОбязательная,
	|	вт_Объединение.НеИспользовать КАК НеИспользовать
	|ИЗ
	|	вт_Объединение КАК вт_Объединение
	|ГДЕ
	|	(вт_Объединение.ОбновленнаяМодельХарактеристика ЕСТЬ NULL
	|			ИЛИ вт_Объединение.СтараяМодельХарактеристика ЕСТЬ NULL
	|			ИЛИ вт_Объединение.СтараяМодельОбязательная <> вт_Объединение.ОбновленнаяМодельОбязательная)";

	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("ОбновленнаяМодель", ОбновленнаяМодель);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		Если Не ЗначениеЗаполнено(Выборка.ОбновленнаяМодельХарактеристика) Тогда
			ТекстСообщения = СтрШаблон("У категории товаров ""%1"" удалена характеристика ""%2""", Категория,
				Выборка.СтараяМодельХарактеристика);
		ИначеЕсли Не ЗначениеЗаполнено(Выборка.СтараяМодельХарактеристика) Тогда
			ТекстСообщения = СтрШаблон("У категории товаров ""%1"" добавлена характеристика ""%2""", Категория,
				Выборка.ОбновленнаяМодельХарактеристика);
		ИначеЕсли Не Выборка.ОбновленнаяМодельОбязательная Тогда
			ТекстСообщения = СтрШаблон(
				"У категории товаров ""%1"" характеристика ""%2"" стала не обязательна для заполнения", Категория,
				Выборка.СтараяМодельХарактеристика);
		ИначеЕсли Выборка.ОбновленнаяМодельОбязательная Тогда
			ТекстСообщения = СтрШаблон(
				"У категории товаров ""%1"" характеристика ""%2"" стала обязательна для заполнения", Категория,
				Выборка.ОбновленнаяМодельХарактеристика);
		КонецЕсли;

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция КатегорииСОбязательнымиСертификатами(ПараметрыПодключения)

	Результат = Новый Соответствие;
	КатегорииСОбязательнымиСертификатами = ИС_Ozon_API.КатегорииСОбязатетльнымиСертификатами(ПараметрыПодключения);

	Для Каждого Категория Из КатегорииСОбязательнымиСертификатами Цикл
		
		//+ ИнфоСофт Стояк Ю.К. 27.01.2025 УА #91601		
		//Результат.Вставить(Категория.Получить("category_name"), Категория.Получить("is_required"));
		Результат.Вставить(Категория.category_name, Категория.is_required);
		//- ИнфоСофт Стояк Ю.К. 27.01.2025 УА #91601

	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура УдалитьУстаревшиеКатегорииТоваров(МассивАктуальныхКатегорий)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ozon_КатегорииТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_Ozon_КатегорииТоваров КАК Ozon_КатегорииТоваров
	|ГДЕ
	|	НЕ Ozon_КатегорииТоваров.ПометкаУдаления
	|	И НЕ Ozon_КатегорииТоваров.Ссылка В (&МассивАктуальныхКатегорий)";

	Запрос.УстановитьПараметр("МассивАктуальныхКатегорий", МассивАктуальныхКатегорий);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		обКатегория = Выборка.ССылка.ПолучитьОбъект();
		обКатегория.Используется 		= Ложь;
		обКатегория.ПометкаУдаления 	= Истина;
		обКатегория.Записать();

	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

#КонецОбласти

#Область СопоставлениеДляВыгрукзи

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция РеквизитыНоменклатуры() Экспорт

	Реквизиты = Метаданные.Справочники["Номенклатура"].Реквизиты;
	Результат = Новый Массив;
	Для Каждого Реквизит Из Реквизиты Цикл
		Результат.Добавить(СокрЛП(Реквизит.Синоним));
	КонецЦикла;

	СтандартныеРеквизиты = Метаданные.Справочники["Номенклатура"].СтандартныеРеквизиты;
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		Результат.Добавить(Реквизит.Имя);
	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция СоответствиеРеквизитовНоменклатуры() Экспорт

	СоответствиеРеквизитов = Новый Соответствие;

	РеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].Реквизиты;
	Для Каждого реквизит Из РеквизитыНоменклатуры Цикл
		СоответствиеРеквизитов.Вставить(СокрЛП(реквизит.Синоним), реквизит);
	КонецЦикла;

	СтандартныеРеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].СтандартныеРеквизиты;
	Для Каждого реквизит Из СтандартныеРеквизитыНоменклатуры Цикл
		СоответствиеРеквизитов.Вставить(реквизит.Имя, реквизит);
	КонецЦикла;

	Возврат СоответствиеРеквизитов;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ДопРеквизитыНабора(НаборДопРеквизитов = Неопределено) Экспорт

	Если НаборДопРеквизитов = Неопределено Тогда

		НаименованияЭлементовСправочника = Новый Массив;
		НаименованияЭлементовСправочника.Добавить("Номенклатура");
		НаименованияЭлементовСправочника.Добавить("Справочник ""Номенклатура""");
		//т.к. с версии 11.5 имеются предопределенные и непредопределенные элементы с одним наименованием
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
		|ГДЕ
		|	НаборыДополнительныхРеквизитовИСведений.Наименование В (&НаименованияЭлементовСправочника)";

		Запрос.УстановитьПараметр("НаименованияЭлементовСправочника", НаименованияЭлементовСправочника);

		РезультатЗапроса = Запрос.Выполнить().Выгрузить();

		НаборДопРеквизитов = РезультатЗапроса.ВыгрузитьКолонку("Ссылка");

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаборыДопРеквизитов.Свойство КАК Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДопРеквизитов
	|ГДЕ
	|	НаборыДопРеквизитов.Ссылка В ИЕРАРХИИ(&НаборДопРеквизитов)
	|	И НЕ НаборыДопРеквизитов.Ссылка.ЭтоГруппа
	|	И НЕ НаборыДопРеквизитов.ПометкаУдаления";

	Запрос.УстановитьПараметр("НаборДопРеквизитов", НаборДопРеквизитов);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса.ВыгрузитьКолонку("Свойство");

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ДопСвойстваНоменклатуры() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаборыДополнительныхСведений.Свойство КАК Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхСведений
	|ГДЕ
	|	НаборыДополнительныхСведений.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка
	|			ИЗ
	|				Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	|			ГДЕ
	|				НаборыДополнительныхРеквизитовИСведений.Наименование = &Наименование)
	|	И НЕ НаборыДополнительныхСведений.Ссылка.ЭтоГруппа
	|	И НЕ НаборыДополнительныхСведений.ПометкаУдаления";

	Запрос.УстановитьПараметр("Наименование", "Номенклатура");

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса.ВыгрузитьКолонку("Свойство");

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция НаборыДопРеквизитовХарактеристикиНоменклатуры() Экспорт

	НаименованияЭлементовСправочника = Новый Массив;
	НаименованияЭлементовСправочника.Добавить("Характеристики");
	НаименованияЭлементовСправочника.Добавить("Характеристики номенклатуры");
	НаименованияЭлементовСправочника.Добавить("Справочник ""Характеристики номенклатуры""");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	|ГДЕ
	|	НЕ НаборыДополнительныхРеквизитовИСведений.ЭтоГруппа
	|	И НЕ НаборыДополнительныхРеквизитовИСведений.ПометкаУдаления
	|	И НаборыДополнительныхРеквизитовИСведений.Родитель В (ВЫБРАТЬ
	|			НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	|		ГДЕ
	|			НаборыДополнительныхРеквизитовИСведений.Наименование В (&НаименованияЭлементовСправочника))
	|	И НаборыДополнительныхРеквизитовИСведений.КоличествоРеквизитов > 0";

	Запрос.УстановитьПараметр("НаименованияЭлементовСправочника", НаименованияЭлементовСправочника);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция РеквизитыХарактеристикиНоменклатуры() Экспорт

	Реквизиты = Метаданные.Справочники["ХарактеристикиНоменклатуры"].Реквизиты;
	Результат = Новый Массив;
	Для Каждого Реквизит Из Реквизиты Цикл
		Результат.Добавить(Реквизит.Синоним);
	КонецЦикла;

	СтандартныеРеквизиты = Метаданные.Справочники["ХарактеристикиНоменклатуры"].СтандартныеРеквизиты;
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		Результат.Добавить(Реквизит.Имя);
	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ВидыНоменклатурыХарактеристик() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры,
	|	КОЛИЧЕСТВО(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство) КАК Свойство
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ПО (ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка = ХарактеристикиНоменклатуры.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ХарактеристикиНоменклатуры.ВидНоменклатуры
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство) = 0
	|";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса.ВыгрузитьКолонку("ВидНоменклатуры");

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ТекстКоличествоСопоставленныхЗначений(Категория, ХарактеристикаOzon, ВидРеквизита1С, Реквизит1С,
	ТребуетсяСопоставление) Экспорт

	Если Не ТребуетсяСопоставление Тогда
		Возврат "Сопоставление не требуется";
	КонецЕсли;

	Результат = "Сопоставлено 0 из 0";

	Если ЗначениеЗаполнено(Реквизит1С) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаСоответствийЗначений.ЗначениеВ1С КАК ЗначениеВ1С,
		|	ТаблицаСоответствийЗначений.ЗначениеХарактеристикиOzon КАК ЗначениеХарактеристикиOzon
		|ПОМЕСТИТЬ вт_Значения
		|ИЗ
		|	&ТаблицаСоответствийЗначений КАК  ТаблицаСоответствийЗначений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_Значения.ЗначениеВ1С) КАК Всего,
		|	КОЛИЧЕСТВО(вт_Значения.ЗначениеХарактеристикиOzon) КАК Сопоставлено
		|ИЗ
		|	вт_Значения КАК вт_Значения";

		Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений(Категория,
			ХарактеристикаOzon, ВидРеквизита1С, Реквизит1С));

		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = СтрШаблон("Сопоставлено %1 из %2", ?(Выборка.Сопоставлено = Null, 0, Выборка.Сопоставлено),
				Выборка.Всего);
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ТаблицаСоответствийЗначений(Категория, ХарактеристикаOzon, ВидРеквизита1С, Реквизит1С) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("ХарактеристикаOzon", ХарактеристикаOzon);
	Запрос.УстановитьПараметр("ВидРеквизита1С", ВидРеквизита1С);
	Запрос.УстановитьПараметр("Реквизит1С", Реквизит1С);

	ИмяРеквизита 	= Неопределено;
	ТипРеквизита 	= Неопределено;

	Если ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры Тогда

		СтандартныеРеквизиты = Метаданные.Справочники["Номенклатура"].СтандартныеРеквизиты;
		Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
			Если Реквизит.Имя = Реквизит1С Тогда
				ИмяРеквизита = Реквизит.Имя;
				ТипРеквизита = Реквизит.Тип;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ИмяРеквизита = Неопределено Тогда
			РеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].Реквизиты;
			Для Каждого Реквизит Из РеквизитыНоменклатуры Цикл
				Если Реквизит.Синоним = Реквизит1С Тогда
					ИмяРеквизита = Реквизит.Имя;
					ТипРеквизита = Реквизит.Тип;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры Тогда

		СтандартныеРеквизиты = Метаданные.Справочники["ХарактеристикиНоменклатуры"].СтандартныеРеквизиты;
		Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
			Если Реквизит.Имя = Реквизит1С Тогда
				ИмяРеквизита = Реквизит.Имя;
				ТипРеквизита = Реквизит.Тип;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ИмяРеквизита = Неопределено Тогда
			РеквизитыХарактеристики = Метаданные.Справочники["ХарактеристикиНоменклатуры"].Реквизиты;
			Для Каждого Реквизит Из РеквизитыХарактеристики Цикл
				Если Реквизит.Синоним = Реквизит1С Тогда
					ИмяРеквизита = Реквизит.Имя;
					ТипРеквизита = Реквизит.Тип;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры Тогда

		ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
		ИмяРеквизита = "Ссылка";

	Иначе
		
		ТипРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизит1С, "ТипЗначения");
		ИмяРеквизита = "Значение";

	КонецЕсли;

	Если ЭтоПримитивныйТип(ТипРеквизита) Тогда

		Отбор = "ГДЕ ЗначенияВ1С.Свойство = &Реквизит1С";

		Если ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры Тогда
			ПолноеИмяОбъекта =  "Справочник.Номенклатура";
			Отбор = "ГДЕ НЕ ЗначенияВ1С.Ссылка.ПометкаУдаления";
		ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры Тогда
			ПолноеИмяОбъекта =  "Справочник.Номенклатура.ДополнительныеРеквизиты";
		ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры Тогда
			ПолноеИмяОбъекта =  "РегистрСведений.ДополнительныеСведения";
		ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры Тогда
			ПолноеИмяОбъекта =  "Справочник.ХарактеристикиНоменклатуры";
			Отбор = "ГДЕ НЕ ЗначенияВ1С.Ссылка.ПометкаУдаления";
		ИначеЕсли ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры Тогда
			ПолноеИмяОбъекта =  "Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты";
		КонецЕсли;

		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					   |	ЗначенияВ1С.ИмяРеквизита КАК ЗначениеВ1С
					   |ПОМЕСТИТЬ вт_ЗначенияВ1С
					   |ИЗ
					   | " + ПолноеИмяОбъекта + " КАК ЗначенияВ1С
												| " + Отбор + "
															  |;
															  |
															  |////////////////////////////////////////////////////////////////////////////////
															  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
															  |	ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon КАК ЗначениеХарактеристикиOzon,
															  |	вт_ЗначенияВ1С.ЗначениеВ1С КАК ЗначениеВ1С
															  |ИЗ
															  |	вт_ЗначенияВ1С КАК вт_ЗначенияВ1С
															  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеЗначенийХарактеристик КАК ИС_Ozon_СоответствиеЗначенийХарактеристик
															  |		ПО вт_ЗначенияВ1С.ЗначениеВ1С = ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики
															  |			И (ИС_Ozon_СоответствиеЗначенийХарактеристик.Категория = &Категория)
															  |			И (ИС_Ozon_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon = &ХарактеристикаOzon)
															  |			И (ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = &ВидРеквизита1С)
															  |			И (ИС_Ozon_СоответствиеЗначенийХарактеристик.Реквизит1С = &Реквизит1С)
															  |ГДЕ
															  |	НЕ вт_ЗначенияВ1С.ЗначениеВ1С ЕСТЬ null
															  |СГРУППИРОВАТЬ ПО
															  |	ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon,
															  |	вт_ЗначенияВ1С.ЗначениеВ1С
															  |
															  |УПОРЯДОЧИТЬ ПО
															  |	ЗначениеВ1С";

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяРеквизита", ИмяРеквизита);

	Иначе   
		
 		ОбъектМетаданных 	= Метаданные.НайтиПоТипу(ТипРеквизита.Типы()[0]);
		ПолноеИмяОбъекта 	= ОбъектМетаданных.ПолноеИмя();
		ЭтоСправочник		= СтрНайти(ПолноеИмяОбъекта, "Справочник.") = 1;
		ЭтоПеречисление		= СтрНайти(ПолноеИмяОбъекта, "Перечисление.") = 1;

		Запрос.Текст =
		"ВЫБРАТЬ 
		|	ИС_Ozon_СоответствиеЗначенийХарактеристик.Категория КАК Категория,
		|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon КАК ХарактеристикаOzon,
		|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon КАК ЗначениеХарактеристикиOzon,
		|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
		|	ИС_Ozon_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
		|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики
		|ИЗ
		|	РегистрСведений.ИС_Ozon_СоответствиеЗначенийХарактеристик КАК ИС_Ozon_СоответствиеЗначенийХарактеристик
		|ГДЕ
		|	ИС_Ozon_СоответствиеЗначенийХарактеристик.Категория = &Категория
		|	И ИС_Ozon_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon = &ХарактеристикаOzon
		|	И ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = &ВидРеквизита1С
		|	И ИС_Ozon_СоответствиеЗначенийХарактеристик.Реквизит1С = &Реквизит1С";
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		РезультатЗапроса.Колонки.ЗначениеХарактеристики.Имя = "ЗначениеВРегистре";
		РезультатЗапроса.Колонки.Добавить("ЗначениеХарактеристики", ТипРеквизита);
		Для Каждого стр Из РезультатЗапроса Цикл
			Если ЭтоСправочник Тогда

				Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда
					стр.ЗначениеХарактеристики = Справочники[ОбъектМетаданных.Имя].ПолучитьСсылку(
						Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
				КонецЕсли;

			ИначеЕсли ЭтоПеречисление Тогда

				Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда
					стр.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Получить(стр.ЗначениеВРегистре - 1);
				КонецЕсли;

			КонецЕсли;
		КонецЦикла;

		Отбор = "";
		Если ЭтоСправочник Тогда
			Отбор = "ГДЕ НЕ ЗначенияОбъекта.ПометкаУдаления ";
			Если ТипРеквизита.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Или ТипРеквизита.СодержитТип(
				Тип("СправочникСсылка.ЗначенияСвойствОбъектовИерархия")) Тогда
				Отбор = Отбор + "И ЗначенияОбъекта.Владелец = &Реквизит1С";
			ИначеЕсли ТипРеквизита.СодержитТип(Тип("СправочникСсылка.ХарактеристикиНоменклатуры")) Тогда
				Отбор = Отбор + "И ЗначенияОбъекта.ВидНоменклатуры = &Реквизит1С";
			КонецЕсли;
		КонецЕсли;

		Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", РезультатЗапроса);
		Запрос.Текст = "ВЫБРАТЬ
					   |	ТаблицаСоответствийЗначений.Категория КАК Категория,
					   |	ТаблицаСоответствийЗначений.ХарактеристикаOzon КАК ХарактеристикаOzon,
					   |	ТаблицаСоответствийЗначений.ЗначениеХарактеристикиOzon КАК ЗначениеХарактеристикиOzon,
					   |	ТаблицаСоответствийЗначений.ВидРеквизита1С КАК ВидРеквизита1С,
					   |	ТаблицаСоответствийЗначений.Реквизит1С КАК Реквизит1С,
					   |	ТаблицаСоответствийЗначений.ЗначениеВРегистре КАК ЗначениеВРегистре,
					   |	ТаблицаСоответствийЗначений.ЗначениеХарактеристики КАК ЗначениеХарактеристики
					   |ПОМЕСТИТЬ вт_СоответствиеЗначенийХарактеристик
					   |ИЗ
					   |	&ТаблицаСоответствийЗначений КАК  ТаблицаСоответствийЗначений
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
					   |	ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon КАК ЗначениеХарактеристикиOzon,
					   |	ЗначенияОбъекта.Ссылка КАК ЗначениеВ1С
					   |ИЗ
					   |	" + ПолноеИмяОбъекта + " КАК ЗначенияОбъекта
												   |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК ИС_Ozon_СоответствиеЗначенийХарактеристик
												   |		ПО ЗначенияОбъекта.Ссылка = ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики
												   | " + Отбор + " 								
																 |СГРУППИРОВАТЬ ПО
																 |	ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon,
																 |	ЗначенияОбъекта.Ссылка
																 |
																 |УПОРЯДОЧИТЬ ПО
																 |	ЗначениеВ1С";

	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура ДобавитьСопоставлениеХарактеристики(Категория, ХарактеристикаOzon, ВидРеквизита1С, Реквизит1С,
	ФиксированноеЗначение) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_Ozon_СоответствиеЗначенийХарактеристик.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.ХарактеристикаOzon.Установить(ХарактеристикаOzon);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.Категория 				= Категория;
	ЗаписьНабора.ХарактеристикаOzon 	= ХарактеристикаOzon;
	ЗаписьНабора.ВидРеквизита1С 		= ВидРеквизита1С;
	ЗаписьНабора.Реквизит1С 			= Реквизит1С;
	ЗаписьНабора.ФиксированноеЗначение 	= ФиксированноеЗначение;
	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура УдалитьСопоставлениеХарактеристики(Категория, ХарактеристикаOzon) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_Ozon_СоответствиеЗначенийХарактеристик.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.ХарактеристикаOzon.Установить(ХарактеристикаOzon);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Заварин К.В. 20.05.24 УА #71523
//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
//Процедура ДобавитьСопоставлениеОсновногоРеквизита(Категория, РеквизитТовара, ВидРеквизита1С, Реквизит1С,
//	ФиксированноеЗначение) Экспорт
Процедура ДобавитьСопоставлениеОсновногоРеквизита(Категория, РеквизитТовара, ВидРеквизита1С, Реквизит1С,
	ФиксированноеЗначение, Множитель = 0) Экспорт
//- ИнфоСофт Заварин К.В. 20.05.24 УА #71523

	НаборЗаписей = РегистрыСведений.ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.РеквизитТовара.Установить(РеквизитТовара);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.Категория 				= Категория;
	ЗаписьНабора.РеквизитТовара 		= РеквизитТовара;
	ЗаписьНабора.ВидРеквизита1С 		= ВидРеквизита1С;
	ЗаписьНабора.Реквизит1С 			= Реквизит1С;
	ЗаписьНабора.ФиксированноеЗначение 	= ФиксированноеЗначение;
	//+ ИнфоСофт Заварин К.В. 20.05.24 УА #71523
	ЗаписьНабора.Множитель = Множитель;      
	//- ИнфоСофт Заварин К.В. 20.05.24 УА #71523
	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура УдалитьСопоставлениеОсновногоРеквизита(Категория, РеквизитТовара) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.РеквизитТовара.Установить(РеквизитТовара);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983 

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ЭтоПримитивныйТип(ТипРеквизита) Экспорт

	Результат = Ложь;

	Если ТипЗнч(ТипРеквизита) = Тип("ОписаниеТипов") Тогда

		Если ТипРеквизита.СодержитТип(Тип("Строка")) Или ТипРеквизита.СодержитТип(Тип("Число"))
			Или ТипРеквизита.СодержитТип(Тип("Булево")) Или ТипРеквизита.СодержитТип(Тип("Дата")) Тогда

			Результат = Истина;

		КонецЕсли;
	ИначеЕсли ТипЗнч(ТипРеквизита) = Тип("Тип") Тогда

		Если ТипРеквизита = Тип("Строка") Или ТипРеквизита = Тип("Число") Или ТипРеквизита = Тип("Булево")
			Или ТипРеквизита = Тип("Дата") Тогда

			Результат = Истина;

		КонецЕсли;

	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ЭтоТипЗначенияСвойствОбъектов(ТипРеквизита) Экспорт

	Результат = Ложь;

	Если ТипРеквизита.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Или ТипРеквизита.СодержитТип(Тип(
		"СправочникСсылка.ЗначенияСвойствОбъектовИерархия")) Тогда

		Результат = Истина;

	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ТаблицаСоответствийДопРеквизитов(Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории) Экспорт

	Если ЕстьНастройкиОсновныхРеквизитовДляКатегории Тогда
		КатегорияДляОсновныхРеквизитов = Категория;
	Иначе
		КатегорияДляОсновныхРеквизитов = ПредопределенноеЗначение("Справочник.ИС_Ozon_КатегорииТоваров.ПустаяСсылка");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("КатегорияДляОсновныхРеквизитов", КатегорияДляОсновныхРеквизитов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon КАК ХарактеристикаOzon,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon КАК ЗначениеХарактеристикиOzon,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.Реквизит1С.ТипЗначения КАК ТипЗначенияРеквизита,
	|	ИС_Ozon_Характеристики.Код КАК ХарактеристикаOzonКод,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	0 КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	ИС_Ozon_Характеристики.ИДСправочникаЗначенийХарактеристики > 0 КАК ТребуетсяСопоставление
	|ИЗ
	|	РегистрСведений.ИС_Ozon_СоответствиеЗначенийХарактеристик КАК ИС_Ozon_СоответствиеЗначенийХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Характеристики КАК ИС_Ozon_Характеристики
	|		ПО ИС_Ozon_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon = ИС_Ozon_Характеристики.Ссылка
	|ГДЕ
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.Категория = &Категория
	|	И (ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры)
	|			ИЛИ ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры)
	|			ИЛИ ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры)
	|			ИЛИ ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	| 
	|ВЫБРАТЬ
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon,
	|	NULL,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ФиксированноеЗначение,
	|	ТипЗначения(ИС_Ozon_СоответствиеЗначенийХарактеристик.ФиксированноеЗначение),
	|	ИС_Ozon_Характеристики.Код КАК ХарактеристикаOzonКод,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	0,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_Ozon_СоответствиеЗначенийХарактеристик КАК ИС_Ozon_СоответствиеЗначенийХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Характеристики КАК ИС_Ozon_Характеристики
	|		ПО ИС_Ozon_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon = ИС_Ozon_Характеристики.Ссылка
	|ГДЕ
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.Категория = &Категория
	|	И (ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение)
	|	ИЛИ ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара,
	|	NULL,
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С,
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Реквизит1С,
	|	NULL,
	|	NULL,
	|	NULL,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_Ozon_СоответствиеОсновныхРеквизитовТовара КАК ИС_Ozon_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Категория = &КатегорияДляОсновныхРеквизитов
	|	И (ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры)
	|			ИЛИ ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры)
	|			ИЛИ ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры)
	|			ИЛИ ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара,
	|	NULL,
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С,
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Реквизит1С,
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ФиксированноеЗначение,
	|	ТипЗначения(ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ФиксированноеЗначение),
	|	NULL,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	0,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_Ozon_СоответствиеОсновныхРеквизитовТовара КАК ИС_Ozon_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Категория = &КатегорияДляОсновныхРеквизитов
	|	И (ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение)
	|	ИЛИ ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры))";

	ТаблицаСоответствийЗначений = Запрос.Выполнить().Выгрузить();

	МассивОписанийТипов = ТаблицаСоответствийЗначений.ВыгрузитьКолонку("ТипЗначенияРеквизита");
	МассивОписанийТипов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивОписанийТипов);
	МассивТипов = Новый Массив;
	Для Каждого описаниеТипов Из МассивОписанийТипов Цикл
		Если ЗначениеЗаполнено(описаниеТипов) Тогда
			Если ТипЗнч(описаниеТипов) = Тип("ОписаниеТипов") Тогда
				МассивТипов.Добавить(ОписаниеТипов.Типы()[0]);
			ИначеЕсли ТипЗнч(описаниеТипов) = Тип("Тип") Тогда
				МассивТипов.Добавить(описаниеТипов);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если МассивТипов.Количество() = 0 Тогда
		МассивТипов.Добавить(Тип("Строка"));
	КонецЕсли;

	МассивТипов.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
	КС = Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная);
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов, , КС);

	ТаблицаСоответствийЗначений.Колонки.ЗначениеХарактеристики.Имя = "ЗначениеВРегистре";
	ТаблицаСоответствийЗначений.Колонки.Добавить("ЗначениеХарактеристики", ОписаниеТипов);

	Для Каждого стр Из ТаблицаСоответствийЗначений Цикл

		Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда

			Если ЭтоПримитивныйТип(стр.ТипЗначенияРеквизита) Тогда
				стр.ЗначениеХарактеристики = стр.ЗначениеВРегистре;
			Иначе

				Если стр.ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры Тогда
					стр.ЗначениеХарактеристики = Справочники["ХарактеристикиНоменклатуры"].ПолучитьСсылку(
						Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
				Иначе

					ОбъектМетаданных = Метаданные.НайтиПоТипу(стр.ТипЗначенияРеквизита.Типы()[0]);
					ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
					ЭтоСправочник	= СтрНайти(ПолноеИмяОбъекта, "Справочник.") = 1;
					ЭтоПеречисление	= СтрНайти(ПолноеИмяОбъекта, "Перечисление.") = 1;

					Если ЭтоСправочник Тогда
						стр.ЗначениеХарактеристики = Справочники[ОбъектМетаданных.Имя].ПолучитьСсылку(
							Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
					ИначеЕсли ЭтоПеречисление Тогда
						стр.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Получить(стр.ЗначениеВРегистре
							- 1);
					КонецЕсли;
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Возврат ТаблицаСоответствийЗначений;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция СтруктураПараметровЗначенийРеквизитовНоменклатуры(Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории) Экспорт

	Если ЕстьНастройкиОсновныхРеквизитовДляКатегории Тогда
		КатегорияДляОсновныхРеквизитов = Категория;
	Иначе
		КатегорияДляОсновныхРеквизитов = ПредопределенноеЗначение("Справочник.ИС_Ozon_КатегорииТоваров.ПустаяСсылка");
	КонецЕсли;

	СоответствиеРеквизитов = Новый Соответствие;
	СписокРеквизитов = "";
	МассивТипов = Новый Массив;
	МассивСинонимов = Новый Массив;

	РеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].Реквизиты;
	Для Каждого реквизит Из РеквизитыНоменклатуры Цикл
		СоответствиеРеквизитов.Вставить(СокрЛП(реквизит.Синоним), реквизит);
		МассивСинонимов.Добавить(СокрЛП(реквизит.Синоним));
		СписокРеквизитов = СписокРеквизитов + реквизит.Имя + ", ";
		МассивТипов.Добавить(реквизит.тип.типы()[0]);
	КонецЦикла;

	СтандартныеРеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].СтандартныеРеквизиты;
	Для Каждого реквизит Из СтандартныеРеквизитыНоменклатуры Цикл
		СоответствиеРеквизитов.Вставить(реквизит.Имя, реквизит);
		МассивСинонимов.Добавить(реквизит.Имя);
		СписокРеквизитов = СписокРеквизитов + реквизит.Имя + ", ";
		МассивТипов.Добавить(реквизит.тип.типы()[0]);
	КонецЦикла;

	СписокРеквизитов = Лев(СписокРеквизитов, СтрДлина(СписокРеквизитов) - 2);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("КатегорияДляОсновныхРеквизитов", КатегорияДляОсновныхРеквизитов);
	Запрос.УстановитьПараметр("МассивСинонимов", МассивСинонимов);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon КАК ХарактеристикаOzon,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon КАК ЗначениеХарактеристикиOzon,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	|	ИС_Ozon_Характеристики.Код КАК ХарактеристикаOzonКод,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	0 КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	ИС_Ozon_Характеристики.ИДСправочникаЗначенийХарактеристики > 0 КАК ТребуетсяСопоставление
	|ИЗ
	|	РегистрСведений.ИС_Ozon_СоответствиеЗначенийХарактеристик КАК ИС_Ozon_СоответствиеЗначенийХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Характеристики КАК ИС_Ozon_Характеристики
	|		ПО ИС_Ozon_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon = ИС_Ozon_Характеристики.Ссылка
	|ГДЕ
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.Категория = &Категория
	|	И ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры)
	|	И ИС_Ozon_СоответствиеЗначенийХарактеристик.Реквизит1С В(&МассивСинонимов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара,
	|	NULL,
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С,
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Реквизит1С,
	|	NULL,
	|	NULL,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_Ozon_СоответствиеОсновныхРеквизитовТовара КАК ИС_Ozon_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Категория = &КатегорияДляОсновныхРеквизитов
	|	И ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры)
	|	И ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Реквизит1С В(&МассивСинонимов)";

	ТаблицаСоответствийЗначений = Запрос.Выполнить().Выгрузить();
	ТаблицаСоответствийЗначений.Колонки.ЗначениеХарактеристики.Имя = "ЗначениеВРегистре";

	МассивТипов 	= ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивТипов);
	ОписаниеТипов 	= Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная));
	ТаблицаСоответствийЗначений.Колонки.Добавить("ЗначениеХарактеристики", ОписаниеТипов);

	Для Каждого стр Из ТаблицаСоответствийЗначений Цикл
		Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда

			РеквизитИзСоответствия = СоответствиеРеквизитов.Получить(стр.Реквизит1С);
			Если РеквизитИзСоответствия = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			ТипЗначенияРеквизита = РеквизитИзСоответствия.Тип;
			Если ЭтоПримитивныйТип(ТипЗначенияРеквизита) Тогда

				стр.ЗначениеХарактеристики = стр.ЗначениеВРегистре;

			Иначе

				ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначенияРеквизита.Типы()[0]);
				ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
				ЭтоСправочник	= СтрНайти(ПолноеИмяОбъекта, "Справочник.") = 1;
				ЭтоПеречисление	= СтрНайти(ПолноеИмяОбъекта, "Перечисление.") = 1;

				Если ЭтоСправочник Тогда
					стр.ЗначениеХарактеристики = Справочники[ОбъектМетаданных.Имя].ПолучитьСсылку(
						Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
				ИначеЕсли ЭтоПеречисление Тогда
					стр.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Получить(стр.ЗначениеВРегистре - 1);
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Результат = Новый Структура;
	Результат.Вставить("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);
	Результат.Вставить("СписокРеквизитов", СписокРеквизитов);
	Результат.Вставить("СоответствиеРеквизитов", СоответствиеРеквизитов);

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры(Категория,
	ЕстьНастройкиОсновныхРеквизитовДляКатегории) Экспорт

	Если ЕстьНастройкиОсновныхРеквизитовДляКатегории Тогда
		КатегорияДляОсновныхРеквизитов = Категория;
	Иначе
		КатегорияДляОсновныхРеквизитов = ПредопределенноеЗначение("Справочник.ИС_Ozon_КатегорииТоваров.ПустаяСсылка");
	КонецЕсли;

	СоответствиеРеквизитов = Новый Соответствие;
	СписокРеквизитов = "";
	МассивТипов = Новый Массив;

	РеквизитыНоменклатуры = Метаданные.Справочники["ХарактеристикиНоменклатуры"].Реквизиты;
	Для Каждого реквизит Из РеквизитыНоменклатуры Цикл
		СоответствиеРеквизитов.Вставить(реквизит.Синоним, реквизит);
		СписокРеквизитов = СписокРеквизитов + реквизит.Имя + ", ";
		МассивТипов.Добавить(реквизит.тип.типы()[0]);
	КонецЦикла;

	СтандартныеРеквизиты = Метаданные.Справочники["ХарактеристикиНоменклатуры"].СтандартныеРеквизиты;
	Для Каждого реквизит Из СтандартныеРеквизиты Цикл
		СоответствиеРеквизитов.Вставить(реквизит.Имя, реквизит);
		СписокРеквизитов = СписокРеквизитов + реквизит.Имя + ", ";
		МассивТипов.Добавить(реквизит.тип.типы()[0]);
	КонецЦикла;

	СписокРеквизитов = Лев(СписокРеквизитов, СтрДлина(СписокРеквизитов) - 2);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("КатегорияДляОсновныхРеквизитов", КатегорияДляОсновныхРеквизитов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon КАК ХарактеристикаOzon,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon КАК ЗначениеХарактеристикиOzon,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	|	ИС_Ozon_Характеристики.Код КАК ХарактеристикаOzonКод,
	|	ИС_Ozon_Характеристики.ИДСправочникаЗначенийХарактеристики > 0 КАК ТребуетсяСопоставление
	|ИЗ
	|	РегистрСведений.ИС_Ozon_СоответствиеЗначенийХарактеристик КАК ИС_Ozon_СоответствиеЗначенийХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Характеристики КАК ИС_Ozon_Характеристики
	|		ПО ИС_Ozon_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon = ИС_Ozon_Характеристики.Ссылка
	|ГДЕ
	|	ИС_Ozon_СоответствиеЗначенийХарактеристик.Категория = &Категория
	|	И ИС_Ozon_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара,
	|	NULL,
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С,
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Реквизит1С,
	|	NULL,
	|	NULL,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИС_Ozon_СоответствиеОсновныхРеквизитовТовара КАК ИС_Ozon_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Категория = &КатегорияДляОсновныхРеквизитов
	|	И ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры)";

	ТаблицаСоответствийЗначений = Запрос.Выполнить().Выгрузить();
	ТаблицаСоответствийЗначений.Колонки.ЗначениеХарактеристики.Имя = "ЗначениеВРегистре";

	МассивТипов 	= ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивТипов);
	ОписаниеТипов 	= Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(1024, ДопустимаяДлина.Переменная));
	ТаблицаСоответствийЗначений.Колонки.Добавить("ЗначениеХарактеристики", ОписаниеТипов);

	Для Каждого стр Из ТаблицаСоответствийЗначений Цикл
		Если ЗначениеЗаполнено(стр.ЗначениеВРегистре) Тогда

			ТипЗначенияРеквизита = СоответствиеРеквизитов.Получить(стр.Реквизит1С).тип;
			Если ЭтоПримитивныйТип(ТипЗначенияРеквизита) Тогда

				стр.ЗначениеХарактеристики = стр.ЗначениеВРегистре;

			Иначе

				ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначенияРеквизита.Типы()[0]);
				ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
				ЭтоСправочник	= СтрНайти(ПолноеИмяОбъекта, "Справочник.") = 1;
				ЭтоПеречисление	= СтрНайти(ПолноеИмяОбъекта, "Перечисление.") = 1;

				Если ЭтоСправочник Тогда
					стр.ЗначениеХарактеристики = Справочники[ОбъектМетаданных.Имя].ПолучитьСсылку(
						Новый УникальныйИдентификатор(стр.ЗначениеВРегистре));
				ИначеЕсли ЭтоПеречисление Тогда
					стр.ЗначениеХарактеристики = Перечисления[ОбъектМетаданных.Имя].Получить(стр.ЗначениеВРегистре - 1);
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Результат = Новый Структура;
	Результат.Вставить("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);
	Результат.Вставить("СписокРеквизитов", СписокРеквизитов);
	Результат.Вставить("СоответствиеРеквизитов", СоответствиеРеквизитов);

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ЕстьНастройкиОсновныхРеквизитовДляКатегории(Категория) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Категория КАК Категория
	|ИЗ
	|	РегистрСведений.ИС_Ozon_СоответствиеОсновныхРеквизитовТовара КАК ИС_Ozon_СоответствиеОсновныхРеквизитовТовара
	|ГДЕ
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Категория = &Категория";

	Запрос.УстановитьПараметр("Категория", Категория);

	РезультатЗапроса = Запрос.Выполнить();

	Возврат Не РезультатЗапроса.Пустой();

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура ЗаполнитьЗначенияПоДопРеквизитам(СтрокаТаблицы, ТаблицаСоответствийЗначений, РазделительФотографий,
	ИмяЗаполняемойКолонки = Неопределено) Экспорт

	Если ТаблицаСоответствийЗначений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСоответствийЗначений.ХарактеристикаOzon КАК ХарактеристикаOzon,
	|	ТаблицаСоответствийЗначений.ХарактеристикаOzonКод КАК ХарактеристикаOzonКод,
	|	ТаблицаСоответствийЗначений.ЗначениеХарактеристикиOzon КАК ЗначениеХарактеристикиOzon,
	|	ТаблицаСоответствийЗначений.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ТаблицаСоответствийЗначений.Реквизит1С КАК Реквизит1С,
	|	ТаблицаСоответствийЗначений.ЗначениеВРегистре КАК ЗначениеВРегистре,
	|	ТаблицаСоответствийЗначений.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	ТаблицаСоответствийЗначений.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	ТаблицаСоответствийЗначений.ТребуетсяСопоставление КАК ТребуетсяСопоставление
	|ПОМЕСТИТЬ вт_СоответствиеЗначенийХарактеристик
	|ИЗ
	|	&ТаблицаСоответствийЗначений КАК ТаблицаСоответствийЗначений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК Ссылка,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon КАК ХарактеристикаOzon,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzonКод КАК ХарактеристикаOzonКод,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon КАК ЗначениеХарактеристикиOzon,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	"""" КАК ТекстоваяСтрока
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
	|			И (ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
	|ГДЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка В (&ХарактеристикиНоменклатуры)
	|	И вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры)
	|	И вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzonКод,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство)
	|			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon ЕСТЬ NULL
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon = НЕОПРЕДЕЛЕНО)
	|ГДЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка В(&ХарактеристикиНоменклатуры)
	|	И вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры)
	|	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzonКод,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (НоменклатураДополнительныеРеквизиты.Свойство = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
	|			И (НоменклатураДополнительныеРеквизиты.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
	|ГДЕ
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры)
	|	И НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
	|	И вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzonКод,
	|	НоменклатураДополнительныеРеквизиты.Значение,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	НоменклатураДополнительныеРеквизиты.ТекстоваяСтрока
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = НоменклатураДополнительныеРеквизиты.Свойство)
	|			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon ЕСТЬ NULL
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon = НЕОПРЕДЕЛЕНО)
	|ГДЕ
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры)
	|	И НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
	|	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzonКод,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (ДополнительныеСведения.Свойство = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
	|			И (ДополнительныеСведения.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
	|ГДЕ
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры)
	|	И ДополнительныеСведения.Объект = &Номенклатура
	|	И вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzonКод,
	|	ДополнительныеСведения.Значение,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = ДополнительныеСведения.Свойство)
	|			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon ЕСТЬ NULL
	|				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon = НЕОПРЕДЕЛЕНО)
	|ГДЕ
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры)
	|	И ДополнительныеСведения.Объект = &Номенклатура
	|	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon,
	|	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzonКод,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеВРегистре,
	|	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
	|	""""
	|ИЗ
	|	вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
	|
	|ГДЕ
	|	(вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение)
	|	ИЛИ вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры))
	|	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление 
	|";

	Если ЕстьВидНоменклатурыУХарактеристики() Тогда
		Запрос.Текст = Запрос.Текст + "
									  |
									  |ОБЪЕДИНИТЬ ВСЕ
									  |
									  |////////////////////////////////////////////////////////////////////////////////
									  |ВЫБРАТЬ
									  |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
									  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon КАК ХарактеристикаOzon,
									  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzonКод КАК ХарактеристикаOzonКод,
									  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon КАК ЗначениеХарактеристикиOzon,
									  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
									  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
									  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
									  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
									  |	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
									  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
									  |	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
									  |	"""" КАК ТекстоваяСтрока
									  |ИЗ
									  |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
									  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
									  |		ПО (ХарактеристикиНоменклатуры.ВидНоменклатуры = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
									  |			И (ХарактеристикиНоменклатуры.Ссылка = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
									  |ГДЕ
									  |	ХарактеристикиНоменклатуры.Ссылка В (&ХарактеристикиНоменклатуры)
									  |	И вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры)
									  |	И вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
									  |
									  |ОБЪЕДИНИТЬ ВСЕ
									  |
									  |ВЫБРАТЬ
									  |	ХарактеристикиНоменклатуры.Ссылка,
									  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon,
									  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzonКод,
									  |	ХарактеристикиНоменклатуры.Ссылка,
									  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
									  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
									  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
									  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
									  |	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
									  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
									  |	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление КАК ТребуетсяСопоставление,
									  |	""""
									  |ИЗ
									  |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
									  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
									  |		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = ХарактеристикиНоменклатуры.ВидНоменклатуры)
									  |			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
									  |				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon ЕСТЬ NULL
									  |				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon = НЕОПРЕДЕЛЕНО)
									  |ГДЕ
									  |	ХарактеристикиНоменклатуры.Ссылка В(&ХарактеристикиНоменклатуры)
									  |	И вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры)
									  |	И НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление";

	КонецЕсли;

	Запрос.УстановитьПараметр("ХарактеристикиНоменклатуры", СтрокаТаблицы.ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура", СтрокаТаблицы.Номенклатура);
	Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		ЗаполнитьЗначениеКолонки(Выборка, СтрокаТаблицы, РазделительФотографий, ИмяЗаполняемойКолонки);
		
	КонецЦикла
	;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура ЗаполнитьЗначенияПоРеквизитамНоменклатуры(СтрокаТаблицы, СтруктураПараметров, РазделительФотографий,
	ИмяЗаполняемойКолонки = Неопределено) Экспорт

	ТаблицаСоответствийЗначений = СтруктураПараметров.ТаблицаСоответствийЗначений;
	Если ТаблицаСоответствийЗначений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	" + СтруктураПараметров.СписокРеквизитов + Символы.ПС + "
																				|ПОМЕСТИТЬ вт_ЗначенияРеквизитов1С
																				|ИЗ
																				|	Справочник.Номенклатура КАК Номенклатура
																				|ГДЕ
																				|	Номенклатура.Ссылка = &Номенклатура
																				|;
																				|
																				|////////////////////////////////////////////////////////////////////////////////
																				|";

	МассивРеквизитов = ТаблицаСоответствийЗначений.ВыгрузитьКолонку("Реквизит1С");
	МассивРеквизитов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивРеквизитов);
	ПервыйЗапрос = Истина;
	Если МассивРеквизитов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СинонимРеквизита Из МассивРеквизитов Цикл
		Реквизит = СтруктураПараметров.СоответствиеРеквизитов.Получить(СинонимРеквизита);
		Если Реквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СодержитСтроку = Реквизит.Тип.СодержитТип(Тип("Строка"));

		Запрос.текст = Запрос.Текст + ?(ПервыйЗапрос, "", "ОБЪЕДИНИТЬ ВСЕ") + Символы.ПС + Символы.ПС + "ВЫБРАТЬ
																										| " + ?(
			СодержитСтроку, "Выразить(вт_ЗначенияРеквизитов1С." + Реквизит.Имя + " КАК Строка(1024))",
			"вт_ЗначенияРеквизитов1С." + Реквизит.Имя) + " КАК Значение,
														 |	""" + СинонимРеквизита + """ КАК ИмяРеквизита1С,"
			+ Символы.ПС + "
						   | " + ?(СодержитСтроку, "вт_ЗначенияРеквизитов1С." + Реквизит.Имя, """""") + " КАК ТекстоваяСтрока 
																										| " + ?(
			ПервыйЗапрос, "ПОМЕСТИТЬ вт_таб2" + Символы.ПС, "") + "ИЗ
																  |	вт_ЗначенияРеквизитов1С КАК вт_ЗначенияРеквизитов1С"
			+ Символы.ПС + Символы.ПС;
		ПервыйЗапрос = Ложь;
	КонецЦикла;

	Запрос.Текст = Запрос.Текст + ";
								  |////////////////////////////////////////////////////////////////////////////////
								  |
								  |ВЫБРАТЬ
								  |	ТаблицаСоответствийЗначений.ХарактеристикаOzon КАК ХарактеристикаOzon,
								  |	ТаблицаСоответствийЗначений.ХарактеристикаOzonКод КАК ХарактеристикаOzonКод,
								  |	ТаблицаСоответствийЗначений.ЗначениеХарактеристикиOzon КАК ЗначениеХарактеристикиOzon,
								  |	ТаблицаСоответствийЗначений.ВидРеквизита1С КАК ВидРеквизита1С,
								  |	ТаблицаСоответствийЗначений.Реквизит1С КАК Реквизит1С,
								  |	ТаблицаСоответствийЗначений.ЗначениеВРегистре КАК ЗначениеВРегистре,
								  |	ТаблицаСоответствийЗначений.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
								  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
			  					  |	ТаблицаСоответствийЗначений.Множитель КАК Множитель,
								  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
								  |	ТаблицаСоответствийЗначений.ТребуетсяСопоставление КАК ТребуетсяСопоставление
								  |ПОМЕСТИТЬ вт_СоответствиеЗначенийХарактеристик
								  |ИЗ
								  |	&ТаблицаСоответствийЗначений КАК ТаблицаСоответствийЗначений
								  |;
								  |
								  |////////////////////////////////////////////////////////////////////////////////
								  |
								  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
								  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon,
								  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzonКод,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon,
								  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
								  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
			  					  |	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
								  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
								  |	РеквизитыНоменклатуры.ТекстоваяСтрока КАК ТекстоваяСтрока,
								  |   вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |ИЗ
								  |	вт_таб2 КАК РеквизитыНоменклатуры
								  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
								  |		ПО (РеквизитыНоменклатуры.ИмяРеквизита1С = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
								  |			И (РеквизитыНоменклатуры.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
								  |ГДЕ
								  |	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |
								  |ОБЪЕДИНИТЬ ВСЕ
								  |
								  |ВЫБРАТЬ
								  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon,
								  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzonКод,
								  |	РеквизитыНоменклатуры.Значение,
								  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
								  //+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
			  					  |	вт_СоответствиеЗначенийХарактеристик.Множитель КАК Множитель,
								  //- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
								  |	РеквизитыНоменклатуры.ТекстоваяСтрока,
								  |   вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |ИЗ
								  |	вт_таб2 КАК РеквизитыНоменклатуры
								  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
								  |		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = РеквизитыНоменклатуры.ИмяРеквизита1С)
								  |			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
								  |				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon ЕСТЬ NULL ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon = Неопределено)
								  |ГДЕ
								  |	НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление";

	Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);
	Запрос.УстановитьПараметр("Номенклатура", СтрокаТаблицы.Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначениеКолонки(Выборка, СтрокаТаблицы, РазделительФотографий, ИмяЗаполняемойКолонки);
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура ЗаполнитьЗначенияПоРеквизитамХарактеристикиНоменклатуры(СтрокаТаблицы, СтруктураПараметров,
	РазделительФотографий, ИмяЗаполняемойКолонки = Неопределено) Экспорт

	ТаблицаСоответствийЗначений = СтруктураПараметров.ТаблицаСоответствийЗначений;
	Если ТаблицаСоответствийЗначений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	" + СтруктураПараметров.СписокРеквизитов + Символы.ПС + "
																				|ПОМЕСТИТЬ вт_ЗначенияРеквизитов1С
																				|ИЗ
																				|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
																				|ГДЕ
																				|	ХарактеристикиНоменклатуры.Ссылка = &ХарактеристикаНоменклатуры
																				|;
																				|
																				|////////////////////////////////////////////////////////////////////////////////
																				|";

	МассивРеквизитов = ТаблицаСоответствийЗначений.ВыгрузитьКолонку("Реквизит1С");
	МассивРеквизитов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивРеквизитов);
	ПервыйЗапрос = Истина;
	Для Каждого СинонимРеквизита Из МассивРеквизитов Цикл
		Реквизит = СтруктураПараметров.СоответствиеРеквизитов.Получить(СинонимРеквизита);
		Если Реквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СодержитСтроку = Реквизит.Тип.СодержитТип(Тип("Строка"));

		Запрос.текст = Запрос.Текст + ?(ПервыйЗапрос, "", "ОБЪЕДИНИТЬ ВСЕ") + Символы.ПС + Символы.ПС + "ВЫБРАТЬ
																										| " + ?(
			СодержитСтроку, "Выразить(вт_ЗначенияРеквизитов1С." + Реквизит.Имя + " КАК Строка(1024))",
			"вт_ЗначенияРеквизитов1С." + Реквизит.Имя) + " КАК Значение,
														 |	""" + СинонимРеквизита + """ КАК ИмяРеквизита1С,"
			+ Символы.ПС + "
						   | " + ?(СодержитСтроку, "вт_ЗначенияРеквизитов1С." + Реквизит.Имя, """""") + " КАК ТекстоваяСтрока 
																										| " + ?(
			ПервыйЗапрос, "ПОМЕСТИТЬ вт_таб2" + Символы.ПС, "") + "ИЗ
																  |	вт_ЗначенияРеквизитов1С КАК вт_ЗначенияРеквизитов1С"
			+ Символы.ПС + Символы.ПС;
		ПервыйЗапрос = Ложь;
	КонецЦикла;

	Запрос.Текст = Запрос.Текст + ";
								  |////////////////////////////////////////////////////////////////////////////////
								  |
								  |ВЫБРАТЬ
								  |	ТаблицаСоответствийЗначений.ХарактеристикаOzon КАК ХарактеристикаOzon,
								  |	ТаблицаСоответствийЗначений.ХарактеристикаOzonКод КАК ХарактеристикаOzonКод,
								  |	ТаблицаСоответствийЗначений.ЗначениеХарактеристикиOzon КАК ЗначениеХарактеристикиOzon,
								  |	ТаблицаСоответствийЗначений.ВидРеквизита1С КАК ВидРеквизита1С,
								  |	ТаблицаСоответствийЗначений.Реквизит1С КАК Реквизит1С,
								   //+ ИнфоСофт Стояк Ю.К. 22.08.2024 УА #82083
								  |	0 КАК Множитель,
								  //- ИнфоСофт Стояк Ю.К. 22.08.2024 УА #82083
								  |	ТаблицаСоответствийЗначений.ЗначениеВРегистре КАК ЗначениеВРегистре,
								  |	ТаблицаСоответствийЗначений.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
								  |	ТаблицаСоответствийЗначений.ТребуетсяСопоставление КАК ТребуетсяСопоставление
								  |ПОМЕСТИТЬ вт_СоответствиеЗначенийХарактеристик
								  |ИЗ
								  |	&ТаблицаСоответствийЗначений КАК ТаблицаСоответствийЗначений
								  |;
								  |
								  |////////////////////////////////////////////////////////////////////////////////
								  |
								  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
								  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon,
								  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzonКод,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon,
								  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
								   //+ ИнфоСофт Стояк Ю.К. 22.08.2024 УА #82093
								  |	вт_СоответствиеЗначенийХарактеристик.Множитель,
								  //- ИнфоСофт Стояк Ю.К. 22.08.2024 УА #82093
								  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
								  |	РеквизитыХарактеристики.ТекстоваяСтрока КАК ТекстоваяСтрока,
								  |   вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |ИЗ
								  |	вт_таб2 КАК РеквизитыХарактеристики
								  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
								  |		ПО (РеквизитыХарактеристики.ИмяРеквизита1С = вт_СоответствиеЗначенийХарактеристик.Реквизит1С)
								  |			И (РеквизитыХарактеристики.Значение = вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики)
								  |ГДЕ
								  |	вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |
								  |ОБЪЕДИНИТЬ ВСЕ
								  |
								  |ВЫБРАТЬ
								  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzon,
								  |	вт_СоответствиеЗначенийХарактеристик.ХарактеристикаOzonКод,
								  |	РеквизитыХарактеристики.Значение,
								  |	вт_СоответствиеЗначенийХарактеристик.Реквизит1С,
								   //+ ИнфоСофт Стояк Ю.К. 22.08.2024 УА #82093
								  |	вт_СоответствиеЗначенийХарактеристик.Множитель,
								  //- ИнфоСофт Стояк Ю.К. 22.08.2024 УА #82093
								  |	вт_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
								  |	вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристики,
								  |	РеквизитыХарактеристики.ТекстоваяСтрока,
								  |   вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление
								  |ИЗ
								  |	вт_таб2 КАК РеквизитыХарактеристики
								  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоответствиеЗначенийХарактеристик КАК вт_СоответствиеЗначенийХарактеристик
								  |		ПО (вт_СоответствиеЗначенийХарактеристик.Реквизит1С = РеквизитыХарактеристики.ИмяРеквизита1С)
								  |			И (вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon = ЗНАЧЕНИЕ(Справочник.ИС_Ozon_ЗначенияХарактеристик.ПустаяСсылка)
								  |				ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon ЕСТЬ NULL ИЛИ вт_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиOzon = Неопределено)
								  |ГДЕ
								  |	НЕ вт_СоответствиеЗначенийХарактеристик.ТребуетсяСопоставление";

	Запрос.УстановитьПараметр("ТаблицаСоответствийЗначений", ТаблицаСоответствийЗначений);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", СтрокаТаблицы.ХарактеристикаНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначениеКолонки(Выборка, СтрокаТаблицы, РазделительФотографий, ИмяЗаполняемойКолонки);
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура ЗаполнитьЗначениеКолонки(Выборка, СтрокаТаблицы, РазделительФотографий, ИмяЗаполняемойКолонки) Экспорт

	Если ЗначениеЗаполнено(Выборка.ХарактеристикаOzonКод) Тогда
		ИмяКолонки = "Атрибут_" + СтрЗаменить(Строка(Выборка.ХарактеристикаOzonКод), Символы.НПП, "");
	Иначе
		ИмяКолонки = Выборка.ХарактеристикаOzon;
	КонецЕсли;

	Если Не СтрокаТаблицы.Свойство(ИмяКолонки) Или (ЗначениеЗаполнено(ИмяЗаполняемойКолонки) И ИмяКолонки
		<> ИмяЗаполняемойКолонки) Тогда
		Возврат;
	КонецЕсли;

	Если Выборка.ВидРеквизита1С = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры") Тогда
		ЗначениеХарактеристикиOzon = СтрокаТаблицы.Штрихкод;
	ИначеЕсли ЗначениеЗаполнено(Выборка.ТекстоваяСтрока) И Не Выборка.ТребуетсяСопоставление Тогда
		ЗначениеХарактеристикиOzon = Выборка.ТекстоваяСтрока;
	Иначе
		//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
		//ЗначениеХарактеристикиOzon = Выборка.ЗначениеХарактеристикиOzon;
		Если Выборка.Множитель <> 0 Тогда
			ЗначениеХарактеристикиOzon = Выборка.ЗначениеХарактеристикиOzon * Выборка.Множитель;
		Иначе
			ЗначениеХарактеристикиOzon = Выборка.ЗначениеХарактеристикиOzon;
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	КонецЕсли;

	Если ТипЗнч(СтрокаТаблицы[ИмяКолонки]) = Тип("СписокЗначений") Тогда
		Если ИмяКолонки = "Изображения" Тогда
			Если ТипЗнч(ЗначениеХарактеристикиOzon) = Тип("Строка") И РазделительФотографий <> "" Тогда
				МассивЗначений = СтрРазделить(ЗначениеХарактеристикиOzon, РазделительФотографий, Ложь);
			Иначе
				Ozon_Константы = ПолучитьНастройкиСопоставления();
				РазделительФотографий = Ozon_Константы.РазделительФотографий;
				//Ozon_Константы = Ozon_КонстантыВызовСервера.ПрочитатьКонстанты();
				РасширенияДляВыгрузкиКартинок = Ozon_Константы.РасширенияДляВыгрузкиКартинок;
				Если ЗначениеЗаполнено(РасширенияДляВыгрузкиКартинок) Тогда

					//@skip-check wrong-string-literal-content
					Если (КраткоеНаименованиеОсновнойПодсистемы() = "УНФ"
						И ТипЗнч(ЗначениеХарактеристикиOzon) = Тип("СправочникСсылка.ХарактеристикиНоменклатурыПрисоединенныеФайлы")) Тогда
						ВладелецФайлов = СтрокаТаблицы.ХарактеристикаНоменклатуры;
					Иначе
						ВладелецФайлов = СтрокаТаблицы.Номенклатура;
					КонецЕсли;

					МассивЗначений = ПолучитьКартинкиПоВладельцу(ВладелецФайлов,
						РасширенияДляВыгрузкиКартинок);
				Иначе
					МассивЗначений = Новый Массив;
				КонецЕсли;

			КонецЕсли;
			МассивЗначений = ОбработатьСсылки(МассивЗначений);
		Иначе
			Если ТипЗнч(ЗначениеХарактеристикиOzon) = Тип("Строка") И Выборка.ТребуетсяСопоставление Тогда
				МассивЗначений = ЗначенияХарактеристикиOzonИзСтроки(
					ЗначениеХарактеристикиOzon);
			Иначе
				МассивЗначений = Новый Массив;
				МассивЗначений.Добавить(ЗначениеХарактеристикиOzon);
			КонецЕсли;
		КонецЕсли;
		СтрокаТаблицы[ИмяКолонки].ЗагрузитьЗначения(МассивЗначений);
	Иначе

		Если ИмяКолонки = "СсылкаНаГлавноеФото" Тогда
			ЗначениеХарактеристикиOzon = ОбработатьСсылки(ЗначениеХарактеристикиOzon);
		КонецЕсли;

		Если ТипЗнч(СтрокаТаблицы[ИмяКолонки]) <> ТипЗнч(ЗначениеХарактеристикиOzon) Тогда

			Если Не ЭтоПримитивныйТип(ЗначениеХарактеристикиOzon) Тогда
				ЗначениеХарактеристикиOzon = Строка(ЗначениеХарактеристикиOzon);
			КонецЕсли;
			
			//@skip-check empty-except-statement
			Попытка
				Если ТипЗнч(СтрокаТаблицы[ИмяКолонки]) = Тип("Число") Тогда
					ЗначениеХарактеристикиOzon = Число(ЗначениеХарактеристикиOzon);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;

		СтрокаТаблицы[ИмяКолонки] = ЗначениеХарактеристикиOzon;

	КонецЕсли;
	СтрокаТаблицы.ИзменилсяТовар = Истина;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ЗаполнитьТаблицуОсновныхРеквизитов(ТаблицаРеквизитов, Категория) Экспорт

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "Название";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Наименование товара";
	НоваяСтрока.РасширеннаяПодсказка = "Ознакомьтесь с Требованиями к названию, чтобы указать правильное название товара и пройти модерацию. 
									   |Вы можете не заполнять это поле - тогда название составится автоматически из обязательных характеристик: тип + бренд + модель + важные характеристики для категории.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "Артикул";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Артикул";
	НоваяСтрока.РасширеннаяПодсказка = "Уникальный идентификатор товара в разрезе характеристики номенклатуры и упаковки. Значение по умолчанию GUID";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "СсылкаНаГлавноеФото";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Ссылка на главное фото";
	НоваяСтрока.РасширеннаяПодсказка = "Требования к изображению:
									   |1. Формат: JPEG или PNG.
									   |2. Разрешение: от 700 до 1600 пикселей по любой стороне.
									   |3. Фон: белый - белые поля не более 2 пикселей от границы товара.
									   |4. Запрещены: логотипы, водяные знаки, цены, надписи, алкогольная тематика и эскизы товара (например, 3D-модель).";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "Изображения";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Ссылки на дополнительные фото";
	НоваяСтрока.РасширеннаяПодсказка = "Требования к изображению:
									   |1. Формат: JPEG или PNG.
									   |2. Разрешение: от 700 до 1600 пикселей по любой стороне.
									   |3. Фон: белый - белые поля не более 2 пикселей от границы товара.
									   |4. Запрещены: логотипы, водяные знаки, цены, надписи, алкогольная тематика и эскизы товара (например, 3D-модель).";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "МаркетинговыйЦвет";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Маркетинговый цвет";
	НоваяСтрока.РасширеннаяПодсказка = "Адрес ссылки на изображение в общедоступном облачном хранилище. Формат изображения по ссылке - JPG.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "ДлинаУпаковки";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Длина упаковки, мм";
	НоваяСтрока.РасширеннаяПодсказка = "Длина - это наибольшая сторона упаковки товара. Перед измерением длины: - Одежда, текстиль, наборы для вышивания - сложите товар в упаковке пополам. 
									   |- Карты и интерьерные наклейки - скрутите в рулон. Длина рулона - самая большая величина. - Длина книжного комплекта - это длина всей стопки книг, которые входят в комплект.
									   |По умолчанию используются упаковки номенклатуры.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "ШиринаУпаковки";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Ширина упаковки, мм";
	НоваяСтрока.РасширеннаяПодсказка = "Сначала измерьте длину и высоту, оставшаяся сторона - это ширина. Перед измерением ширины: - Одежда, текстиль, наборы для вышивания - сложите товар в упаковке пополам. 
									   |- Карты и интерьерные наклейки - скрутите в рулон. Ширина рулона - это его диаметр. - Ширина книжного комплекта - это ширина всей стопки книг, которые входят в комплект.
									   |По умолчанию используются упаковки номенклатуры.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "ВысотаУпаковки";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Высота упаковки, мм";
	НоваяСтрока.РасширеннаяПодсказка = "Высота - это наименьшая сторона упаковки товара. Перед измерением высоты: - Одежда, текстиль, наборы для вышивания - сложите товар в упаковке пополам. 
									   |- Карты и интерьерные наклейки - скрутите в рулон. Высота рулона - это его диаметр. - Высота книжного комплекта - это высота всей стопки книг, которые входят в комплект.
									   |По умолчанию используются упаковки номенклатуры.";

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.РеквизитТовара = "ВесУпаковки";
	НоваяСтрока.ПредставлениеРеквизитаТовара = "Вес в упаковке, г";
	НоваяСтрока.РасширеннаяПодсказка = "Вес единицы товара вместе с упаковкой в граммах.
									   |По умолчанию используются упаковки номенклатуры.";

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаРеквизитов", ТаблицаРеквизитов);
	Запрос.УстановитьПараметр("Категория", Категория);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРеквизитов.РеквизитТовара КАК РеквизитТовара,
	|	ТаблицаРеквизитов.ПредставлениеРеквизитаТовара КАК ПредставлениеРеквизитаТовара,
	|	ТаблицаРеквизитов.РасширеннаяПодсказка КАК РасширеннаяПодсказка
	|ПОМЕСТИТЬ вт_ОсновныеРеквизитыТовара
	|ИЗ
	|	&ТаблицаРеквизитов КАК ТаблицаРеквизитов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ОсновныеРеквизитыТовара.РеквизитТовара КАК РеквизитТовара,
	|	вт_ОсновныеРеквизитыТовара.ПредставлениеРеквизитаТовара КАК ПредставлениеРеквизитаТовара,
	|	вт_ОсновныеРеквизитыТовара.РасширеннаяПодсказка КАК РасширеннаяПодсказка,
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Реквизит1С КАК Реквизит1С,
	//+ ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Множитель КАК Множитель,
	//- ИнфоСофт Заварин К.В. 18.05.24 УА #71523
	|	ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.ФиксированноеЗначение КАК ФиксированноеЗначение
	|ИЗ
	|	вт_ОсновныеРеквизитыТовара КАК вт_ОсновныеРеквизитыТовара
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеОсновныхРеквизитовТовара КАК ИС_Ozon_СоответствиеОсновныхРеквизитовТовара
	|		ПО вт_ОсновныеРеквизитыТовара.РеквизитТовара = ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.РеквизитТовара
	|			И (ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.Категория = &Категория)";

	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРеквизитов = РезультатЗапроса.Выгрузить();

	СоответствиеРеквизитовНоменклатуры = СоответствиеРеквизитовНоменклатуры();

	Для Каждого стр Из ТаблицаРеквизитов Цикл
		Если стр.ВидРеквизита1С = Перечисления.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры
			И СоответствиеРеквизитовНоменклатуры.Получить(стр.Реквизит1С) = Неопределено Тогда

			УдалитьСопоставлениеОсновногоРеквизита(Категория, стр.РеквизитТовара);
			стр.ВидРеквизита1С 	= Неопределено;
			стр.Реквизит1С 		= Неопределено;

		КонецЕсли;
	КонецЦикла;

	Возврат ТаблицаРеквизитов;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ЕстьВидНоменклатурыУХарактеристики() Экспорт

	Возврат Метаданные.Справочники["ХарактеристикиНоменклатуры"].Реквизиты.Найти("ВидНоменклатуры") <> Неопределено;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция СсылкиНаСправочникИзСтроки(ЗначенияСтрокой, ИмяСправочника) Экспорт

	Результат = Новый Массив;

	Если ЗначениеЗаполнено(ЗначенияСтрокой) Тогда
		МассивСтрок = СтрРазделить(ЗначенияСтрокой, ";", Ложь);
		Для Каждого стр Из МассивСтрок Цикл
			СсылкаНаЭлемент = Справочники[ИмяСправочника].ПолучитьСсылку(Новый УникальныйИдентификатор(стр));
			Результат.Добавить(СсылкаНаЭлемент);
		КонецЦикла;
	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983 

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция СсылкиНаПеречислениеИзСтроки(ЗначенияСтрокой, ИмяПеречисления) Экспорт

	Результат = Новый Массив;

	Если ЗначениеЗаполнено(ЗначенияСтрокой) Тогда
		МассивСтрок = СтрРазделить(ЗначенияСтрокой, ";", Ложь);
		Для Каждого стр Из МассивСтрок Цикл
			СсылкаНаЭлемент = Перечисления[ИмяПеречисления][стр];
			Результат.Добавить(СсылкаНаЭлемент);
		КонецЦикла;
	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

#КонецОбласти

#КонецОбласти

#Область Склады 

//+ ИнфоСофт Ивонин К.А. 29.03.24 УА #71892
Процедура ПолучитьСкладыOzon(Профиль) Экспорт  
	
	Событие = ПолучитьИмяСобытия("ПолучитьСкладыOzon");
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
					
	Склады = ИС_Ozon_API.ЗагрузитьСкладыOzon(Профиль, ПараметрыЗапроса);
	
	Если Склады = Неопределено Тогда
		Возврат;
	КонецЕсли;		
		
	Для Каждого Склад Из Склады Цикл
		
		НайденныйСклад = Справочники.ИС_Ozon_Склады.НайтиПоРеквизиту("id", Склад.warehouse_id);
		
		Если НайденныйСклад.Пустая() Тогда		
			ОбъектСклад = Справочники.ИС_Ozon_Склады.СоздатьЭлемент();
		Иначе
			ОбъектСклад = НайденныйСклад.ПолучитьОбъект();
		КонецЕсли;
	    
	    ЗаполнитьЗначенияСвойств(ОбъектСклад, Склад);
	    
		ОбъектСклад.Профиль = Профиль;	
		ОбъектСклад.Наименование = Склад.name;
		ОбъектСклад.id 			 = Склад.warehouse_id;
		ОбъектСклад.ЗагруженИзЛК = Истина;
		ОбъектСклад.status = ИС_MP_Сервер.ПолучитьПеречислениеПоЗначению(Перечисления.ИС_Ozon_СтатусыСкладов, Склад.status);
		
		Если ОбъектСклад.status = Перечисления.ИС_Ozon_СтатусыСкладов.disabled Тогда
			ОбъектСклад.ПометкаУдаления = Истина;
		КонецЕсли;
		
		//+ ИнфоСофт Заварин К.В. 28.01.25 УА #82060
		ОбъектСклад.is_kgt 	 = Склад.is_kgt;
		//- ИнфоСофт Заварин К.В. 28.01.25 УА #82060
		
		Попытка	
			ОбъектСклад.Записать();	
		Исключение
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;   
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 29.03.24 УА #71892

#КонецОбласти

#Область ЦеныИОстатки 

//+ ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #92578
Функция ПолучитьИнформациюОЦенах(Профиль) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса 	= ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
		
	СтруктураТела = Новый Структура; 
	
	Фильтр = Новый Структура;
	Фильтр.Вставить("visibility", "ALL");
	
	СтруктураТела.Вставить("filter", 	Фильтр);   	
	СтруктураТела.Вставить("cursor", 	"");
	СтруктураТела.Вставить("limit", 	1);   		

	Результат = ИС_Ozon_API.ПолучитьИнформациюОЦенах(Профиль, ПараметрыЗапроса, СтруктураТела);
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
					
	КоличествоТоваров 				= Результат.total; 			
	ПовторятьПостраничныйЗапросЦен 	= КоличествоТоваров > 0;
	ТекущаяСтраница 				= 1; 
	Лимит 							= 1000;
	
	ТаблицаЦен = Новый ТаблицаЗначений;  
	
	КвалификаторыЧисла 	= Новый КвалификаторыЧисла(50, 2, ДопустимыйЗнак.Неотрицательный);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(80);
	
	ТаблицаЦен.Колонки.Добавить("nmId", 		Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	ТаблицаЦен.Колонки.Добавить("product_id", 	Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	ТаблицаЦен.Колонки.Добавить("old_price", 	Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	ТаблицаЦен.Колонки.Добавить("min_price", 	Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	ТаблицаЦен.Колонки.Добавить("Цена", 		Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	
	СтруктураТела.limit = Лимит; 
	
	Пока ПовторятьПостраничныйЗапросЦен Цикл
		
		Результат = ИС_Ozon_API.ПолучитьИнформациюОЦенах(Профиль, ПараметрыЗапроса, СтруктураТела);
	
		Если Результат = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;   						               

		Предметы = Результат.items;
		
		Для Каждого Предмет из Предметы Цикл      
			
			НоваяСтрока = ТаблицаЦен.Добавить();
			
			НоваяСтрока.nmId 		= Предмет.offer_id;
			//+ ИнфоСофт Стояк Ю.К. 10.03.2025 УА #95750			
			//НоваяСтрока.product_id 	= Предмет.product_id;	
			НоваяСтрока.product_id 	= Формат(Предмет.product_id, "ЧГ=0");	
			//- ИнфоСофт Стояк Ю.К. 10.03.2025 УА #95750
			
			Цены 					= Предмет.price;
			
			НоваяСтрока.Цена 		= Цены.price;
			НоваяСтрока.old_price 	= Цены.old_price;
			НоваяСтрока.min_price 	= Цены.min_price;										     
			
		КонецЦикла;   
				
		ПовторятьПостраничныйЗапросЦен 	= Лимит * ТекущаяСтраница <= КоличествоТоваров;
		ТекущаяСтраница 				= ТекущаяСтраница + 1;
		
	КонецЦикла;
	
	Возврат ТаблицаЦен;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.02.25 УА #92578

//+ ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524
Функция ПолучитьИнформациюОбОстатках(Профиль) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	СтруктураТела = Новый Структура; 
	Фильтр = Новый Структура;
	Фильтр.Вставить("visibility", "ALL");
	СтруктураТела.Вставить("filter", Фильтр);
	//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698	
	//СтруктураТела.Вставить("last_id", "");   	
	СтруктураТела.Вставить("cursor", "");   	
	//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
	СтруктураТела.Вставить("limit", 1);
	
	Результат = ИС_Ozon_API.ПолучитьИнформациюОбОстатках(Профиль, ПараметрыЗапроса, СтруктураТела);
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
			
	КоличествоТоваров = Результат.total; 			
	
	ПовторятьПостраничныйЗапросОстатков = КоличествоТоваров > 0;
	//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698	
	//last_id = "";                               
	cursor = "";                               
	//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
	ТекущаяСтраница = 1; 
	Лимит = 1000; 
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(50, 2, ДопустимыйЗнак.Неотрицательный);
	//+ ИнфоСофт Стояк Ю.К. 15.03.2024 УА #72261	
	//КвалификаторыСтроки = Новый КвалификаторыСтроки(20);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(80);
	//- ИнфоСофт Стояк Ю.К. 15.03.2024 УА #72261
	
	ТаблицаОстатковFBS = Новый ТаблицаЗначений;
	ТаблицаОстатковFBS.Колонки.Добавить("nmId", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	ТаблицаОстатковFBS.Колонки.Добавить("НаСкладе", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	ТаблицаОстатковFBS.Колонки.Добавить("ВРезерве", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	ТаблицаОстатковFBS.Колонки.Добавить("ТипСклада", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	
	ТаблицаОстатковFBO = Новый ТаблицаЗначений;
	ТаблицаОстатковFBO.Колонки.Добавить("nmId", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	ТаблицаОстатковFBO.Колонки.Добавить("НаСкладе", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	ТаблицаОстатковFBO.Колонки.Добавить("ВРезерве", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	ТаблицаОстатковFBO.Колонки.Добавить("ТипСклада", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
		
	СтруктураТела.limit = Лимит;                
	
	Пока ПовторятьПостраничныйЗапросОстатков Цикл 
		
		//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698		
		//СтруктураТела.last_id = last_id;            
		СтруктураТела.cursor = cursor;            
		//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
		
		Результат = ИС_Ozon_API.ПолучитьИнформациюОбОстатках(Профиль, ПараметрыЗапроса, СтруктураТела);
	
		Если Результат = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
			
		//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698		
		//last_id = Результат.last_id;	            
		cursor = Результат.cursor;	            
		//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
		Предметы = Результат.items;
		
		Для Каждого Предмет Из Предметы Цикл      
			
			Для Каждого Остаток Из Предмет.stocks Цикл
				
				Если Остаток.type = "fbo" Тогда
					
					НСтр = ТаблицаОстатковFBO.Добавить();
					НСтр.nmId = Предмет.offer_id;     													
					НСтр.ТипСклада = Остаток.type;
					НСтр.НаСкладе = Остаток.present;
					НСтр.ВРезерве = Остаток.reserved;															        
					
				ИначеЕсли Остаток.type = "fbs" Тогда
					
					НСтр = ТаблицаОстатковFBS.Добавить();
					НСтр.nmId = Предмет.offer_id;     													
					НСтр.ТипСклада = Остаток.type;
					НСтр.НаСкладе = Остаток.present;
					НСтр.ВРезерве = Остаток.reserved;         
					
				КонецЕсли;
				
			КонецЦикла;                                                   													      
			
		КонецЦикла; 
					
		ПовторятьПостраничныйЗапросОстатков = Лимит * ТекущаяСтраница <= КоличествоТоваров;
		ТекущаяСтраница = ТекущаяСтраница + 1;
		
	КонецЦикла;
	
	Возврат Новый Структура("FBS,FBO", ТаблицаОстатковFBS, ТаблицаОстатковFBO);
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.01.2023 УА #52524

//+ ИнфоСофт Стояк Ю.К. 13.10.2023 УА #62194
Функция ПолучитьОстаткиПоСкладам(Профиль) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	МассивSKU = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Номенклатура.sku КАК sku
	|ИЗ
	|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|ГДЕ
	|	ИС_Ozon_Номенклатура.Профиль = &Профиль
	|	И НЕ ИС_Ozon_Номенклатура.sku = 0";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивSKU.Добавить(СтрЗаменить(Строка(ВыборкаДетальныеЗаписи.sku), Символы.НПП, ""));
	КонецЦикла;
	
	ТаблицаОстатков = Новый ТаблицаЗначений;  
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(20, 2, ДопустимыйЗнак.Неотрицательный);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(80);
	
	ТаблицаОстатков.Колонки.Добавить("product_id", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	ТаблицаОстатков.Колонки.Добавить("Склад", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	ТаблицаОстатков.Колонки.Добавить("stock", Новый ОписаниеТипов("Число", КвалификаторыЧисла));	
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивSKU, 500);
	
	Для Каждого Элемент Из РазбитыйМассив Цикл	
		
		Результат = ИС_Ozon_API.ПолучитьОстаткиFBS(Профиль, ПараметрыЗапроса, Элемент);
		
		Если Результат = Неопределено Тогда	
			Продолжить;	
		КонецЕсли;
		
		Для Каждого Элемент Из Результат Цикл
			
			Если Не Элемент.Свойство("warehouse_name") Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаОстатков.Добавить();							
			НоваяСтрока.product_id = Элемент.product_id;	
			НоваяСтрока.stock = Элемент.present;
			НоваяСтрока.Склад = Элемент.warehouse_name;	 
			
		КонецЦикла; 		
		
	КонецЦикла; 
		
	Возврат ТаблицаОстатков;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 13.10.2023 УА #62194

//+ ИнфоСофт Ивонин К.А. 08.03.24 УА #66733
Процедура ВыгрузитьОстатки(Профиль, Склад, ТаблицаВыгрузки = Неопределено) Экспорт  
	
	Событие = ПолучитьИмяСобытия("ВыгрузитьОстатки");
		
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Озон;
	
	МассивНастроек = ИС_МП_УправлениеОстатками.МассивПараметровВыгрузкиОстатков();	
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивНастроек);
		
	ИспользоватьПоследниеОстатки = Ложь;
	
	Если Настройки.ИспользоватьПоследниеОстатки <> Неопределено Тогда
		ИспользоватьПоследниеОстатки = Настройки.ИспользоватьПоследниеОстатки;
	КонецЕсли;
		
	Если ТаблицаВыгрузки = Неопределено Тогда		
		ТаблицаВыгрузки = ИС_МП_УправлениеОстатками.СформироватьТаблицуВыгрузки(Профиль, Склад, ПеречислениеМП, Настройки);		
	КонецЕсли;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;  
	
	stocks = Новый Массив;
		
	//МассивОстатковСОшибками = Новый Массив;  
		
	Для Каждого Строка Из ТаблицаВыгрузки Цикл
		
		stock = Новый Структура;
		
		stock.Вставить("product_id", Число(Строка.ProductId));
		stock.Вставить("offer_id", Строка.OfferId);
		stock.Вставить("stock", Строка.Остаток);
		stock.Вставить("warehouse_id", Склад.id);		
		
		stocks.Добавить(stock);
		
	КонецЦикла; 
			
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(stocks, 100);	
	
	БылиОшибкиВыгрузки = Ложь;
	
	//+ ИнфоСофт Заварин К.В. 05.08.24 УА #80998
	СчетчикПаузы = 0;
	//- ИнфоСофт Заварин К.В. 05.08.24 УА #80998
	
	Для Каждого Элемент Из РазбитыйМассив Цикл
		
		//+ ИнфоСофт Заварин К.В. 03.08.24 УА #80998
		Если СчетчикПаузы = 78 Тогда
			ИС_MP_Сервер.Пауза(60);
			СчетчикПаузы = 0;
		КонецЕсли;
		СчетчикПаузы = СчетчикПаузы + 1;
		//- ИнфоСофт Заварин К.В. 03.08.24 УА #80998
		
		Результат = ИС_Ozon_API.ВыгрузитьОстаткиOzon(Профиль, ПараметрыЗапроса, Элемент);
		
		Если ЗначениеЗаполнено(Результат) Тогда	
			
			//Для Каждого ОтветОстатокПоТовару Из Результат Цикл
			//	
			//	Если Не ОтветОстатокПоТовару.updated Тогда
			//		
			//		Если ОтветОстатокПоТовару.errors.Количество() > 0 Тогда
			//			
			//			Если НЕ (ОтветОстатокПоТовару.errors[0].code = "SKU_STOCK_NOT_CHANGE" И ОтветОстатокПоТовару.errors[0].message = "sku stock not changed") Тогда
			//				
			//				ОтветОбОшибке = Новый Структура();
			//				
			//				ОтветОбОшибке.Вставить("product_id", ОтветОстатокПоТовару.product_id);
			//				ОтветОбОшибке.Вставить("offer_id", ОтветОстатокПоТовару.offer_id);
			//				ОтветОбОшибке.Вставить("error_code", ОтветОстатокПоТовару.errors[0].code);
			//				ОтветОбОшибке.Вставить("error_message", ОтветОстатокПоТовару.errors[0].message);
			//				
			//				МассивОстатковСОшибками.Добавить(ОтветОбОшибке);
			//				
			//			КонецЕсли;
			//			
			//		КонецЕсли;
			//		
			//	КонецЕсли;				
			//	
			//КонецЦикла;
			
		Иначе   
			БылиОшибкиВыгрузки = Истина;
			Текст = "Не удалось обновить остатки товаров";			
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);			
		КонецЕсли; 		
		
	КонецЦикла;
	
	Если Не ИспользоватьПоследниеОстатки Тогда
		Возврат;
	КонецЕсли;
	
	Если Не БылиОшибкиВыгрузки Тогда	
	
		Для Каждого Строка Из ТаблицаВыгрузки Цикл
			ИС_МП_УправлениеОстатками.ЗаписатьПоследнийВыгруженныйОстаток(Профиль, 
				Перечисления.ИС_МП_Маркетплейсы.Озон, Склад, Строка.НоменклатураOzon, Строка.Остаток);
		КонецЦикла;
		
	КонецЕсли; 
		
	//Возврат МассивОстатковСОшибками;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 08.03.24 УА #66733

//+ ИнфоСофт Ивонин К.А. 04.03.24 УА #66733
Функция ПолучитьТекстЗапросаОстатков() Экспорт 
	
	Текст =
	"ВЫБРАТЬ
	|	ИС_Ozon_Номенклатура.Ссылка КАК ПолеСопоставления,
	|	ИС_Ozon_Номенклатура.offer_id КАК OfferId,
	|	ИС_Ozon_Номенклатура.Код КАК ProductId,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.Упаковка, &ПустаяУпаковка) КАК Упаковка,
	|	ИС_MP_ОграничениеОстатков.Остаток КАК СкрываемыйОстаток,
	|	НЕ ИС_MP_ОграничениеОстатков.Остаток ЕСТЬ NULL КАК ЕстьСкрываемыйОстаток,
	|	ИС_MP_РучныеОстатки.Остаток КАК РучнойОстаток,
	|	НЕ ИС_Ozon_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL КАК ЕстьСопоставление,
	|	НЕ ИС_MP_РучныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьРучнойОстаток,
	|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.Упаковка.Числитель, 1)
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.Упаковка.Знаменатель, 1)
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	ЕСТЬNULL(ИС_MP_ПоследниеВыгруженныеОстатки.Остаток, 0) КАК ПоследнийВыгруженныйОстаток,
	|	НЕ ИС_MP_ПоследниеВыгруженныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьПоследнийВыгруженныйОстаток
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО ИС_Ozon_Номенклатура.Ссылка = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ОграничениеОстатков КАК ИС_MP_ОграничениеОстатков
	|		ПО (ИС_MP_ОграничениеОстатков.Профиль = &Профиль)
	|			И (ИС_MP_ОграничениеОстатков.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ОграничениеОстатков.Склад КАК Справочник.ИС_Ozon_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ОграничениеОстатков.КарточкаМП КАК Справочник.ИС_Ozon_Номенклатура)) = ИС_Ozon_Номенклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_РучныеОстатки КАК ИС_MP_РучныеОстатки
	|		ПО (ИС_MP_РучныеОстатки.Профиль = &Профиль)
	|			И (ИС_MP_РучныеОстатки.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_РучныеОстатки.Склад КАК Справочник.ИС_Ozon_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_РучныеОстатки.КарточкаМП КАК Справочник.ИС_Ozon_Номенклатура)) = ИС_Ozon_Номенклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ПоследниеВыгруженныеОстатки КАК ИС_MP_ПоследниеВыгруженныеОстатки
	|		ПО (ИС_MP_ПоследниеВыгруженныеОстатки.Профиль = &Профиль)
	|			И (ИС_MP_ПоследниеВыгруженныеОстатки.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ПоследниеВыгруженныеОстатки.Склад КАК Справочник.ИС_Ozon_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ПоследниеВыгруженныеОстатки.КарточкаМП КАК Справочник.ИС_Ozon_Номенклатура)) = ИС_Ozon_Номенклатура.Ссылка)
	|ГДЕ
	|	ИС_Ozon_Номенклатура.Профиль = &Профиль
	|	И НЕ ИС_Ozon_Номенклатура.ПометкаУдаления
	|	И ИС_Ozon_Номенклатура.is_kgt = &СГТ";
	
	Текст = Текст + ";";
	
	Текст = Текст + ИС_МП_УправлениеОстатками.ТекстЗапросаОстатков();
	
	Текст = Текст +
	"ВЫБРАТЬ
	|	ВТ_Сопоставление.ПолеСопоставления КАК НоменклатураOzon,
	|	ВТ_Сопоставление.OfferId КАК OfferId,
	|	ВТ_Сопоставление.ProductId КАК ProductId,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка,
	|	ВТ_Остатки.Свободно КАК Свободно,
	|	ВТ_Остатки.Резерв КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВТ_Сопоставление.СкрываемыйОстаток ЕСТЬ NULL
	|			ТОГДА &КоличествоСкрываемогоОстатка
	|		ИНАЧЕ ВТ_Сопоставление.СкрываемыйОстаток
	|	КОНЕЦ КАК СкрываемыйОстаток,
	|	ВТ_Сопоставление.ЕстьСкрываемыйОстаток КАК ЕстьСкрываемыйОстаток,
	|	ВТ_Сопоставление.РучнойОстаток КАК РучнойОстаток,
	|	ВТ_Сопоставление.ЕстьСопоставление КАК ЕстьСопоставление,
	|	ВТ_Сопоставление.ЕстьРучнойОстаток КАК ЕстьРучнойОстаток,
	|	МАКСИМУМ(ИС_Ozon_Штрихкоды.Наименование) КАК Штрихкод,
	|	ВТ_Сопоставление.ПоследнийВыгруженныйОстаток КАК ПоследнийВыгруженныйОстаток,
	|	ВТ_Сопоставление.ЕстьПоследнийВыгруженныйОстаток КАК ЕстьПоследнийВыгруженныйОстаток
	|ИЗ
	|	ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_Остатки.ПолеСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Штрихкоды КАК ИС_Ozon_Штрихкоды
	|		ПО (ИС_Ozon_Штрихкоды.ЛичныйКабинет = &Профиль)
	|			И ВТ_Сопоставление.ПолеСопоставления = ИС_Ozon_Штрихкоды.Карточка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сопоставление.ПолеСопоставления,
	|	ВТ_Сопоставление.OfferId,
	|	ВТ_Сопоставление.ProductId,
	|	ВТ_Сопоставление.Номенклатура,
	|	ВТ_Сопоставление.ЕстьСопоставление,
	|	ВТ_Сопоставление.Характеристика,
	|	ВТ_Сопоставление.Упаковка,
	|	ВТ_Сопоставление.ЕстьРучнойОстаток,
	|	ВТ_Сопоставление.РучнойОстаток,
	|	ВЫБОР
	|		КОГДА ВТ_Сопоставление.СкрываемыйОстаток ЕСТЬ NULL
	|			ТОГДА &КоличествоСкрываемогоОстатка
	|		ИНАЧЕ ВТ_Сопоставление.СкрываемыйОстаток
	|	КОНЕЦ,
	|	ВТ_Сопоставление.ЕстьСкрываемыйОстаток,
	|	ВТ_Остатки.Свободно,
	|	ВТ_Остатки.Резерв,
	|	ВТ_Сопоставление.ПоследнийВыгруженныйОстаток,
	|	ВТ_Сопоставление.ЕстьПоследнийВыгруженныйОстаток
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Сопоставление.ЕстьСопоставление УБЫВ";
	
	Возврат Текст;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 04.03.24 УА #66733

//+ ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901
Функция ПолучитьТекстЗапросаЦен() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Номенклатура.Ссылка КАК ПолеСопоставления,
	|	ИС_МП_РучныеЦены.Цена КАК Цена,
	|	NULL КАК ЦенаСоСкидкой,
	|	NULL КАК ЦенаМинимальная
	|ПОМЕСТИТЬ ВТ_РучныеЦеныОбъединение
	|ИЗ
	|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_РучныеЦены КАК ИС_МП_РучныеЦены
	|		ПО (ИС_МП_РучныеЦены.Профиль = &Профиль)
	|			И (ИС_МП_РучныеЦены.Маркетплейс = &Маркетплейс)
	|			И (ИС_Ozon_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_РучныеЦены.КарточкаМП КАК Справочник.ИС_Ozon_Номенклатура)))
	|			И (ИС_МП_РучныеЦены.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦены))
	|ГДЕ
	|	ИС_МП_РучныеЦены.Профиль = &Профиль
	|	И ИС_МП_РучныеЦены.Маркетплейс = &Маркетплейс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_Ozon_Номенклатура.Ссылка,
	|	NULL,
	|	ИС_МП_РучныеЦеныСоСкидкой.Цена,
	|	NULL
	|ИЗ
	|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_РучныеЦены КАК ИС_МП_РучныеЦеныСоСкидкой
	|		ПО (ИС_МП_РучныеЦеныСоСкидкой.Профиль = &Профиль)
	|			И (ИС_МП_РучныеЦеныСоСкидкой.Маркетплейс = &Маркетплейс)
	|			И (ИС_Ozon_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_РучныеЦеныСоСкидкой.КарточкаМП КАК Справочник.ИС_Ozon_Номенклатура)))
	|			И (ИС_МП_РучныеЦеныСоСкидкой.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой))
	|ГДЕ
	|	ИС_МП_РучныеЦеныСоСкидкой.Профиль = &Профиль
	|	И ИС_МП_РучныеЦеныСоСкидкой.Маркетплейс = &Маркетплейс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_Ozon_Номенклатура.Ссылка,
	|	NULL,
	|	NULL,
	|	ИС_МП_РучныеЦеныМинимальные.Цена
	|ИЗ
	|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_РучныеЦены КАК ИС_МП_РучныеЦеныМинимальные
	|		ПО (ИС_МП_РучныеЦеныМинимальные.Профиль = &Профиль)
	|			И (ИС_МП_РучныеЦеныМинимальные.Маркетплейс = &Маркетплейс)
	|			И (ИС_Ozon_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_РучныеЦеныМинимальные.КарточкаМП КАК Справочник.ИС_Ozon_Номенклатура)))
	|			И (ИС_МП_РучныеЦеныМинимальные.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныМинимальный))
	|ГДЕ
	|	ИС_МП_РучныеЦеныМинимальные.Профиль = &Профиль
	|	И ИС_МП_РучныеЦеныМинимальные.Маркетплейс = &Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Ozon_Номенклатура.Ссылка КАК ПолеСопоставления,
	|	ИС_МП_ПоследниеЦены.Цена КАК Цена,
	|	NULL КАК ЦенаСоСкидкой,
	|	NULL КАК ЦенаМинимальная
	|ПОМЕСТИТЬ ВТ_ПоследниеЦеныОбъединение
	|ИЗ
	|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_ПоследниеВыгруженныеЦены КАК ИС_МП_ПоследниеЦены
	|		ПО (ИС_МП_ПоследниеЦены.Профиль = &Профиль)
	|			И (ИС_МП_ПоследниеЦены.Маркетплейс = &Маркетплейс)
	|			И (ИС_Ozon_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_ПоследниеЦены.КарточкаМП КАК Справочник.ИС_Ozon_Номенклатура)))
	|			И (ИС_МП_ПоследниеЦены.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦены))
	|ГДЕ
	|	ИС_МП_ПоследниеЦены.Профиль = &Профиль
	|	И ИС_МП_ПоследниеЦены.Маркетплейс = &Маркетплейс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_Ozon_Номенклатура.Ссылка,
	|	NULL,
	|	ИС_МП_ПоследниеЦеныСоСкидкой.Цена,
	|	NULL
	|ИЗ
	|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_ПоследниеВыгруженныеЦены КАК ИС_МП_ПоследниеЦеныСоСкидкой
	|		ПО (ИС_МП_ПоследниеЦеныСоСкидкой.Профиль = &Профиль)
	|			И (ИС_МП_ПоследниеЦеныСоСкидкой.Маркетплейс = &Маркетплейс)
	|			И (ИС_Ozon_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_ПоследниеЦеныСоСкидкой.КарточкаМП КАК Справочник.ИС_Ozon_Номенклатура)))
	|			И (ИС_МП_ПоследниеЦеныСоСкидкой.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой))
	|ГДЕ
	|	ИС_МП_ПоследниеЦеныСоСкидкой.Профиль = &Профиль
	|	И ИС_МП_ПоследниеЦеныСоСкидкой.Маркетплейс = &Маркетплейс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_Ozon_Номенклатура.Ссылка,
	|	NULL,
	|	NULL,
	|	ИС_МП_ПоследниеЦеныМинимальные.Цена
	|ИЗ
	|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МП_ПоследниеВыгруженныеЦены КАК ИС_МП_ПоследниеЦеныМинимальные
	|		ПО (ИС_МП_ПоследниеЦеныМинимальные.Профиль = &Профиль)
	|			И (ИС_МП_ПоследниеЦеныМинимальные.Маркетплейс = &Маркетплейс)
	|			И (ИС_Ozon_Номенклатура.Ссылка = (ВЫРАЗИТЬ(ИС_МП_ПоследниеЦеныМинимальные.КарточкаМП КАК Справочник.ИС_Ozon_Номенклатура)))
	|			И (ИС_МП_ПоследниеЦеныМинимальные.ВидЦеныМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныМинимальный))
	|ГДЕ
	|	ИС_МП_ПоследниеЦеныМинимальные.Профиль = &Профиль
	|	И ИС_МП_ПоследниеЦеныМинимальные.Маркетплейс = &Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РучныеЦеныОбъединение.ПолеСопоставления КАК ПолеСопоставления,
	|	СУММА(ВТ_РучныеЦеныОбъединение.Цена) КАК Цена,
	|	СУММА(ВТ_РучныеЦеныОбъединение.ЦенаСоСкидкой) КАК ЦенаСоСкидкой,
	|	СУММА(ВТ_РучныеЦеныОбъединение.ЦенаМинимальная) КАК ЦенаМинимальная
	|ПОМЕСТИТЬ ВТ_РучныеЦены
	|ИЗ
	|	ВТ_РучныеЦеныОбъединение КАК ВТ_РучныеЦеныОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РучныеЦеныОбъединение.ПолеСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеЦеныОбъединение.ПолеСопоставления КАК ПолеСопоставления,
	|	СУММА(ВТ_ПоследниеЦеныОбъединение.Цена) КАК Цена,
	|	СУММА(ВТ_ПоследниеЦеныОбъединение.ЦенаСоСкидкой) КАК ЦенаСоСкидкой,
	|	СУММА(ВТ_ПоследниеЦеныОбъединение.ЦенаМинимальная) КАК ЦенаМинимальная
	|ПОМЕСТИТЬ ВТ_ПоследниеЦены
	|ИЗ
	|	ВТ_ПоследниеЦеныОбъединение КАК ВТ_ПоследниеЦеныОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоследниеЦеныОбъединение.ПолеСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Ozon_Номенклатура.Ссылка КАК ПолеСопоставления,
	|	ИС_Ozon_Номенклатура.offer_id КАК OfferId,
	|	ИС_Ozon_Номенклатура.Код КАК ProductId,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)) КАК ХарактеристикаЦО,
	|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
	|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.Упаковка, &ПустаяУпаковка) КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.Упаковка.Числитель, 1)
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.Упаковка.Знаменатель, 1)
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	НЕ ИС_Ozon_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL КАК ЕстьСопоставление,
	|	ВТ_РучныеЦены.Цена КАК РучнаяЦена,
	|	НЕ ВТ_РучныеЦены.Цена ЕСТЬ NULL КАК ЕстьРучнаяЦена,
	|	ВТ_РучныеЦены.ЦенаСоСкидкой КАК РучнаяЦенаСоСкидкой,
	|	НЕ ВТ_РучныеЦены.ЦенаСоСкидкой ЕСТЬ NULL КАК ЕстьРучнаяЦенаСоСкидкой,
	|	ВТ_РучныеЦены.ЦенаМинимальная КАК РучнаяЦенаМинимальная,
	|	НЕ ВТ_РучныеЦены.ЦенаМинимальная ЕСТЬ NULL КАК ЕстьРучнаяЦенаМинимальная,
	|	ЕСТЬNULL(ВТ_ПоследниеЦены.Цена, 0) КАК ПоследняяВыгруженнаяЦена,
	|	НЕ ВТ_ПоследниеЦены.Цена ЕСТЬ NULL КАК ЕстьПоследняяВыгруженнаяЦена,
	|	ЕСТЬNULL(ВТ_ПоследниеЦены.ЦенаСоСкидкой, 0) КАК ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	НЕ ВТ_ПоследниеЦены.ЦенаСоСкидкой ЕСТЬ NULL КАК ЕстьПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ЕСТЬNULL(ВТ_ПоследниеЦены.ЦенаМинимальная, 0) КАК ПоследняяВыгруженнаяЦенаМинимальная,
	|	НЕ ВТ_ПоследниеЦены.ЦенаМинимальная ЕСТЬ NULL КАК ЕстьПоследняяВыгруженнаяЦенаМинимальная
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО ИС_Ozon_Номенклатура.Ссылка = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РучныеЦены КАК ВТ_РучныеЦены
	|		ПО (ВТ_РучныеЦены.ПолеСопоставления = ИС_Ozon_Номенклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследниеЦены КАК ВТ_ПоследниеЦены
	|		ПО (ВТ_ПоследниеЦены.ПолеСопоставления = ИС_Ozon_Номенклатура.Ссылка)
	|ГДЕ
	|	ИС_Ozon_Номенклатура.Профиль = &Профиль
	|	И НЕ ИС_Ozon_Номенклатура.ПометкаУдаления";	
	
	Текст = Текст + ";";
	
	Текст = Текст + ИС_МП_УправлениеЦенами.ТекстЗапросаЦен();
	
	Текст = Текст +	
	
	"ВЫБРАТЬ
	|	ВТ_Сопоставление.ПолеСопоставления КАК НоменклатураOzon,
	|	ВТ_Сопоставление.OfferId КАК OfferId,
	|	ВТ_Сопоставление.ProductId КАК ProductId,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка,  
	|	ВТ_Сопоставление.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Сопоставление.ЕстьСопоставление КАК ЕстьСопоставление,
	|	ВТ_Сопоставление.РучнаяЦена КАК РучнаяЦена,
	|	ВТ_Сопоставление.ЕстьРучнаяЦена КАК ЕстьРучнаяЦена,
	|	ВТ_Сопоставление.РучнаяЦенаСоСкидкой КАК РучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьРучнаяЦенаСоСкидкой КАК ЕстьРучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.РучнаяЦенаМинимальная КАК РучнаяЦенаМинимальная,
	|	ВТ_Сопоставление.ЕстьРучнаяЦенаМинимальная КАК ЕстьРучнаяЦенаМинимальная,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦена КАК ПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦена КАК ЕстьПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦенаСоСкидкой КАК ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой КАК ЕстьПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦенаМинимальная КАК ПоследняяВыгруженнаяЦенаМинимальная,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦенаМинимальная КАК ЕстьПоследняяВыгруженнаяЦенаМинимальная, 
	|	ВТ_Цены.Цена КАК Цена,
	|	ВТ_Цены.ЦенаСоСкидкой КАК ЦенаСоСкидкой,
	|	ВТ_Цены.ЦенаМинимальная КАК ЦенаМинимальная,
	|	МАКСИМУМ(ИС_Ozon_Штрихкоды.Наименование) КАК Штрихкод
	|ИЗ
	|	ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_Цены.ПолеСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Штрихкоды КАК ИС_Ozon_Штрихкоды
	|		ПО (ИС_Ozon_Штрихкоды.ЛичныйКабинет = &Профиль)
	|			И ВТ_Сопоставление.ПолеСопоставления = ИС_Ozon_Штрихкоды.Карточка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сопоставление.ПолеСопоставления,
	|	ВТ_Сопоставление.OfferId,
	|	ВТ_Сопоставление.ProductId,
	|	ВТ_Сопоставление.Номенклатура,
	|	ВТ_Сопоставление.Характеристика,
	|	ВТ_Сопоставление.Упаковка,    
	|	ВТ_Сопоставление.ЭтоНабор,
	|	ВТ_Сопоставление.ЕстьСопоставление,
	|	ВТ_Сопоставление.РучнаяЦена,
	|	ВТ_Сопоставление.ЕстьРучнаяЦена,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦена,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦена,
	|	ВТ_Цены.Цена,
	|	ВТ_Цены.ЦенаСоСкидкой,
	|	ВТ_Цены.ЦенаМинимальная,
	|	ВТ_Сопоставление.РучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьРучнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.РучнаяЦенаМинимальная,
	|	ВТ_Сопоставление.ЕстьРучнаяЦенаМинимальная,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой,
	|	ВТ_Сопоставление.ПоследняяВыгруженнаяЦенаМинимальная,
	|	ВТ_Сопоставление.ЕстьПоследняяВыгруженнаяЦенаМинимальная
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Сопоставление.ЕстьСопоставление УБЫВ,
	|	ВТ_Сопоставление.РучнаяЦена УБЫВ";
	
	Возврат Текст;
		
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
Функция ПолучитьСкладПоУмолчанию(Профиль) Экспорт

	Результат = Справочники.ИС_Ozon_Склады.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ИС_Ozon_Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_Ozon_Склады КАК ИС_Ozon_Склады
	|ГДЕ
	|	ИС_Ozon_Склады.Профиль = &Профиль
	|	И НЕ ИС_Ozon_Склады.ПометкаУдаления";

	Запрос.УстановитьПараметр("Профиль", Профиль);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 15.03.24 УА #71892
Функция ПолучитьОстаткиFBS(Профиль, Склад) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Склады.id КАК id,
	|	ИС_Ozon_Склады.is_kgt КАК СГТ
	|ИЗ
	|	Справочник.ИС_Ozon_Склады КАК ИС_Ozon_Склады
	|ГДЕ
	|	ИС_Ozon_Склады.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать();
	
	ВыборкаСклад.Следующий();
	
	Id = ВыборкаСклад.id;
	СГТ = ВыборкаСклад.СГТ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Номенклатура.Ссылка КАК Ссылка,
	|	ИС_Ozon_Номенклатура.sku КАК sku
	|ИЗ
	|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|ГДЕ
	|	ИС_Ozon_Номенклатура.Профиль = &Профиль
	|	И ИС_Ozon_Номенклатура.is_kgt = &СГТ
	|	И НЕ ИС_Ozon_Номенклатура.sku = 0";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("СГТ", СГТ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаSKU = РезультатЗапроса.Выбрать();
	
	МассивSKU = Новый Массив;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НоменклатураOzon");
	Результат.Колонки.Добавить("sku");
	Результат.Колонки.Добавить("Остаток");
	
	Пока ВыборкаSKU.Следующий() Цикл
	
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.НоменклатураOzon = ВыборкаSKU.Ссылка;
		НоваяСтрока.sku = Формат(ВыборкаSKU.sku, "ЧГ=0");
		
		МассивSKU.Добавить(Формат(ВыборкаSKU.sku, "ЧГ=0"));
	
	КонецЦикла;
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивSKU, 500);
	
	Для Каждого Элемент Из РазбитыйМассив Цикл
					
		ОстаткиТоваров = ИС_Ozon_API.ПолучитьОстаткиFBS(Профиль, ПараметрыЗапроса, Элемент);
		
		Если ОстаткиТоваров = Неопределено Тогда
			Продолжить;
		КонецЕсли;
				
		Для Каждого Элемент Из ОстаткиТоваров Цикл
		    
		    Если Элемент.warehouse_id <> Id Тогда
		    	Продолжить;
		    КонецЕсли;
		    
			НайденныеСтроки = Результат.НайтиСтроки(Новый Структура("sku", Формат(Элемент.sku, "ЧГ=0")));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].Остаток = Элемент.present;	
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЦикла;	
							
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 15.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 01.04.24 УА #71892
Функция ПолучитьИнформациюОСкладе(Склад) Экспорт

	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Склады.Ссылка КАК Ссылка,
	|	ИС_Ozon_Склады.is_rfbs КАК rFBS,
	|	ИС_Ozon_Склады.is_kgt КАК КГТ,
	|	ИС_Ozon_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_Ozon_Склады.Склад КАК Склад,
	|	ИС_Ozon_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_Ozon_СкладыГруппаСкладов.Склад КАК СкладГруппы
	|ИЗ
	|	Справочник.ИС_Ozon_Склады КАК ИС_Ozon_Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Склады.ГруппаСкладов КАК ИС_Ozon_СкладыГруппаСкладов
	|		ПО ИС_Ozon_Склады.Ссылка = ИС_Ozon_СкладыГруппаСкладов.Ссылка
	|ГДЕ
	|	ИС_Ozon_Склады.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Результат = "";
		
	Пока ВыборкаСклад.Следующий() Цикл
		
		Результат = Результат + "rFBS: " + ВыборкаСклад.rFBS + Символы.ПС;
		Результат = Результат + "КГТ: " + ВыборкаСклад.КГТ + Символы.ПС;				
				
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
		    
		    Результат = Результат + "Группа складов: " + Символы.ПС;
		    
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
		
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
			
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда
			    	Результат = Результат + Символы.Таб + " - " + ВыборкаГруппаСкладов.СкладГруппы + Символы.ПС;
			    КонецЕсли;
			    
			КонецЦикла;				
		
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			Результат = Результат + "Общая группа складов: " + ВыборкаСклад.ОбщаяГруппаСкладов + Символы.ПС;
		Иначе
			Результат = Результат + "Склад: " + ВыборкаСклад.Склад + Символы.ПС;		
		КонецЕсли;
	
	КонецЦикла;
    
    Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 01.04.24 УА #71892

//+ ИнфоСофт Мурсалимов Д.Р. 04.03.24 УА #67173
Процедура УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад) Экспорт
	
	Событие = ПолучитьИмяСобытия("УстановитьПараметрыЗапросаОстатков");
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "Организация");
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Озон; 
	
	МассивПараметров = ИС_МП_УправлениеОстатками.МассивНастроекОстатков(ПеречислениеМП);
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивПараметров); 
	
	РассчитыватьНесобранныеКомплекты = Ложь;
	ВыгружатьОстаткиВРазрезеОрганизации = Ложь;
	СкрываемыйОстаток = 0;

	Если Настройки.РассчитыватьНесобранныеКомплекты <> Неопределено Тогда
		РассчитыватьНесобранныеКомплекты = Настройки.РассчитыватьНесобранныеКомплекты;	
	КонецЕсли;
	
	Если Настройки.ВыгружатьОстаткиВРазрезеОрганизации <> Неопределено Тогда
		ВыгружатьОстаткиВРазрезеОрганизации = Настройки.ВыгружатьОстаткиВРазрезеОрганизации;	
	КонецЕсли;

	Если Настройки.СкрываемыйОстаток <> Неопределено Тогда
		СкрываемыйОстаток = Настройки.СкрываемыйОстаток;	
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Маркетплейс", ПеречислениеМП);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("КоличествоСкрываемогоОстатка", СкрываемыйОстаток);
	Запрос.УстановитьПараметр("РассчитыватьНесобранныеКомплекты", РассчитыватьНесобранныеКомплекты);
	Запрос.УстановитьПараметр("ВыгружатьОстаткиВРазрезеОрганизации", ВыгружатьОстаткиВРазрезеОрганизации);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПустаяУпаковка", ИС_МП_СерверЛокализация.ПустаяСсылкаУпаковка());
	
	СГТ = Ложь;
	Заменитель = "ИЕРАРХИИ";
	ПараметрСклад = Неопределено;
	
	ЗапросНазначений = Новый Запрос;
	ЗапросНазначений.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
	|ИЗ
	|	Справочник.ИС_Ozon_Склады.НаправленияДеятельности КАК ИС_Ozon_СкладыНаправленияДеятельности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ИС_Ozon_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|ГДЕ
	|	ИС_Ozon_СкладыНаправленияДеятельности.Ссылка = &Ссылка";
	
	ЗапросНазначений.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
	
	Назначения = Новый Массив;
	
	ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
	
	Пока ВыборкаНазначения.Следующий() Цикл	
		Назначения.Добавить(ВыборкаНазначения.Назначение);	
	КонецЦикла;
	
	Если Назначения.Количество() = 0 Тогда		
		Назначения = Справочники.Назначения.ПустаяСсылка();		
	КонецЕсли;	

	Запрос.УстановитьПараметр("Назначение", Назначения);	
	
	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Склады.Ссылка КАК Ссылка,
	|	ИС_Ozon_Склады.is_kgt КАК СГТ,
	|	ИС_Ozon_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_Ozon_Склады.Склад КАК Склад,
	|	ИС_Ozon_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_Ozon_СкладыГруппаСкладов.Склад КАК СкладГруппы
	|ИЗ
	|	Справочник.ИС_Ozon_Склады КАК ИС_Ozon_Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Склады.ГруппаСкладов КАК ИС_Ozon_СкладыГруппаСкладов
	|		ПО (ИС_Ozon_Склады.Ссылка = ИС_Ozon_СкладыГруппаСкладов.Ссылка)
	|ГДЕ
	|	ИС_Ozon_Склады.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСклад.Следующий() Цикл
		
		СГТ = ВыборкаСклад.СГТ;      
		
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
			
			ПараметрСклад = Новый Массив;
			
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
			
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
				
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда		
					ПараметрСклад.Добавить(ВыборкаГруппаСкладов.СкладГруппы); 
				КонецЕсли;
				
			КонецЦикла;        
			
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			
			Заменитель = "";
			ПараметрСклад = ВыборкаСклад.ОбщаяГруппаСкладов;
			
		Иначе			
			ПараметрСклад = ВыборкаСклад.Склад;
		КонецЕсли;  
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СГТ", СГТ); 
	
	Если ЗначениеЗаполнено(Заменитель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, Заменитель, "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрСклад) Тогда	
		Текст = СтрШаблон("Не заполнено сопоставление склада %1 (%2)", Склад, Профиль);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст); 
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склад1С", ПараметрСклад);
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 04.03.24 УА #67173

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
Процедура ВыгрузитьЦены(Профиль, ТаблицаВыгрузки = Неопределено) Экспорт
	
	Событие = ПолучитьИмяСобытия("ВыгрузитьЦены");
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Озон;
	
	МассивПараметров = ПолучитьСписокПараметровЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, МассивПараметров);
	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
	
	РежимОкругленияЦен = СтруктураЦен.РежимОкругленияЦен;
	ИспользоватьПоследниеЦены = СтруктураЦен.ИспользоватьПоследниеЦены;
	//+ ИнфоСофт Стояк Ю.К. 26.11.2024 УА #87103
	АвтоприменениеАкций = ?(ЗначениеЗаполнено(СтруктураЦен.АвтоприменениеАкций), СтруктураЦен.АвтоприменениеАкций, "UNKNOWN");
	АвтоприменениеСтратегийЦены = ?(ЗначениеЗаполнено(СтруктураЦен.АвтоприменениеСтратегийЦены), СтруктураЦен.АвтоприменениеСтратегийЦены, "UNKNOWN");
	//- ИнфоСофт Стояк Ю.К. 26.11.2024 УА #87103
	
	Если ТаблицаВыгрузки = Неопределено Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = ПолучитьТекстЗапросаЦен(); 
		
		УстановитьПараметрыЗапросаЦен(Запрос, Профиль);                                                       
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		ТаблицаВыгрузки = Новый ТаблицаЗначений;	
		
		ИС_МП_УправлениеЦенами.ЗаполнитьКолонкиТаблицыВыгрузкиЦен(ПеречислениеМП, ТаблицаВыгрузки);
		
		МассивПолей = ИС_МП_УправлениеЦенами.ПолучитьПоляДляВыгрузки(ПеречислениеМП);
		
		Пока Выборка.Следующий() Цикл
		
			Если Не Выборка.ЕстьСопоставление 
				И Не Выборка.ЕстьРучнаяЦена 
				И Не Выборка.ЕстьРучнаяЦенаСоСкидкой 
				И Не Выборка.ЕстьРучнаяЦенаМинимальная Тогда
					Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
		
			Для Каждого Элемент Из МассивПолей Цикл
				НоваяСтрока[Элемент] = Выборка[Элемент];
			КонецЦикла;
			
			ЭтоНабор = Выборка.ЭтоНабор;
			
			Если Выборка.ЕстьРучнаяЦена Тогда
				Цена = Выборка.РучнаяЦена;
			Иначе  
				Цена = Выборка.Цена;	
			КонецЕсли;
			
			Цена = Окр(Цена, 0, РежимОкругленияЦен);
			
			НоваяСтрока.Цена = Цена;
			
			Если Выборка.ЕстьРучнаяЦенаСоСкидкой Тогда
				ЦенаСоСкидкой = Выборка.РучнаяЦенаСоСкидкой;
			Иначе
				ЦенаСоСкидкой = Выборка.ЦенаСоСкидкой;
			КонецЕсли;
			
			ЦенаСоСкидкой = Окр(ЦенаСоСкидкой, 0, РежимОкругленияЦен);
			
			НоваяСтрока.ЦенаСоСкидкой = ЦенаСоСкидкой;
			
			Если Выборка.ЕстьРучнаяЦенаМинимальная Тогда
				ЦенаМинимальная = Выборка.РучнаяЦенаМинимальная;
			Иначе  
				ЦенаМинимальная = Выборка.ЦенаМинимальная;
			КонецЕсли;
				
			ЦенаМинимальная = Окр(ЦенаМинимальная, 0, РежимОкругленияЦен);
			
			НоваяСтрока.ЦенаМинимальная = ЦенаМинимальная;
			
			Если НоваяСтрока.Цена = 0 И НоваяСтрока.ЦенаСоСкидкой = 0 И НоваяСтрока.ЦенаМинимальная = 0 Тогда 
				ТаблицаВыгрузки.Удалить(НоваяСтрока);
			КонецЕсли;
			
			Если Не ИспользоватьПоследниеЦены Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не Выборка.ЕстьРучнаяЦена И Не Выборка.ЕстьРучнаяЦенаСоСкидкой И Не Выборка.ЕстьРучнаяЦенаМинимальная Тогда
			
				Если Не ИС_МП_УправлениеЦенами.ПроверитьПоследниеЦены(ПеречислениеМП, Выборка, НоваяСтрока) Тогда				
					ТаблицаВыгрузки.Удалить(НоваяСтрока);
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	data = Новый Массив;
	
	//+ ИнфоСофт Заварин К.В. 25.12.24 УА #90044 
	НевыгруженныйМассив = Новый Массив;
	//- ИнфоСофт Заварин К.В. 25.12.24 УА #90044
	
	Для Каждого Строка Из ТаблицаВыгрузки Цикл
		
		//+ ИнфоСофт Заварин К.В. 25.12.24 УА #90044
		Если Строка.ЦенаМинимальная > Строка.ЦенаСоСкидкой Тогда 
			НевыгруженныйМассив.Добавить(Строка.OfferId);
			Продолжить;                              
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 25.12.24 УА #90044
		
		dataStructure = Новый Структура;
		dataStructure.Вставить("product_id", 			Строка.ProductId);
		dataStructure.Вставить("offer_id", 				Строка.OfferId);
		dataStructure.Вставить("old_price", 			Формат(Строка.Цена, "ЧРД=.; ЧН=0; ЧГ=0"));	
		dataStructure.Вставить("price", 				Формат(Строка.ЦенаСоСкидкой, "ЧРД=.; ЧН=0; ЧГ=0"));
		
		Если ЗначениеЗаполнено(Строка.ЦенаМинимальная) Тогда
			dataStructure.Вставить("min_price", 		Формат(Строка.ЦенаМинимальная, "ЧРД=.; ЧН=0; ЧГ=0"));
		КонецЕсли;
		
		//+ ИнфоСофт Стояк Ю.К. 26.11.2024 УА #87103		
		//dataStructure.Вставить("auto_action_enabled", 	"UNKNOWN");
		dataStructure.Вставить("auto_action_enabled", 		АвтоприменениеАкций);
		dataStructure.Вставить("price_strategy_enabled", 	АвтоприменениеСтратегийЦены);
		//- ИнфоСофт Стояк Ю.К. 26.11.2024 УА #87103
		
		data.Добавить(dataStructure);		

	КонецЦикла;
	
	//+ ИнфоСофт Заварин К.В. 25.12.24 УА #90044
	Если Не НевыгруженныйМассив.Количество() = 0 Тогда
		ВыходнаяСтрокаОшибки = СтрСоединить(НевыгруженныйМассив, "; ");
		Текст = "Минимальная цена должна быть меньше или равна чем цена со скидкой по артикулам: " + ВыходнаяСтрокаОшибки;			
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);	
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 25.12.24 УА #90044
	
	//	МассивЦенСОшибками = Новый Массив
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(data, 1000);
	
	БылиОшибкиВыгрузки = Ложь;
	
	Для Каждого Элемент Из РазбитыйМассив Цикл
	
		Результат = ИС_Ozon_API.ВыгрузитьЦеныOzon(Профиль, ПараметрыЗапроса, Элемент);	 
	
		Если ЗначениеЗаполнено(Результат) Тогда
			
			//Для Каждого ОтветЦенаТовара Из Результат Цикл
			//	
			//	Если Не ОтветЦенаТовара.updated Тогда
			//		
			//		Если ОтветЦенаТовара.errors.Количество() > 0 Тогда
			//			
			//			ОтветОбОшибке = Новый Структура();
			//			
			//			ОтветОбОшибке.Вставить("product_id"		, ОтветЦенаТовара.product_id);
			//			ОтветОбОшибке.Вставить("offer_id"		, ОтветЦенаТовара.offer_id);
			//			ОтветОбОшибке.Вставить("error_code"		, ОтветЦенаТовара.errors[0].code);
			//			ОтветОбОшибке.Вставить("error_message"	, ОтветЦенаТовара.errors[0].message);
			//			
			//			МассивЦенСОшибками.Добавить(ОтветОбОшибке);
			//			
			//		КонецЕсли;
			//		
			//	КонецЕсли;			
			//	
			//КонецЦикла; 
			//
			//Возврат МассивЦенСОшибками;
			
		Иначе
			БылиОшибкиВыгрузки = Истина;	
			Текст = "Не удалось обновить цены товаров";			
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецЕсли;
	
	КонецЦикла;
	
	Если Не БылиОшибкиВыгрузки И ИспользоватьПоследниеЦены Тогда 
		
		Для Каждого Строка Из ТаблицаВыгрузки Цикл	
			
			ИС_МП_УправлениеЦенами.ЗаписатьПоследнююВыгруженнуюЦену(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы.Озон, Строка.НоменклатураOzon, Строка.Цена, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦены);
			
			ИС_МП_УправлениеЦенами.ЗаписатьПоследнююВыгруженнуюЦену(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы.Озон, Строка.НоменклатураOzon, Строка.ЦенаСоСкидкой, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныСоСкидкой);                
			
			ИС_МП_УправлениеЦенами.ЗаписатьПоследнююВыгруженнуюЦену(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы.Озон, Строка.НоменклатураOzon, Строка.ЦенаМинимальная, Перечисления.ИС_МП_ВидыЦенМаркетплейса.ВидЦеныМинимальный);
			
		КонецЦикла;
		
	КонецЕсли;
						
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901
Процедура УстановитьПараметрыЗапросаЦен(Запрос, Профиль) Экспорт
	
	Событие = ПолучитьИмяСобытия("УстановитьПараметрыЗапросаЦен");
		
	МассивПараметров = ПолучитьСписокПараметровЦен();
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, МассивПараметров);
	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен();
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
		
	Запрос.УстановитьПараметр("Маркетплейс"			, Перечисления.ИС_МП_Маркетплейсы.Озон);
	Запрос.УстановитьПараметр("ВидЦены"				, СтруктураЦен.ВидЦены); 
	Запрос.УстановитьПараметр("ВидЦеныСоСкидкой"	, СтруктураЦен.ВидЦеныСоСкидкой);
	Запрос.УстановитьПараметр("ВидЦеныМинимальный"	, СтруктураЦен.ВидЦеныМинимальный);
	//+ ИнфоСофт Заварин К.В. 03.09.24 УА #72696
	Запрос.УстановитьПараметр("ВидЦеныFBO"			, Справочники.ВидыЦен.ПустаяСсылка());
	//- ИнфоСофт Заварин К.В. 03.09.24 УА #72696
	Запрос.УстановитьПараметр("Профиль"				, Профиль); 
	Запрос.УстановитьПараметр("ПустаяУпаковка"		, ИС_MP_СерверЛокализация.ПустаяСсылкаУпаковка());
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 11.05.24 УА #66901
Функция ПолучитьЦеныFBS(Профиль) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);	
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Номенклатура.Ссылка КАК Ссылка,
	|	ИС_Ozon_Номенклатура.offer_id КАК offer_id
	|ИЗ
	|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|ГДЕ
	|	ИС_Ozon_Номенклатура.Профиль = &Профиль
	|	И НЕ ИС_Ozon_Номенклатура.offer_id = """"
	|	И НЕ ИС_Ozon_Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаOfferId = РезультатЗапроса.Выбрать();
	
	МассивOfferId = Новый Массив;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НоменклатураOzon");
	Результат.Колонки.Добавить("OfferId");
	Результат.Колонки.Добавить("Цена");
	Результат.Колонки.Добавить("ЦенаСоСкидкой"); 
	Результат.Колонки.Добавить("ЦенаМинимальная"); 
	
	//+ ИнфоСофт Заварин К.В. 07.04.25 УА #89329
	Результат.Колонки.Добавить("ТоварУчаствуетВАкции");
	Результат.Колонки.Добавить("ЦенаДляПокупателя"); 
	Результат.Колонки.Добавить("ЦенаВаша");
	
	МассивЛожныхАкций = Новый Массив;
    МассивЛожныхАкций.Добавить(6);
    МассивЛожныхАкций.Добавить(330);
   	//- ИнфоСофт Заварин К.В. 07.04.25 УА #89329
	
	Пока ВыборкаOfferId.Следующий() Цикл
	
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.НоменклатураOzon = ВыборкаOfferId.Ссылка;
		НоваяСтрока.OfferId = ВыборкаOfferId.offer_id;
		
		МассивOfferId.Добавить(ВыборкаOfferId.offer_id);
	
	КонецЦикла;
	
	//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698	
	//last_id = "";                               
	cursor = "";                               
	//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
	
	//+ ИнфоСофт Заварин К.В. 07.04.25 УА #89329
	//РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивOfferId, 500);
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(МассивOfferId, 1000);
	//- ИнфоСофт Заварин К.В. 07.04.25 УА #89329
	
	Для Каждого Элемент Из РазбитыйМассив Цикл
		
		Фильтр = Новый Структура;
		Фильтр.Вставить("visibility", "ALL");
		Фильтр.Вставить("offer_id", Элемент);
		
		СтруктураТела = Новый Структура; 
		
		СтруктураТела.Вставить("filter", Фильтр);
		//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698		
		//СтруктураТела.Вставить("last_id", last_id); 
		СтруктураТела.Вставить("cursor", cursor); 
		//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
		
		СтруктураТела.Вставить("limit", 1000);
		
		ЦеныТоваров = ИС_Ozon_API.ПолучитьИнформациюОЦенах(Профиль, ПараметрыЗапроса, СтруктураТела);
		
		Если ЦеныТоваров = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		//+ ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698		
		//last_id = ЦеныТоваров.last_id;             
		cursor = ЦеныТоваров.cursor;             
		//- ИнфоСофт Стояк Ю.К. 26.01.2025 УА #91698
		
		Для Каждого Элемент Из ЦеныТоваров.items Цикл
			
			НайденныеСтроки = Результат.НайтиСтроки(Новый Структура("OfferId", Элемент.offer_id));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Цены = Элемент.price;
				
				НайденныеСтроки[0].Цена 			= Цены.old_price;
				НайденныеСтроки[0].ЦенаСоСкидкой 	= Цены.price; 
				НайденныеСтроки[0].ЦенаМинимальная 	= Цены.min_price;
				
				//+ ИнфоСофт Заварин К.В. 07.04.25 УА #89329
				НайденныеСтроки[0].ЦенаДляПокупателя 	= Цены.marketing_price; 
				НайденныеСтроки[0].ЦенаВаша 			= Цены.marketing_seller_price;
				
				Для Каждого Акция Из Элемент.marketing_actions.actions Цикл
					
					Если МассивЛожныхАкций.Найти(Акция.value) = Неопределено Тогда
						НайденныеСтроки[0].ТоварУчаствуетВАкции = Истина;		
					КонецЕсли;
					
				КонецЦикла;
				//- ИнфоСофт Заварин К.В. 07.04.25 УА #89329
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 11.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьСписокПараметровЦен() Экспорт

	Результат = Новый Массив;
	
	Результат.Добавить("ВидЦены");
	Результат.Добавить("ВидЦеныСоСкидкой");
	Результат.Добавить("ВидЦеныМинимальный");
	Результат.Добавить("РежимОкругленияЦен");
	Результат.Добавить("ИспользоватьПоследниеЦены");
	//+ ИнфоСофт Стояк Ю.К. 26.11.2024 УА #87103
	Результат.Добавить("АвтоприменениеАкций");
	Результат.Добавить("АвтоприменениеСтратегийЦены");
	//- ИнфоСофт Стояк Ю.К. 26.11.2024 УА #87103

    Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьСтруктуруПараметровЦен() Экспорт

	Результат = Новый Структура;
	
	Результат.Вставить("ВидЦены"					, Справочники.ВидыЦен.ПустаяСсылка());
	Результат.Вставить("ВидЦеныСоСкидкой"			, Справочники.ВидыЦен.ПустаяСсылка()); 
	Результат.Вставить("ВидЦеныМинимальный"			, Справочники.ВидыЦен.ПустаяСсылка());
	Результат.Вставить("РежимОкругленияЦен"			, 0);
	Результат.Вставить("ИспользоватьПоследниеЦены"	, Ложь);
	//+ ИнфоСофт Стояк Ю.К. 26.11.2024 УА #87103
	Результат.Вставить("АвтоприменениеАкций"		, "UNKNOWN");
	Результат.Вставить("АвтоприменениеСтратегийЦены", "UNKNOWN");
	//- ИнфоСофт Стояк Ю.К. 26.11.2024 УА #87103

    Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

//+ ИнфоСофт Заварин К.В. 10.07.24 УА #70305
Функция ПолучитьИнформациюПоОтчётПоОстаткамИТоварам(Профиль) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	СтруктураТела = Новый Структура; 
	Фильтр = Новый Структура;  	
	СтруктураТела.Вставить("limit", 1000);
	СтруктураТела.Вставить("offset", 0);
	СтруктураТела.Вставить("warehouse_type", "ALL"); 
	
	КвалификаторыЧисла  = Новый КвалификаторыЧисла(50, 2, ДопустимыйЗнак.Неотрицательный);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(80);
	
	ТаблицаОстатковFBO = Новый ТаблицаЗначений;
	ТаблицаОстатковFBO.Колонки.Добавить("nmId", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));  
	ТаблицаОстатковFBO.Колонки.Добавить("Склад", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	ТаблицаОстатковFBO.Колонки.Добавить("НаСкладе", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
		
	Пока Истина Цикл
		
		Результат = ИС_Ozon_API.ПолучитьОтчётПоОстаткамИТоварам(Профиль, ПараметрыЗапроса, СтруктураТела);
		
		Если Результат = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если Результат.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Для Каждого Остаток Из Результат Цикл
			
			НСтр          = ТаблицаОстатковFBO.Добавить();
			НСтр.nmId     = Остаток.item_code;     													
			НСтр.Склад    = Остаток.warehouse_name;
			НСтр.НаСкладе = Остаток.free_to_sell_amount + Остаток.reserved_amount;
			
		КонецЦикла; 
		
		СтруктураТела.offset = СтруктураТела.offset + СтруктураТела.limit;
		
	КонецЦикла;
	
	Возврат ТаблицаОстатковFBO;
	
КонецФункции //- ИнфоСофт Заварин К.В. 10.07.24 УА #70305

//+ ИнфоСофт Стояк Ю.К. 07.11.2024 УА #72455
Функция ПолучитьОстаткиПоСкладамFBO(Профиль) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
		
	ТаблицаОстатков = Новый ТаблицаЗначений;  
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(20, 2, ДопустимыйЗнак.Неотрицательный);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(80);
	
	ТаблицаОстатков.Колонки.Добавить("sku", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	ТаблицаОстатков.Колонки.Добавить("warehouse_name", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	ТаблицаОстатков.Колонки.Добавить("free_to_sell_amount", Новый ОписаниеТипов("Число", КвалификаторыЧисла));	
	ТаблицаОстатков.Колонки.Добавить("promised_amount", Новый ОписаниеТипов("Число", КвалификаторыЧисла));	
	ТаблицаОстатков.Колонки.Добавить("reserved_amount", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	
	Лимит = 500;
	Смещение = 0;    
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("limit", Лимит);
	ТелоЗапроса.Вставить("offset", Смещение);
		
	Пока Истина Цикл	
		
		Результат = ИС_Ozon_API.ПолучитьОстаткиFBO(Профиль, ПараметрыЗапроса, ТелоЗапроса);
		
		Если Результат = Неопределено Или Результат.rows.Количество() = 0 Тогда	
			Прервать;	
		КонецЕсли;
		
		Для Каждого Элемент Из Результат.rows Цикл
			
			Если Не Элемент.Свойство("warehouse_name") Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаОстатков.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент); 
			
		КонецЦикла;
		
		ТелоЗапроса.offset = ТелоЗапроса.offset + Лимит;
		
	КонецЦикла; 
		
	Возврат ТаблицаОстатков;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 07.11.2024 УА #72455

#КонецОбласти

#Область Заказы

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Процедура ПолучитьЗаказы(Профиль, ДатаПоследнегоОтправления, ОбработатьТолькоСтатусы = Ложь) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	МассивЗагруженныхЗаданий = Новый Массив;     
	
	//+ ИнфоСофт Мурсалимов Д.Р. 07.12.23 УА #67276
	offset = 0;
	//- ИнфоСофт Мурсалимов Д.Р. 07.12.23 УА #67276
	
	Пока Истина Цикл
		
		Тело = Новый Структура;
		Тело.Вставить("dir", "asc");
		
		Фильтр = Новый Структура; 
		Фильтр.Вставить("since", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ДатаПоследнегоОтправления, ФорматДатыJSON.ISO
		, ВариантЗаписиДатыJSON.УниверсальнаяДата));
		Фильтр.Вставить("to", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO
		, ВариантЗаписиДатыJSON.УниверсальнаяДата));  
		
		Тело.Вставить("filter", Фильтр);
		Тело.Вставить("limit", 1000);
		//+ ИнфоСофт Мурсалимов Д.Р. 07.12.23 УА #67276
		Тело.Вставить("offset", offset); 
		//- ИнфоСофт Мурсалимов Д.Р. 07.12.23 УА #67276
		
		Дополнительно = Новый Структура;
		Дополнительно.Вставить("analytics_data", Истина);
		Дополнительно.Вставить("barcodes", Истина);
		Дополнительно.Вставить("financial_data", Истина);  
		
		Тело.Вставить("with", Дополнительно);
		
		ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Тело);
		
		Результат = ИС_Ozon_API.ПолучитьСписокОтправлений(Профиль, ПараметрыЗапроса);
		
		Если ЗначениеЗаполнено(Результат) Тогда
			
			Для Каждого Элемент Из Результат.postings Цикл 		
				//+ ИнфоСофт Стояк Ю.К. 28.04.2023 УА #58008				
				//+ ИнфоСофт Мурсалимов Д.Р. 07.12.23 УА #67276
				//Если Не ОбработатьТолькоСтатусы Тогда
				
				СсылкаЗадания = СоздатьИлиОбновитьОтправление(Профиль, Элемент, ДатаПоследнегоОтправления);				 
				
				Если Не СсылкаЗадания.Пустая() Тогда
					
					МассивЗагруженныхЗаданий.Добавить(СсылкаЗадания); 
					
					//Статусы = Новый Структура;
					//Статусы.Вставить("posting_number", Элемент.posting_number);
					//Статусы.Вставить("status", Перечисления.ИС_Ozon_СтатусыОтправлений[Элемент.status]);
					Статус = ПолучитьСтатусСборочногоЗадания(Элемент.status);
					
					//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
					ДетальныйСтатус = ПолучитьДетальныйСтатусСборочногоЗадания(Элемент.status, Элемент.substatus);
					//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
					
					//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801					
					ДатаОтгрузки = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Элемент.shipment_date, ФорматДатыJSON.ISO);
					
					//+ ИнфоСофт Власова И.С. 13.02.25 УА #83194
					//ОбновитьСтатусыЗаказов(Профиль, СсылкаЗадания, Статус, ДатаОтгрузки);
					ДатаОтгрузкиРекомендуемая = ДатаОтгрузки;
					
					Если Не Элемент.Свойство("tariffication") = Неопределено Тогда 
						
						ТарификацияЗаказа = Элемент["tariffication"];
						
						Если Не ТарификацияЗаказа.Свойство("next_tariff_starts_at") = Неопределено
							И Не ТарификацияЗаказа["next_tariff_starts_at"] = Неопределено Тогда
							
							ДатаСледующегоТарифа = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(ТарификацияЗаказа["next_tariff_starts_at"], ФорматДатыJSON.ISO) - 1;
							
							ТекущаяДата = ТекущаяДатаСеанса();
							
							Если ДатаОтгрузки < ТекущаяДата 
								И ДатаОтгрузки <> ДатаСледующегоТарифа Тогда
								
								ДатаОтгрузки = ДатаСледующегоТарифа;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
					//ОбновитьСтатусыЗаказов(Профиль, СсылкаЗадания, Статус, ДатаОтгрузки, ДатаОтгрузкиРекомендуемая);
					ОбновитьСтатусыЗаказов(Профиль, СсылкаЗадания, Статус, ДатаОтгрузки, ДатаОтгрузкиРекомендуемая, ДетальныйСтатус, Элемент.cancellation.cancelled_after_ship);
					//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
					//- ИнфоСофт Власова И.С. 13.02.25 УА #83194
					
					//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
					
				КонецЕсли; 
					
				//Иначе
				//	
				//	Статусы = Новый Структура;
				//	Статусы.Вставить("posting_number", Элемент.posting_number);
				//	Статусы.Вставить("status", Перечисления.ИС_Ozon_СтатусыОтправлений[Элемент.status]);
				//	ОбновитьСтатусыЗаказов(Профиль, Элемент.posting_number, Статусы); 
				//	
				//КонецЕсли;
				//- ИнфоСофт Мурсалимов Д.Р. 07.12.23 УА #67276
				//- ИнфоСофт Стояк Ю.К. 28.04.2023 УА #58008
			КонецЦикла;
			
		Иначе
			Прервать;			
		КонецЕсли;
		
		Если Результат.has_next = Ложь Тогда
			Прервать;
		КонецЕсли;
		
		//+ ИнфоСофт Мурсалимов Д.Р. 07.12.23 УА #67276
		offset = Результат.postings.Количество();
		//- ИнфоСофт Мурсалимов Д.Р. 07.12.23 УА #67276
		
	КонецЦикла;
	
	Если МассивЗагруженныхЗаданий.Количество() > 0 Тогда
		ПроверитьФункциональныеОпцииСборочныхЗаданий(Профиль, МассивЗагруженныхЗаданий);	
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Функция СоздатьИлиОбновитьОтправление(Профиль, Данные, ДатаПоследнегоОтправления)

    Событие = "СоздатьИлиОбновитьОтправление";
	
	Заказ = Документы.ИС_Ozon_Заказ.НайтиПоНомеру(Данные.posting_number);
	
	Если Заказ.Пустая() Тогда
		Заказ = Документы.ИС_Ozon_Заказ.СоздатьДокумент();
	Иначе
		Заказ = Заказ.ПолучитьОбъект();
	КонецЕсли;		
	
	Заказ.Профиль = Профиль;
	
	ЗаполнитьЗначенияСвойств(Заказ, Данные);
	
	//+ ИнфоСофт Стояк Ю.К. 26.07.2023 УА #60348	
	Заказ.Номер = Данные.posting_number;
	Заказ.order_id = Данные.order_id;           
	//- ИнфоСофт Стояк Ю.К. 26.07.2023 УА #60348
		
	Заказ.Дата = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные.in_process_at, ФорматДатыJSON.ISO);			
	
	Заказ.Склад = Справочники.ИС_Ozon_Склады.НайтиПоРеквизиту("id", Данные.delivery_method.warehouse_id);	
	Заказ.tpl_provider = Данные.delivery_method.tpl_provider;
	Заказ.delivering_date = Данные.delivering_date;
	Заказ.shipment_date = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные.shipment_date, ФорматДатыJSON.ISO);
	Заказ.delivery_method_id = Данные.delivery_method.id;
	
	//+ ИнфоСофт Заварин К.В. 18.10.24 УА #74582
	Заказ.is_express = Данные.is_express;
	//- ИнфоСофт Заварин К.В. 18.10.24 УА #74582
	
	Если Данные.barcodes <> Неопределено Тогда
		Заказ.lower_barcode = Данные.barcodes.lower_barcode;
		Заказ.upper_barcode = Данные.barcodes.upper_barcode;
	КонецЕсли;
	
	Заказ.is_multibox = Данные.is_multibox; 
	Заказ.multi_box_qty = Данные.multi_box_qty; 
	Заказ.order_number = Данные.order_number; 
	
	Если Данные.customer <> Неопределено Тогда 
		
		//+ ИнфоСофт Власова И.С. 04.02.25 УА #92800
		//Если Данные.customer.Свойство("address") Тогда
			//address = Данные.customer.address.address_tail;
			//Заказ.address_tail = Данные.customer.address.address_tail;
		//КонецЕсли;
		
		Если Данные.customer.Свойство("address") И Данные.customer.address <> Неопределено Тогда
		
			customer_address = Данные.customer.address;
			
			Если customer_address.Свойство("address_tail") Тогда
				
				address = customer_address.address_tail;
				Заказ.address_tail = address;
				
			КонецЕсли;	
				
		КонецЕсли;
		//- ИнфоСофт Власова И.С. 04.02.25 УА #92800
		
		Если Данные.customer.Свойство("customer_email") Тогда
			Заказ.customer_email = Данные.customer.customer_email; 
		КонецЕсли;                                         
		
		Если Данные.customer.Свойство("name") Тогда
			name = Данные.customer.name;	
			Заказ.name = Данные.customer.name; 
		КонецЕсли;
	    
	    Если ЗначениеЗаполнено(address) Или ЗначениеЗаполнено(name) Тогда
	        
			НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
			ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	        
	        ДанныеОбОтпралвении = ИС_Ozon_API.ПолучитьИнформциюПоОтправлению(Профиль, ПараметрыЗапроса, Данные.posting_number);
	        
	        Если ДанныеОбОтпралвении <> Неопределено Тогда
                
                ДанныеОПокупателе = ДанныеОбОтпралвении["result"]["customer"];
                
                Если ДанныеОПокупателе <> Неопределено Тогда
					Заказ.phone = ДанныеОПокупателе["phone"]; 
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли; 
		                                         
	КонецЕсли;
	
	Заказ.products.Очистить();
	Требования = Данные.requirements;
	
	Если Данные.financial_data <> Неопределено Тогда
		
		Для Каждого Элемент Из Данные.products Цикл	
			
			НоваяСтрока = Заказ.products.Добавить();
			
			//+ ИнфоСофт Мурсалимов Д.Р. 20.03.24 УА #72613
			Запрос = Новый Запрос;
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИС_Ozon_Номенклатура.Ссылка КАК НоменклатураOzon,
			|	МАКСИМУМ(ИС_Ozon_Штрихкоды.Ссылка) КАК ХарактеристикаOzon
			|ИЗ
			|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Штрихкоды КАК ИС_Ozon_Штрихкоды
			|		ПО ИС_Ozon_Номенклатура.Профиль = ИС_Ozon_Штрихкоды.ЛичныйКабинет
			|			И ИС_Ozon_Номенклатура.Ссылка = ИС_Ozon_Штрихкоды.Карточка
			|ГДЕ
			|	ИС_Ozon_Номенклатура.offer_id = &offer_id
			|	И ИС_Ozon_Номенклатура.Профиль = &Профиль
			|
			|СГРУППИРОВАТЬ ПО
			|	ИС_Ozon_Номенклатура.Ссылка";
			
			Запрос.УстановитьПараметр("offer_id", Элемент.offer_id);
			Запрос.УстановитьПараметр("Профиль", Профиль);
			
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаНоменклатуры = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаНоменклатуры.Следующий() Цикл
				
				НоваяСтрока.НоменклатураOzon = ВыборкаНоменклатуры.НоменклатураOzon;	
				НоваяСтрока.ХарактеристикаOzon = ВыборкаНоменклатуры.ХарактеристикаOzon; 
			
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(НоваяСтрока.НоменклатураOzon) Тогда
				
				НоваяСтрока.НоменклатураOzon = Справочники.ИС_Ozon_Номенклатура.НайтиПоРеквизиту("offer_id", Элемент.offer_id);	
				НоваяСтрока.ХарактеристикаOzon = Справочники.ИС_Ozon_Штрихкоды.НайтиПоНаименованию(НоваяСтрока.НоменклатураOzon.Штрихкод, Истина);
				
			КонецЕсли;
			
			//НоваяСтрока.НоменклатураOzon = Справочники.ИС_Ozon_Номенклатура.НайтиПоРеквизиту("offer_id", Элемент.offer_id);	
			//НоваяСтрока.ХарактеристикаOzon = Справочники.ИС_Ozon_Штрихкоды.НайтиПоНаименованию(НоваяСтрока.НоменклатураOzon.Штрихкод, Истина);		
			//- ИнфоСофт Мурсалимов Д.Р. 20.03.24 УА #72613	
			
			НоваяСтрока.price = Число(Элемент.price);	
			НоваяСтрока.Сумма = Число(Элемент.price) * Элемент.quantity;	
			НоваяСтрока.quantity = Элемент.quantity;
			
			Индекс = Требования.products_requiring_gtd.Найти(Строка(Элемент.offer_id));
			Если ЗначениеЗаполнено(Индекс) Тогда
				НоваяСтрока.requiring_gtd = Истина;			
			КонецЕсли; 
			
			Индекс = Требования.products_requiring_country.Найти(Строка(Элемент.offer_id));
			Если ЗначениеЗаполнено(Индекс) Тогда
				НоваяСтрока.requiring_country = Истина;			
			КонецЕсли; 
			
            Индекс = Требования.products_requiring_mandatory_mark.Найти(Строка(Элемент.offer_id));
			Если ЗначениеЗаполнено(Индекс) Тогда
				НоваяСтрока.requiring_mandatory_mark = Истина;			
			КонецЕсли; 
			
            Индекс = Требования.products_requiring_rnpt.Найти(Строка(Элемент.offer_id));
			Если ЗначениеЗаполнено(Индекс) Тогда
				НоваяСтрока.requiring_rnpt = Истина;			
			КонецЕсли;
			
			//НоваяСтрока.НоменклатураOzon = Справочники.ИС_Ozon_Номенклатура.НайтиПоРеквизиту("sku", Элемент.sku);	
			//НоваяСтрока.ХарактеристикаOzon = Справочники.ИС_Ozon_Штрихкоды.НайтиПоНаименованию(НоваяСтрока.НоменклатураOzon.Штрихкод, Истина);	
			//
			//НоваяСтрока.price = Число(Элемент.price);	
			//НоваяСтрока.Сумма = Число(Элемент.price) * Элемент.quantity;	
			//НоваяСтрока.quantity = Элемент.quantity;
			//
			//Индекс = Требования.products_requiring_gtd.Найти(Строка(Элемент.sku));
			//Если ЗначениеЗаполнено(Индекс) Тогда
			//	НоваяСтрока.requiring_gtd = Истина;			
			//КонецЕсли; 
			//
			//Индекс = Требования.products_requiring_country.Найти(Строка(Элемент.sku));
			//Если ЗначениеЗаполнено(Индекс) Тогда
			//	НоваяСтрока.requiring_country = Истина;			
			//КонецЕсли; 
			//
			//Индекс = Требования.products_requiring_mandatory_mark.Найти(Строка(Элемент.sku));
			//Если ЗначениеЗаполнено(Индекс) Тогда
			//	НоваяСтрока.requiring_mandatory_mark = Истина;			
			//КонецЕсли; 
			//
			//Индекс = Требования.products_requiring_rnpt.Найти(Строка(Элемент.sku));
			//Если ЗначениеЗаполнено(Индекс) Тогда
			//	НоваяСтрока.requiring_rnpt = Истина;			
			//КонецЕсли; 
			//- ИнфоСофт Мурсалимов Д.Р. 04.02.24 УА #70041
	
		КонецЦикла;
	
	КонецЕсли;
	
	Попытка	      
		
		Заказ.Записать(РежимЗаписиДокумента.Запись);
		ДатаПоследнегоОтправления = Заказ.Дата;
		
		Возврат Заказ.Ссылка;		
	
	Исключение
		ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Текст = СтрШаблон("Произошла ошибка при записи элемента Заказ Ozon: %1",	ИнформацияОбОшибке);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	КонецПопытки;
	
	Возврат Документы.ИС_Ozon_Заказ.ПустаяСсылка();

КонецФункции //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628 

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Процедура СоздатьЗаказы(Профиль, МассивЗаданий) Экспорт  
	
	Событие = "СоздатьЗаказыOzon";
    
	Запрос = Новый Запрос;
	Запрос.Текст =
	//+ ИнфоСофт Мурсалимов Д.Р. 11.12.23 УА #67325
	"ВЫБРАТЬ
	|	ИС_Ozon_Заказ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|		ПО (ИС_Ozon_СтатусыСборочныхЗаданий.Заказ = ИС_Ozon_Заказ.Ссылка
	|			И ИС_Ozon_СтатусыСборочныхЗаданий.Профиль = &Профиль)
	|ГДЕ
	|	ИС_Ozon_Заказ.Ссылка В(&МассивСсылок)
	|	И ИС_Ozon_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status <> ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_СтатусыОтправлений.cancelled)
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status <> ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_СтатусыОтправлений.cancelled_from_split_pending)";	
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	//- ИнфоСофт Мурсалимов Д.Р. 06.12.23 УА #67325
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивКСозданию = Новый Массив();
	Пока Выборка.Следующий() Цикл
		МассивКСозданию.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если МассивКСозданию.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
    	
	Если ФукнциональныеОпции.РежимСозданияЗаказовOzon = 0 Тогда // Один к одному
	
		Для Каждого СборочноеЗадание Из МассивКСозданию Цикл
			
			Заказ = СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции);
			
			Если Не Заказ.Пустая() Тогда
			
				ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
				ДокОбъект.Заказ = Заказ;
				
				Попытка
					ДокОбъект.Записать();
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;
			
			КонецЕсли; 	
			
		КонецЦикла;
		
	ИначеЕсли ФукнциональныеОпции.РежимСозданияЗаказовOzon = 1 Тогда // Пакетный режим
		
		//+ ИнфоСофт Заварин К.В. 02.08.24 УА #80812 
		
		МассивСтатусов = Новый Массив;
		МассивСтатусов.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.cancelled);
		МассивСтатусов.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.cancelled_from_split_pending);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_Заказ.Ссылка КАК Ссылка,
		|	ИС_Ozon_Заказ.Склад КАК Склад
		|ИЗ
		|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
		|		ПО (ИС_Ozon_СтатусыСборочныхЗаданий.Заказ = ИС_Ozon_Заказ.Ссылка
		|			И ИС_Ozon_СтатусыСборочныхЗаданий.Профиль = &Профиль)
		|ГДЕ
		|	ИС_Ozon_Заказ.Ссылка В(&МассивСсылок)
		|	И ИС_Ozon_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И НЕ ИС_Ozon_СтатусыСборочныхЗаданий.status В(&МассивСтатусов) 
		|ИТОГИ ПО
		|	Склад";
		Запрос.УстановитьПараметр("МассивСсылок", МассивКСозданию);
		Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);

		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
				
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();
			Заказ = Неопределено;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Заказ = СоздатьИлиДополнитьЗаказУТ11_5(ВыборкаДетальныеЗаписи.Ссылка, ФукнциональныеОпции, Заказ);
				
				Если Не Заказ.Пустая() И Заказ <> Неопределено Тогда	
					ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
					ДокОбъект.Заказ = Заказ;
					
					Попытка	
						ДокОбъект.Записать();
						
					Исключение
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
					КонецПопытки; 
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;
		
		//Заказ = СоздатьИлиДополнитьЗаказУТ11_5(МассивКСозданию[0], ФукнциональныеОпции);
		//	
		//Если Не Заказ.Пустая() Тогда
		//
		//	ДокОбъект = МассивКСозданию[0].ПолучитьОбъект();
		//	ДокОбъект.Заказ = Заказ;
		//	
		//	Попытка
		//		ДокОбъект.Записать();
		//	Исключение
		//		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//	КонецПопытки;
		//
		//КонецЕсли;
		//		
		//МассивКСозданию.Удалить(0);
		//
		//Для Каждого СборочноеЗадание Из МассивКСозданию Цикл
		//	
		//	Заказ = СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, Заказ);
		//	
		//	Если Не Заказ.Пустая() Тогда
		//	
		//		ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
		//		ДокОбъект.Заказ = Заказ;
		//		
		//		Попытка
		//			ДокОбъект.Записать();
		//		Исключение
		//			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//		КонецПопытки;
		//	
		//	КонецЕсли; 	
		//	
		//КонецЦикла; 
		
		//- ИнфоСофт Заварин К.В. 02.08.24 УА #80812 
		
	ИначеЕсли ФукнциональныеОпции.РежимСозданияЗаказовOzon = 2 Тогда // Формирование в течение дня 
		
		//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		//+ ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146                  
		Если ФукнциональныеОпции.ФормироватьЕдиныйЗаказБезРазбиенияOzon
			И НЕ ФукнциональныеОпции.ИспользоватьРазбиениеПоСкладамOzon Тогда // без разбиения, создается только 1 заказ 
			
			Если ФукнциональныеОпции.АктивныйЗаказКлиентаOzon.Пустая() Тогда
				
				Заказ = СоздатьИлиДополнитьЗаказУТ11_5(МассивКСозданию[0], ФукнциональныеОпции);
				
				Если Не Заказ.Пустая() Тогда
					
					ДокОбъект = МассивКСозданию[0].ПолучитьОбъект();
					ДокОбъект.Заказ = Заказ;
					
					Попытка
						ДокОбъект.Записать();
					Исключение
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
					КонецПопытки;
					
				КонецЕсли;
				
				СоответствиеПараметровЗаписи = Новый Соответствие;
				СоответствиеПараметровЗаписи.Вставить("АктивныйЗаказКлиентаOzon", Заказ.Ссылка);
				ИС_MP_Сервер.ЗаписатьНастройкиСправочника(Профиль.Ссылка, СоответствиеПараметровЗаписи);
				
				МассивКСозданию.Удалить(0);
				
			Иначе
				Заказ = ФукнциональныеОпции.АктивныйЗаказКлиентаOzon;
			КонецЕсли;
			
			Для Каждого СборочноеЗадание Из МассивКСозданию Цикл
				
				СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, Заказ);
				
				ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
				ДокОбъект.Заказ = Заказ;
				
				Попытка
					ДокОбъект.Записать();
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;	
			КонецЦикла;
			
			Возврат;
			
		КонецЕсли;
		//- ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
		//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
		//+ ИнфоСофт Сумин Д.В. 30.05.2023 УА #59231
		Для Каждого СборочноеЗадание Из МассивКСозданию Цикл 
			
			ДобавитьЗапись = Ложь;
			
			//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
			АктивныйЗаказ = ПолучитьАктивныйЗаказКлиентаОзон(СборочноеЗадание,
				НЕ ФукнциональныеОпции.ФормироватьЕдиныйЗаказБезРазбиенияOzon, ФукнциональныеОпции.ИспользоватьРазбиениеПоСкладамOzon);
			//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
			
			Если АктивныйЗаказ = Неопределено Тогда
				ДобавитьЗапись = Истина;	
			КонецЕсли;	
			
			Заказ = СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, АктивныйЗаказ); 
			
			Если Заказ = Документы.ЗаказКлиента.ПустаяСсылка() Тогда
				Текст = "Отсутствует сопоставление по заказу Озон. Номер: " + СокрЛП(СборочноеЗадание.Номер); 
				ОбщегоНазначения.СообщитьПользователю(Текст);
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				Продолжить;	
			КонецЕсли;	
			
			Если ДобавитьЗапись Тогда
				ДобавитьЗаписьВРегистрЗаказовОзон(Заказ, СборочноеЗадание);	
			КонецЕсли;	
			
			ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
			ДокОбъект.Заказ = Заказ;
			
			Попытка
				ДокОбъект.Записать();
			Исключение
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			КонецПопытки;	
		КонецЦикла;
		
		//Если ФукнциональныеОпции.АктивныйЗаказКлиентаOzon.Пустая() Тогда
		//	
		//	Заказ = СоздатьИлиДополнитьЗаказУТ11_5(МассивКСозданию[0], ФукнциональныеОпции);
		//	
		//	Если Не Заказ.Пустая() Тогда
		//	
		//		ДокОбъект = МассивКСозданию[0].ПолучитьОбъект();
		//		ДокОбъект.Заказ = Заказ;
		//		
		//		Попытка
		//			ДокОбъект.Записать();
		//		Исключение
		//			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//		КонецПопытки;
		//	
		//	КонецЕсли;
		//	
		//	ПрофильОбъект = Профиль.ПолучитьОбъект;
		//	ПрофильОбъект.АктивныйЗаказКлиента = Заказ;
		//	
		//	Попытка
		//		ПрофильОбъект.Записать();
		//	Исключение
		//		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//	КонецПопытки;
		//	
		//	МассивКСозданию.Удалить(0);
		//	 
		//Иначе
		//	Заказ = ФукнциональныеОпции.АктивныйЗаказКлиентаOzon;
		//КонецЕсли;
		//
		//Для Каждого СборочноеЗадание Из МассивКСозданию Цикл
		//	
		//	СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, Заказ);
		//	
		//	ДокОбъект = СборочноеЗадание.ПолучитьОбъект();
		//	ДокОбъект.Заказ = Заказ;
		//	
		//	Попытка
		//		ДокОбъект.Записать();
		//	Исключение
		//		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		//	КонецПопытки;	
		//КонецЦикла;
        //- ИнфоСофт Сумин Д.В. 30.05.2023 УА #59231
	Иначе
		ВызватьИсключение("Неизвестный режим формирования заказов");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
Процедура СоздатьРеализации(Профиль, МассивЗаданий) Экспорт
    
	Событие = "СоздатьРеализацииOzon";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//+ ИнфоСофт Сумин Д.В. 30.10.2023 УА #65227
	"ВЫБРАТЬ
	|	ИС_Ozon_Заказ.Заказ КАК Заказ,          
	//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
	|	МАКСИМУМ(ИС_Ozon_Заказ.Склад.АвтоматическиСоздаватьОрдерНаОтгрузку) КАК АвтоматическиСоздаватьОрдерНаОтгрузку,
	//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
	|	МАКСИМУМ(ИС_Ozon_Заказ.Склад.СтатусСтрокиРасходногоОрдера) КАК СтатусСтрокиРасходногоОрдера,
	//+ ИнфоСофт Ивонин К.А. 01.07.24 УА #76413
	|	МАКСИМУМ(ИС_Ozon_Заказ.Склад.СтатусРасходногоОрдера) КАК СтатусРасходногоОрдера,
	//- ИнфоСофт Ивонин К.А. 01.07.24 УА #76413
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	МАКСИМУМ(ИС_Ozon_Заказ.Склад) КАК Склад,
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801	
	|	МАКСИМУМ(ИС_Ozon_СтатусыСборочныхЗаданий.shipment_date) КАК shipment_date
	//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|		ПО ИС_Ozon_СтатусыСборочныхЗаданий.Заказ = ИС_Ozon_Заказ.Ссылка
	//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
	|ГДЕ
	|	ИС_Ozon_Заказ.Ссылка В(&МассивСсылок)
	|	И НЕ ИС_Ozon_Заказ.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_Ozon_Заказ.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	СУММА(ВЫБОР
	|			КОГДА РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоРТУ,
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	ВТ_Заказы.Склад КАК Склад, 
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	МАКСИМУМ(ВТ_Заказы.shipment_date) КАК shipment_date
	|ПОМЕСТИТЬ ВТ_РТУ
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (РеализацияТоваровУслуг.ЗаказКлиента = ВТ_Заказы.Заказ.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказы.Заказ,
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732 
	|	ВТ_Заказы.Склад
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ,
	|	СУММА(ВЫБОР
	|			КОГДА ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ),
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	ВТ_Заказы.Склад,     
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	МАКСИМУМ(ВТ_Заказы.shipment_date)
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО (ВТ_Заказы.Заказ = ПередачаТоваровХранителю.ЗаказКлиента)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказы.Заказ,
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	ВТ_Заказы.Склад     
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РТУ.Заказ КАК Заказ,
	|	СУММА(ВТ_РТУ.КоличествоРТУ) КАК КоличествоРТУ,
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	ВТ_РТУ.Склад КАК Склад,     
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	МАКСИМУМ(ВТ_РТУ.shipment_date) КАК shipment_date
	|ПОМЕСТИТЬ ВТ_РТУ_Группировка
	|ИЗ
	|	ВТ_РТУ КАК ВТ_РТУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РТУ.Заказ,
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	ВТ_РТУ.Склад     
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//+ ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981	
	//|	ВТ_Заказы.Заказ КАК Заказ,              
	|	ВТ_Заказы.Заказ КАК ЗаказКлиента,              
	//- ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981
	//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
	|	ВТ_Заказы.АвтоматическиСоздаватьОрдерНаОтгрузку КАК АвтоматическиСоздаватьОрдерНаОтгрузку,
	//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
	|	ВТ_Заказы.СтатусСтрокиРасходногоОрдера КАК СтатусСтрокиРасходногоОрдера,
	//+ ИнфоСофт Ивонин К.А. 01.07.24 УА #76413
	|	ВТ_Заказы.СтатусРасходногоОрдера КАК СтатусРасходногоОрдера,
	//- ИнфоСофт Ивонин К.А. 01.07.24 УА #76413
	|	ВТ_Заказы.Заказ.Дата КАК Дата,
	|	ВТ_Заказы.Заказ.Комментарий КАК Комментарий,
	|	ВТ_РТУ_Группировка.КоличествоРТУ КАК КоличествоРТУ,
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|	ВТ_Заказы.Склад КАК СкладОзон,
	|	ВТ_Заказы.Заказ.Склад КАК Склад,
    //- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	//+ ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981	
	//|	ВТ_Заказы.shipment_date КАК shipment_date
	|	ВТ_Заказы.shipment_date КАК ДатаОтгрузки
	//- ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ_Группировка КАК ВТ_РТУ_Группировка
	|		ПО (ВТ_Заказы.Заказ = ВТ_РТУ_Группировка.Заказ)
	|ГДЕ
	|	ВТ_РТУ_Группировка.КоличествоРТУ = 0
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	|ИТОГИ
	|	МАКСИМУМ(СкладОзон)
	|ПО
	|	Склад";
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	//- ИнфоСофт Сумин Д.В. 30.10.2023 УА #65227
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивЗаданий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
		
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	Комиссия25 = ФукнциональныеОпции.ДоговорOzon.КомиссионныеПродажи25;
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
    
	//+ ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
	ПорядокОформленияНакладныхРасходныхОрдеров = Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить();
	//- ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
	
	//+ ИнфоСофт Заварин К.В. 20.03.25 УА #96732
	Если ФукнциональныеОпции.OzonРежимСозданияРеализаций = 1 Тогда // Пакетный режим
		
		ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСклад.Следующий() Цикл
		    
		    Выборка = ВыборкаСклад.Выбрать();
			
			МассивДляЗаполнения = Новый Массив;
			
			Пока Выборка.Следующий() Цикл		
				МассивДляЗаполнения.Добавить(Выборка.ЗаказКлиента);			
			КонецЦикла;
			
			Если ПорядокОформленияНакладныхРасходныхОрдеров 
				= Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные Тогда
				
				Выборка.Сбросить();
				Выборка.Следующий();
				
				СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25, МассивДляЗаполнения);
				
				Выборка.Сбросить();
				
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.ЗаказКлиента.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
						ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.ЗаказКлиента
																	, Выборка.СтатусРасходногоОрдера
																	, Выборка.СтатусСтрокиРасходногоОрдера);	
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				Выборка.Сбросить();
				
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.ЗаказКлиента.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
						ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.ЗаказКлиента
																	, Выборка.СтатусРасходногоОрдера
																	, Выборка.СтатусСтрокиРасходногоОрдера);	
					КонецЕсли;
					
				КонецЦикла;
				
				Выборка.Сбросить();
				Выборка.Следующий();
				
				СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25, МассивДляЗаполнения);
							
			КонецЕсли;
					
		КонецЦикла;
		
		Возврат; 
		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 20.03.25 УА #96732
	
    Пока Выборка.Следующий() Цикл
		
		//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
		Если Выборка.ЗаказКлиента = Null Тогда
			Продолжить;
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
		
		//+ ИнфоСофт Мурсалимов Д.Р. 10.06.24 УА #77595
		Если ПорядокОформленияНакладныхРасходныхОрдеров 
			= Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные Тогда
			
			СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25);
			
			//+ ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981			
			//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872                                                                         		
			//Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.Заказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
			//	ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
			//												, Выборка.СтатусРасходногоОрдера
			//												, Выборка.СтатусСтрокиРасходногоОрдера);	                            
			Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.ЗаказКлиента.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
				ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.ЗаказКлиента
															, Выборка.СтатусРасходногоОрдера
															, Выборка.СтатусСтрокиРасходногоОрдера);	                            
			//- ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981	
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872
					
		Иначе
			
			//+ ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981			
			//+ ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872                                                                         		
			//Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.Заказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
			//	ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.Заказ
			//												, Выборка.СтатусРасходногоОрдера
			//												, Выборка.СтатусСтрокиРасходногоОрдера);	                            
			Если Выборка.АвтоматическиСоздаватьОрдерНаОтгрузку И Выборка.ЗаказКлиента.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда		
				ИС_MP_РаботаСЗаказами.СоздатьРасходныйОрдер(  Выборка.ЗаказКлиента
															, Выборка.СтатусРасходногоОрдера
															, Выборка.СтатусСтрокиРасходногоОрдера);	                            
			//- ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981	
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 19.06.24 УА #77872		
			
			СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25);
			
		КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 10.06.24 УА #77595			
			
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Мурсалимов Д.Р. 06.12.23 УА #67276
Процедура ОбновитьСтатусыСборочныхЗаданий(Профиль, _7Дней = 604800) Экспорт
	
	Событие = "ОбновитьСтатусыСборочныхЗаданийOzon";
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Заказ.Ссылка КАК Ссылка,
	|	ИС_Ozon_Заказ.Номер КАК Номер,
	|	ИС_Ozon_Заказ.Заказ КАК Заказ,
	|	ИС_Ozon_СтатусыСборочныхЗаданий.status КАК status,
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #83194
	|	ИС_Ozon_СтатусыСборочныхЗаданий.recommended_shipment_date КАК ДатаОтгрузкиРекомендуемая,
	//- ИнфоСофт Власова И.С. 13.02.25 УА #83194
	|	ИС_Ozon_СтатусыСборочныхЗаданий.shipment_date КАК ДатаОтгрузки
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|		ПО (ИС_Ozon_Заказ.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ)
	|			И (ИС_Ozon_Заказ.Профиль = &Профиль)
	|ГДЕ
	|	НЕ ИС_Ozon_СтатусыСборочныхЗаданий.status ЕСТЬ NULL
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status В(&Статусы)
	|	И ИС_Ozon_Заказ.Дата >= &Дата
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	|	И НЕ ИС_Ozon_Заказ.ЗаказФБО
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	|;
	|
	//+ ИнфоСофт Стояк Ю.К. 20.03.2024 УА #64801	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Ссылка КАК Заказ,
	|	ПередачаТоваровХранителю.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ_РеализацииВсе
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ВТ_Данные.Заказ = ПередачаТоваровХранителю.ЗаказКлиента
	|			И (НЕ ВТ_Данные.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Данные.Ссылка,
	|	ПередачаТоваровХранителюТовары.Ссылка
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО ВТ_Данные.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента
	|			И (НЕ ВТ_Данные.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Данные.Ссылка,
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Данные.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
	|			И (НЕ ВТ_Данные.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Данные.Ссылка,
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_Данные.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
	|			И (НЕ ВТ_Данные.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Заказ КАК Заказ,
	|	МАКСИМУМ(ВТ_Реализации.Реализация) КАК Реализация,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	ВТ_РеализацииВсе КАК ВТ_Реализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Ссылка КАК Ссылка,
	|	ВТ_Данные.Номер КАК Номер,
	|	ВТ_Данные.Заказ КАК Заказ,
	|	ВТ_Данные.status КАК status,
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #83194
	|	ВТ_Данные.ДатаОтгрузкиРекомендуемая КАК ДатаОтгрузкиРекомендуемая,
	//- ИнфоСофт Власова И.С. 13.02.25 УА #83194
	|	ВТ_Данные.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЕСТЬNULL(ВТ_Реализации.Количество, 0) КАК КоличествоРТУ
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|		ПО ВТ_Данные.Ссылка = ВТ_Реализации.Заказ";
	//- ИнфоСофт Стояк Ю.К. 20.03.2024 УА #64801

	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.acceptance_in_progress);
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.arbitration);
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_approve);
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_deliver);
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_packaging);
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_registration);
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_verification);
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.client_arbitration);
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.delivering);
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.driver_pickup);
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.not_accepted);
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.sent_by_seller);
	
	Запрос.УстановитьПараметр("Статусы", Статусы);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса() - _7Дней);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
		
	Если НастройкиСоединения = Неопределено Тогда
		ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	КонецЕсли;  
		
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);   
	
	НастройкиСборочныхЗаданий = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	Пока Выборка.Следующий() Цикл
		
		Результат = ИС_Ozon_API.ПолучитьИнформциюПоОтправлению(Профиль, ПараметрыЗапроса, Выборка.Номер);	 
		
		Если Результат = Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		Статус = ПолучитьСтатусСборочногоЗадания(Результат["result"]["status"]);
		
		//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801			
		ДатаОтгрузки = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Результат["result"]["shipment_date"], ФорматДатыJSON.ISO);
		
		//+ ИнфоСофт Власова И.С. 13.02.25 УА #83194
		ДатаОтгрузкиРекомендуемая = ДатаОтгрузки;
		
		Если Не Результат["result"]["tariffication"] = Неопределено Тогда 
			
			ТарификацияЗаказа = Результат["result"]["tariffication"];
			
			Если Не ТарификацияЗаказа["next_tariff_starts_at"] = Неопределено Тогда
			
				ДатаСледующегоТарифа = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(ТарификацияЗаказа["next_tariff_starts_at"], ФорматДатыJSON.ISO) - 1;
				
				ТекущаяДата = ТекущаяДатаСеанса();
				
				Если Выборка.ДатаОтгрузки < ТекущаяДата 
					И Выборка.ДатаОтгрузки <> ДатаСледующегоТарифа 
					И ДатаОтгрузки <> ДатаСледующегоТарифа Тогда
					
					ДатаОтгрузки = ДатаСледующегоТарифа;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		//- ИнфоСофт Власова И.С. 13.02.25 УА #83194
		
		//Если Статус <> Выборка.status Тогда
		
		//+ ИнфоСофт Власова И.С. 13.02.25 УА #83194
		//Если Статус <> Выборка.status Или ДатаОтгрузки <> Выборка.ДатаОтгрузки Тогда
		
			//ОбновитьСтатусыЗаказов(Профиль, Выборка.Ссылка, Статус, ДатаОтгрузки);
		
		Если Статус <> Выборка.status 
			Или ДатаОтгрузки <> Выборка.ДатаОтгрузки 
			Или ДатаОтгрузкиРекомендуемая <> Выборка.ДатаОтгрузкиРекомендуемая Тогда	
			
			//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
			ДетальныйСтатус = ПолучитьДетальныйСтатусСборочногоЗадания(Результат["result"]["status"], Результат["result"]["substatus"]);
			
			//ОбновитьСтатусыЗаказов(Профиль, Выборка.Ссылка, Статус, ДатаОтгрузки, ДатаОтгрузкиРекомендуемая);
			ОбновитьСтатусыЗаказов(Профиль, Выборка.Ссылка, Статус, ДатаОтгрузки, ДатаОтгрузкиРекомендуемая, ДетальныйСтатус, Результат["result"]["cancellation"]["cancelled_after_ship"]);
			//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648						
			//- ИнфоСофт Власова И.С. 13.02.25 УА #83194
			
			Если Не ЗначениеЗаполнено(Выборка.Заказ) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			//+ ИнфоСофт Заварин К.В. 23.09.24 УА #84126
			//Заказ1С = Выборка.Заказ.ПолучитьОбъект();
			//- ИнфоСофт Заварин К.В. 23.09.24 УА #84126
			
			//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
			//+ ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88089
			Если (ДатаОтгрузки <> Выборка.ДатаОтгрузки И НастройкиСборочныхЗаданий.ИзменятьДатуОтгрузкиOzon И Выборка.КоличествоРТУ = 0
				И Выборка.Заказ.ДатаОтгрузки <> ДатаОтгрузки)
				И (НастройкиСборочныхЗаданий.РежимСозданияЗаказовOzon = 0 ИЛИ (Не НастройкиСборочныхЗаданий.ФормироватьЕдиныйЗаказБезРазбиенияOzon
				И НастройкиСборочныхЗаданий.РежимСозданияЗаказовOzon = 2) ИЛИ (НастройкиСборочныхЗаданий.ИспользоватьРазбиениеПоСкладамOzon
				И НастройкиСборочныхЗаданий.РежимСозданияЗаказовOzon = 2)) Тогда				
				//Если ДатаОтгрузки <> Выборка.ДатаОтгрузки И НастройкиСборочныхЗаданий.ИзменятьДатуОтгрузкиOzon 
				//	И НастройкиСборочныхЗаданий.РежимСозданияЗаказовOzon = 0 И Выборка.КоличествоРТУ = 0 Тогда				
				//- ИнфоСофт Стояк Ю.К. 25.11.2024 УА #88089
				//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
				
				//+ ИнфоСофт Заварин К.В. 23.09.24 УА #84126
				Заказ1С = Выборка.Заказ.ПолучитьОбъект();
				//- ИнфоСофт Заварин К.В. 23.09.24 УА #84126
				
				Заказ1С.ДатаОтгрузки = ДатаОтгрузки;
				
				Для Каждого Элемент Из Заказ1С.Товары Цикл
					Элемент.ДатаОтгрузки = ДатаОтгрузки;
				КонецЦикла;
			//+ ИнфоСофт Заварин К.В. 23.09.24 УА #84126
			Иначе     
				
				Продолжить;
			//- ИнфоСофт Заварин К.В. 23.09.24 УА #84126
				
			КонецЕсли;
			
			ЗаписыватьДокумент = Ложь;	
			
			Если НастройкиСборочныхЗаданий.ПроводитьЗаказыOzon Тогда
				
				Попытка
					Заказ1С.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ЗаписыватьДокумент = Истина;
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;
				
			Иначе
				ЗаписыватьДокумент = Истина;	
			КонецЕсли;
			
			Если ЗаписыватьДокумент Тогда	
				
				Попытка
					Заказ1С.Записать();			
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
				КонецПопытки;
				
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
			
		КонецЕсли;
		
	КонецЦикла;	
	
	//+ ИнфоСофт Заварин К.В. 04.09.24 УА #69327 
	ФункциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	Если ФункциональныеОпции.OzonАвтоматическиСобиратьЗаказы Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
		|ГДЕ
		|	ИС_Ozon_СтатусыСборочныхЗаданий.Профиль = &Профиль
		|	И ИС_Ozon_СтатусыСборочныхЗаданий.status = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_СтатусыОтправлений.awaiting_packaging)
		|	И ИС_Ozon_СтатусыСборочныхЗаданий.Заказ.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		МассивЗаданий = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			МассивЗаданий.Добавить(Выборка.Заказ);					
			
		КонецЦикла;
		
		Если МассивЗаданий.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		СобратьЗаказ(Профиль, МассивЗаданий);
		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 04.09.24 УА #69327
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 06.12.23 УА #67276 

//+ ИнфоСофт Заварин К.В. 13.06.24 УА #72552
//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
//Функция НапечататьЭтикетки(Профиль, Знач МассивЗаданий) Экспорт
Функция НапечататьЭтикетки(Профиль, Знач МассивЗаданий, СтруктураПараметровПечати = Неопределено) Экспорт
//- ИнфоСофт Заварин К.В. 13.06.24 УА #72552

	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения); 
	
	//+ ИнфоСофт Заварин К.В. 13.06.24 УА #72552
	Если СтруктураПараметровПечати = Неопределено Тогда
		СортировкаПечати = "Наименование";
	Иначе
		СортировкаПечати = СтруктураПараметровПечати.СортировкаПечати; 
	КонецЕсли; 
	//- ИнфоСофт Заварин К.В. 13.06.24 УА #72552
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//+ ИнфоСофт Заварин К.В. 13.06.24 УА #72552
	//"ВЫБРАТЬ
	//|	ИС_Ozon_СтатусыСборочныхЗаданий.status КАК status,
	//|	ИС_Ozon_СтатусыСборочныхЗаданий.posting_number КАК posting_number
	//|ИЗ
	//|	РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	//|ГДЕ
	//|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ В (&Заказ)";
	
	"ВЫБРАТЬ
	|	ИС_Ozon_СтатусыСборочныхЗаданий.status КАК status,
	|	ИС_Ozon_СтатусыСборочныхЗаданий.posting_number КАК posting_number,
	//+ ИнфоСофт Стояк Ю.К. 21.10.2024 УА #84967	
	//|	ИС_Ozon_Заказ.Номер КАК Номер,          
	|	ИС_Ozon_Заказ.Номер КАК НомерЗадания,
	|	ИС_Ozon_Заказ.Дата КАК Дата, 
	//- ИнфоСофт Стояк Ю.К. 21.10.2024 УА #84967
	//+ ИнфоСофт Конышев А.Е. 11.12.24 УА #79539
	|	Подстрока(ИС_Ozon_Заказ.Номер, СтрНайти(ИС_Ozon_Заказ.Номер, ""-"") - 4, 4) КАК НомерЭтикетки,	
	//- ИнфоСофт Конышев А.Е. 11.12.24 УА #79539
	//+ ИнфоСофт Заварин К.В. 18.10.24 УА #74582
	|	ИС_Ozon_Заказ.is_express КАК is_express,
	//- ИнфоСофт Заварин К.В. 18.10.24 УА #74582
	|	ИС_Ozon_Заказproducts.НоменклатураOzon.Наименование КАК Наименование,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id, ""Отсутствует Сопоставление"") КАК offer_id
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|		ПО (ИС_Ozon_Заказproducts.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО (ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Ссылка = ИС_Ozon_Заказproducts.НоменклатураOzon.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|		ПО (ИС_Ozon_Заказproducts.Ссылка = ИС_Ozon_Заказ.Ссылка)
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка В(&Заказ)
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	|	И НЕ ИС_Ozon_Заказ.ЗаказФБО
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	|
	|УПОРЯДОЧИТЬ ПО
	|	%1";
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, ?(СортировкаПечати = "Наименование", "Наименование, Характеристика", СортировкаПечати));
    //- ИнфоСофт Заварин К.В. 13.06.24 УА #72552
	
	Запрос.УстановитьПараметр("Заказ", МассивЗаданий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивЗаданий = РезультатЗапроса.Выгрузить();
	
	//+ ИнфоСофт Заварин К.В. 18.10.24 УА #74582
	//+ ИнфоСофт Заварин К.В. 10.07.24 УА #79390
	//МассивЗаданий.Свернуть("posting_number, status");
	//- ИнфоСофт Заварин К.В. 10.07.24 УА #79390
	МассивЗаданий.Свернуть("posting_number, status, is_express");
	//- ИнфоСофт Заварин К.В. 18.10.24 УА #74582 
	
	//+ ИнфоСофт Стояк Ю.К. 15.08.2023 УА #61981
	ЕстьОтправлениеСНевернымСтатусом = Ложь;
	//- ИнфоСофт Стояк Ю.К. 15.08.2023 УА #61981
	
	КодыОтправлений = Новый Массив;
	Для Каждого Задание Из МассивЗаданий Цикл
		
		//+ ИнфоСофт Заварин К.В. 18.10.24 УА #74582	
		//Если Задание.status = Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_deliver Тогда
		//	КодыОтправлений.Добавить(Задание.posting_number);
		//Иначе
		//	ЕстьОтправлениеСНевернымСтатусом = Истина
		//КонецЕсли;
		Если Не Задание.is_express Тогда		
			Если Задание.status = Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_deliver Тогда
				КодыОтправлений.Добавить(Задание.posting_number);
			Иначе
				ЕстьОтправлениеСНевернымСтатусом = Истина
			КонецЕсли;		
		Иначе 		
			КодыОтправлений.Добавить(Задание.posting_number);	
		КонецЕсли; 
		//- ИнфоСофт Заварин К.В. 18.10.24 УА #74582
		
	КонецЦикла;
	
	//+ ИнфоСофт Стояк Ю.К. 15.08.2023 УА #61981	
	Если ЕстьОтправлениеСНевернымСтатусом Тогда
		ОбщегоНазначения.СообщитьПользователю("Отправления не в статусе ""Ожидают отгрузки"" не попадут в печать этикеток!");
	КонецЕсли;
	
	МассивФайлов = Новый Массив;
	
	Если КодыОтправлений.Количество() = 0 Тогда
		Возврат МассивФайлов;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 15.08.2023 УА #61981
	
	РазбитыйМассив = ИС_MP_Сервер.РазбитьМассивПоNЭлементов(КодыОтправлений, 20);
	
	Для Каждого Элемент Из РазбитыйМассив Цикл
		СтруктураКодов = Новый Структура;
		
		СтруктураКодов.Вставить("posting_number", Элемент);
		ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(СтруктураКодов);  
		
		МассивФайлов.Добавить(ИС_Ozon_API.НапечататьЭтикетки(Профиль, ПараметрыЗапроса));
	КонецЦикла;
	
	//ОбновитьСтатусыСборочныхЗаданий(Профиль, 432000);
	
	Возврат МассивФайлов;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Заварин К.В. 10.08.24 УА #76631
Функция НапечататьКомпактныеЭтикетки(Профиль, Знач МассивЗаданий, СтруктураПараметровПечати = Неопределено) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);  
	
	Если СтруктураПараметровПечати = Неопределено Тогда
		СортировкаПечати = "Наименование";
	Иначе
		СортировкаПечати = СтруктураПараметровПечати.СортировкаПечати; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_СтатусыСборочныхЗаданий.status КАК status,
	|	ИС_Ozon_СтатусыСборочныхЗаданий.posting_number КАК posting_number,
	//+ ИнфоСофт Стояк Ю.К. 21.10.2024 УА #84967	
	//|	ИС_Ozon_Заказ.Номер КАК Номер,          
	|	ИС_Ozon_Заказ.Номер КАК НомерЗадания,
	|	ИС_Ozon_Заказ.Дата КАК Дата,
	//- ИнфоСофт Стояк Ю.К. 21.10.2024 УА #84967
	//+ ИнфоСофт Конышев А.Е. 11.12.24 УА #79539
	|	Подстрока(ИС_Ozon_Заказ.Номер, СтрНайти(ИС_Ozon_Заказ.Номер, ""-"") - 4, 4) КАК НомерЭтикетки,	
	//- ИнфоСофт Конышев А.Е. 11.12.24 УА #79539
	//+ ИнфоСофт Заварин К.В. 18.10.24 УА #74582
	|	ИС_Ozon_Заказ.is_express КАК is_express,
	//- ИнфоСофт Заварин К.В. 18.10.24 УА #74582
	|	ИС_Ozon_Заказproducts.НоменклатураOzon.Наименование КАК Наименование,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id, ""Отсутствует Сопоставление"") КАК offer_id
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|		ПО (ИС_Ozon_Заказproducts.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО (ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Ссылка = ИС_Ozon_Заказproducts.НоменклатураOzon.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|		ПО (ИС_Ozon_Заказproducts.Ссылка = ИС_Ozon_Заказ.Ссылка)
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка В(&Заказ)
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	|	И НЕ ИС_Ozon_Заказ.ЗаказФБО
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	|
	|УПОРЯДОЧИТЬ ПО
	|	%1";
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, ?(СортировкаПечати = "Наименование", "Наименование, Характеристика", СортировкаПечати));
	
	Запрос.УстановитьПараметр("Заказ", МассивЗаданий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивЗаданий = РезультатЗапроса.Выгрузить();
	
	//+ ИнфоСофт Заварин К.В. 18.10.24 УА #74582
	//МассивЗаданий.Свернуть("posting_number, status");
	МассивЗаданий.Свернуть("posting_number, status, is_express");
	//- ИнфоСофт Заварин К.В. 18.10.24 УА #74582
	
	ЕстьОтправлениеСНевернымСтатусом = Ложь;
	
	КодыОтправлений = Новый Массив;
	Для Каждого Задание Из МассивЗаданий Цикл
		
		//+ ИнфоСофт Заварин К.В. 18.10.24 УА #74582	
		//Если Задание.status = Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_deliver Тогда
		//	КодыОтправлений.Добавить(Задание.posting_number);
		//Иначе
		//	ЕстьОтправлениеСНевернымСтатусом = Истина
		//КонецЕсли;
		Если Не Задание.is_express Тогда	
			Если Задание.status = Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_deliver Тогда
				КодыОтправлений.Добавить(Задание.posting_number);
			Иначе
				ЕстьОтправлениеСНевернымСтатусом = Истина
			КонецЕсли;		
		Иначе  	
			КодыОтправлений.Добавить(Задание.posting_number);		
		КонецЕсли; 
		//- ИнфоСофт Заварин К.В. 18.10.24 УА #74582
		
	КонецЦикла;
	
	Если ЕстьОтправлениеСНевернымСтатусом Тогда
		ОбщегоНазначения.СообщитьПользователю("Отправления не в статусе ""Ожидают отгрузки"" не попадут в печать этикеток!");
	КонецЕсли;
	
	МассивФайлов = Новый Массив;
	
	Если КодыОтправлений.Количество() = 0 Тогда
		Возврат МассивФайлов;
	КонецЕсли;
		
	РазбитыйМассив = КодыОтправлений;
	
	СтруктураКодов = Новый Структура;
	
	СтруктураКодов.Вставить("posting_number", РазбитыйМассив);
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(СтруктураКодов);  
	
	МассивЗаданий = ИС_Ozon_API.СоздатьЗаданиеНаФормированиеЭтикеток(Профиль, ПараметрыЗапроса);
	
	//+ ИнфоСофт Стояк Ю.К. 11.03.2025 УА #95884	
	Если Не ЗначениеЗаполнено(МассивЗаданий) Тогда
		Возврат Неопределено;
	КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 11.03.2025 УА #95884
	
	//+ ИнфоСофт Заварин К.В. 20.09.24 УА #84102
	ПараметрыЗапроса.ТелоСтрока = Неопределено;
	//- ИнфоСофт Заварин К.В. 20.09.24 УА #84102
	
	Для Каждого Задание Из МассивЗаданий Цикл
		
		Если Задание.task_type = "big_label" Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураКодов = Новый Структура;
		СтруктураКодов.Вставить("task_id", Задание.task_id);
		
		ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(СтруктураКодов);
				
	КонецЦикла; 
	
	Пока Истина Цикл
		
		//+ ИнфоСофт Заварин К.В. 20.09.24 УА #84102
		Если ПараметрыЗапроса.ТелоСтрока = Неопределено Тогда
			Прервать;	
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 20.09.24 УА #84102
		
		КомпактнаяЭтикеткаПоЗаданию	= ИС_Ozon_API.ПолучитьЭтикеткиПоЗаданию(Профиль, ПараметрыЗапроса);
		
		Если КомпактнаяЭтикеткаПоЗаданию.status = "completed" Тогда
			МассивФайлов.Добавить(КомпактнаяЭтикеткаПоЗаданию.file_url);
			Прервать;
		КонецЕсли;
		
		Если КомпактнаяЭтикеткаПоЗаданию.status = "error" Тогда
			Прервать;	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции //- ИнфоСофт Заварин К.В. 10.08.24 УА #76631

//+ ИнфоСофт Власова И.С. 13.02.25 УА #83194
Процедура ОбновитьСтатусыЗаказов(Профиль, Заказ, Статус, ДатаОтгрузки, ДатаОтгрузкиРекомендуемая = Неопределено
								//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
								, ДетальныйСтатус = Неопределено
								, ОтменаПослеСборки = Ложь)
								//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648)
	
	Событие = "СоздатьИлиОбновитьСтатусOzon";
	
	Если Заказ = Документы.ИС_Ozon_Заказ.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли; 
	
	МенеджерЗаписи = РегистрыСведений.ИС_Ozon_СтатусыСборочныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Заказ = Заказ;
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Заказ = Заказ;
	МенеджерЗаписи.status = Статус;
	МенеджерЗаписи.posting_number = Заказ.Номер;
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	МенеджерЗаписи.substatus = ДетальныйСтатус;
	МенеджерЗаписи.cancelled_after_ship = ОтменаПослеСборки;
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #83194
	////+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
	//МенеджерЗаписи.shipment_date = ДатаОтгрузки;
	////- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
	
	ДатаЗаполнения = Дата(1, 1, 1);
	
	Если МенеджерЗаписи.shipment_date = ДатаЗаполнения 
		Или (Не МенеджерЗаписи.shipment_date = ДатаЗаполнения И МенеджерЗаписи.shipment_date < ДатаОтгрузки) Тогда	
		
		МенеджерЗаписи.shipment_date = ДатаОтгрузки;
		
	КонецЕсли;	
	
	Если Не ДатаОтгрузкиРекомендуемая = Неопределено Тогда
		МенеджерЗаписи.recommended_shipment_date = ДатаОтгрузкиРекомендуемая;
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 13.02.25 УА #83194
	
	//+ ИнфоСофт Мурсалимов Д.Р. 12.02.24 УА #63850			
	Если МенеджерЗаписи.status = Перечисления.ИС_Ozon_СтатусыОтправлений.cancelled Тогда
		
		//+ ИнфоСофт Заварин К.В. 25.09.24 УА #73468
		//ОтменитьЗаказ(Заказ, Профиль);
		ОтменитьЗаказ(Заказ, Профиль, Истина);
		//- ИнфоСофт Заварин К.В. 25.09.24 УА #73468
		
	КонецЕсли;
    //- ИнфоСофт Мурсалимов Д.Р. 12.02.24 УА #63850
	
	Попытка
		МенеджерЗаписи.Записать(Истина);	
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 13.02.25 УА #83194

//+ ИнфоСофт Ивонин К.А. 10.11.23 УА #65952
Процедура СобратьЗаказ(Профиль, Знач МассивЗаданий) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	//+ ИнфоСофт Заварин К.В. 04.09.24 УА #69327
	Событие = ПолучитьИмяСобытия("СобратьЗаказOzon");    
	//- ИнфоСофт Заварин К.В. 04.09.24 УА #69327
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_СтатусыСборочныхЗаданий.posting_number КАК posting_number,
	|	ИС_Ozon_Заказproducts.quantity КАК quantity,
	|	ИС_Ozon_Заказproducts.НоменклатураOzon.sku КАК product_id
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|		ПО (ИС_Ozon_Заказproducts.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ)
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка В (&Заказы)
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.Заказ В (&Заказы)
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status = ЗНАЧЕНИЕ(Перечисление.ИС_Ozon_СтатусыОтправлений.awaiting_packaging)
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	|	И НЕ ИС_Ozon_СтатусыСборочныхЗаданий.Заказ.ЗаказФБО
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	|ИТОГИ ПО
	|	posting_number";
	
	Запрос.УстановитьПараметр("Заказы", МассивЗаданий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
    Пока ВыборкаЗаказов.Следующий() Цикл
    
    	Выборка = ВыборкаЗаказов.Выбрать();
    			
		ТелоЗапроса = Новый Структура;
		МассивОтправлений = Новый Массив;
		МассивТоваров = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
		
			СтруктураТовара = Новый Структура;
			СтруктураТовара.Вставить("product_id", Выборка.product_id); 
			СтруктураТовара.Вставить("quantity", Выборка.quantity);
		
			МассивТоваров.Добавить(СтруктураТовара);
		
		КонецЦикла;
		
		СтруктураProducts = Новый Структура;
		СтруктураProducts.Вставить("products", МассивТоваров);
		
		МассивОтправлений.Добавить(СтруктураProducts);
		ТелоЗапроса.Вставить("packages", МассивОтправлений);
		ТелоЗапроса.Вставить("posting_number", ВыборкаЗаказов.posting_number);
		
		ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
		
		//+ ИнфоСофт Заварин К.В. 04.09.24 УА #69327
		//ИС_Ozon_API.СобратьЗаказ(Профиль, ПараметрыЗапроса);
		
		Результат = ИС_Ozon_API.СобратьЗаказ(Профиль, ПараметрыЗапроса);
		
		Если Результат = Неопределено Тогда
			ТекстСообщения = СтрШаблон("Не удалось собрать заказ %1 (%2)", ВыборкаЗаказов.posting_number, Профиль);
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);		
		КонецЕсли;
		
		//- ИнфоСофт Заварин К.В. 04.09.24 УА #69327 
		
	КонецЦикла;
 		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.11.23 УА #65952

//+ ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628
Функция РазбитьНаОтправления(Профиль, Тело) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения); 
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Тело);  
	
	Возврат ЗначениеЗаполнено(ИС_Ozon_API.СобратьЗаказ(Профиль, ПараметрыЗапроса));
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 21.03.2023 УА #54628

//+ ИнфоСофт Заварин К.В. 25.09.24 УА #73468
//Добавлено ИспользоватьФО
//+ ИнфоСофт Стояк Ю.К. 16.08.2023 УА #61318
Процедура ОтменитьЗаказ(Заказ, Профиль, ИспользоватьФО) Экспорт 
//- ИнфоСофт Заварин К.В. 25.09.24 УА #73468

	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 23.09.2024 УА #82955	
	//Если Не ФукнциональныеОпции.РежимСозданияЗаказовOzon = 0 Тогда
	//	Возврат;
	//КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 23.09.2024 УА #82955
	
	//+ ИнфоСофт Заварин К.В. 25.09.24 УА #73468
	//+ ИнфоСофт Заварин К.В. 05.06.24 УА #68574
	//Если Не ФукнциональныеОпции.УдалятьРТУOzon Тогда
	//	Возврат;
	//КонецЕсли;
	//- ИнфоСофт Заварин К.В. 05.06.24 УА #68574	
	Если ИспользоватьФО Тогда
		
		Если Не ФукнциональныеОпции.УдалятьРТУOzon Тогда
			Возврат;
		КонецЕсли; 
		
		//+ ИнфоСофт Заварин К.В. 25.09.24 УА #77549
		Если ФукнциональныеОпции.ПроверятьДатуПередУдалениемOzon Тогда
			ЗапросДатаОтгрузкиЗаказа = Новый Запрос;
			ЗапросДатаОтгрузкиЗаказа.Текст =	
			"ВЫБРАТЬ
			|	ИС_Ozon_Заказ.Ссылка КАК Ссылка,
			|	ИС_Ozon_СтатусыСборочныхЗаданий.shipment_date КАК ДатаОтгрузки
			|ИЗ
			|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
			|		ПО (ИС_Ozon_Заказ.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ)
			|			И (ИС_Ozon_СтатусыСборочныхЗаданий.Профиль = &Профиль)
			|ГДЕ
			|	ИС_Ozon_Заказ.Профиль = &Профиль
			|	И ИС_Ozon_Заказ.Ссылка = &Заказ";
			
			ЗапросДатаОтгрузкиЗаказа.УстановитьПараметр("Заказ", Заказ);
			ЗапросДатаОтгрузкиЗаказа.УстановитьПараметр("Профиль", Профиль);
			
			
			Выборка = ЗапросДатаОтгрузкиЗаказа.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ДатаОтгрузкиЗаказа = Выборка.ДатаОтгрузки;
			КонецЦикла;			                          
			
			Если ЗначениеЗаполнено(ДатаОтгрузкиЗаказа) И ТекущаяДатаСеанса() >= ДатаОтгрузкиЗаказа Тогда
				Возврат;	
			КонецЕсли;
			
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 25.09.24 УА #77549
		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 25.09.24 УА #73468
	
	//+ ИнфоСофт Мурсалимов Д.Р. 14.02.24 УА #63850
	Если Не ЗначениеЗаполнено(ФукнциональныеОпции.ПричинаОтменыOzon) Тогда
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 14.02.24 УА #63850  
	
	//+ ИнфоСофт Мурсалимов Д.Р. 20.05.24 УА #76182
	ИспользоватьПричины = Ложь;
	
	Если Константы.ИспользоватьПричиныОтменыЗаказовКлиентов.Получить() Тогда
		
		ИспользоватьПричины = Истина;
		
		Если Не ЗначениеЗаполнено(ФукнциональныеОпции.ПричинаОтменыOzon) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 20.05.24 УА #76182
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	//+ ИнфоСофт Стояк Ю.К. 23.09.2024 УА #82955
	//"ВЫБРАТЬ
	//|	ДокументИС_Ozon_Заказ.Ссылка КАК Ссылка,
	//|	ДокументИС_Ozon_Заказ.Заказ КАК Заказ
	//|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	//|ИЗ
	//|	Документ.ИС_Ozon_Заказ КАК ДокументИС_Ozon_Заказ
	//|ГДЕ
	//|	ДокументИС_Ozon_Заказ.Ссылка = &Ссылка
	//|	И НЕ ДокументИС_Ozon_Заказ.Заказ ЕСТЬ NULL
	//|;
	//|
	"ВЫБРАТЬ
	|	ИС_Ozon_Заказproducts.Ссылка КАК Ссылка,
	|	ИС_Ozon_Заказproducts.Ссылка.Заказ КАК Заказ,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ИС_Ozon_СоответствиеХарактеристик.Упаковка КАК Упаковка,
	|	ИС_Ozon_Заказproducts.quantity КАК count,
	|	ИС_Ozon_Заказproducts.price КАК price,
	|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор		
	|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО ИС_Ozon_Заказproducts.НоменклатураOzon = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка = &Ссылка
	|	И НЕ ИС_Ozon_Заказproducts.Ссылка.Заказ ЕСТЬ NULL
	|;
	|
	//- ИнфоСофт Стояк Ю.К. 23.09.2024 УА #82955
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка КАК Заказ,
	|	МАКСИМУМ(РеализацияТоваровУслуг.Ссылка) КАК РТУ,
	|	СУММА(ВЫБОР
	|			КОГДА РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоРТУ
	|ПОМЕСТИТЬ ВТ_РТУ
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (ВТ_ОсновныеДанные.Ссылка.Заказ = (ВЫРАЗИТЬ(РеализацияТоваровУслуг.ЗаказКлиента КАК Документ.ЗаказКлиента)))
	|ГДЕ
	|	ВТ_ОсновныеДанные.Ссылка.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОсновныеДанные.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка,
	|	МАКСИМУМ(ПередачаТоваровХранителю.Ссылка),
	|	СУММА(ВЫБОР
	|			КОГДА ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ)
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО (ВТ_ОсновныеДанные.Ссылка.Заказ = (ВЫРАЗИТЬ(ПередачаТоваровХранителю.ЗаказКлиента КАК Документ.ЗаказКлиента)))
	|ГДЕ
	|	ВТ_ОсновныеДанные.Ссылка.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОсновныеДанные.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_РТУ.КоличествоРТУ) КАК КоличествоРТУ1,
	|	ВТ_РТУ.Заказ КАК Заказ,
	|	МАКСИМУМ(ВТ_РТУ.РТУ) КАК РТУ
	|ПОМЕСТИТЬ ВТ_РТУ_Группировка
	|ИЗ
	|	ВТ_РТУ КАК ВТ_РТУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РТУ.Заказ
	|;
	|
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК РасходныйОрдер
	|ПОМЕСТИТЬ ВТ_РасходныйОрдер1
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ПО ВТ_ОсновныеДанные.Заказ = (ВЫРАЗИТЬ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Документ.ЗаказКлиента))
	|ГДЕ
	|	НЕ ВТ_ОсновныеДанные.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасходныйОрдер1.Ссылка КАК Ссылка,
	|	ВТ_РасходныйОрдер1.РасходныйОрдер КАК РасходныйОрдер,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) КАК РазличныхРаспоряжений
	|ПОМЕСТИТЬ ВТ_РасходныйОрдер
	|ИЗ
	|	ВТ_РасходныйОрдер1 КАК ВТ_РасходныйОрдер1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ПО ВТ_РасходныйОрдер1.РасходныйОрдер = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
    |
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасходныйОрдер1.Ссылка,
	|	ВТ_РасходныйОрдер1.РасходныйОрдер
	|;
	|
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка КАК ЗаказOzon,
	|	ВТ_ОсновныеДанные.Заказ КАК Заказ1С,
	|	ВТ_РТУ_Группировка.РТУ КАК РТУ,
	//+ ИнфоСофт Стояк Ю.К. 23.09.2024 УА #82955
	|	ВТ_ОсновныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ОсновныеДанные.Характеристика КАК Характеристика,
	|	ВТ_ОсновныеДанные.count КАК count,
	|	ВТ_ОсновныеДанные.price КАК price,
	|	ВТ_ОсновныеДанные.ЭтоНабор КАК ЭтоНабор,
	|	NULL КАК НоменклатураВНаборе,
	|	NULL КАК ХарактеристикаНабора,
	|	NULL КАК Количество,
	//- ИнфоСофт Стояк Ю.К. 23.09.2024 УА #82955
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|	ВТ_РасходныйОрдер.РасходныйОрдер КАК РасходныйОрдер,
	|   ВТ_РасходныйОрдер.РазличныхРаспоряжений КАК РазличныхРаспоряжений
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ_Группировка КАК ВТ_РТУ_Группировка
	|		ПО ВТ_ОсновныеДанные.Ссылка = ВТ_РТУ_Группировка.Заказ
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныйОрдер КАК ВТ_РасходныйОрдер		
	|       ПО ВТ_ОсновныеДанные.Ссылка = ВТ_РасходныйОрдер.Ссылка
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	//+ ИнфоСофт Стояк Ю.К. 23.09.2024 УА #82955	
	|ГДЕ
	|	НЕ ВТ_ОсновныеДанные.ЭтоНабор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Ссылка,
	//+ ИнфоСофт Заварин К.В. 20.02.25 УА #94308
	//|	ВТ_РТУ_Группировка.Заказ,
	//|	ВТ_ОсновныеДанные.Заказ,
	|	ВТ_ОсновныеДанные.Заказ,
	|	ВТ_РТУ_Группировка.РТУ,
	//- ИнфоСофт Заварин К.В. 20.02.25 УА #94308
	|	ВТ_ОсновныеДанные.Номенклатура,
	|	ВТ_ОсновныеДанные.Характеристика,
	|	ВТ_ОсновныеДанные.count,
	|	ВТ_ОсновныеДанные.price,
	|	ВТ_ОсновныеДанные.ЭтоНабор,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество,
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|	ВТ_РасходныйОрдер.РасходныйОрдер КАК РасходныйОрдер,
	|   ВТ_РасходныйОрдер.РазличныхРаспоряжений КАК РазличныхРаспоряжений
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУ_Группировка КАК ВТ_РТУ_Группировка
	|		ПО ВТ_ОсновныеДанные.Ссылка = ВТ_РТУ_Группировка.Заказ,
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО (ВТ_ОсновныеДанные.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|				И ВТ_ОсновныеДанные.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика)
	//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныйОрдер КАК ВТ_РасходныйОрдер		
	|       ПО ВТ_ОсновныеДанные.Ссылка = ВТ_РасходныйОрдер.Ссылка
	//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
	|ГДЕ
	|	ВТ_ОсновныеДанные.ЭтоНабор";
	//- ИнфоСофт Стояк Ю.К. 23.09.2024 УА #82955
	
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//+ ИнфоСофт Стояк Ю.К. 11.10.2024 УА #84967		
		//+ ИнфоСофт Заварин К.В. 25.09.24 УА #73468
		//+ ИнфоСофт Мурсалимов Д.Р. 14.02.24 УА #63850
		//Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РТУ) И ФукнциональныеОпции.УдалятьРТУOzon Тогда
		//Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РТУ) Тогда 
		//- ИнфоСофт Мурсалимов Д.Р. 14.02.24 УА #63850
		//Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РТУ) Тогда
		//- ИнфоСофт Заварин К.В. 25.09.24 УА #73468
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РТУ) И ФукнциональныеОпции.РежимСозданияЗаказовOzon = 0 Тогда
		//- ИнфоСофт Стояк Ю.К. 11.10.2024 УА #84967 
			
			РТУ = ВыборкаДетальныеЗаписи.РТУ.ПолучитьОбъект();	
			
			Попытка	
				РТУ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение 
				
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
				Возврат;
				
			КонецПопытки;
			
			РТУ.ПометкаУдаления = Истина; 			
			
			Попытка	
				РТУ.Записать();
			Исключение 
							
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
				Возврат;
				
			КонецПопытки; 
			
		КонецЕсли;
		
		//+ ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РасходныйОрдер)
			И ФукнциональныеОпции.РежимСозданияЗаказовOzon = 0 Тогда   
			
			РО = ВыборкаДетальныеЗаписи.РасходныйОрдер.ПолучитьОбъект();
			
			Если ВыборкаДетальныеЗаписи.РазличныхРаспоряжений = 1 Тогда
				
				Попытка	
					РО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение 
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
					Возврат;	
				КонецПопытки;
				
				РО.ПометкаУдаления = Истина;
				
				Попытка	
					РО.Записать();
				Исключение
					Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
					Возврат;
				КонецПопытки; 	
				
			Иначе
				
				Отбор = Новый Структура(); 
				Отбор.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
				Отбор.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);
				
				НайденныеСтрокиОтгружаемые = РО.ОтгружаемыеТовары.НайтиСтроки(Отбор);
				
				Отбор.Вставить("Распоряжение", ВыборкаДетальныеЗаписи.Заказ1С);
				
				НайденныеСтрокиПоРаспоряжениям = РО.ТоварыПоРаспоряжениям.НайтиСтроки(Отбор);
				
				Если НайденныеСтрокиПоРаспоряжениям.Количество() > 0 Тогда
					
					РО.ТоварыПоРаспоряжениям.Удалить(НайденныеСтрокиПоРаспоряжениям[0]);
					
					НайденныеСтрокиОтгружаемые[0].Действие = 
					Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать;
					
					Попытка			
						РО.Записать(РежимЗаписиДокумента.Проведение);	
					Исключение 
						РО.Записать();			
						Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);	
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		//- ИнфоСофт Тимофеева А.А. 31.03.25 УА #77929
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Заказ1С) Тогда 
			
			Заказ1С = ВыборкаДетальныеЗаписи.Заказ1С.ПолучитьОбъект();	
			
			//+ ИнфоСофт Мурсалимов Д.Р. 20.05.24 УА #76182
			Попытка
				Заказ1С.Заблокировать();    
			Исключение   
				
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", "Заказ " + Заказ1С.Ссылка + " заблокирован для изменения данных");     
				Продолжить;
				
			КонецПопытки;                               
			
			//+ ИнфоСофт Стояк Ю.К. 23.09.2024 УА #82955
			Если ФукнциональныеОпции.РежимСозданияЗаказовOzon <> 0 Тогда
				
				Если ВыборкаДетальныеЗаписи.ЭтоНабор Тогда
					Отбор = Новый Структура();							
					Отбор.Вставить("НоменклатураНабора", ВыборкаДетальныеЗаписи.Номенклатура);
					Отбор.Вставить("ХарактеристикаНабора", ВыборкаДетальныеЗаписи.Характеристика); 
					Отбор.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.НоменклатураВНаборе);
					Отбор.Вставить("Характеристика", ВыборкаДетальныеЗаписи.ХарактеристикаНабора);					
					//+ ИнфоСофт Стояк Ю.К. 10.04.2025 УА #98469
					Отбор.Вставить("Количество", ВыборкаДетальныеЗаписи.Количество);
					//- ИнфоСофт Стояк Ю.К. 10.04.2025 УА #98469
					
					НайденныеСтроки = Заказ1С.Товары.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() > 0 Тогда	
											
						НайденныеСтроки[0].Отменено = Истина;
						Если ИспользоватьПричины Тогда		
							НайденныеСтроки[0].ПричинаОтмены = ФукнциональныеОпции.ПричинаОтменыOzon;	
						КонецЕсли;  
						
					КонецЕсли; 
					
				Иначе
					Отбор = Новый Структура();							
					Отбор.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					Отбор.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);					
					//+ ИнфоСофт Стояк Ю.К. 10.04.2025 УА #98469
					Отбор.Вставить("Количество", ВыборкаДетальныеЗаписи.count);
					//- ИнфоСофт Стояк Ю.К. 10.04.2025 УА #98469
					
					НайденныеСтроки = Заказ1С.Товары.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() > 0 Тогда 
						
						НайденныеСтроки[0].Отменено = Истина;
						Если ИспользоватьПричины Тогда		
							НайденныеСтроки[0].ПричинаОтмены = ФукнциональныеОпции.ПричинаОтменыOzon;	
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЕсли;                                                       
				
			Иначе 
				
				Для Каждого Товар Из Заказ1С.Товары Цикл
					Товар.Отменено = Истина;
					Если ИспользоватьПричины Тогда		
						Товар.ПричинаОтмены = ФукнциональныеОпции.ПричинаОтменыOzon;	
					КонецЕсли;	
				КонецЦикла;
				
			КонецЕсли;                                  
			//Для Каждого Товар Из Заказ1С.Товары Цикл
			//	Товар.Отменено = Истина;
			//	Если ИспользоватьПричины Тогда		
			//		Товар.ПричинаОтмены = ФукнциональныеОпции.ПричинаОтменыЯМ;	
			//	КонецЕсли;	
			//КонецЦикла;
			//- ИнфоСофт Стояк Ю.К. 23.09.2024 УА #82955
			
			Попытка	
				Заказ1С.Записать(РежимЗаписиДокумента.Проведение);
			Исключение 
				
				Заказ1С.Записать();			
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Отмена заказа", Текст);
				
			КонецПопытки;
			//- ИнфоСофт Мурсалимов Д.Р. 20.05.24 УА #76182
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 16.08.2023 УА #61318

//+ ИнфоСофт Мурсалимов Д.Р. 15.11.23 УА #65901
Функция ПолучитьТекстЗапросаСборочныхЗаданий() Экспорт
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ИС_Ozon_Заказ.Ссылка КАК Ссылка,
	|	ИС_Ozon_Заказ.Заказ КАК Заказ1C,
	|	ИС_Ozon_СтатусыСборочныхЗаданий.status КАК status,
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #83194
	|	ИС_Ozon_СтатусыСборочныхЗаданий.recommended_shipment_date КАК ДатаОтгрузкиРекомендуемая,
	//- ИнфоСофт Власова И.С. 13.02.25 УА #83194
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	ИС_Ozon_СтатусыСборочныхЗаданий.substatus КАК substatus,
	|	ИС_Ozon_СтатусыСборочныхЗаданий.cancelled_after_ship КАК cancelled_after_ship,
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	ИС_Ozon_СтатусыСборочныхЗаданий.shipment_date КАК ДатаОтгрузки
	|ПОМЕСТИТЬ ВТ_ЗаказыСоСтатусами
	|ИЗ
	|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|		ПО (ИС_Ozon_Заказ.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ)
	|			И (ИС_Ozon_СтатусыСборочныхЗаданий.Профиль = &Профиль)
	|ГДЕ
	|	ИС_Ozon_Заказ.Профиль = &Профиль
	|	И &ВсеОтправления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИС_Ozon_Заказ.Ссылка,
	|	ИС_Ozon_Заказ.Заказ,
	|	ИС_Ozon_СтатусыСборочныхЗаданий.status,
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #83194
	|	ИС_Ozon_СтатусыСборочныхЗаданий.recommended_shipment_date,
	//- ИнфоСофт Власова И.С. 13.02.25 УА #83194
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	ИС_Ozon_СтатусыСборочныхЗаданий.substatus КАК substatus,
	|	ИС_Ozon_СтатусыСборочныхЗаданий.cancelled_after_ship КАК cancelled_after_ship,
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	ИС_Ozon_СтатусыСборочныхЗаданий.shipment_date
	|ИЗ
	|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|		ПО ИС_Ozon_Заказ.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ
	|			И (ИС_Ozon_СтатусыСборочныхЗаданий.Профиль = &Профиль)
	|ГДЕ
	|	ИС_Ozon_Заказ.Профиль = &Профиль
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status В(&Статусы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаказыСоСтатусами.Ссылка КАК Заказ,
	|	ВТ_ЗаказыСоСтатусами.status КАК status,
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	ВТ_ЗаказыСоСтатусами.substatus КАК substatus,
	|	ВТ_ЗаказыСоСтатусами.cancelled_after_ship КАК cancelled_after_ship,
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	ПередачаТоваровХранителю.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ_РеализацииВсе
	|ИЗ
	|	ВТ_ЗаказыСоСтатусами КАК ВТ_ЗаказыСоСтатусами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ВТ_ЗаказыСоСтатусами.Заказ1C = ПередачаТоваровХранителю.ЗаказКлиента
	|			И (НЕ ВТ_ЗаказыСоСтатусами.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаказыСоСтатусами.Ссылка,
	|	ВТ_ЗаказыСоСтатусами.status,
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	ВТ_ЗаказыСоСтатусами.substatus,
	|	ВТ_ЗаказыСоСтатусами.cancelled_after_ship,
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	ПередачаТоваровХранителюТовары.Ссылка
	|ИЗ
	|	ВТ_ЗаказыСоСтатусами КАК ВТ_ЗаказыСоСтатусами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО ВТ_ЗаказыСоСтатусами.Заказ1C = ПередачаТоваровХранителюТовары.ЗаказКлиента
	|			И (НЕ ВТ_ЗаказыСоСтатусами.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаказыСоСтатусами.Ссылка,
	|	ВТ_ЗаказыСоСтатусами.status,
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	ВТ_ЗаказыСоСтатусами.substatus,
	|	ВТ_ЗаказыСоСтатусами.cancelled_after_ship,
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	ВТ_ЗаказыСоСтатусами КАК ВТ_ЗаказыСоСтатусами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_ЗаказыСоСтатусами.Заказ1C = РеализацияТоваровУслуг.ЗаказКлиента
	|			И (НЕ ВТ_ЗаказыСоСтатусами.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаказыСоСтатусами.Ссылка,
	|	ВТ_ЗаказыСоСтатусами.status,
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	ВТ_ЗаказыСоСтатусами.substatus,
	|	ВТ_ЗаказыСоСтатусами.cancelled_after_ship,
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	ВТ_ЗаказыСоСтатусами КАК ВТ_ЗаказыСоСтатусами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_ЗаказыСоСтатусами.Заказ1C = РеализацияТоваровУслугТовары.ЗаказКлиента
	|			И (НЕ ВТ_ЗаказыСоСтатусами.Заказ1C = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Заказ КАК Заказ,
	|	МАКСИМУМ(ВТ_Реализации.Реализация) КАК Реализация,
	|	СУММА(1) КАК Количество,
	|	ВТ_Реализации.status КАК status,
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648	
	|	ВТ_Реализации.substatus КАК substatus,
	|	ВТ_Реализации.cancelled_after_ship КАК cancelled_after_ship
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	ВТ_РеализацииВсе КАК ВТ_Реализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Заказ,
	|	ВТ_Реализации.status,
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648	
	|	ВТ_Реализации.substatus,
	|	ВТ_Реализации.cancelled_after_ship
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//+ ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ВТ_РасходныеОрдера
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаказыСоСтатусами КАК ВТ_ЗаказыСоСтатусами
	|	ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = ВТ_ЗаказыСоСтатусами.Заказ1C
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//- ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ВТ_РасходныеОрдера.Ссылка) КАК Ссылка,
	|	ВТ_РасходныеОрдера.Распоряжение КАК Распоряжение,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_РасходныеОрдераКоличество
	|ИЗ
	|	ВТ_РасходныеОрдера КАК ВТ_РасходныеОрдера
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасходныеОрдера.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|ВЫБРАТЬ
	|	ИС_Ozon_Заказ.Ссылка КАК Ссылка,
	|	ИС_Ozon_Заказ.ПометкаУдаления КАК ПометкаУдаления,
	|	ИС_Ozon_Заказ.Номер КАК Номер,
	|	ИС_Ozon_Заказ.Дата КАК Дата,
	|	ИС_Ozon_Заказ.Проведен КАК Проведен,
	|	ИС_Ozon_Заказ.Профиль КАК Профиль,
	|	ИС_Ozon_Заказ.Склад КАК Склад,
	|	ИС_Ozon_Заказ.order_number КАК order_number,
	|	ИС_Ozon_Заказ.Заказ КАК Заказ,
	|	ИС_Ozon_Заказ.name КАК name,
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #83194
	|	ВТ_ЗаказыСоСтатусами.ДатаОтгрузкиРекомендуемая КАК ДатаОтгрузкиРекомендуемая,
	//- ИнфоСофт Власова И.С. 13.02.25 УА #83194
	|	ВТ_ЗаказыСоСтатусами.ДатаОтгрузки КАК ДатаОтгрузки,	
	|	ИС_Ozon_Заказ.МоментВремени КАК МоментВремени,
	//+ ИнфоСофт Заварин К.В. 16.04.24 УА #71409
	|	ИС_Ozon_Заказ.tpl_provider КАК tpl_provider,
	//- ИнфоСофт Заварин К.В. 16.04.24 УА #71409 
	//+ ИнфоСофт Заварин К.В. 16.04.24 УА #74582
	|	ИС_Ozon_Заказ.is_express КАК is_express,
	//- ИнфоСофт Заварин К.В. 16.04.24 УА #74582
	|	ВЫБОР
	|		КОГДА ВТ_Реализации.Реализация ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ВТ_Реализации.Количество = 1
	|			ТОГДА ВТ_Реализации.Реализация
	|		ИНАЧЕ ""Список реализаций""
	|	КОНЕЦ КАК Реализация,
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|	ВЫБОР
	|		КОГДА ВТ_РасходныеОрдераКоличество.Ссылка ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ВТ_РасходныеОрдераКоличество.Количество = 1
	|			ТОГДА ВТ_РасходныеОрдераКоличество.Ссылка
	|		ИНАЧЕ ""Список ордеров""
	|	КОНЕЦ КАК РасходныйОрдер,
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	|	ЕСТЬNULL(ВТ_Реализации.status, ВТ_ЗаказыСоСтатусами.status) КАК СтатусОтправления,
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	ЕСТЬNULL(ВТ_Реализации.substatus, ВТ_ЗаказыСоСтатусами.substatus) КАК ДетальныйСтатусОтправления,
	|	ЕСТЬNULL(ВТ_Реализации.cancelled_after_ship, ВТ_ЗаказыСоСтатусами.cancelled_after_ship) КАК ОтмененоПослеОтправления,
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
	|	ИС_Ozon_Заказ.order_id КАК order_id,
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	|	ИС_Ozon_Заказ.ЗаказФБО КАК ЗаказФБО,
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(250)) КАК Состав,
	//+ ИнфоСофт Тимофеева А.А. 04.09.2025 УА #79192 
	|	ВЫБОР        
	|		КОГДА ИС_Ozon_Заказ.Заказ.Проведен
	|			ТОГДА 3
	|		КОГДА НЕ ИС_Ozon_Заказ.Заказ.Проведен
	|			ТОГДА 1
	|       ИНАЧЕ 4
	|	КОНЕЦ КАК СтатусПроведенияЗаказа
	//- ИнфоСофт Тимофеева А.А. 04.09.2025 УА #79192
	|ИЗ
	|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаказыСоСтатусами КАК ВТ_ЗаказыСоСтатусами
	|		ПО ИС_Ozon_Заказ.Ссылка = ВТ_ЗаказыСоСтатусами.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|		ПО ИС_Ozon_Заказ.Ссылка = ВТ_Реализации.Заказ
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201 
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныеОрдераКоличество КАК ВТ_РасходныеОрдераКоличество
	|		ПО ИС_Ozon_Заказ.Заказ = ВТ_РасходныеОрдераКоличество.Распоряжение
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201 
	|ГДЕ
	|	ИС_Ozon_Заказ.Профиль = &Профиль";
	
	Возврат ТекстЗапроса;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 15.11.23 УА #65901

//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629 
Функция ПолучитьАктивныйЗаказКлиентаОзон(СборочноеЗадание, РазбиениеПоДатам, РазбиениеПоСкладам)
	
	//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_СтатусыСборочныхЗаданий.shipment_date КАК shipment_date
	|ИЗ
	|	РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|ГДЕ
	|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", СборочноеЗадание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДатаОтгрузки = ВыборкаДетальныеЗаписи.shipment_date;	
	КонецЦикла;
	//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ                                                                
	|	ИС_Ozon_ЗаказыВТеченииДня.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	РегистрСведений.ИС_Ozon_ЗаказыВТеченииДня КАК ИС_Ozon_ЗаказыВТеченииДня
	|ГДЕ
	|	ИС_Ozon_ЗаказыВТеченииДня.ЗаказОткрыт
	|	И ИС_Ozon_ЗаказыВТеченииДня.Профиль = &Профиль";
	
	Если РазбиениеПоДатам Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ИС_Ozon_ЗаказыВТеченииДня.ДатаОтгрузки = &ДатаОтгрузки";
		
		//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801	
		//Запрос.УстановитьПараметр("ДатаОтгрузки", СборочноеЗадание.shipment_date);
		Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
		//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
		
	КонецЕсли;
	
	Если РазбиениеПоСкладам Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ИС_Ozon_ЗаказыВТеченииДня.СкладМП = &Склад";
		
		Запрос.УстановитьПараметр("Склад", СборочноеЗадание.Склад);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Профиль", СборочноеЗадание.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	КонецЕсли; 	
	
	ВыборкаДетальныеЗаписи.Следующий();	
	
	Возврат ВыборкаДетальныеЗаписи.ЗаказКлиента;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629

//+ ИнфоСофт Сумин Д.В. 30.05.2023 УА #59231
Процедура ДобавитьЗаписьВРегистрЗаказовОзон(Заказ, СборочноеЗадание)
	
	//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_СтатусыСборочныхЗаданий.shipment_date КАК shipment_date
		|ИЗ
		|	РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
		|ГДЕ
		|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", СборочноеЗадание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДатаОтгрузки = ВыборкаДетальныеЗаписи.shipment_date;	
	КонецЦикла;
	//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #64801
	
	МенеджерЗаписи = РегистрыСведений.ИС_Ozon_ЗаказыВТеченииДня.СоздатьМенеджерЗаписи(); 
	
	МенеджерЗаписи.ДатаОтгрузки = ДатаОтгрузки;
	МенеджерЗаписи.ЗаказКлиента = Заказ;

	//+ ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	МенеджерЗаписи.СкладМП = СборочноеЗадание.Склад; 
	//- ИнфоСофт Мурсалимов Д.Р. 23.04.25 УА #99629
	
	МенеджерЗаписи.Профиль = СборочноеЗадание.Профиль;
	МенеджерЗаписи.ЗаказОткрыт = Истина;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 30.05.2023 УА #59231

//+ ИнфоСофт Мурсалимов Д.Р. 06.12.23 УА #67276
Функция ПолучитьСтатусСборочногоЗадания(Статус)
    
    Событие = ПолучитьИмяСобытия("ПолучитьСтатусСборочногоЗадания");
    
	Если Статус = "acceptance_in_progress" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.acceptance_in_progress;
	КонецЕсли; 
	
	Если Статус = "arbitration" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.arbitration;
	КонецЕсли;
	
	Если Статус = "awaiting_approve" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_approve;
	КонецЕсли;
	
	Если Статус = "awaiting_deliver" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_deliver;
	КонецЕсли;       
	
	Если Статус = "awaiting_packaging" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_packaging;
	КонецЕсли; 
	
	Если Статус = "awaiting_registration" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_registration;
	КонецЕсли;
	
	Если Статус = "awaiting_verification" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_verification;
	КонецЕсли;
	
	Если Статус = "cancelled" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.cancelled;
	КонецЕсли;  
	
	Если Статус = "cancelled_from_split_pending" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.cancelled_from_split_pending;
	КонецЕсли; 
	
	Если Статус = "client_arbitration" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.client_arbitration;
	КонецЕсли;
	
	Если Статус = "delivered" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.delivered;
	КонецЕсли;
	
	Если Статус = "delivering" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.delivering;
	КонецЕсли;
	
	Если Статус = "driver_pickup" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.driver_pickup;
	КонецЕсли;
	
	Если Статус = "not_accepted" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.not_accepted;
	КонецЕсли;
	
	Если Статус = "sent_by_seller" Тогда                           
		Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.sent_by_seller;
	КонецЕсли;

	Текст = СтрШаблон("Получен неизвестный статус сборочного задания: %1", Статус);
	ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	
	Возврат Перечисления.ИС_Ozon_СтатусыОтправлений.ПустаяСсылка();
		
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 06.12.23 УА #67276

//+ ИнфоСофт Сумин Д.В. 26.01.2024 УА #62586
Функция ПрикрепитьКиз(Профиль, СтруктураДанных) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	//+ ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73296
	//МассивПродуктов = Новый Массив();
	//
	//СтруктураПродуктов = Новый Структура;  
	//
	//СтруктураПродуктов.Вставить("exemplars", СтруктураДанных.МассивДанных);
	//СтруктураПродуктов.Вставить("product_id", Число(СтруктураДанных.product_id));
	//МассивПродуктов.Добавить(СтруктураПродуктов);  
	//
	//ДанныеЗапроса = Новый Структура; 
	//
	//ДанныеЗапроса.Вставить("posting_number", СтруктураДанных.posting_number);
	//ДанныеЗапроса.Вставить("products", МассивПродуктов); 
	//Результат = ИС_Ozon_API.ЗакрепитьКиЗыСборочногоЗадания(Профиль, ПараметрыЗапроса, ДанныеЗапроса);
	
	Результат = ИС_Ozon_API.ЗакрепитьКиЗыСборочногоЗадания(Профиль, ПараметрыЗапроса, СтруктураДанных);	
	//- ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73296
		
	Если Результат = Неопределено Тогда
		Возврат Неопределено	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 26.01.2024 УА #62586

//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
Функция АктИНакладная(Профиль, Склад
	//+ ИнфоСофт Заварин К.В. 11.04.25 УА #77376
	, Грузоместа) Экспорт  
    //- ИнфоСофт Заварин К.В. 11.04.25 УА #77376
	
	//+ ИнфоСофт Стояк Ю.К. 15.03.2024 УА #72125
	//Изменил некоторые названия на капс, без этого не работало
	
	//+ ИнфоСофт Заварин К.В. 11.04.25 УА #77376
	//Номер = ПолучитьНомерЗадания(Профиль, Склад);
	Номер = ПолучитьНомерЗадания(Профиль, Склад,, Грузоместа);
	//- ИнфоСофт Заварин К.В. 11.04.25 УА #77376
	
	Если ЗначениеЗаполнено(Номер) Тогда
		
		СтатусФормированияАктовИНакладных = СтатусФормированияАктовИНакладных(Профиль, Номер);   
		
		Если СтатусФормированияАктовИНакладных = "in_process" Или СтатусФормированияАктовИНакладных = "FORMING" Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Документы формируются, нужно подождать");
			
		ИначеЕсли СтатусФормированияАктовИНакладных = "The next postings aren't ready" Тогда
			
			ОбщегоНазначения.СообщитьПользователю(
			"Произошла ошибка, отправления не включены в отгрузку. Подождите некоторое время и проверьте результат запроса. Если ошибка повторяется, обратитесь в службу поддержки");
		ИначеЕсли СтатусФормированияАктовИНакладных = "cancelled" Тогда
			
			ОбщегоНазначения.СообщитьПользователю(
			"Cоздание документов отменено, выполняется повторный запрос на формирования документов."); 
			
			ПолучитьНомерЗадания(Профиль, Склад, Истина);
			
		ИначеЕсли СтатусФормированияАктовИНакладных = "error" Или СтатусФормированияАктовИНакладных = "UNKNOWN_ERROR" Тогда
			
			ОбщегоНазначения.СообщитьПользователю(
			"Произошла ошибка при формировании документов, выполняется повторный запрос на формирование документов");
			ПолучитьНомерЗадания(Профиль, Склад, Истина);
			
			
		ИначеЕсли СтатусФормированияАктовИНакладных = "not_found" Тогда
			
			ОбщегоНазначения.СообщитьПользователю(
			"Документы не найдены, выполняется повторный запрос на формирование документов");
			ПолучитьНомерЗадания(Профиль, Склад, Истина);
			
		ИначеЕсли СтатусФормированияАктовИНакладных = "ready" Тогда
			
			Возврат ПолучитьАктыИНакладныеСOzon(, Номер, Профиль);
			
		ИначеЕсли СтатусФормированияАктовИНакладных = "FORMED" Или СтатусФормированияАктовИНакладных = "CONFIRMED"
			Или СтатусФормированияАктовИНакладных = "CONFIRMED_WITH_MISMATCH" Тогда
			
			Возврат ПолучитьАктыИНакладныеСOzon(Истина, Номер, Профиль);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Неопределено;
	//- ИнфоСофт Стояк Ю.К. 15.03.2024 УА #72125
		
КонецФункции //- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585

//+ ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73296
Функция ПолучитьДанныеСозданныхЭкземпляров(Профиль, СтруктураДанных) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	ДанныеЗапроса = Новый Структура; 
	
	ДанныеЗапроса.Вставить("posting_number", СтруктураДанных.posting_number);
	
	Результат = ИС_Ozon_API.ПолучитьДанныеСозданныхЭкземпляров(Профиль, ПараметрыЗапроса, ДанныеЗапроса);
		
	Если Результат = Неопределено Тогда
		Возврат Неопределено	
	КонецЕсли;
	
	Возврат Результат;  
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73296

//+ ИнфоСофт Конышев А.Е. 06.12.24 УА #77791
Функция УстановитьТрекНомерОтправления(Профиль, СтруктураДанных) Экспорт

	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);

	МассивОтправлений = Новый Массив;
	МассивОтправлений.Добавить(СтруктураДанных);

	Результат = ИС_Ozon_API.ДобавитьТрекНомерКОтправлению(Профиль, ПараметрыЗапроса, МассивОтправлений);
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Конышев А.Е. 06.12.24 УА #77791

//+ ИнфоСофт Сумин Д.В. 27.04.2023 УА #57537
Процедура ОбновитьСтатусы(Профиль, ДатаПоследнегоОтправления) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
		
	Если НастройкиСоединения = Неопределено Тогда
		ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	КонецЕсли;  
		
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
		
	МассивЗагруженныхЗаданий = Новый Массив;
	
	Пока Истина Цикл
		
		Тело = Новый Структура;
		Тело.Вставить("dir", "asc");
		
		Фильтр = Новый Структура; 
		Фильтр.Вставить("since", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ДатаПоследнегоОтправления, ФорматДатыJSON.ISO
		, ВариантЗаписиДатыJSON.УниверсальнаяДата));
		Фильтр.Вставить("to", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO
		, ВариантЗаписиДатыJSON.УниверсальнаяДата));  
		
		Тело.Вставить("filter", Фильтр);
		Тело.Вставить("limit", 1000); 
		
		Дополнительно = Новый Структура;
		Дополнительно.Вставить("analytics_data", Истина);
		Дополнительно.Вставить("barcodes", Истина);
		Дополнительно.Вставить("financial_data", Истина);  
		
		Тело.Вставить("with", Дополнительно);
		
		ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Тело);
		
		Результат = ИС_Ozon_API.ПолучитьСписокОтправлений(Профиль, ПараметрыЗапроса);
		
		Если ЗначениеЗаполнено(Результат) Тогда
			
			Для Каждого Элемент Из Результат.postings Цикл 		
				СсылкаЗадания = СоздатьИлиОбновитьОтправление(Профиль, Элемент, ДатаПоследнегоОтправления);				 
						
			КонецЦикла;
			
		Иначе
			Прервать;			
		КонецЕсли;
		
		Если Результат.has_next = Ложь Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 27.04.2023 УА #57537

//+ ИнфоСофт Сумин Д.В. 06.06.2023 УА #59478
Функция СоздатьИлиДополнитьЗаказУТ11_5(СборочноеЗадание, ФукнциональныеОпции, Заказ = Неопределено)
	
	Событие = "СоздатьИлиДополнитьЗаказУТ11_5";
	
	//+ ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ИС_Ozon_СоответствиеХарактеристик.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Знаменатель
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	ИС_Ozon_Заказproducts.Ссылка.Дата КАК Дата,
	|	ИС_Ozon_Заказproducts.Ссылка.Номер КАК Номер,
	|	ИС_Ozon_Заказproducts.Ссылка.Склад КАК Склад,
	|	ИС_Ozon_Заказproducts.НоменклатураOzon КАК НоменклатураOzon,
	|	ИС_Ozon_Заказproducts.ХарактеристикаOzon КАК ХарактеристикаOzon,
	|	ИС_Ozon_Заказproducts.Ссылка.Склад.Склад КАК СкладУТ,
	|	ИС_Ozon_Заказproducts.Ссылка.Склад.ВыгружатьОстаткиИзГруппыСкладов КАК СкладВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_Ozon_Заказproducts.Ссылка.Склад.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_Ozon_Заказproducts.Ссылка.Склад.АдресДоставки КАК АдресДоставки,
	|	ИС_Ozon_Заказproducts.Ссылка.Склад.СпособДоставки КАК СпособДоставки,
	|	ИС_Ozon_Заказproducts.Ссылка.Склад.ЗонаДоставки КАК ЗонаДоставки,
	|	ИС_Ozon_Заказproducts.Ссылка.Склад.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_Ozon_Заказproducts.Ссылка.Склад.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ИС_Ozon_Заказproducts.Ссылка.Склад.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	ИС_Ozon_Заказproducts.Ссылка.Склад.Грузополучатель КАК Грузополучатель,
	|	ИС_Ozon_Заказproducts.Ссылка.Склад.Грузоотправитель КАК Грузоотправитель,
	|	ИС_Ozon_Заказproducts.Ссылка.Склад.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	ИС_Ozon_Заказproducts.price КАК price,
	|	ИС_Ozon_Заказproducts.quantity КАК quantity,
	|	ИС_Ozon_Заказproducts.Сумма КАК Сумма,
	//+ ИнфоСофт Заварин К.В. 09.09.24 УА #69689
	|	ИС_Ozon_Заказproducts.Ссылка.address_tail КАК address_tail,
	|	ИС_Ozon_Заказproducts.Ссылка.name КАК name,
	|	ИС_Ozon_Заказproducts.Ссылка.phone КАК phone,
	//- ИнфоСофт Заварин К.В. 09.09.24 УА #69689
	|	ИС_Ozon_СтатусыСборочныхЗаданий.shipment_date КАК shipment_date
	|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	|ИЗ
	|	Документ.ИС_Ozon_Заказ.products КАК ИС_Ozon_Заказproducts
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО ИС_Ozon_Заказproducts.НоменклатураOzon = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|		ПО ИС_Ozon_Заказproducts.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ
	|ГДЕ
	|	ИС_Ozon_Заказproducts.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ОсновныеДанные.Характеристика КАК Характеристика,
	|	ВТ_ОсновныеДанные.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВТ_ОсновныеДанные.Дата КАК Дата,
	|	ВТ_ОсновныеДанные.Номер КАК Номер,
	|	ВТ_ОсновныеДанные.Склад КАК Склад,        	
	|	ВТ_ОсновныеДанные.НоменклатураOzon КАК НоменклатураOzon,
	|	ВТ_ОсновныеДанные.ХарактеристикаOzon КАК ХарактеристикаOzon,	
	|	ВТ_ОсновныеДанные.СкладУТ КАК СкладУТ,
	|	ВТ_ОсновныеДанные.СкладВыгружатьОстаткиИзГруппыСкладов КАК СкладВыгружатьОстаткиИзГруппыСкладов,
	|	ВТ_ОсновныеДанные.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ВТ_ОсновныеДанные.price КАК price,
	|	ВТ_ОсновныеДанные.quantity КАК quantity,
	|	ВТ_ОсновныеДанные.Сумма КАК Сумма,
	//+ ИнфоСофт Заварин К.В. 09.09.24 УА #69689
	|	ВТ_ОсновныеДанные.address_tail КАК Адрес,
	|	ВТ_ОсновныеДанные.name КАК Получатель,
	|	ВТ_ОсновныеДанные.phone КАК phone,
	//- ИнфоСофт Заварин К.В. 09.09.24 УА #69689
	|	ВТ_ОсновныеДанные.shipment_date КАК shipment_date,	
	|	ВТ_ОсновныеДанные.АдресДоставки КАК АдресДоставки,
	|	ВТ_ОсновныеДанные.СпособДоставки КАК СпособДоставки,
	|	ВТ_ОсновныеДанные.ЗонаДоставки КАК ЗонаДоставки,
	|	ВТ_ОсновныеДанные.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ВТ_ОсновныеДанные.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ВТ_ОсновныеДанные.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	ВТ_ОсновныеДанные.Грузополучатель КАК Грузополучатель,
	|	ВТ_ОсновныеДанные.Грузоотправитель КАК Грузоотправитель,
	|	ВТ_ОсновныеДанные.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	ВТ_ОсновныеДанные.Упаковка КАК Упаковка,
	|	ВТ_ОсновныеДанные.КоэффициентУпаковки КАК КоэффициентУпаковки	
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные";
	//- ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005
	
	Запрос.УстановитьПараметр("Ссылка", СборочноеЗадание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Заказ = Неопределено Тогда
		НовыйДокумент = Документы.ЗаказКлиента.СоздатьДокумент();
	Иначе
		НовыйДокумент = Заказ.ПолучитьОбъект();
	КонецЕсли;
	
	ГруппаСкладов = СборочноеЗадание.Склад.ОбщаяГруппаСкладов;	
	Организация = ФукнциональныеОпции.Организация; 
	Партнер = ФукнциональныеОпции.ПартнерOzon; 
	Соглашение = ФукнциональныеОпции.СоглашениеOzon;
	Контрагент = ФукнциональныеОпции.КонтрагентOzon;
	Договор = ФукнциональныеОпции.ДоговорOzon;
	
	ПродажаОблагаетсяНДС = ИС_MP_Сервер.ПолучитьПрименениеНДСОрганизации(Организация);
	СтруктураСтатусов = ИС_MP_Сервер.ПолучитьЗначенияСтатусовЗаказа(); 
	
	Если Заказ = Неопределено Тогда					
		
		Если ФукнциональныеОпции.РежимСозданияЗаказовOzon = 2 Тогда
			НовыйДокумент.Дата = ТекущаяДатаСеанса();
		Иначе
			НовыйДокумент.Дата = СборочноеЗадание.Дата;
		КонецЕсли;
		
		НовыйДокумент.Заполнить(Партнер);
		
		НовыйДокумент.Организация = Организация;
		НовыйДокумент.Подразделение = ФукнциональныеОпции.ПодразделениеOzon; 
		
		НовыйДокумент.Партнер = Партнер;
		НовыйДокумент.Контрагент = Контрагент;      
		
		НовыйДокумент.НеОтгружатьЧастями = Ложь;
		//+ ИнфоСофт Сумин Д.В. 22.11.2023 УА #61641
		//Если Соглашение.ИспользуютсяДоговорыКонтрагентов Тогда
		//	НовыйДокумент.Договор = Договор;
		//	НовыйДокумент.Соглашение = Соглашение;
		//Иначе
		//	НовыйДокумент.Соглашение = Соглашение;
		//	НовыйДокумент.ПорядокРасчетов = Соглашение.ПорядокРасчетов;
		//КонецЕсли;
		//- ИнфоСофт Сумин Д.В. 22.11.2023 УА #61641
		//+ ИнфоСофт Мурсалимов Д.Р. 10.11.23 УА #65826
		Если ЗначениеЗаполнено(ГруппаСкладов) И ФукнциональныеОпции.РежимСозданияЗаказовOzon = 2 Тогда
		//- ИнфоСофт Мурсалимов Д.Р. 10.11.23 УА #65826	
			НовыйДокумент.Склад = ГруппаСкладов; 
		Иначе
			НовыйДокумент.Склад = СборочноеЗадание.Склад.Склад;  
		КонецЕсли; 		 
		
		//+ ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87933		
		Если ЗначениеЗаполнено(ФукнциональныеОпции.OzonСтатусЗаказа) Тогда
            НовыйДокумент.Статус = ФукнциональныеОпции.OzonСтатусЗаказа; 
		Иначе
			НовыйДокумент.Статус = СтруктураСтатусов.СтатусЗаказа; 
		КонецЕсли;
		//НовыйДокумент.Статус = СтруктураСтатусов.СтатусЗаказа; 
		//- ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87933
		НовыйДокумент.Приоритет = ФукнциональныеОпции.ПриоритетЗаказаOzon;
		
		НовыйДокумент.ЦенаВключаетНДС = Соглашение.ЦенаВключаетНДС;
		
		//+ ИнфоСофт Сумин Д.В. 22.11.2023 УА #61641
		ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
		
		Если ИспользоватьСоглашенияСКлиентами Тогда
			НовыйДокумент.ПорядокРасчетов 	= Соглашение.ПорядокРасчетов;
			НовыйДокумент.Менеджер 			= Соглашение.Менеджер;
			НовыйДокумент.Валюта 			= Соглашение.Валюта; 
			//+ ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
			Если ЗначениеЗаполнено(Соглашение.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Соглашение.НаправлениеДеятельности;            
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
		Иначе
			НовыйДокумент.Менеджер 			= Договор.Менеджер;
			НовыйДокумент.Валюта 			= Договор.ВалютаВзаиморасчетов;
			НовыйДокумент.ПорядокРасчетов 	= Договор.ПорядокРасчетов;
			//+ ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
			Если ЗначениеЗаполнено(Договор.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Договор.НаправлениеДеятельности;            
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 27.11.2024 УА #87103
		КонецЕсли; 
		
		НовыйДокумент.Договор = Договор;
		НовыйДокумент.Соглашение = Соглашение;
		//Если ЗначениеЗаполнено(Соглашение) Тогда
		//	НовыйДокумент.Валюта = Соглашение.Валюта;
		//ИначеЕсли ЗначениеЗаполнено(Договор) Тогда
		//	НовыйДокумент.Валюта = Договор.ВалютаВзаиморасчетов;
		//Иначе
		//	НовыйДокумент.Валюта = Справочники.Валюты.НайтиПоКоду("643");
		//КонецЕсли;	 
		//- ИнфоСофт Сумин Д.В. 22.11.2023 УА #61641		
		//+ ИнфоСофт Стояк Ю.К. 28.09.2023 УА #61974		
		Если ЗначениеЗаполнено(Договор) Тогда
			НовыйДокумент.ХозяйственнаяОперация = Договор.ХозяйственнаяОперация;	
		ИначеЕсли ЗначениеЗаполнено(Соглашение) Тогда                                                                       
			НовыйДокумент.ХозяйственнаяОперация = Соглашение.ХозяйственнаяОперация;	
		КонецЕсли;	
		//- ИнфоСофт Стояк Ю.К. 28.09.2023 УА #61974
		//НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;	
		
		//+ ИнфоСофт Заварин К.В. 05.12.24 УА #79415 
		Если ЗначениеЗаполнено(Соглашение) И Не Соглашение.ИспользуютсяДоговорыКонтрагентов Тогда 
			
			Если ЗначениеЗаполнено(Соглашение.ГруппаФинансовогоУчета) Тогда
				НовыйДокумент.ГруппаФинансовогоУчета 			= Соглашение.ГруппаФинансовогоУчета;            
			КонецЕсли;
			Если ЗначениеЗаполнено(Соглашение.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Соглашение.НаправлениеДеятельности;            
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Договор) Тогда 
			
			Если ЗначениеЗаполнено(Договор.ГруппаФинансовогоУчета) Тогда
				НовыйДокумент.ГруппаФинансовогоУчета 			= Договор.ГруппаФинансовогоУчета;            
			КонецЕсли;
			Если ЗначениеЗаполнено(Договор.НаправлениеДеятельности) Тогда
				НовыйДокумент.НаправлениеДеятельности 			= Договор.НаправлениеДеятельности;            
			КонецЕсли;
	
		КонецЕсли;
		//- ИнфоСофт Заварин К.В. 05.12.24 УА #79415

		Если ФукнциональныеОпции.РежимСозданияЗаказовOzon = 0 Тогда
			НовыйДокумент.Комментарий = "Создан на основание заказа Ozon "; 
		Иначе
			НовыйДокумент.Комментарий = "Создан на основание заказов Ozon ";
		КонецЕсли;
		
		Если ПродажаОблагаетсяНДС = Неопределено Тогда
			ВызватьИсключение("Не заполнена учетная политика организации");
		КонецЕсли;
		
		Если ПродажаОблагаетсяНДС Тогда
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;			
		Иначе
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
		КонецЕсли;	
		
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 05.12.24 УА #88585
	Отбор = Новый Структура;
	
	Отбор.Вставить("Дата", НовыйДокумент.Дата);
	Отбор.Вставить("Организация", Организация);
	ТЗОтветственныеЛицаОрг = ОтветственныеЛицаСервер.ПолучитьТаблицуОтветственныхЛицПоОтбору(Отбор);
	
	НовыйДокумент.Руководитель = "";
	НовыйДокумент.ГлавныйБухгалтер = "";
	
	Для Каждого Результат Из ТЗОтветственныеЛицаОрг Цикл
		
		Если Строка(Результат.ОтветственноеЛицо) = "Руководитель" Тогда
			НовыйДокумент.Руководитель = Результат.Ссылка;
		ИначеЕсли Строка(Результат.ОтветственноеЛицо) = "Главный бухгалтер" Тогда
			НовыйДокумент.ГлавныйБухгалтер = Результат.Ссылка;
		КонецЕсли;		
	КонецЦикла;
    //- ИнфоСофт Заварин К.В. 05.12.24 УА #88585
	
	//+ ИнфоСофт Заварин К.В. 12.12.24 УА #89604
	Если ЗначениеЗаполнено(Договор) Тогда
		НовыйДокумент.БанковскийСчет = "";
		НовыйДокумент.БанковскийСчет = Договор.БанковскийСчет;		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 12.12.24 УА #89604
	
	Номер = СтрЗаменить(СборочноеЗадание.Номер, Символы.НПП, ""); 
	НовыйДокумент.Комментарий = СтрШаблон("%1%2; ", НовыйДокумент.Комментарий, Номер);  
	
	НовыйДокумент.Менеджер = НовыйДокумент.Договор.Менеджер;	
	
	Выборка = РезультатЗапроса.Выбрать();
	//+ ИнфоСофт Стояк Ю.К. 31.07.2024 УА #80616
	Если ФукнциональныеОпции.РежимСозданияЗаказовOzon = 0 Тогда
		//+ ИнфоСофт Стояк Ю.К. 13.06.2023 УА #59330	
		НовыйДокумент.НеОтгружатьЧастями = Истина;		
		//- ИнфоСофт Стояк Ю.К. 13.06.2023 УА #59330               
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 31.07.2024 УА #80616
	
	//+ ИнфоСофт Стояк Ю.К. 24.07.2023 УА #60348 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_СтатусыСборочныхЗаданий.posting_number КАК posting_number
		|ИЗ
		|	РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
		|ГДЕ
		|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", СборочноеЗадание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовыйДокумент.НомерПоДаннымКлиента = ВыборкаДетальныеЗаписи.posting_number;	
	КонецЦикла;
		 
	Если ФукнциональныеОпции.РежимСозданияЗаказовOzon = 2 Тогда
		НовыйДокумент.ДатаПоДаннымКлиента = ТекущаяДатаСеанса();
	Иначе
		НовыйДокумент.ДатаПоДаннымКлиента = НовыйДокумент.Дата;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 24.07.2023 УА #60348 
	
	//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	Назначения = Новый Массив;
	
	Если Метаданные.Перечисления.Найти("ТипыОбъектовНазначений") <> Неопределено Тогда
		
		ЗапросНазначений = Новый Запрос;
		ЗапросНазначений.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
		|ИЗ
		|	Справочник.ИС_Ozon_Склады.НаправленияДеятельности КАК ИС_Ozon_СкладыНаправленияДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|		ПО ИС_Ozon_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности
		|			И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|ГДЕ
		|	ИС_Ozon_СкладыНаправленияДеятельности.Ссылка = &Ссылка
		|	И Назначения.ТипОбъектаНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовНазначений.НаправлениеДеятельности)";
		
		ЗапросНазначений.УстановитьПараметр("Ссылка", СборочноеЗадание.Склад);
		
		РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
		
		ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
		
		Пока ВыборкаНазначения.Следующий() Цикл	
			Назначения.Добавить(ВыборкаНазначения.Назначение);
		КонецЦикла; 
		
	КонецЕсли;
	
	Если Назначения.Количество() = 0 Тогда		
		Назначения.Добавить(Справочники.Назначения.ПустаяСсылка());
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
	
	//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99444
	ПострочнаяОтгрузка = Константы.ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента.Получить();
	//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99444
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Номенклатура = NULL Тогда
			ОбщегоНазначения.СообщитьПользователю("Отсутствует сопоставление");
			Возврат Документы.ЗаказКлиента.ПустаяСсылка();
		КонецЕсли;
		
		Если Выборка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
			ЭтоНабор = Истина;
		Иначе 
			ЭтоНабор = Ложь;
		КонецЕсли;
		
		ТоварыЗаказа = Новый ТаблицаЗначений;
		ТоварыЗаказа.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТоварыЗаказа.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры")); 
		
		//+ ИнфоСофт Мурсалимов Д.Р. 26.08.24 УА #82005
		ТоварыЗаказа.Колонки.Добавить("Упаковка");
		//- ИнфоСофт Мурсалимов Д.Р. 26.08.24 УА #82005
		
		ТоварыЗаказа.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10, 0)));
		ТоварыЗаказа.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
		ТоварыЗаказа.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2))); 
		
		//+ ИнфоСофт Заварин К.В. 11.02.25 УА #93503
		ТоварыЗаказа.Колонки.Добавить("ОстатокНеСвободен", Новый ОписаниеТипов("Булево")); 
		//- ИнфоСофт Заварин К.В. 11.02.25 УА #93503
		
		СтрокаТовары = ТоварыЗаказа.Добавить();
		СтрокаТовары.Номенклатура = Выборка.Номенклатура;
		СтрокаТовары.Характеристика = Выборка.Характеристика;
		
		//+ ИнфоСофт Мурсалимов Д.Р. 26.08.24 УА #82005
		СтрокаТовары.Упаковка = Выборка.Упаковка;
		//- ИнфоСофт Мурсалимов Д.Р. 26.08.24 УА #82005
		
		СтрокаТовары.Количество = Выборка.quantity;
		СтрокаТовары.Цена = Выборка.price;
		СтрокаТовары.Сумма = Выборка.Сумма;
		
		Если ЭтоНабор Тогда
			
			//+ ИнфоСофт Мурсалимов Д.Р. 28.05.24 УА #76561
			//ТоварыЗаказаТЗ = ПолучитьТаблицуТоваровНабора(ТоварыЗаказа);
			ТоварыЗаказаТЗ = ИС_MP_РаботаСЗаказами.ПолучитьТаблицуТоваровНабора(ТоварыЗаказа);
			//- ИнфоСофт Мурсалимов Д.Р. 28.05.24 УА #76561
			
			МассивКоэфф = ИС_WB_СерверУТ11_5.РассчитатьДолюСтоимости(ТоварыЗаказаТЗ, ФукнциональныеОпции.OzonВидЦеныСоСкидкой, НовыйДокумент.Дата);
			Если ТоварыЗаказаТЗ[0].ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям Тогда				
				СуммаПродажиПриДолях = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТоварыЗаказаТЗ[0].Сумма, ТоварыЗаказаТЗ.ВыгрузитьКолонку("ДоляСтоимости"));
			ИначеЕсли МассивКоэфф <> Неопределено Тогда
				СуммыПродажи = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ТоварыЗаказаТЗ[0].Сумма, МассивКоэфф);
			КонецЕсли;                                  
			
		Иначе 
			ТоварыЗаказаТЗ = ТоварыЗаказа;
		КонецЕсли;
		
		//+ ИнфоСофт Мурсалимов Д.Р. 10.11.23 УА #65826	
		Если ЗначениеЗаполнено(ГруппаСкладов) Тогда
			
			НовыйДокумент.Склад = ГруппаСкладов;
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083			
			//РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, ГруппаСкладов);
			РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, ГруппаСкладов, Назначения);
			//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
			СтрокаРезультат = РезультатПроверки[0];

			Если СтрокаРезультат.ОстатокВНаличии Тогда
				СкладСОстатком = СтрокаРезультат.Склад;
			Иначе 
				СкладСОстатком = Выборка.СкладУТ;
			КонецЕсли; 
			
			//+ ИнфоСофт Заварин К.В. 02.04.25 УА #97851
		ИначеЕсли СборочноеЗадание.Склад.ИспользоватьОсновнойСкладВЗаказах Тогда
			
			Если ЗначениеЗаполнено(СборочноеЗадание.Склад.Склад) Тогда
				НовыйДокумент.Склад = СборочноеЗадание.Склад.Склад;
			Иначе
				НовыйДокумент.Склад = Выборка.Склад.ГруппаСкладов[0].Склад;
			КонецЕсли;
			
			СкладСОстатком = НовыйДокумент.Склад;
			
			РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, СкладСОстатком, Назначения);	
			//- ИнфоСофт Заварин К.В. 02.04.25 УА #97851
			
		ИначеЕсли Выборка.СкладВыгружатьОстаткиИзГруппыСкладов И ФукнциональныеОпции.РежимСозданияЗаказовOzon <> 2 Тогда
			
			Склады = Выборка.Склад.ГруппаСкладов.ВыгрузитьКолонку("Склад");			
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083			
			//РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, Склады);
			РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, Склады, Назначения);
			//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
			
			СкладСОстатком = Выборка.СкладУТ;
			
			Для Каждого Строка Из Выборка.Склад.ГруппаСкладов Цикл
				
				НайденныйСклад = РезультатПроверки.НайтиСтроки(Новый Структура("Склад", Строка.Склад));
				Если НайденныйСклад.Количество() > 0 Тогда
					
					Если НайденныйСклад[0].ОстатокВНаличии Тогда 
						СкладСОстатком = НайденныйСклад[0].Склад;
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			НовыйДокумент.Склад = СкладСОстатком;
			
		Иначе
			НовыйДокумент.Склад = Выборка.СкладУТ;
			СкладСОстатком = Выборка.СкладУТ;						
			//+ ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083			
			//РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, СкладСОстатком);
			РезультатПроверки = ИС_WB_СерверУТ11_5.ПроверитьСвободныеОстатки(ТоварыЗаказаТЗ, СкладСОстатком, Назначения);
			//- ИнфоСофт Стояк Ю.К. 18.11.2024 УА #74083
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(ГруппаСкладов) И ФукнциональныеОпции.РежимСозданияЗаказовOzon <> 2 Тогда 
		//	
		//	Если Выборка.ВыгружатьОстаткиИзГруппыСкладов Тогда
		//		
		//		Для Каждого ДопСклад Из Выборка.Склад.ГруппаСкладов Цикл			
		//			
		//			СтруктураПроверки = ИС_WB_СерверУТ11_5.ПроверитьОстаткиТваровНаСервере(ТоварыЗаказаТЗ, ДопСклад.Склад, Организация);
		//			
		//			Если СтруктураПроверки.КоличестваХватает Тогда
		//				СкладСОстатком = ДопСклад.Склад;
		//				НовыйДокумент.Склад = ДопСклад.Склад; 
		//				Прервать;
		//			КонецЕсли;
		//			
		//		КонецЦикла;		
		//		
		//	Иначе
		//		
		//		СтруктураПроверки = ИС_WB_СерверУТ11_5.ПроверитьОстаткиТваровНаСервере(ТоварыЗаказаТЗ, Выборка.СкладУТ, Организация);
		//		
		//		Если СтруктураПроверки.КоличестваХватает Тогда
		//			СкладСОстатком = Выборка.СкладУТ;
		//			НовыйДокумент.Склад = Выборка.СкладУТ;
		//		КонецЕсли;	
		//		
		//	КонецЕсли;
		//	
		//КонецЕсли;
		//- ИнфоСофт Мурсалимов Д.Р. 10.11.23 УА #65826
		
		//+ ИнфоСофт Заварин К.В. 02.04.25 УА #97851
		//+ ИнфоСофт Заварин К.В. 31.01.25 УА #88005
		//Если СборочноеЗадание.Склад.ИспользоватьОсновнойСкладВЗаказах Тогда
		//	Если ЗначениеЗаполнено(СборочноеЗадание.Склад.Склад) Тогда
		//		НовыйДокумент.Склад = СборочноеЗадание.Склад.Склад;
		//	Иначе
		//		НовыйДокумент.Склад = Выборка.Склад.ГруппаСкладов[0].Склад;
		//	КонецЕсли;	
		//КонецЕсли;			
		//- ИнфоСофт Заварин К.В. 30.01.25 УА #88005		
		//- ИнфоСофт Заварин К.В. 02.04.25 УА #97851
		
		Для Каждого Элемент Из ТоварыЗаказаТЗ Цикл
			
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			
			//+ ИнфоСофт Заварин К.В. 12.02.25 УА #93503
			//Если ЭтоНабор Тогда
			Если ЭтоНабор И Не Элемент.ОстатокНеСвободен Тогда
			//- ИнфоСофт Заварин К.В. 12.02.25 УА #93503
				
				НоваяСтрока.НоменклатураНабора = Элемент.Набор;
				
				//+ ИнфоСофт Мурсалимов Д.Р. 28.05.24 УА #76561
				НоваяСтрока.ХарактеристикаНабора = Элемент.ХарактеристикаНабора;
				//- ИнфоСофт Мурсалимов Д.Р. 28.05.24 УА #76561
				
				Если Элемент.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям Тогда
					Элемент.Сумма = СуммаПродажиПриДолях[0];
					СуммаПродажиПриДолях.Удалить(0);	
				Иначе					
					
					Если МассивКоэфф = Неопределено Тогда
						ОбщегоНазначения.СообщитьПользователю("Проверьте наличие цены на набор/его комплектующие " + Элемент.Набор);
						Элемент.Сумма = Элемент.Сумма / Элемент.КоличествоОбщее;
					Иначе
						Элемент.Сумма = СуммыПродажи[0];
						СуммыПродажи.Удалить(0);
					КонецЕсли;
					
				КонецЕсли;
				
				Элемент.Цена = Элемент.Сумма / Элемент.Количество;
				
			КонецЕсли;
			
			НоваяСтрока.Номенклатура = Элемент.Номенклатура;
			НоваяСтрока.Характеристика = Элемент.Характеристика;
			
			СтрокаСОстатком = РезультатПроверки.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Склад", Элемент.Номенклатура, Элемент.Характеристика, СкладСОстатком));
			
			ЕстьОстаток = ?(СтрокаСОстатком.Количество() > 0, СтрокаСОстатком[0].ОстатокВНаличии, Ложь);
			
			//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
			ИспользованВариантОбеспеченияПриНехватке = Ложь;
			//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
			
			//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99444
			Если Не ПострочнаяОтгрузка И НовыйДокумент.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению") Тогда				
				НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;								
			ИначеЕсли Не ПострочнаяОтгрузка 
				И НовыйДокумент.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОтгрузке") Тогда
				НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;				
			//Если Не ЕстьОстаток И ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияПриНехваткеOzon) Тогда
			ИначеЕсли Не ЕстьОстаток И ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияПриНехваткеOzon) Тогда		
			//- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #99444			
				НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспеченияПриНехваткеOzon;
				//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
				ИспользованВариантОбеспеченияПриНехватке = Истина;
				//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
			Иначе
				
				Если ФукнциональныеОпции.РежимСозданияЗаказовOzon = 2 Тогда	
					
					Если ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияOzon) Тогда  
						НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспеченияOzon;	
					Иначе
						НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
					КонецЕсли;
					
				Иначе 
					
					Если ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияOzon) Тогда  
						НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспеченияOzon;	
					Иначе
						НоваяСтрока.ВариантОбеспечения = СтруктураСтатусов.СтатусСтроки;	
					КонецЕсли;
					
				КонецЕсли;
														
			КонецЕсли;                                       
			
			//+ ИнфоСофт Заварин К.В. 12.02.25 УА #93503
			Если ФукнциональныеОпции.OzonОтделятьТоварыПриНехватке Тогда
				
				Если Не Элемент.ОстатокНеСвободен Тогда
					
					Если ЕстьОстаток И Элемент.Количество > СтрокаСОстатком[0].Свободно  Тогда			
						
						СтрокаТоварыЗаказаТЗСвободные = ТоварыЗаказаТЗ.Добавить();
						
						ЗаполнитьЗначенияСвойств(СтрокаТоварыЗаказаТЗСвободные, Элемент);
						СтрокаТоварыЗаказаТЗСвободные.Количество 	 	 = Элемент.Количество - СтрокаСОстатком[0].Свободно;
						СтрокаТоварыЗаказаТЗСвободные.Сумма 	 	 	 = Элемент.Сумма - Элемент.Цена * СтрокаСОстатком[0].Свободно; 
						СтрокаТоварыЗаказаТЗСвободные.ОстатокНеСвободен  = Истина;
						
						Элемент.Сумма = Элемент.Цена * СтрокаСОстатком[0].Свободно;
						Элемент.Количество = СтрокаСОстатком[0].Свободно;
						
					КонецЕсли;	
					
				КонецЕсли;
				
				Если Элемент.ОстатокНеСвободен И ЗначениеЗаполнено(ФукнциональныеОпции.ВариантОбеспеченияПриНехваткеOzon) Тогда
					НоваяСтрока.ВариантОбеспечения = ФукнциональныеОпции.ВариантОбеспеченияПриНехваткеOzon;	
				КонецЕсли;
				
			КонецЕсли;
			//- ИнфоСофт Заварин К.В. 11.02.25 УА #93503
			
			//+ ИнфоСофт Стояк Ю.К. 23.05.2024 УА #76351			
			//Если ФукнциональныеОпции.РежимСозданияЗаказовOzon = 1 Тогда
			//	НоваяСтрока.Склад = Выборка.СкладУТ;
			//ИначеЕсли ЗначениеЗаполнено(ГруппаСкладов) Тогда
			//	НоваяСтрока.Склад = СкладСОстатком;		
			//Иначе
			//	НоваяСтрока.Склад = НовыйДокумент.Склад;
			//КонецЕсли; 
			
			//+ ИнфоСофт Заварин К.В. 30.01.25 УА #88005
			Если ЗначениеЗаполнено(ГруппаСкладов) Тогда
				НоваяСтрока.Склад = СкладСОстатком;
			Иначе
				НоваяСтрока.Склад = НовыйДокумент.Склад;	
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 23.05.2024 УА #76351
			
			НоваяСтрока.КоличествоУпаковок = Элемент.Количество;
			НоваяСтрока.Количество = Элемент.Количество;
			
			НоваяСтрока.ДатаОтгрузки = Выборка.shipment_date;
			
			Если ПродажаОблагаетсяНДС Тогда					
				
				НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС;
				
				//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #67044
				НДС = ИС_MP_РаботаСЗаказами.ПолучитьПроцентНДС(Элемент.Номенклатура.СтавкаНДС);
				//НДС = ИС_WB_СерверУТ11_5.ПолучитьПроцентНДС(Элемент.Номенклатура.СтавкаНДС);
				//- ИнфоСофт Сумин Д.В. 18.12.2023 УА #67044
	
				//+ ИнфоСофт Мурсалимов Д.Р. 24.01.25 УА #91921
				//Если НДС = 0 Или НДС = Неопределено Тогда
				//	НоваяСтрока.СуммаНДС = Элемент.Сумма;						
				//Иначе
				//	НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(Элемент.Сумма, НДС, Истина);						
				//КонецЕсли;                                     
				
				Если НДС = 0 Или НДС = Неопределено Тогда
					НоваяСтрока.СуммаНДС = 0;						
				Иначе
					НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(Элемент.Сумма, НДС, Истина);						
				КонецЕсли;
				//- ИнфоСофт Мурсалимов Д.Р. 24.01.25 УА #91921
				
				НоваяСтрока.Сумма = Элемент.Сумма;
				НоваяСтрока.СуммаСНДС = Элемент.Сумма;	
			Иначе 						
				НоваяСтрока.СуммаНДС = 0;
				НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
				НоваяСтрока.Сумма = Элемент.Сумма;
				НоваяСтрока.СуммаСНДС = Элемент.Сумма;	
			КонецЕсли;	
			
			НоваяСтрока.Цена = Элемент.Цена;
			
			//+ ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			НоваяСтрока.Количество 	= Выборка.КоэффициентУпаковки * НоваяСтрока.Количество;
			НоваяСтрока.Упаковка 	= Элемент.Упаковка;
			//- ИнфоСофт Мурсалимов Д.Р. 04.09.24 УА #82005
			
			//+ ИнфоСофт Заварин К.В. 25.11.24 УА #79380
			Если ФукнциональныеОпции.OzonСоздатьЗаказНаСборку Тогда
				
				НовыйДокумент.Записать();
				ИС_MP_РаботаСЗаказами.ПроверкаНаличияКомплектов(Перечисления.ИС_МП_Маркетплейсы.Озон, НовыйДокумент, Выборка.Склад,, НоваяСтрока);
				НовыйДокумент = НовыйДокумент.ПолучитьОбъект();
				
			КонецЕсли;                                     
			//- ИнфоСофт Заварин К.В. 25.11.24 УА #79380
			
		КонецЦикла; 
		
	КонецЦикла;
	
	НовыйДокумент.ДатаОтгрузки = Выборка.shipment_date;
		
	//+ ИнфоСофт Мурсалимов Д.Р. 15.11.23 УА #66213
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах") Тогда
		НовыйДокумент.СкидкиРассчитаны = Истина;
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 15.11.23 УА #66213
	
	Если ЗначениеЗаполнено(Выборка.СпособДоставки) Тогда
		НовыйДокумент.СпособДоставки = Выборка.СпособДоставки; 
	Иначе
		НовыйДокумент.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;	
	КонецЕсли;
	
	НовыйДокумент.ЗонаДоставки = Выборка.ЗонаДоставки;
	
	Если ЗначениеЗаполнено(Выборка.АдресДоставки) Тогда
		НовыйДокумент.АдресДоставки = Выборка.АдресДоставки;
		НовыйДокумент.АдресДоставкиЗначение = Выборка.АдресДоставкиЗначение;
		НовыйДокумент.АдресДоставкиЗначенияПолей = Выборка.АдресДоставкиЗначенияПолей;
	//+ ИнфоСофт Заварин К.В. 09.09.24 УА #69689	
	Иначе
		НовыйДокумент.АдресДоставки = Выборка.Адрес;
		НовыйДокумент.ДополнительнаяИнформацияПоДоставке = СтрШаблон("Получатель: %1 %2", Выборка.Получатель, Выборка.phone);	
	//- ИнфоСофт Заварин К.В. 09.09.24 УА #69689
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Выборка.Грузополучатель) Тогда 
		НовыйДокумент.Грузополучатель = Выборка.Грузополучатель;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Грузоотправитель) Тогда
		НовыйДокумент.Грузоотправитель = Выборка.Грузоотправитель;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ПеревозчикПартнер) Тогда
		НовыйДокумент.ПеревозчикПартнер = Выборка.ПеревозчикПартнер;	
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	//+ ИнфоСофт Мурсалимов Д.Р. 12.03.24 УА #67173
	//Если ФукнциональныеОпции.OzonСоздатьЗаказНаСборку Тогда
	//	
	//	НовыйДокумент.Записать();
	//	ИС_MP_РаботаСЗаказами.ПроверкаНаличияКомплектов(Перечисления.ИС_МП_Маркетплейсы.Озон, НовыйДокумент, Выборка.Склад);
	//	НовыйДокумент = НовыйДокумент.ПолучитьОбъект();
	//	
	//КонецЕсли;                                     
	//- ИнфоСофт Мурсалимов Д.Р. 12.03.24 УА #67173
	//- ИнфоСофт Заварин К.В. 25.11.24 УА #79380
	
	ЗаписыватьДокумент = Ложь;
	Если ФукнциональныеОпции.ПроводитьЗаказыOzon Тогда
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);		
		Исключение
			ЗаписыватьДокумент = Истина;
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
		
	Иначе
		ЗаписыватьДокумент = Истина;	
	КонецЕсли;

	Если ЗаписыватьДокумент Тогда	
		
		Попытка
			НовыйДокумент.Записать();
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
		
	КонецЕсли;
	
	//+ ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
	Если ИспользованВариантОбеспеченияПриНехватке Тогда 
		Текст = СтрШаблон("%1 создан с использованием варианта обеспечения при нехватке товара", НовыйДокумент.Ссылка);    
    	ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст, УровеньЖурналаРегистрации.Информация);
	КонецЕсли;
	//- ИнфоСофт Тимофеева А.А. 07.04.2025 УА #79192
	
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 06.06.2023 УА #59478

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
Функция ПолучитьЗаказыФБО(Профиль, ДатаПоследнегоОтправления) Экспорт
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	МассивЗагруженныхЗаданий = Новый Массив;     
		
	//offset = 0;	
	
	Пока Истина Цикл
		
		Тело = Новый Структура;
		Тело.Вставить("dir", "asc");
		
		Фильтр = Новый Структура; 
		Фильтр.Вставить("since", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ДатаПоследнегоОтправления, ФорматДатыJSON.ISO
		, ВариантЗаписиДатыJSON.УниверсальнаяДата));
		Фильтр.Вставить("to", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO
		, ВариантЗаписиДатыJSON.УниверсальнаяДата));  
		
		Тело.Вставить("filter", Фильтр);
		Тело.Вставить("limit", 1000);		
		//Тело.Вставить("offset", offset); 		
		
		Дополнительно = Новый Структура;
		Дополнительно.Вставить("analytics_data", Истина);		
		Дополнительно.Вставить("financial_data", Истина);  
		
		Тело.Вставить("with", Дополнительно);
		
		ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Тело);
		
		Результат = ИС_Ozon_API.ПолучитьСписокОтправленийФБО(Профиль, ПараметрыЗапроса);
		
		Если ЗначениеЗаполнено(Результат) Тогда
			
			Для Каждого Элемент Из Результат Цикл 		
				
				СсылкаЗадания = СоздатьИлиОбновитьОтправлениеФБО(Профиль, Элемент, ДатаПоследнегоОтправления);				 
				
				Если Не СсылкаЗадания.Пустая() Тогда
					
					МассивЗагруженныхЗаданий.Добавить(СсылкаЗадания); 
										
					Статус = ПолучитьСтатусСборочногоЗадания(Элемент.status);
					
					ДатаОтгрузки = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Элемент.in_process_at, ФорматДатыJSON.ISO);
										
					ДатаОтгрузкиРекомендуемая = ДатаОтгрузки;
										
					ОбновитьСтатусыЗаказов(Профиль, СсылкаЗадания, Статус, ДатаОтгрузки, ДатаОтгрузкиРекомендуемая);
					
				КонецЕсли;    
				
			КонецЦикла;
			
		Иначе
			Прервать;			
		КонецЕсли;
		
		//offset = offset + Результат.postings.Количество();		
		//
		//Если offset % 1000 <> 0 Тогда
		//	Прервать;
		//КонецЕсли;
		
		Если Результат.Количество() % 1000 <> 0 Тогда
			Прервать;
		КонецЕсли;
								
	КонецЦикла;
	
	Если МассивЗагруженныхЗаданий.Количество() > 0 Тогда
		ПроверитьФункциональныеОпцииСборочныхЗаданий(Профиль, МассивЗагруженныхЗаданий);	
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
Функция СоздатьИлиОбновитьОтправлениеФБО(Профиль, Данные, ДатаПоследнегоОтправления)

    Событие = "СоздатьИлиОбновитьОтправлениеФБО";
	
	Заказ = Документы.ИС_Ozon_Заказ.НайтиПоНомеру(Данные.posting_number);
	
	Если Заказ.Пустая() Тогда
		Заказ = Документы.ИС_Ozon_Заказ.СоздатьДокумент();
	Иначе
		Заказ = Заказ.ПолучитьОбъект();
	КонецЕсли;		
	
	Заказ.Профиль = Профиль;
	
	ЗаполнитьЗначенияСвойств(Заказ, Данные);
	
	Заказ.Номер = Данные.posting_number;
	Заказ.order_id = Данные.order_id;           	
	Заказ.order_number = Данные.order_number; 
		
	Заказ.Дата = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(Данные.in_process_at, ФорматДатыJSON.ISO);			
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_Ozon_Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_Ozon_Склады КАК ИС_Ozon_Склады
		|ГДЕ
		|	ИС_Ozon_Склады.СкладДляЗаказовФБО
		|	И ИС_Ozon_Склады.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Заказ.Склад = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Заказ.ЗаказФБО = Истина;
			
	Заказ.products.Очистить();
	
	Для Каждого Элемент Из Данные.products Цикл	
		
		НоваяСтрока = Заказ.products.Добавить();
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_Номенклатура.Ссылка КАК НоменклатураOzon,
		|	МАКСИМУМ(ИС_Ozon_Штрихкоды.Ссылка) КАК ХарактеристикаOzon
		|ИЗ
		|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Штрихкоды КАК ИС_Ozon_Штрихкоды
		|		ПО ИС_Ozon_Номенклатура.Профиль = ИС_Ozon_Штрихкоды.ЛичныйКабинет
		|			И ИС_Ozon_Номенклатура.Ссылка = ИС_Ozon_Штрихкоды.Карточка
		|ГДЕ
		|	ИС_Ozon_Номенклатура.offer_id = &offer_id
		|	И ИС_Ozon_Номенклатура.Профиль = &Профиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ИС_Ozon_Номенклатура.Ссылка";
		
		Запрос.УстановитьПараметр("offer_id", Элемент.offer_id);
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаНоменклатуры = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаНоменклатуры.Следующий() Цикл
			
			НоваяСтрока.НоменклатураOzon = ВыборкаНоменклатуры.НоменклатураOzon;	
			НоваяСтрока.ХарактеристикаOzon = ВыборкаНоменклатуры.ХарактеристикаOzon; 
			
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.НоменклатураOzon) Тогда
			
			НоваяСтрока.НоменклатураOzon = Справочники.ИС_Ozon_Номенклатура.НайтиПоРеквизиту("offer_id", Элемент.offer_id);	
			НоваяСтрока.ХарактеристикаOzon = Справочники.ИС_Ozon_Штрихкоды.НайтиПоНаименованию(НоваяСтрока.НоменклатураOzon.Штрихкод, Истина);
			
		КонецЕсли;
		
		НоваяСтрока.price = Число(Элемент.price);	
		НоваяСтрока.Сумма = Число(Элемент.price) * Элемент.quantity;	
		НоваяСтрока.quantity = Элемент.quantity;
		
	КонецЦикла;
	
	Попытка	      
		
		Заказ.Записать(РежимЗаписиДокумента.Запись);
		ДатаПоследнегоОтправления = Заказ.Дата;
		
		Возврат Заказ.Ссылка;		
	
	Исключение
		ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Текст = СтрШаблон("Произошла ошибка при записи элемента Заказ Ozon: %1",	ИнформацияОбОшибке);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	КонецПопытки;
	
	Возврат Документы.ИС_Ozon_Заказ.ПустаяСсылка();

КонецФункции //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
Процедура ОбновитьСтатусыСборочныхЗаданийФБО(Профиль, _7Дней = 604800) Экспорт
	
	Событие = "ОбновитьСтатусыСборочныхЗаданийOzon";
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_Заказ.Ссылка КАК Ссылка,
	|	ИС_Ozon_Заказ.Номер КАК Номер,
	|	ИС_Ozon_Заказ.Заказ КАК Заказ,
	|	ИС_Ozon_СтатусыСборочныхЗаданий.status КАК status,	
	|	ИС_Ozon_СтатусыСборочныхЗаданий.recommended_shipment_date КАК ДатаОтгрузкиРекомендуемая,	
	|	ИС_Ozon_СтатусыСборочныхЗаданий.shipment_date КАК ДатаОтгрузки	
	|ПОМЕСТИТЬ ВТ_Данные                                              	
	|ИЗ
	|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
	|		ПО (ИС_Ozon_Заказ.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ)
	|			И (ИС_Ozon_Заказ.Профиль = &Профиль)
	|ГДЕ
	|	НЕ ИС_Ozon_СтатусыСборочныхЗаданий.status ЕСТЬ NULL
	|	И ИС_Ozon_СтатусыСборочныхЗаданий.status В(&Статусы)
	|	И ИС_Ozon_Заказ.Дата >= &Дата	
	|	И ИС_Ozon_Заказ.ЗаказФБО	
	|;
	|		
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Ссылка КАК Заказ,
	|	ПередачаТоваровХранителю.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ_РеализацииВсе
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ВТ_Данные.Заказ = ПередачаТоваровХранителю.ЗаказКлиента
	|			И (НЕ ВТ_Данные.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Данные.Ссылка,
	|	ПередачаТоваровХранителюТовары.Ссылка
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО ВТ_Данные.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента
	|			И (НЕ ВТ_Данные.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Данные.Ссылка,
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Данные.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
	|			И (НЕ ВТ_Данные.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Данные.Ссылка,
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_Данные.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
	|			И (НЕ ВТ_Данные.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Заказ КАК Заказ,
	|	МАКСИМУМ(ВТ_Реализации.Реализация) КАК Реализация,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	ВТ_РеализацииВсе КАК ВТ_Реализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Ссылка КАК Ссылка,
	|	ВТ_Данные.Номер КАК Номер,
	|	ВТ_Данные.Заказ КАК Заказ,
	|	ВТ_Данные.status КАК status,
	|	ВТ_Данные.ДатаОтгрузкиРекомендуемая КАК ДатаОтгрузкиРекомендуемая,	
	|	ВТ_Данные.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЕСТЬNULL(ВТ_Реализации.Количество, 0) КАК КоличествоРТУ
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|		ПО ВТ_Данные.Ссылка = ВТ_Реализации.Заказ";	

	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_deliver);
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_packaging);
	Статусы.Добавить(Перечисления.ИС_Ozon_СтатусыОтправлений.delivering);
	
	Запрос.УстановитьПараметр("Статусы", Статусы);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса() - _7Дней);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);  
		
	НастройкиСборочныхЗаданий = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);	
	
	Пока Выборка.Следующий() Цикл
		
		Результат = ИС_Ozon_API.ПолучитьИнформциюПоОтправлениюФБО(Профиль, ПараметрыЗапроса, Выборка.Номер);	 
		
		Если Результат = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Статус = ПолучитьСтатусСборочногоЗадания(Результат.status);
							
		Если Статус = Выборка.status Тогда
			Продолжить;	
		КонецЕсли;
		
		ОбновитьСтатусыЗаказов(Профиль, Выборка.Ссылка, Статус, Выборка.ДатаОтгрузки, Выборка.ДатаОтгрузкиРекомендуемая);
					
	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
Процедура ЗагрузитьЗаказыПоВсемСхемам(Профиль, ДатаПоследнегоОтправления, ДатаПоследнегоОтправленияФБО, ОбработатьТолькоСтатусы = Ложь) Экспорт
	ПолучитьЗаказы(Профиль, ДатаПоследнегоОтправления, ОбработатьТолькоСтатусы);
	ПолучитьЗаказыФБО(Профиль, ДатаПоследнегоОтправленияФБО);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469

//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
Процедура ОбновитьСтатусыЗаказовПоВсемСхемам(Профиль, _7Дней = 604800) Экспорт
	ОбновитьСтатусыСборочныхЗаданий(Профиль, _7Дней);
	ОбновитьСтатусыСборочныхЗаданийФБО(Профиль, _7Дней);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	
#КонецОбласти

#Область ДанныеОтчетов     

//+ ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621
Процедура ЗагрузитьДанныеОК(Профиль, Дата) Экспорт
	
	Событие = ПолучитьИмяСобытия("ЗагрузитьДанныеОК");
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	Кэш = Новый Структура;
	Исключения = Новый Структура;
	
	ЗаполчитьКэшПараметров(Кэш, Исключения);
	
	Результат = ИС_Ozon_API.ПолучитьОтчетОПродажахПоРеализации(Профиль, ПараметрыЗапроса, Дата);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.header.Свойство("num") Тогда
		num = Результат.header.num;
	Иначе
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , "Не найдено поле num");		
		Возврат;
	КонецЕсли;
	
	Если Результат.header.Свойство("stop_date") Тогда
		stop_date = Результат.header.stop_date;
	Иначе
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , "Не найдено поле stop_date");
		Возврат;
	КонецЕсли;
	
	Если Результат.header.Свойство("start_date") Тогда
		start_date = Результат.header.start_date;
	Иначе
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , "Не найдено поле start_date");
		Возврат;
	КонецЕсли; 
	
	Если Результат.header.Свойство("doc_date") Тогда
		doc_date = Результат.header.doc_date;
	Иначе
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , "Не найдено поле doc_date");
		Возврат;
	КонецЕсли;
	
	stop_date = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(stop_date, ФорматДатыJSON.ISO);
	doc_date = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(doc_date, ФорматДатыJSON.ISO);		
	start_date = ИС_MP_РаботаСHTTPЗапросамиСервер.ПрочитатьДатуИзJSON(start_date, ФорматДатыJSON.ISO);
	
	НаборЗаписей = РегистрыСведений.ИС_Ozon_ДанныеОтчетовРеализации.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(start_date);
	НаборЗаписей.Отбор.Профиль.Установить(Профиль);
	НаборЗаписей.Отбор.rrd_id.Установить(num); 
	
	Для Каждого Элемент Из Результат.rows Цикл   
		
		Если Элемент.Свойство("row_number") Тогда
			row_number = Элемент.row_number;
		Иначе
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , "Не найдено поле doc_date");
			Продолжить;
		КонецЕсли; 
		
		Для Каждого Параметр Из Элемент Цикл
			
			Если Исключения.Свойство(Параметр.Ключ) Тогда
				Продолжить;	
			КонецЕсли;
			
			Если Кэш.Свойство(Параметр.Ключ) Тогда
				Свойство = Кэш[Параметр.Ключ];
			Иначе
				
				НовыйЭлемент = Справочники.ИС_Ozon_ПараметрыОтчетовРеализации.СоздатьЭлемент();
				НовыйЭлемент.Наименование = Параметр.Ключ;
				
				Попытка
					НовыйЭлемент.Записать();
				Исключение
					ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					Продолжить;
				КонецПопытки;
				
				Кэш.Вставить(Параметр.Ключ, НовыйЭлемент.Ссылка);
				Свойство = НовыйЭлемент.Ссылка;
				
			КонецЕсли;
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = start_date;
			НоваяЗапись.row_number = row_number;						
			НоваяЗапись.num = num;
			НоваяЗапись.stop_date = stop_date;
			НоваяЗапись.doc_date = doc_date;
			НоваяЗапись.Параметр = Свойство;				
			НоваяЗапись.Профиль = Профиль;
			НоваяЗапись.Значение = Параметр.Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);		
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621

//+ ИнфоСофт Стояк Ю.К. 22.03.2024 УА #62623
Процедура ЗагрузитьДанныеУслуг(Профиль, ДатаТело) Экспорт
	
	Событие = ПолучитьИмяСобытия("ЗагрузитьДанныеУслуг");
	
 	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
		
	Если НастройкиСоединения = Неопределено Тогда
		ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	КонецЕсли;  
			
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить("services");
	МассивТипов.Добавить("compensation");
	МассивТипов.Добавить("transferDelivery");
	МассивТипов.Добавить("other");
	//+ ИнфоСофт Стояк Ю.К. 25.03.2025 УА #67821
	МассивТипов.Добавить("orders");
	МассивТипов.Добавить("returns ");
	//- ИнфоСофт Стояк Ю.К. 25.03.2025 УА #67821
	
	РазмерСтраницы = 1000;
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("page_size", РазмерСтраницы);
	
	Для Каждого Тип Из МассивТипов Цикл  
		
		Фильтр = Новый Структура;
		
		Фильтр.Вставить("transaction_type", Тип);
		Фильтр.Вставить("date", ДатаТело);     
		
		ТелоЗапроса.Вставить("filter", Фильтр);
		
		НомерСтраницы = 1; 
		
		Пока Истина Цикл 
			
			ТелоЗапроса.Вставить("page", НомерСтраницы);
			
			Результат = ИС_Ozon_API.ПолучитьДанныеПоУслугам(Профиль, ПараметрыЗапроса, ТелоЗапроса);
			
			Если Результат = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			//+ ИнфоСофт Стояк Ю.К. 02.10.2024 УА #84454
			Если Результат.page_count = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Данных по улсугам не найдено за выбранный период.");
				Прервать;
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 02.10.2024 УА #84454
			
			Если Результат.operations.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого Элемент Из Результат.operations Цикл 
				
				СтроковаяДата = Элемент.operation_date;             
				СтроковаяДата = СтрЗаменить(СтроковаяДата, "-", "");
				СтроковаяДата = СтрЗаменить(СтроковаяДата, " ", "");
				СтроковаяДата = СтрЗаменить(СтроковаяДата, ":", ""); 
				
				operation_date = Дата(СтроковаяДата);    
				
				Если Элемент.posting.order_date <> "" Тогда
					СтроковаяДата = Элемент.posting.order_date;
					СтроковаяДата = СтрЗаменить(СтроковаяДата, "-", "");
					СтроковаяДата = СтрЗаменить(СтроковаяДата, " ", "");
					СтроковаяДата = СтрЗаменить(СтроковаяДата, ":", "");	
					
					order_date = Дата(СтроковаяДата);          
				Иначе                                      
					order_date = operation_date;
				КонецЕсли;
					
				НаборЗаписей = РегистрыСведений.ИС_Ozon_ДанныеУслуг.СоздатьНаборЗаписей();
				
				НаборЗаписей.Отбор.Период.Установить(operation_date);
				НаборЗаписей.Отбор.Профиль.Установить(Профиль);
				НаборЗаписей.Отбор.operation_id.Установить(Элемент.operation_id);
				НаборЗаписей.Отбор.operation_type.Установить(Элемент.operation_type);
				НаборЗаписей.Отбор.posting_number.Установить(Элемент.posting.posting_number);
				
				ТребуетсяНоваяЗапись = Истина;	
				
				Если НаборЗаписей.Количество() > 0 Тогда 
					
					Для Каждого Запись Из НаборЗаписей Цикл
						
						Если Запись.amount = Элемент.amount И Запись.delivery_charge = Элемент.delivery_charge
							И Запись.return_delivery_charge = Элемент.return_delivery_charge И Запись.accruals_for_sale = Элемент.accruals_for_sale
							И Запись.sale_commission = Элемент.sale_commission Тогда
							ТребуетсяНоваяЗапись 	= Ложь;
							Прервать;
							
						КонецЕсли;
						
					КонецЦикла; 	
					
				КонецЕсли;
				
				Если ТребуетсяНоваяЗапись Тогда
					
					НоваяЗапись = НаборЗаписей.Добавить(); 
					
					НоваяЗапись.Период = operation_date;
					НоваяЗапись.operation_id = Элемент.operation_id;
					НоваяЗапись.operation_type = Элемент.operation_type;
					НоваяЗапись.posting_number = Элемент.posting.posting_number; 
					
					НоваяЗапись.delivery_charge = Элемент.delivery_charge;
					НоваяЗапись.return_delivery_charge = Элемент.return_delivery_charge;
					НоваяЗапись.accruals_for_sale = Элемент.accruals_for_sale;
					НоваяЗапись.sale_commission = Элемент.sale_commission;
					НоваяЗапись.amount = Элемент.amount;     
					
					НоваяЗапись.operation_type_name = Элемент.operation_type_name;
					НоваяЗапись.warehouse_id = Элемент.posting.warehouse_id;
					НоваяЗапись.delivery_schema = Элемент.posting.delivery_schema;
					НоваяЗапись.type = Перечисления.ИС_Ozon_ТипыОперацийВТранзакциях[Элемент.type];
					НоваяЗапись.order_date = order_date;
					
					НоваяЗапись.Профиль = Профиль;
					
					НаборЗаписей.Записать(Истина);
					
				КонецЕсли;
				
			КонецЦикла; 
			
			Если НомерСтраницы = Результат.page_count Тогда
				Прервать; 
			КонецЕсли;
			
			НомерСтраницы = НомерСтраницы + 1;
			
		КонецЦикла; 
		
	КонецЦикла;
	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.03.2024 УА #62623

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 19.01.23 УА #53535
Функция ПолучитьНастройкиСоединенияПрофиля(Профиль) Экспорт
	
	НастройкиСоединения = ИС_Ozon_СерверПовтИсп.ПолучитьНастройкиСоединения(Профиль);
	
	Если НастройкиСоединения.Количество() = 0 Тогда
		ВызватьИсключение("Не удалось получить настройки подключения, проверьте настройки авторизации");
	КонецЕсли;
	
	Возврат НастройкиСоединения;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 19.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.01.23 УА #53535
Функция ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения) Экспорт
    
    Если Не ЗначениеЗаполнено(НастройкиСоединения["OzonАдресСервисаAPI"]) Тогда
		ВызватьИсключение("Для данного профиля не заполнен ""Адрес Сервиса Ozon"", проверьте настройки авторизации");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения["OzonApiKey"]) Тогда
		ВызватьИсключение("Для данного профиля не заполнен ""Ozon Api Key"", проверьте настройки авторизации");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения["OzonClientID"]) Тогда
		ВызватьИсключение("Для данного профиля не заполнен ""Ozon Client ID"", проверьте настройки авторизации");
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
	
	ПараметрыЗапроса.Сервер = НастройкиСоединения["OzonАдресСервисаAPI"];
	ПараметрыЗапроса.Порт = 443;
	ПараметрыЗапроса.ЗащищенноеСоединение = Истина;
	ПараметрыЗапроса.Заголовки.Вставить("Client-Id", НастройкиСоединения["OzonClientID"]);
	ПараметрыЗапроса.Заголовки.Вставить("Api-Key", НастройкиСоединения["OzonApiKey"]);
	
	Возврат ПараметрыЗапроса;
   	    
КонецФункции //- ИнфоСофт Ивонин К.А. 19.01.23 УА #53535

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Функция ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль) Экспорт
	
	Событие = "ПолучитьНастройкиФункциональностиСборочныхЗвданий";
	Параметры = Новый Структура;
	
	МассивНаименованийПараметров = Новый Массив;  
		
	МассивНаименованийПараметров.Добавить("АвтоматическиСоздаватьЗаказыOzon");
	МассивНаименованийПараметров.Добавить("РежимСозданияЗаказовOzon");
	МассивНаименованийПараметров.Добавить("АктивныйЗаказКлиентаOzon");
	МассивНаименованийПараметров.Добавить("РассчитыватьДатыОтгрузкиOzon");
	МассивНаименованийПараметров.Добавить("ВремяОтсчетаOzon");
	МассивНаименованийПараметров.Добавить("КоличествоДнейКОтгрузкеOzon");
	МассивНаименованийПараметров.Добавить("АвтоматическиСоздаватьРеализацииOzon");
	МассивНаименованийПараметров.Добавить("КоличествоДнейКРеализацииOzon");
	
	МассивНаименованийПараметров.Добавить("ПартнерOzon");
	МассивНаименованийПараметров.Добавить("КонтрагентOzon");
	МассивНаименованийПараметров.Добавить("СоглашениеOzon");
	МассивНаименованийПараметров.Добавить("ДоговорOzon");
	МассивНаименованийПараметров.Добавить("ПодразделениеOzon");
	МассивНаименованийПараметров.Добавить("ПриоритетЗаказаOzon");
	МассивНаименованийПараметров.Добавить("OzonВидЦеныСоСкидкой");
	МассивНаименованийПараметров.Добавить("Организация");
	
	//+ ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
	МассивНаименованийПараметров.Добавить("ФормироватьЕдиныйЗаказБезРазбиенияOzon");
	//- ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
	
	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	МассивНаименованийПараметров.Добавить("ИспользоватьРазбиениеПоСкладамOzon");
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	
	//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	МассивНаименованийПараметров.Добавить("ЗакрытиеЗаказаПоДатеОтгрузкиOzon");
	//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175 
	
	МассивНаименованийПараметров.Добавить("ПроводитьЗаказыOzon");
	МассивНаименованийПараметров.Добавить("ПроводитьРеализацииOzon");
	МассивНаименованийПараметров.Добавить("ВариантОбеспеченияOzon");
	
	//+ ИнфоСофт Мурсалимов Д.Р. 12.02.24 УА #63850
	МассивНаименованийПараметров.Добавить("ПричинаОтменыOzon"); 
	МассивНаименованийПараметров.Добавить("УдалятьРТУOzon");
	//- ИнфоСофт Мурсалимов Д.Р. 12.02.24 УА #63850          
	
	//+ ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	МассивНаименованийПараметров.Добавить("ПроверятьДатуПередУдалениемOzon");
	//- ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	
	//+ ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	МассивНаименованийПараметров.Добавить("ДатаОтгрузкиИлиТекущаяДатаВРеализациюOzon");
	//- ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	//+ ИнфоСофт Мурсалимов Д.Р. 13.03.24 УА #67173   
	МассивНаименованийПараметров.Добавить("OzonРассчитатьНесобранныеКомплекты");
	МассивНаименованийПараметров.Добавить("OzonСоздатьЗаказНаСборку");
	//- ИнфоСофт Мурсалимов Д.Р. 13.03.24 УА #67173
	//+ ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
	МассивНаименованийПараметров.Добавить("ВариантОбеспеченияПриНехваткеOzon");
	МассивНаименованийПараметров.Добавить("ИзменятьДатуОтгрузкиOzon");
	//- ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	МассивНаименованийПараметров.Добавить("OzonКоличествоДнейОбновлениеСтатусов");
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800 
	
	//+ ИнфоСофт Заварин К.В. 04.09.24 УА #69327
	МассивНаименованийПараметров.Добавить("OzonАвтоматическиСобиратьЗаказы");
	//- ИнфоСофт Заварин К.В. 04.09.24 УА #69327
	//+ ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87933
	МассивНаименованийПараметров.Добавить("OzonСтатусЗаказа");
	//- ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87933
	
	//+ ИнфоСофт Заварин К.В. 27.11.24 УА #74680
	МассивНаименованийПараметров.Добавить("OzonСоглашениеРеализации");
	МассивНаименованийПараметров.Добавить("OzonДоговорРеализации");
	МассивНаименованийПараметров.Добавить("OzonСкладРеализации");
	//- ИнфоСофт Заварин К.В. 27.11.24 УА #74680
	
	//+ ИнфоСофт Заварин К.В. 11.02.25 УА #93503
	МассивНаименованийПараметров.Добавить("OzonОтделятьТоварыПриНехватке");
	//- ИнфоСофт Заварин К.В. 11.02.25 УА #93503
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	МассивНаименованийПараметров.Добавить("ОзонЗагружатьЗаказыПоСхемеФБО");
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732   
	МассивНаименованийПараметров.Добавить("OzonРежимСозданияРеализаций");
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	
	ПараметрыСоединения = Новый Структура;
	
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);
	
	Если Настройки = Неопределено Тогда
		
		Текст = "Параметры создания заказов не установлены";
		ЗаписьЖурналаРегистрации("ИС.OZON." + Событие, УровеньЖурналаРегистрации.Ошибка, , , Текст);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Ложь;
		
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87933
	Если Настройки["OzonСтатусЗаказа"] <> Неопределено Тогда
		Параметры.Вставить("OzonСтатусЗаказа", Настройки["OzonСтатусЗаказа"]);
	Иначе
		Параметры.Вставить("OzonСтатусЗаказа", Неопределено);
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87933
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800	
	Если Настройки["OzonКоличествоДнейОбновлениеСтатусов"] <> Неопределено Тогда
		Параметры.Вставить("OzonКоличествоДнейОбновлениеСтатусов", Настройки["OzonКоличествоДнейОбновлениеСтатусов"]);
	Иначе
		Параметры.Вставить("OzonКоличествоДнейОбновлениеСтатусов", 7);
	КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	
	//+ ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
	Если Настройки["ИзменятьДатуОтгрузкиOzon"] <> Неопределено Тогда
		Параметры.Вставить("ИзменятьДатуОтгрузкиOzon", Настройки["ИзменятьДатуОтгрузкиOzon"]);
	Иначе
		Параметры.Вставить("ИзменятьДатуОтгрузкиOzon", Ложь);
	КонецЕсли;
	
	Если Настройки["ВариантОбеспеченияПриНехваткеOzon"] <> Неопределено Тогда
		Параметры.Вставить("ВариантОбеспеченияПриНехваткеOzon", Настройки["ВариантОбеспеченияПриНехваткеOzon"]);
	Иначе
		Параметры.Вставить("ВариантОбеспеченияПриНехваткеOzon", Неопределено);
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 18.03.2024 УА #64801
	
	//+ ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	Если Настройки["ДатаОтгрузкиИлиТекущаяДатаВРеализациюOzon"] <> Неопределено Тогда
		Параметры.Вставить("ДатаОтгрузкиИлиТекущаяДатаВРеализациюOzon", Настройки["ДатаОтгрузкиИлиТекущаяДатаВРеализациюOzon"]);
	Иначе
		Параметры.Вставить("ДатаОтгрузкиИлиТекущаяДатаВРеализациюOzon", Ложь);
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 07.03.2024 УА #66113
	
	//+ ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146
	Если Настройки["ФормироватьЕдиныйЗаказБезРазбиенияOzon"] <> Неопределено Тогда
		Параметры.Вставить("ФормироватьЕдиныйЗаказБезРазбиенияOzon", Настройки["ФормироватьЕдиныйЗаказБезРазбиенияOzon"]);
	Иначе
		Параметры.Вставить("ФормироватьЕдиныйЗаказБезРазбиенияOzon", Ложь);
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 27.10.2023 УА #65146 
	
	//+ ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	Если Настройки["ИспользоватьРазбиениеПоСкладамOzon"] <> Неопределено Тогда
		Параметры.Вставить("ИспользоватьРазбиениеПоСкладамOzon", Настройки["ИспользоватьРазбиениеПоСкладамOzon"]);
	Иначе
		Параметры.Вставить("ИспользоватьРазбиениеПоСкладамOzon", Ложь);
	КонецЕсли;
	//- ИнфоСофт Макарова Н.Е. 01.04.2025 УА #77424
	
	//+ ИнфоСофт Заварин К.В. 26.04.24 УА #74175
	Если Настройки["ЗакрытиеЗаказаПоДатеОтгрузкиOzon"] <> Неопределено Тогда
		Параметры.Вставить("ЗакрытиеЗаказаПоДатеОтгрузкиOzon", Настройки["ЗакрытиеЗаказаПоДатеОтгрузкиOzon"]);
	Иначе
		Параметры.Вставить("ЗакрытиеЗаказаПоДатеОтгрузкиOzon", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 26.04.24 УА #74175 
	//+ ИнфоСофт Заварин К.В. 04.09.24 УА #69327
	Если Настройки["OzonАвтоматическиСобиратьЗаказы"] <> Неопределено Тогда
		Параметры.Вставить("OzonАвтоматическиСобиратьЗаказы", Настройки["OzonАвтоматическиСобиратьЗаказы"]);
	Иначе
		Параметры.Вставить("OzonАвтоматическиСобиратьЗаказы", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 04.09.24 УА #69327

	Если Настройки["АвтоматическиСоздаватьЗаказыOzon"] <> Неопределено Тогда
		Параметры.Вставить("АвтоматическиСоздаватьЗаказыOzon", Настройки["АвтоматическиСоздаватьЗаказыOzon"]);
	Иначе
		Параметры.Вставить("АвтоматическиСоздаватьЗаказыOzon", Ложь);
	КонецЕсли;
	
	Если Настройки["РежимСозданияЗаказовOzon"] <> Неопределено Тогда
		Параметры.Вставить("РежимСозданияЗаказовOzon", Настройки["РежимСозданияЗаказовOzon"]);
	Иначе
		Параметры.Вставить("РежимСозданияЗаказовOzon", 0);
	КонецЕсли;
	
	Параметры.Вставить("АктивныйЗаказКлиентаOzon", Настройки["АктивныйЗаказКлиентаOzon"]);
	
	Если Настройки["РассчитыватьДатыОтгрузкиOzon"] <> Неопределено Тогда
		Параметры.Вставить("РассчитыватьДатыОтгрузкиOzon", Настройки["РассчитыватьДатыОтгрузкиOzon"]); 
	Иначе
		Параметры.Вставить("РассчитыватьДатыОтгрузкиOzon", Ложь);
	КонецЕсли;
	
	Если Настройки["ВремяОтсчетаOzon"] <> Неопределено Тогда
		Параметры.Вставить("ВремяОтсчетаOzon", Настройки["ВремяОтсчетаOzon"]);
	Иначе
		Параметры.Вставить("ВремяОтсчетаOzon", Дата(1,1,1));
	КонецЕсли;
	
	Если Настройки["КоличествоДнейКОтгрузкеOzon"] <> Неопределено Тогда
		Параметры.Вставить("КоличествоДнейКОтгрузкеOzon", Настройки["КоличествоДнейКОтгрузкеOzon"]);
	Иначе
		Параметры.Вставить("КоличествоДнейКОтгрузкеOzon", 0);
	КонецЕсли;
	
	Если Настройки["АвтоматическиСоздаватьРеализацииOzon"] <> Неопределено Тогда
		Параметры.Вставить("АвтоматическиСоздаватьРеализацииOzon", Настройки["АвтоматическиСоздаватьРеализацииOzon"]);
	Иначе
		Параметры.Вставить("АвтоматическиСоздаватьРеализацииOzon", Ложь);
	КонецЕсли;
	
	Если Настройки["КоличествоДнейКРеализацииOzon"] <> Неопределено Тогда
		Параметры.Вставить("КоличествоДнейКРеализацииOzon", Настройки["КоличествоДнейКРеализацииOzon"]); 
	Иначе
		Параметры.Вставить("КоличествоДнейКРеализацииOzon", 0);
	КонецЕсли;
	
	Если Настройки["ПроводитьЗаказыOzon"] <> Неопределено Тогда
		Параметры.Вставить("ПроводитьЗаказыOzon", Настройки["ПроводитьЗаказыOzon"]);
	Иначе
		Параметры.Вставить("ПроводитьЗаказыOzon", Ложь);
	КонецЕсли;
	
	Если Настройки["ПроводитьРеализацииOzon"] <> Неопределено Тогда
		Параметры.Вставить("ПроводитьРеализацииOzon", Настройки["ПроводитьРеализацииOzon"]);
	Иначе
		Параметры.Вставить("ПроводитьРеализацииOzon", Ложь);
	КонецЕсли; 
	
	Если Настройки["ВариантОбеспеченияOzon"] <> Неопределено Тогда
		Параметры.Вставить("ВариантОбеспеченияOzon", Настройки["ВариантОбеспеченияOzon"]);
	Иначе
		Параметры.Вставить("ВариантОбеспеченияOzon", Неопределено);
	КонецЕсли;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 12.02.24 УА #63850	
	Если Настройки["ПричинаОтменыOzon"] <> Неопределено Тогда
		Параметры.Вставить("ПричинаОтменыOzon", Настройки["ПричинаОтменыOzon"]); 
	Иначе
		Параметры.Вставить("ПричинаОтменыOzon", Неопределено);
	КонецЕсли;
	
	Если Настройки["УдалятьРТУOzon"] <> Неопределено Тогда
		Параметры.Вставить("УдалятьРТУOzon", Настройки["УдалятьРТУOzon"]); 
	Иначе
		Параметры.Вставить("УдалятьРТУOzon", Ложь);
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 12.02.24 УА #63850 
	
	//+ ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	Если Настройки["ПроверятьДатуПередУдалениемOzon"] <> Неопределено Тогда
		Параметры.Вставить("ПроверятьДатуПередУдалениемOzon", Настройки["ПроверятьДатуПередУдалениемOzon"]); 
	Иначе
		Параметры.Вставить("ПроверятьДатуПередУдалениемOzon", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 25.09.24 УА #77549
	
	//+ ИнфоСофт Мурсалимов Д.Р. 13.03.24 УА #67173
	Если Настройки["OzonСоздатьЗаказНаСборку"] <> Неопределено Тогда
		Параметры.Вставить("OzonСоздатьЗаказНаСборку", Настройки["OzonСоздатьЗаказНаСборку"]); 
	Иначе
		Параметры.Вставить("OzonСоздатьЗаказНаСборку", Ложь);
	КонецЕсли;
	
	Если Настройки["OzonРассчитатьНесобранныеКомплекты"] <> Неопределено Тогда
		Параметры.Вставить("OzonРассчитатьНесобранныеКомплекты", Настройки["OzonРассчитатьНесобранныеКомплекты"]); 
	Иначе
		Параметры.Вставить("OzonРассчитатьНесобранныеКомплекты", Ложь);
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 13.03.24 УА #67173
	
	//+ ИнфоСофт Заварин К.В. 27.11.24 УА #74680
	Если Настройки["OzonСоглашениеРеализации"] <> Неопределено Тогда
		Параметры.Вставить("OzonСоглашениеРеализации", Настройки["OzonСоглашениеРеализации"]); 
	Иначе
		Параметры.Вставить("OzonСоглашениеРеализации", Ложь);
	КонецЕсли;
	
	Если Настройки["OzonДоговорРеализации"] <> Неопределено Тогда
		Параметры.Вставить("OzonДоговорРеализации", Настройки["OzonДоговорРеализации"]); 
	Иначе
		Параметры.Вставить("OzonДоговорРеализации", Ложь);
	КонецЕсли;
	
	Если Настройки["OzonСкладРеализации"] <> Неопределено Тогда
		Параметры.Вставить("OzonСкладРеализации", Настройки["OzonСкладРеализации"]); 
	Иначе
		Параметры.Вставить("OzonСкладРеализации", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 27.11.24 УА #74680
	
	//+ ИнфоСофт Заварин К.В. 11.02.25 УА #93503
	Если Настройки["OzonОтделятьТоварыПриНехватке"] <> Неопределено Тогда
		Параметры.Вставить("OzonОтделятьТоварыПриНехватке", Настройки["OzonОтделятьТоварыПриНехватке"]); 
	Иначе
		Параметры.Вставить("OzonОтделятьТоварыПриНехватке", Ложь);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 11.02.25 УА #93503  
	
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	Если Настройки["ОзонЗагружатьЗаказыПоСхемеФБО"] <> Неопределено Тогда
		Параметры.Вставить("ОзонЗагружатьЗаказыПоСхемеФБО", Настройки["ОзонЗагружатьЗаказыПоСхемеФБО"]);
	Иначе
		Параметры.Вставить("ОзонЗагружатьЗаказыПоСхемеФБО", Ложь);
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	Если Настройки["OzonРежимСозданияРеализаций"] <> Неопределено Тогда
		Параметры.Вставить("OzonРежимСозданияРеализаций", Настройки["OzonРежимСозданияРеализаций"]);
	Иначе
		Параметры.Вставить("OzonРежимСозданияРеализаций", 0);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96732
	
	Параметры.Вставить("ПартнерOzon", Настройки["ПартнерOzon"]);
	Параметры.Вставить("КонтрагентOzon", Настройки["КонтрагентOzon"]);
	Параметры.Вставить("СоглашениеOzon", Настройки["СоглашениеOzon"]); 
	Параметры.Вставить("ДоговорOzon", Настройки["ДоговорOzon"]);
	Параметры.Вставить("ПодразделениеOzon", Настройки["ПодразделениеOzon"]);
	Параметры.Вставить("ПриоритетЗаказаOzon", Настройки["ПриоритетЗаказаOzon"]); 	
	Параметры.Вставить("OzonВидЦеныСоСкидкой", Настройки["OzonВидЦеныСоСкидкой"]); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_Профили.Организация КАК Организация
	|ИЗ
	|	Справочник.ИС_WB_Профили КАК ИС_WB_Профили
	|ГДЕ
	|	ИС_WB_Профили.Ссылка = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Параметры.Вставить("Организация", ВыборкаДетальныеЗаписи.Организация);
	КонецЦикла;
		
	Возврат Параметры;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628 

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Процедура ПроверитьФункциональныеОпцииСборочныхЗаданий(Профиль, МассивЗаданий)

	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Если ФукнциональныеОпции.АвтоматическиСоздаватьЗаказыOzon Тогда	
		СоздатьЗаказы(Профиль, МассивЗаданий);		
	КонецЕсли;
	
	Если ФукнциональныеОпции.АвтоматическиСоздаватьРеализацииOzon 
		И ФукнциональныеОпции.РежимСозданияЗаказовOzon <> 2 Тогда	
		СоздатьРеализации(Профиль, МассивЗаданий);		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Функция ДобавитьСопоставление(ТаблицаТранзакций, Профиль) Экспорт
	
	МассивSKU 					= ТаблицаТранзакций.ВыгрузитьКолонку("SKU");
	МассивSKU 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивSKU);
	SKUТоваров					= ОчиститьПустыеЗначенияМассива(МассивSKU);
	ОсновныеТоварыПоУцененным 	= ОсновныеТоварыПоУцененным(Профиль, SKUТоваров);
	
	Для Каждого транзакция Из ТаблицаТранзакций Цикл
		
		Если Не ОсновныеТоварыПоУцененным.Получить(транзакция.sku) = Неопределено Тогда
			транзакция.sku = ОсновныеТоварыПоУцененным.Получить(транзакция.sku);
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса =
	
	//+ ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566
	"ВЫБРАТЬ
	|	втТаблицаТранзакций.НаименованиеТовара КАК НаименованиеТовара,
	|	втТаблицаТранзакций.offer_id КАК offer_id,
	|	втТаблицаТранзакций.SKU КАК SKU,
	|	втТаблицаТранзакций.ШтрихКодТовара КАК ШтрихКодТовара,
	|	втТаблицаТранзакций.ЦенаПродовцаСУчетомСкидки КАК ЦенаПродовцаСУчетомСкидки,
	|	втТаблицаТранзакций.КомиссияЗаПродажуПоКатегорииПроцент КАК КомиссияЗаПродажуПоКатегорииПроцент,
	|	втТаблицаТранзакций.ЦенаРеализация КАК ЦенаРеализация,
	|	втТаблицаТранзакций.СуммаЛояльностиРеализации КАК СуммаЛояльностиРеализации,
	|	втТаблицаТранзакций.Количество КАК Количество,
	|	втТаблицаТранзакций.РеализованоНаСумму КАК РеализованоНаСумму,
	|	втТаблицаТранзакций.ДоплатаЗаСчетOzon КАК ДоплатаЗаСчетOzon,
	|	втТаблицаТранзакций.ИтогиКомиссияСУчетомСкидокИНаценок КАК ИтогиКомиссияСУчетомСкидокИНаценок,
	|	втТаблицаТранзакций.ИтогиКНачислению КАК ИтогиКНачислению,
	|	втТаблицаТранзакций.ВозвратЦенаРеализации КАК ВозвратЦенаРеализации,
	|	втТаблицаТранзакций.СуммаЛояльностиВозврата КАК СуммаЛояльностиВозврата,
	|	втТаблицаТранзакций.ВозвратКоличество КАК ВозвратКоличество,
	|	втТаблицаТранзакций.ВозвращеноНаСумму КАК ВозвращеноНаСумму,
	|	втТаблицаТранзакций.ВозвратДоплатаЗаСчетOzon КАК ВозвратДоплатаЗаСчетOzon,
	|	втТаблицаТранзакций.ВозвратИтогиКомиссияСУчетомСкидокИНаценок КАК ВозвратИтогиКомиссияСУчетомСкидокИНаценок,
	|	втТаблицаТранзакций.ИтогоВозвращено КАК ИтогоВозвращено,
	|	втТаблицаТранзакций.НомерОтправления КАК НомерОтправления,
	|	втТаблицаТранзакций.НомерСчетФактуры КАК НомерСчетФактуры,
	|	втТаблицаТранзакций.ДатаСчетФактуры КАК ДатаСчетФактуры,
	|	втТаблицаТранзакций.ДатаОтправления КАК ДатаОтправления
	|ПОМЕСТИТЬ втТаблицаТранзакций
	|ИЗ
	|	&ТаблицаТранзакций КАК втТаблицаТранзакций
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблицаТранзакций.offer_id КАК offer_id,
	|	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Характеристика) КАК Характеристика,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЭтоНабор,
	|	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Знаменатель
	|	КОНЕЦ) КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	втТаблицаТранзакций КАК втТаблицаТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО (ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль = &Профиль)
	|			И (втТаблицаТранзакций.offer_id = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id
	|				ИЛИ втТаблицаТранзакций.SKU = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku_fbs
	|				ИЛИ втТаблицаТранзакций.SKU = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku_fbo)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблицаТранзакций.offer_id 
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблицаТранзакций.НаименованиеТовара КАК НаименованиеТовара,
	|	втТаблицаТранзакций.offer_id КАК offer_id,
	|	втТаблицаТранзакций.SKU КАК SKU,
	|	втТаблицаТранзакций.ШтрихКодТовара КАК ШтрихКодТовара,
	|	втТаблицаТранзакций.ЦенаПродовцаСУчетомСкидки КАК ЦенаПродовцаСУчетомСкидки,
	|	втТаблицаТранзакций.КомиссияЗаПродажуПоКатегорииПроцент КАК КомиссияЗаПродажуПоКатегорииПроцент,
	|	втТаблицаТранзакций.ЦенаРеализация КАК ЦенаРеализация,
	|	втТаблицаТранзакций.СуммаЛояльностиРеализации КАК СуммаЛояльностиРеализации,
	|	втТаблицаТранзакций.Количество КАК Количество,
	|	втТаблицаТранзакций.РеализованоНаСумму КАК РеализованоНаСумму,
	|	втТаблицаТранзакций.ДоплатаЗаСчетOzon КАК ДоплатаЗаСчетOzon,
	|	втТаблицаТранзакций.ИтогиКомиссияСУчетомСкидокИНаценок КАК ИтогиКомиссияСУчетомСкидокИНаценок,
	|	втТаблицаТранзакций.ИтогиКНачислению КАК ИтогиКНачислению,
	|	втТаблицаТранзакций.ВозвратЦенаРеализации КАК ВозвратЦенаРеализации,
	|	втТаблицаТранзакций.СуммаЛояльностиВозврата КАК СуммаЛояльностиВозврата,
	|	втТаблицаТранзакций.ВозвратКоличество КАК ВозвратКоличество,
	|	втТаблицаТранзакций.ВозвращеноНаСумму КАК ВозвращеноНаСумму,
	|	втТаблицаТранзакций.ВозвратДоплатаЗаСчетOzon КАК ВозвратДоплатаЗаСчетOzon,
	|	втТаблицаТранзакций.ВозвратИтогиКомиссияСУчетомСкидокИНаценок КАК ВозвратИтогиКомиссияСУчетомСкидокИНаценок,
	|	втТаблицаТранзакций.ИтогоВозвращено КАК ИтогоВозвращено,
	|	втТаблицаТранзакций.НомерОтправления КАК НомерОтправления,
	|	втТаблицаТранзакций.ДатаОтправления КАК ДатаОтправления,
	|	втТаблицаТранзакций.НомерСчетФактуры КАК НомерСчетФактуры,
	|	втТаблицаТранзакций.ДатаСчетФактуры КАК ДатаСчетФактуры,	
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ВТ_Номенклатура.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ВТ_Номенклатура.КоэффициентУпаковки КАК КоэффициентУпаковки
	|ИЗ
	|	втТаблицаТранзакций КАК втТаблицаТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО втТаблицаТранзакций.offer_id = ВТ_Номенклатура.offer_id";
	//- ИнфоСофт Мурсалимов Д.Р. 21.10.24 УА #85566
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Профиль", 			Профиль);
	Запрос.УстановитьПараметр("ТаблицаТранзакций", 	ТаблицаТранзакций);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат РезультатЗапроса;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008  

//+ ИнфоСофт Заварин К.В. 26.11.24 УА #74680
Функция ДобавитьСопоставлениеВыкупленныхТоваров(ТаблицаТранзакций, Профиль) Экспорт
	
	МассивSKU 					= ТаблицаТранзакций.ВыгрузитьКолонку("SKU");
	МассивSKU 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивSKU);
	SKUТоваров					= ОчиститьПустыеЗначенияМассива(МассивSKU);
	ОсновныеТоварыПоУцененным 	= ОсновныеТоварыПоУцененным(Профиль, SKUТоваров);
	
	Для Каждого транзакция Из ТаблицаТранзакций Цикл
		
		Если Не ОсновныеТоварыПоУцененным.Получить(транзакция.sku) = Неопределено Тогда
			транзакция.sku = ОсновныеТоварыПоУцененным.Получить(транзакция.sku);
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса =
	
	"ВЫБРАТЬ
	|	втТаблицаТранзакций.СтрокаНомер КАК СтрокаНомер,
	|	втТаблицаТранзакций.НаименованиеТовара КАК НаименованиеТовара,
	|	втТаблицаТранзакций.offer_id КАК offer_id,
	|	втТаблицаТранзакций.SKU КАК SKU,
	//+ ИнфоСофт Заварин К.В. 10.01.25 УА #90580
	|	втТаблицаТранзакций.НомерОтправления КАК НомерОтправления,
	//- ИнфоСофт Заварин К.В. 10.01.25 УА #90580
	|	втТаблицаТранзакций.ИсходныеСтоимостныеДанные КАК ИсходныеСтоимостныеДанные,
	|	втТаблицаТранзакций.ДисконтПоКатегорииПроцент КАК ДисконтПоКатегорииПроцент,
	|	втТаблицаТранзакций.ЦенаРеализация КАК ЦенаРеализация,
	|	втТаблицаТранзакций.СтавкаНДСПроцент КАК СтавкаНДСПроцент,
	|	втТаблицаТранзакций.Количество КАК Количество,
	|	втТаблицаТранзакций.ИтогиКНачислению КАК ИтогиКНачислению,
	|	втТаблицаТранзакций.НомерДокумента КАК НомерДокумента
	|ПОМЕСТИТЬ втТаблицаТранзакций
	|ИЗ
	|	&ТаблицаТранзакций КАК втТаблицаТранзакций
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблицаТранзакций.offer_id КАК offer_id,
	|	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Характеристика) КАК Характеристика,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЭтоНабор,
	|	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL ИЛИ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ИС_Ozon_СоответствиеХарактеристик.Упаковка.Знаменатель
	|	КОНЕЦ) КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	втТаблицаТранзакций КАК втТаблицаТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО (ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль = &Профиль)
	|			И (втТаблицаТранзакций.offer_id = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id
	|				ИЛИ втТаблицаТранзакций.SKU = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku_fbs
	|				ИЛИ втТаблицаТранзакций.SKU = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku_fbo)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблицаТранзакций.offer_id 
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблицаТранзакций.СтрокаНомер КАК СтрокаНомер,
	|	втТаблицаТранзакций.НаименованиеТовара КАК НаименованиеТовара,
	|	втТаблицаТранзакций.offer_id КАК offer_id,
	|	втТаблицаТранзакций.SKU КАК SKU,
	//+ ИнфоСофт Заварин К.В. 10.01.25 УА #90580
	|	втТаблицаТранзакций.НомерОтправления КАК НомерОтправления,
	//- ИнфоСофт Заварин К.В. 10.01.25 УА #90580
	|	втТаблицаТранзакций.ИсходныеСтоимостныеДанные КАК ИсходныеСтоимостныеДанные,
	|	втТаблицаТранзакций.ДисконтПоКатегорииПроцент КАК ДисконтПоКатегорииПроцент,
	|	втТаблицаТранзакций.ЦенаРеализация КАК ЦенаРеализация,
	|	втТаблицаТранзакций.СтавкаНДСПроцент КАК СтавкаНДСПроцент,
	|	втТаблицаТранзакций.Количество КАК Количество,
	|	втТаблицаТранзакций.ИтогиКНачислению КАК ИтогиКНачислению,
	|	втТаблицаТранзакций.НомерДокумента КАК НомерДокумента,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ВТ_Номенклатура.ЭтоНабор КАК ЭтоНабор,
	|	ВТ_Номенклатура.Упаковка КАК Упаковка,
	|	ВТ_Номенклатура.КоэффициентУпаковки КАК КоэффициентУпаковки
	|ИЗ
	|	втТаблицаТранзакций КАК втТаблицаТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО втТаблицаТранзакций.offer_id = ВТ_Номенклатура.offer_id";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Профиль", 			Профиль);
	Запрос.УстановитьПараметр("ТаблицаТранзакций", 	ТаблицаТранзакций);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат РезультатЗапроса;
	
КонецФункции //- ИнфоСофт Заварин К.В. 26.11.24 УА #74680

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Функция ОчиститьПустыеЗначенияМассива(МассивЗначений)

	Результат = Новый Массив;
	Для Каждого значение Из МассивЗначений Цикл

		Если ЗначениеЗаполнено(значение) Тогда
			Результат.Добавить(значение);
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008 
                                        
//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Функция ОсновныеТоварыПоУцененным(Профиль, МассивSKU)

	СоответствиеОсноныхТоваровУцененным = Новый Соответствие;

	Результат = Новый Массив;

	Если МассивSKU.Количество() = 0 Тогда
		Возврат СоответствиеОсноныхТоваровУцененным;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнен Профиль. Загрузка товаров невозможна");
		Возврат СоответствиеОсноныхТоваровУцененным;
	КонецЕсли;
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	items = Неопределено;
	НомерЗапроса = 1;
	
	Пока Истина Цикл
		
		СрезЗначенийОтбора = СрезМассива(МассивSKU, НомерЗапроса);
		Если Не ЗначениеЗаполнено(СрезЗначенийОтбора) Тогда
			Прервать;
		КонецЕсли;
		
		items = ИС_Ozon_API.ИнформацияОбУценкеИОсновномТовареПоSKU(Профиль, ПараметрыЗапроса, СрезЗначенийОтбора);
		Если ЗначениеЗаполнено(items) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, items);
		КонецЕсли;
		
		НомерЗапроса = НомерЗапроса + 1;
		
	КонецЦикла; 
	
	Для Каждого Товар Из Результат Цикл
		СоответствиеОсноныхТоваровУцененным.Вставить(Товар.discounted_sku, Товар.sku);
	КонецЦикла;
	
	Возврат СоответствиеОсноныхТоваровУцененным;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Функция СрезМассива(МассивЭлементов, НомерЗапроса, МаксимальноеКоличествоЭлементов = 500) Экспорт

	Результат = Новый Массив;

	Если ЗначениеЗаполнено(МассивЭлементов) Тогда
		МаксимальныйИндекс = МассивЭлементов.ВГраница();

		НачальныйИндекс = МаксимальноеКоличествоЭлементов * (НомерЗапроса - 1);
		КонечныйИндекс  = Мин(МаксимальноеКоличествоЭлементов * НомерЗапроса - 1, МаксимальныйИндекс);

		Если НачальныйИндекс <= МаксимальныйИндекс Тогда
			Индекс = НачальныйИндекс;
			Пока Индекс <= КонечныйИндекс Цикл
				Результат.Добавить(МассивЭлементов[Индекс]);
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЕсли;

	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Функция СоздатьДокументОтчетКомиссионера(Профиль, Период, ТаблицаТранзакций, Комментарий, СуммаКомиссия = Неопределено, СтруктураПараметров = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Событие = "Создание отчета комиссионеров";

	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);

	Если Не ЗначениеЗаполнено(ФукнциональныеОпции.КонтрагентOzon) Тогда

		ТекстСообщения = СтрШаблон(
			"Не заполнен контрагент в настройках Ozon для аккаунта: %1. Документ отчет комиссионера не создан.",
			Профиль);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;

	КонецЕсли;

	ХозОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию");

	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	Если ИспользоватьДоговорыСКлиентами Тогда

		Если ЗначениеЗаполнено(ФукнциональныеОпции.ДоговорOzon) Тогда

			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(ФукнциональныеОпции.ДоговорOzon, "ХозяйственнаяОперация") = ХозОперация Тогда

				ТекстСообщения = СтрШаблон(
					"В выбранный договор контрагента в настройках Ozon для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат Неопределено;

			КонецЕсли;

		Иначе

			ТекстСообщения = СтрШаблон(
				"Не заполнен договор контрагента в настройках Ozon для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;

		КонецЕсли;
	КонецЕсли;

	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	Если ИспользоватьСоглашенияСКлиентами Тогда

		Если ЗначениеЗаполнено(ФукнциональныеОпции.СоглашениеOzon) Тогда

			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(ФукнциональныеОпции.СоглашениеOzon, "ХозяйственнаяОперация") = ХозОперация Тогда

				ТекстСообщения = СтрШаблон(
					"В выбранное соглашение с клиентом в настройках Ozon для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат Неопределено;

			КонецЕсли;

		Иначе

			ТекстСообщения = СтрШаблон(
				"Не заполнено соглашение с клиентом в настройках Ozon для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;

		КонецЕсли;

	КонецЕсли;  
	
	ОбъектОтчетКомиссионера = Документы["ОтчетКомиссионера"].СоздатьДокумент();
	
	ОбъектОтчетКомиссионера.Дата 			= Период.ДатаОкончания;
	ОбъектОтчетКомиссионера.НачалоПериода 	= Период.ДатаНачала;
	ОбъектОтчетКомиссионера.КонецПериода 	= Период.ДатаОкончания;
	ОбъектОтчетКомиссионера.Комментарий		= Комментарий; 
	//+ ИнфоСофт Стояк Ю.К. 12.08.2024 УА #81449                                   
	ИспользоватьПодразделения = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	
	Если ИспользоватьПодразделения Тогда		
		ОбъектОтчетКомиссионера.Подразделение = ФукнциональныеОпции.ПодразделениеOzon;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 12.08.2024 УА #81449
	
	//+ ИнфоСофт Заварин К.В. 04.04.24 УА #66208
	Если ЗначениеЗаполнено(ТаблицаТранзакций[0].НомерДокумента) Тогда
		ОбъектОтчетКомиссионера.ДатаВходящегоДокумента = Период.ДатаОкончания;
		ОбъектОтчетКомиссионера.НомерВходящегоДокумента = Формат(Число(ТаблицаТранзакций[0].НомерДокумента), "ЧГ=");
	КонецЕсли;	
	//- ИнфоСофт Заварин К.В. 04.04.24 УА #66208
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", ФукнциональныеОпции.Организация);
	ДанныеЗаполнения.Вставить("Партнер", ФукнциональныеОпции.ПартнерOzon);
	ДанныеЗаполнения.Вставить("Контрагент", ФукнциональныеОпции.КонтрагентOzon);
	ДанныеЗаполнения.Вставить("Договор", ФукнциональныеОпции.ДоговорOzon);
	//+ ИнфоСофт Сумин Д.В. 19.04.2024 УА #72638
	Если ИспользоватьСоглашенияСКлиентами Тогда
		ДанныеЗаполнения.Вставить("Соглашение", ФукнциональныеОпции.СоглашениеOzon); 
		ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина); 
	КонецЕсли; 
	//ДанныеЗаполнения.Вставить("Соглашение", ФукнциональныеОпции.СоглашениеOzon);
	//ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина); 
	//- ИнфоСофт Сумин Д.В. 19.04.2024 УА #72638
	ДанныеЗаполнения.Вставить("КонецПериода", Период.ДатаОкончания);
	ОбъектОтчетКомиссионера.Заполнить(ДанныеЗаполнения);

	ОбъектОтчетКомиссионера.Услуга = Справочники["Номенклатура"].НайтиПоНаименованию("Комиссионное вознаграждение", Истина);
	ПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(ОбъектОтчетКомиссионера.СтавкаНДСВознаграждения);
	КомиссионнаяТорговляСервер.ЗаполнитьСтавкуНДСкомиссионногоВознаграждения(ОбъектОтчетКомиссионера, ПроцентНДС);

	ОбъектОтчетКомиссионера.СпособРасчетаВознаграждения = ПредопределенноеЗначение(
		"Перечисление.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи");
	ОбъектОтчетКомиссионера.ПроцентВознаграждения  		= 0;
	
	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97340
	НастройкиУчета = УчетНДСУП.ПараметрыУчетаПоОрганизации(Профиль.Организация, ТекущаяДатаСеанса());
	ОбъектОтчетКомиссионера.НалогообложениеНДС = НастройкиУчета.ОсновноеНалогообложениеНДСПродажи;
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97340
	
	//+ ИнфоСофт Стояк Ю.К. 31.05.2024 УА #74897
	ЗаполнитьТЧОтчетаКомиссионера(ОбъектОтчетКомиссионера, ТаблицаТранзакций, СуммаКомиссия, СтруктураПараметров);	
	//ЗаполнитьТЧОтчетаКомиссионера(ОбъектОтчетКомиссионера, ТаблицаТранзакций, СуммаКомиссия);	
	//- ИнфоСофт Стояк Ю.К. 31.05.2024 УА #74897

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
		ОбъектОтчетКомиссионера.Организация, ОбъектОтчетКомиссионера.НалогообложениеНДС, ОбъектОтчетКомиссионера.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
		ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ОбъектОтчетКомиссионера));
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
		ОбъектОтчетКомиссионера.ЦенаВключаетНДС));	
	СтруктураДействий.Вставить("ПересчитатьСуммуПродажиНДС");
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ОбъектОтчетКомиссионера.Товары, СтруктураДействий, Неопределено);

	ОбъектОтчетКомиссионера.СуммаВознаграждения = ОбъектОтчетКомиссионера.Товары.Итог("СуммаВознаграждения");
	ОбъектОтчетКомиссионера.СуммаНДСВознаграждения = Окр(ОбъектОтчетКомиссионера.СуммаВознаграждения * ПроцентНДС
		/ (100 + ПроцентНДС), 2, РежимОкругления.Окр15как20);

	Попытка

		ОбъектОтчетКомиссионера.Записать(РежимЗаписиДокумента.Проведение);

	Исключение

		ТекстСообщения = СтрШаблон("Не удалось провести документ отчет комиссионера: %1%2", Символы.ПС,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

		Попытка
			ОбъектОтчетКомиссионера.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ТекстСообщения = СтрШаблон("Не удалось записать документ отчет комиссионера: %1%2", Символы.ПС,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;

	КонецПопытки;        
	
	Возврат ОбъектОтчетКомиссионера.Ссылка;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Процедура ЗаполнитьТЧОтчетаКомиссионера(ОтчетКомиссионера, ТаблицаТранзакций, СуммаКомиссия = Неопределено, СтруктураПараметров = Неопределено)
	
	//+ ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
	Если ЗначениеЗаполнено(СтруктураПараметров) И СтруктураПараметров.Свойство("СпособРасчетаЦеныВозврата") Тогда
		
		ЦеныВозвратаПоВидуЦен = ?(СтруктураПараметров.СпособРасчетаЦеныВозврата.СпособРасчета = 1, Истина, Ложь);
	
		ВидЦены = СтруктураПараметров.СпособРасчетаЦеныВозврата.ВидЦены; 
		
	Иначе
		
		ЦеныВозвратаПоВидуЦен = Ложь;		
		
	КонецЕсли; 
	//- ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
	
	ОтчетКомиссионера.Товары.Очистить();
	ОтчетКомиссионера.ВидыЗапасов.Очистить();
	
	//+ ИнфоСофт Ивонин К.А. 13.03.25 УА #95585
	Комиссия = 0;      
	ОстатокКРаспределению = 0;
	
	Если СуммаКомиссия <> Неопределено Тогда
		
		ОсталосьРаспределить = СуммаКомиссия;
		
		КоличетсвоВозвратовБезПродажи = 0;
		
		Для Каждого Строка Из ТаблицаТранзакций Цикл
			
			Если Строка.ВозвратКоличество > 0 И Строка.Количество = 0 Тогда
				КоличетсвоВозвратовБезПродажи = КоличетсвоВозвратовБезПродажи + 1;		
			КонецЕсли;
			
		КонецЦикла;
		
		КоличествоПродаж = ТаблицаТранзакций.Количество() - КоличетсвоВозвратовБезПродажи;
		
		Если КоличествоПродаж > 0 Тогда
			Комиссия = Окр(СуммаКомиссия / КоличествоПродаж, 2);	
		КонецЕсли;
		
		//+ ИнфоСофт Заварин К.В. 09.04.25 УА #98697
		//ОстатокКРаспределению = СуммаКомиссия - (КоличествоПродаж * Комиссия);			 
		
		Пока КоличествоПродаж * Комиссия >= СуммаКомиссия  Цикл
			Комиссия = Комиссия - 0.01;
		КонецЦикла;

		ОстатокКРаспределению = СуммаКомиссия - (КоличествоПродаж * Комиссия);
		//- ИнфоСофт Заварин К.В. 09.04.25 УА #98697

	КонецЕсли;
	
	КомиссияВСтроке = Комиссия;
	//- ИнфоСофт Ивонин К.А. 13.03.25 УА #95585
	   
	//+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133
	МассивПараметров = ПолучитьСписокПараметровЦен();	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(СтруктураПараметров.Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, МассивПараметров);	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен();	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
	//- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133
	Для Каждого Транзакция Из ТаблицаТранзакций Цикл
		
		//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
		Если СтруктураПараметров.ЗаполнитьКолонкуПокупательОзон И Не Транзакция = Неопределено Тогда
			
			//+ ИнфоСофт Власова И.С. 10.12.24 УА #87450
			//Покупатель = ?(ЗначениеЗаполнено(ОтчетКомиссионера.Контрагент), ОтчетКомиссионера.Контрагент, Справочники.Контрагенты.ПустаяСсылка());
			Покупатель = СтруктураПараметров.РозничныйПокупательОзон;
			//- ИнфоСофт Власова И.С. 10.12.24 УА #87450
			
			Если ЗначениеЗаполнено(Транзакция.ИннПокупателя) Тогда
				Покупатель = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", Транзакция.ИннПокупателя);
			КонецЕсли;
				
		КонецЕсли;                     
		//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
		
		Если Транзакция.ЭтоНабор Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Транзакция.Номенклатура,
				"ТипНоменклатуры, ВидНоменклатуры");

			Если Транзакция.Количество > 0 Тогда
				
				ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
				ПараметрыКомплектующих.Номенклатура   		= Транзакция.Номенклатура;
				ПараметрыКомплектующих.НоменклатураНабора   = Транзакция.Номенклатура;
				ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.ХарактеристикаНоменклатуры;				
				ПараметрыКомплектующих.КоличествоУпаковок	= Транзакция.Количество;
				ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
				ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
				ПараметрыКомплектующих.ЭтоТовар 			= Истина;
				ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
	
				Склады = Новый Массив;
	
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Дата", 		ОтчетКомиссионера.Дата);
				ДополнительныеПараметры.Вставить("Валюта", 		ОтчетКомиссионера.Валюта);
				ДополнительныеПараметры.Вставить("Склады", 		Склады);
				ДополнительныеПараметры.Вставить("Соглашение", 	ОтчетКомиссионера.Соглашение);
				ДополнительныеПараметры.Вставить("Цена", 		Транзакция.ЦенаПродовцаСУчетомСкидки);
				ДополнительныеПараметры.Вставить("ЦенаПродажи", Транзакция.ЦенаРеализация);
				//+ ИнфоСофт Сумин Д.В. 16.01.2024 УА #68744
				ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.РеализованоНаСумму);
				//ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.РеализованоНаСумму + Транзакция.ДоплатаЗаСчетOzon); 
				//- ИнфоСофт Сумин Д.В. 16.01.2024 УА #68744
				//+ ИнфоСофт Сумин Д.В. 12.02.2024 УА #70399
				ДополнительныеПараметры.Вставить("Комиссия", КомиссияВСтроке);
				//ДополнительныеПараметры.Вставить("Комиссия", 	?(Транзакция.ИтогиКомиссияСУчетомСкидокИНаценок < 0, -Транзакция.ИтогиКомиссияСУчетомСкидокИНаценок,
				//Транзакция.ИтогиКомиссияСУчетомСкидокИНаценок));
				//- ИнфоСофт Сумин Д.В. 12.02.2024 УА #70399
				ДополнительныеПараметры.Вставить("СтоимостьДопУслуг", 0);
	            //+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133
				ДополнительныеПараметры.Вставить("ВидЦены", СтруктураЦен.ВидЦеныСоСкидкой);
				//ДополнительныеПараметры.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
				//- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #89133
				//+ ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
				Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
				//- ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
				
				//+ ИнфоСофт Заварин К.В. 18.12.24 УА #89626
				СуммаСравнения 	  = 0;
				КомиссияСравнения = 0;
				//- ИнфоСофт Заварин К.В. 18.12.24 УА #89626
				
				Для Каждого стрКомплекта Из Комплектующие Цикл
	
					НоваяСтрока = ОтчетКомиссионера.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
					
					НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок
														+ стрКомплекта.Погрешность;
														
					//+ ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #83291									
					НоваяСтрока.СуммаПродажи            = НоваяСтрока.ЦенаПродажи * НоваяСтрока.КоличествоУпаковок
														+ стрКомплекта.ПогрешностьСуммаПродажи;
					НоваяСтрока.СуммаВознаграждения 	= стрКомплекта.Комиссия * НоваяСтрока.КоличествоУпаковок
														+ стрКомплекта.ПогрешностьКомиссия;
					//- ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #83291
					
					//+ ИнфоСофт Сумин Д.В. 26.04.2024 УА #74634
					НоваяСтрока.НомерСчетаФактурыКомиссионера = Транзакция.НомерСчетФактуры;
					НоваяСтрока.ДатаСчетаФактурыКомиссионера  = Транзакция.ДатаСчетФактуры;
					//- ИнфоСофт Сумин Д.В. 26.04.2024 УА #74634 
					
					//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
					НоваяСтрока.Покупатель 					  = Покупатель; 
					//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
					
					//+ ИнфоСофт Заварин К.В. 18.12.24 УА #89626 
					СуммаСравнения 	  = СуммаСравнения 	  + НоваяСтрока.СуммаПродажи;
					КомиссияСравнения = КомиссияСравнения + НоваяСтрока.СуммаВознаграждения;
					
					Если стрКомплекта = Комплектующие[Комплектующие.Количество()-1] Тогда
						
						Если СуммаСравнения - Транзакция.РеализованоНаСумму > 0 Тогда
							
							НоваяСтрока.СуммаПродажи = НоваяСтрока.СуммаПродажи - (СуммаСравнения - Транзакция.РеализованоНаСумму);
							
						ИначеЕсли СуммаСравнения - Транзакция.РеализованоНаСумму < 0 Тогда
							
							НоваяСтрока.СуммаПродажи = НоваяСтрока.СуммаПродажи + (Транзакция.РеализованоНаСумму - СуммаСравнения);	
							
						КонецЕсли;
						
						Если КомиссияСравнения - КомиссияВСтроке > 0 Тогда
							
							НоваяСтрока.СуммаВознаграждения = НоваяСтрока.СуммаВознаграждения - (КомиссияСравнения - КомиссияВСтроке);
							
						ИначеЕсли КомиссияСравнения - КомиссияВСтроке < 0 Тогда
							
							НоваяСтрока.СуммаВознаграждения = НоваяСтрока.СуммаВознаграждения + (КомиссияВСтроке - КомиссияСравнения);	
							
						КонецЕсли
						
					КонецЕсли;
					//- ИнфоСофт Заварин К.В. 18.12.24 УА #89626
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если Транзакция.ВозвратКоличество > 0 Тогда
				
				ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
				ПараметрыКомплектующих.Номенклатура   		= Транзакция.Номенклатура;
				ПараметрыКомплектующих.НоменклатураНабора   = Транзакция.Номенклатура;
				ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.ХарактеристикаНоменклатуры;				
				ПараметрыКомплектующих.КоличествоУпаковок	= Транзакция.ВозвратКоличество;
				ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
				ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
				ПараметрыКомплектующих.ЭтоТовар 			= Истина;
				ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
	
				Склады = Новый Массив;
	
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Дата", 		ОтчетКомиссионера.Дата);
				ДополнительныеПараметры.Вставить("Валюта", 		ОтчетКомиссионера.Валюта);
				ДополнительныеПараметры.Вставить("Склады", 		Склады);
				ДополнительныеПараметры.Вставить("Соглашение", 	ОтчетКомиссионера.Соглашение);
				ДополнительныеПараметры.Вставить("Цена", 		Транзакция.ЦенаПродовцаСУчетомСкидки);
				ДополнительныеПараметры.Вставить("ЦенаПродажи", Транзакция.ВозвратЦенаРеализации);
				//+ ИнфоСофт Сумин Д.В. 16.01.2024 УА #68744
				ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.ВозвращеноНаСумму);
				//ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.ВозвращеноНаСумму + Транзакция.ВозвратДоплатаЗаСчетOzon);
				//- ИнфоСофт Сумин Д.В. 16.01.2024 УА #68744  
				
				//+ ИнфоСофт Сумин Д.В. 12.02.2024 УА #70399
				ДополнительныеПараметры.Вставить("Комиссия", 0);
				//ДополнительныеПараметры.Вставить("Комиссия", 	?(Транзакция.ИтогиКомиссияСУчетомСкидокИНаценок < 0, -Транзакция.ИтогиКомиссияСУчетомСкидокИНаценок, 
				//Транзакция.ИтогиКомиссияСУчетомСкидокИНаценок));
				//- ИнфоСофт Сумин Д.В. 12.02.2024 УА #70399 
				
				ДополнительныеПараметры.Вставить("СтоимостьДопУслуг", 0);
				//+ ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94609				
				//ДополнительныеПараметры.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
				ДополнительныеПараметры.Вставить("ВидЦены", СтруктураЦен.ВидЦеныСоСкидкой);
				//- ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94609
				
				//+ ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
				Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
				//- ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
				
				//+ ИнфоСофт Заварин К.В. 18.12.24 УА #89626
				СуммаСравнения 	  = 0;
				КомиссияСравнения = 0;
				//- ИнфоСофт Заварин К.В. 18.12.24 УА #89626
				
				Для Каждого стрКомплекта Из Комплектующие Цикл
					
					НоваяСтрока = ОтчетКомиссионера.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
										
					НоваяСтрока.КоличествоУпаковок 		= -стрКомплекта.КоличествоУпаковок;
					НоваяСтрока.КоличествоУпаковокУчет 	= -стрКомплекта.КоличествоУпаковок;
					
					//+ ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
					Если Не ЦеныВозвратаПоВидуЦен Тогда
						
						НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок
						+ стрКомплекта.Погрешность;
						
					Иначе
						
						ЦенаРозничная = ЗаполнитьСуммыПоВидуЦен(ВидЦены, ОтчетКомиссионера.Дата, ОтчетКомиссионера.Валюта, НоваяСтрока.Номенклатура, НоваяСтрока.Характеристика, НоваяСтрока.Упаковка);
						
						НоваяСтрока.Цена = -(ЦенаРозничная / НоваяСтрока.КоличествоУпаковок);
						НоваяСтрока.Сумма = -(ЦенаРозничная); 						
						
					КонецЕсли;
					//- ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
					
					//+ ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #83291
					
					//+ ИнфоСофт Заварин К.В. 15.10.24 УА #83983
					//НоваяСтрока.СуммаПродажи            = (НоваяСтрока.ЦенаПродажи * НоваяСтрока.КоличествоУпаковок
					//									+ стрКомплекта.ПогрешностьСуммаПродажи);
					НоваяСтрока.СуммаПродажи            = - ( - НоваяСтрока.ЦенаПродажи * НоваяСтрока.КоличествоУпаковок
														+ стрКомплекта.ПогрешностьСуммаПродажи);  
					//- ИнфоСофт Заварин К.В. 15.10.24 УА #83983

					НоваяСтрока.СуммаВознаграждения 	= -(стрКомплекта.Комиссия * стрКомплекта.КоличествоУпаковок
														+ стрКомплекта.ПогрешностьКомиссия);
					//- ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #83291
					
					//+ ИнфоСофт Сумин Д.В. 26.04.2024 УА #74634
					НоваяСтрока.НомерСчетаФактурыКомиссионера = Транзакция.НомерСчетФактуры;
					НоваяСтрока.ДатаСчетаФактурыКомиссионера  = Транзакция.ДатаСчетФактуры;
					//- ИнфоСофт Сумин Д.В. 26.04.2024 УА #74634	
					
					//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
					НоваяСтрока.Покупатель 					  = Покупатель; 
					//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
					
					//+ ИнфоСофт Заварин К.В. 18.12.24 УА #89626 
					СуммаСравнения 	  = СуммаСравнения 	  + НоваяСтрока.СуммаПродажи;
					КомиссияСравнения = КомиссияСравнения + НоваяСтрока.СуммаВознаграждения;
					
					Если стрКомплекта = Комплектующие[Комплектующие.Количество()-1] Тогда
						
						Если СуммаСравнения + Транзакция.ВозвращеноНаСумму > 0 Тогда
							
							НоваяСтрока.СуммаПродажи = НоваяСтрока.СуммаПродажи + (СуммаСравнения + Транзакция.ВозвращеноНаСумму);
							
						ИначеЕсли СуммаСравнения + Транзакция.ВозвращеноНаСумму < 0 Тогда
							
							НоваяСтрока.СуммаПродажи = НоваяСтрока.СуммаПродажи - (СуммаСравнения + Транзакция.ВозвращеноНаСумму);	
							
						КонецЕсли;
						
						Если КомиссияСравнения > 0 Тогда
							
							НоваяСтрока.СуммаВознаграждения = НоваяСтрока.СуммаВознаграждения + (КомиссияСравнения);
							
						ИначеЕсли КомиссияСравнения < 0 Тогда
							
							НоваяСтрока.СуммаВознаграждения = НоваяСтрока.СуммаВознаграждения - (КомиссияСравнения);	
							
						КонецЕсли
						
					КонецЕсли;
					//- ИнфоСофт Заварин К.В. 18.12.24 УА #89626
				
				КонецЦикла;	
				
			КонецЕсли;
			
		Иначе
			
			Если Транзакция.Количество > 0 Тогда
				
				//+ ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005
				НоваяСтрока = ОтчетКомиссионера.Товары.Добавить();
				
				НоваяСтрока.Номенклатура 					= Транзакция.Номенклатура;
				НоваяСтрока.Характеристика 					= Транзакция.ХарактеристикаНоменклатуры;
				НоваяСтрока.Количество 						= Транзакция.КоэффициентУпаковки * Транзакция.Количество;
				НоваяСтрока.Упаковка 						= Транзакция.Упаковка;
				НоваяСтрока.КоличествоУпаковокУчет 			= Транзакция.Количество;
				НоваяСтрока.КоличествоУпаковок 				= Транзакция.Количество;
				НоваяСтрока.Цена 							= Транзакция.ЦенаПродовцаСУчетомСкидки;
				НоваяСтрока.ЦенаПродажи             		= Транзакция.РеализованоНаСумму  / НоваяСтрока.КоличествоУпаковок;
				НоваяСтрока.Сумма 							= Транзакция.ЦенаПродовцаСУчетомСкидки * НоваяСтрока.КоличествоУпаковок;
				НоваяСтрока.СуммаПродажи            		= Транзакция.РеализованоНаСумму;
				НоваяСтрока.СуммаВознаграждения 			= КомиссияВСтроке;
				НоваяСтрока.НомерСчетаФактурыКомиссионера 	= Транзакция.НомерСчетФактуры;
				НоваяСтрока.ДатаСчетаФактурыКомиссионера  	= Транзакция.ДатаСчетФактуры;
				//- ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005      
				
				//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
				НоваяСтрока.Покупатель 					    = Покупатель; 
				//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
				
			КонецЕсли;
			
			Если Транзакция.ВозвратКоличество > 0 Тогда
				
				//+ ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005
				НоваяСтрока = ОтчетКомиссионера.Товары.Добавить();
				
				НоваяСтрока.Номенклатура 					= Транзакция.Номенклатура;
				НоваяСтрока.Характеристика 					= Транзакция.ХарактеристикаНоменклатуры;
				НоваяСтрока.Количество 						= -Транзакция.КоэффициентУпаковки * Транзакция.ВозвратКоличество;
				НоваяСтрока.Упаковка 						= Транзакция.Упаковка;
				НоваяСтрока.КоличествоУпаковокУчет 			= -Транзакция.ВозвратКоличество;
				НоваяСтрока.КоличествоУпаковок 				= -Транзакция.ВозвратКоличество;
				
				//+ ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
				Если Не ЦеныВозвратаПоВидуЦен Тогда 
					
					НоваяСтрока.Цена 						= Транзакция.ЦенаПродовцаСУчетомСкидки;
					НоваяСтрока.Сумма 						= -Транзакция.ЦенаПродовцаСУчетомСкидки * НоваяСтрока.КоличествоУпаковок;
					
				Иначе
					
					ЦенаРозничная 							= ЗаполнитьСуммыПоВидуЦен(ВидЦены, ОтчетКомиссионера.Дата, ОтчетКомиссионера.Валюта, НоваяСтрока.Номенклатура, НоваяСтрока.Характеристика, НоваяСтрока.Упаковка);
					
					НоваяСтрока.Цена 						= -(ЦенаРозничная) / НоваяСтрока.КоличествоУпаковок;
					НоваяСтрока.Сумма 						= -(ЦенаРозничная); 					
					
				КонецЕсли;
				//- ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
				
				НоваяСтрока.ЦенаПродажи            			= -(Транзакция.ВозвращеноНаСумму) / НоваяСтрока.КоличествоУпаковок;
				НоваяСтрока.СуммаПродажи            		= -(Транзакция.ВозвращеноНаСумму);
				НоваяСтрока.СуммаВознаграждения 			= 0;
				НоваяСтрока.НомерСчетаФактурыКомиссионера	= Транзакция.НомерСчетФактуры;
				НоваяСтрока.ДатаСчетаФактурыКомиссионера  	= Транзакция.ДатаСчетФактуры;
				//- ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005
				
				//+ ИнфоСофт Заварин К.В. 19.09.24 УА #83149
				НоваяСтрока.Покупатель 					    = Покупатель; 
				//- ИнфоСофт Заварин К.В. 19.09.24 УА #83149
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//+ ИнфоСофт Ивонин К.А. 14.03.25 УА #95585
	ПоследняяСтрока = ОтчетКомиссионера.Товары.Количество() - 1;
	
	Строка = Неопределено;
	
	Пока ПоследняяСтрока > 0 Цикл
		
		Если ОтчетКомиссионера.Товары[ПоследняяСтрока].КоличествоУпаковок > 0 Тогда
			Строка = ОтчетКомиссионера.Товары[ПоследняяСтрока];
			Прервать;
		КонецЕсли;
		
		ПоследняяСтрока = ПоследняяСтрока - 1;
		
	КонецЦикла;
	
	Если Строка <> Неопределено Тогда
		Строка.СуммаВознаграждения = Строка.СуммаВознаграждения + ОстатокКРаспределению;
	КонецЕсли;
	//- ИнфоСофт Ивонин К.А. 14.03.25 УА #95585
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Сумин Д.В. 26.04.2023 УА #58166
Функция ПолучитьТаблицуТоваровНабора(ТоварыЗаказа) Экспорт
	
	Запрос = Новый Запрос;		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВзаказе.Сумма КАК Сумма,
	|	ТоварыВзаказе.Номенклатура КАК Номенклатура,
	|	ТоварыВзаказе.Характеристика КАК Характеристика,
	|	ТоварыВзаказе.Цена КАК Цена,
	|	ТоварыВзаказе.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыВЗаказе
	|ИЗ
	|	&ТоварыВзаказе КАК ТоварыВзаказе
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости) КАК ОбщаяДоляСтоимости,
	|	СУММА(1) КАК Количество,
	|	ВТ_ТоварыВЗаказе.Сумма КАК Сумма,
	|	ВТ_ТоварыВЗаказе.Цена КАК Цена,
	|	ВТ_ТоварыВЗаказе.Номенклатура КАК Набор,
	|	ВТ_ТоварыВЗаказе.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ВТ_ТоварыВЗаказе.Количество) КАК КоличествоВЗаказе
	|ПОМЕСТИТЬ ВТ_Количество
	|ИЗ
	|	ВТ_ТоварыВЗаказе КАК ВТ_ТоварыВЗаказе
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО ВТ_ТоварыВЗаказе.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|			И ВТ_ТоварыВЗаказе.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыВЗаказе.Номенклатура,
	|	ВТ_ТоварыВЗаказе.Характеристика,
	|	ВТ_ТоварыВЗаказе.Сумма,
	|	ВТ_ТоварыВЗаказе.Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости,
	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Количество, 1) * ВТ_Количество.КоличествоВЗаказе КАК Количество,
	|	ВТ_Количество.ОбщаяДоляСтоимости КАК ОбщаяДоляСтоимости,
	|	ВТ_Количество.Количество КАК КоличествоОбщее,
	|	ВТ_Количество.Набор КАК Набор,
	|	ВТ_Количество.Сумма КАК Сумма,
	|	ВТ_Количество.Цена КАК Цена,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора
	|ИЗ
	|	ВТ_Количество КАК ВТ_Количество
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО ВТ_Количество.Набор = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
	|			И ВТ_Количество.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика
	//+ ИнфоСофт Стояк Ю.К. 19.03.2024 УА #72423
	|
	|УПОРЯДОЧИТЬ ПО
	| Номенклатура";
	//- ИнфоСофт Стояк Ю.К. 19.03.2024 УА #72423 

	Запрос.УстановитьПараметр("ТоварыВзаказе", ТоварыЗаказа);
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Сумин Д.В. 26.04.2023 УА #58166

//+ ИнфоСофт Сумин Д.В. 21.08.2023 УА #63924
Функция СоздатьДокументВозвратТоваров(СтруктураДанных) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(СтруктураДанных.Профиль);
	
	Документ = Документы.ВозвратТоваровОтКлиента.СоздатьДокумент();
	//+ ИнфоСофт Заварин К.В. 02.05.24 УА #67073
	//Документ.Дата = СтруктураДанных.Период.ДатаОкончания;
	Документ.Дата = СтруктураДанных.ТаблицаПродаж[0].ДатаСчетФактуры;
	Документ.Комментарий = "Номер Счет фактуры " + СтруктураДанных.ТаблицаПродаж[0].НомерСчетФактуры; 
	//- ИнфоСофт Заварин К.В. 02.05.24 УА #67073
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Партнер", ФукнциональныеОпции.ПартнерOzon);
	ПараметрыФормы.Вставить("Контрагент", ФукнциональныеОпции.КонтрагентOzon);
	ПараметрыФормы.Вставить("Договор", ФукнциональныеОпции.ДоговорOzon);
	
	Документ.Заполнить(ПараметрыФормы);
	
	Документ.Соглашение = ФукнциональныеОпции.СоглашениеOzon;
	Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера;
	
	Документ.Валюта = Документ.Договор.ВалютаВзаиморасчетов;
	
	Документ.Организация = СтруктураДанных.Профиль.Организация;    
	
	//+ ИнфоСофт Заварин К.В. 12.02.25 УА #93659
	//Склад = СтруктураДанных.Профиль.Склад;
	Склад = ФукнциональныеОпции.OzonСкладРеализации;
	//- ИнфоСофт Заварин К.В. 12.02.25 УА #93659
	
	Документ.Склад = Склад; 
	
	Документ.ЦенаВключаетНДС = Истина;

	ПродажаОблагаетсяНДС = ИС_WB_СерверУТ11_5.ПолучитьРезультатПроверкиУчетаНДС(СтруктураДанных.Профиль.Организация);
	
	Если ПродажаОблагаетсяНДС Тогда
		Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;			
	Иначе
		Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 10.04.2025 УА #97954
	ВидЦены = Неопределено;
	
	Если СтруктураДанных.Свойство("Профиль") Тогда
		
		МассивПараметров = ПолучитьСписокПараметровЦен();	
		Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(СтруктураДанных.Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, МассивПараметров);	
		СтруктураЦен = ПолучитьСтруктуруПараметровЦен();	
		ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
		ВидЦены = СтруктураЦен.ВидЦеныСоСкидкой; 
		
	КонецЕсли;
	
	//ЗаполнитьТЧРеализации(Документ, СтруктураДанных.ТаблицаПродаж);
	ЗаполнитьТЧРеализации(Документ, СтруктураДанных.ТаблицаПродаж, , , ВидЦены);
	//- ИнфоСофт Стояк Ю.К. 10.04.2025 УА #97954
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
	Документ.Организация, Документ.НалогообложениеНДС, Документ.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
	ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Документ));
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
	Документ.ЦенаВключаетНДС));	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Документ.Товары, СтруктураДействий, Неопределено);	
	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		Документ.Записать();
	КонецПопытки; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Документ;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 21.08.2023 УА #63924

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Функция ПолучитьИмяСобытия(Имя)
	Возврат СтрШаблон("ИС.МП.ИС_Ozon_Сервер.%1", Имя);
КонецФункции //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
Функция СоздатьДокументПриобретения(ЗаголовокСтруктура, ДанныеДокумента) Экспорт  
	
	Документ = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
	
	Документ.Дата = ЗаголовокСтруктура.ДатаДокумента;
	Документ.Автор = ПользователиКлиентСервер.ТекущийПользователь();
	Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	Документ.Организация = ЗаголовокСтруктура.Организация;
	Документ.Партнер = ЗаголовокСтруктура.Партнер;	
	Документ.Контрагент = ЗаголовокСтруктура.Контрагент;  
	
	Документ.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;  
	Документ.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным; 
	
	Если ЗначениеЗаполнено(ЗаголовокСтруктура.ДоговорЗакупки) Тогда
		Валюта = ЗаголовокСтруктура.ДоговорЗакупки.ВалютаВзаиморасчетов;
	Иначе
		Валюта = ЗаголовокСтруктура.ДоговорЗакупки.ВалютаВзаиморасчетов;
	КонецЕсли;	
	
	Документ.Валюта = Валюта;
	Документ.ВалютаВзаиморасчетов = Валюта;
	Документ.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада;  
	Документ.Договор = ЗаголовокСтруктура.ДоговорЗакупки;
	Документ.Соглашение = ЗаголовокСтруктура.СоглашениеЗакупки;
	
	Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС; 		
	
	СуммаДокумента = 0;
	
	Комментарий = "";
	
	Для Каждого Элемент Из ДанныеДокумента Цикл 	
		
		ЭлементТЧ = Документ.Товары.Добавить();
		ЭлементТЧ.Номенклатура = Элемент.Номенклатура;
		ЭлементТЧ.Количество = 1;
		ЭлементТЧ.КоличествоУпаковок = 1;
		ЭлементТЧ.Цена = Элемент.Сумма;
		ЭлементТЧ.СписатьНаРасходы = Истина;
		ЭлементТЧ.СтатьяРасходов = Элемент.СтатьяРасходов;
		
		ЭлементТЧ.СуммаНДС = Элемент.НДС; 
		ЭлементТЧ.СуммаСНДС = Элемент.НДС + Элемент.Сумма; 	
		ЭлементТЧ.СтавкаНДС = Элемент.СтавкаНДС; 
		СуммаДокумента = СуммаДокумента + Элемент.НДС + Элемент.Сумма; 
		ЭлементТЧ.Сумма = Элемент.Сумма;  
		
		ЭлементТЧ.Подразделение = ЗаголовокСтруктура.Подразделение;	
		Комментарий = Комментарий + "/" + Элемент.Номенклатура.Наименование 
	КонецЦикла;	
	
	Документ.Комментарий = Комментарий;
	
	Документ.СуммаДокумента = СуммаДокумента;
	
	Если Документ.Товары.Количество() = 0 Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		Документ.Записать();
	КонецПопытки; 
	
	Возврат Документ.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730
Функция СоздатьДокументВзаимозачетЗадолженности(ДокументПриобретения, ОтчетКомиссионера) Экспорт  
	
	ДокументВзаимозачет = Документы.ВзаимозачетЗадолженности.СоздатьДокумент();
	
	//+ ИнфоСофт Заварин К.В. 21.11.24 УА #86791
	ДокументРасчетов = ДокументПриобретения;
	Если ЗначениеЗаполнено(ОтчетКомиссионера.Соглашение) И ЗначениеЗаполнено(ОтчетКомиссионера.Соглашение.ПорядокРасчетов) Тогда
		ПорядокРасчетов = ОтчетКомиссионера.Соглашение.ПорядокРасчетов;
	Иначе
		ПорядокРасчетов = ОтчетКомиссионера.Договор.ПорядокРасчетов;  
	КонецЕсли;
	
	Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
		ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ОтчетКомиссионера.Ссылка);
	Иначе
		ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ОтчетКомиссионера.Договор);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДокументПриобретения.Соглашение) И ЗначениеЗаполнено(ДокументПриобретения.Соглашение.ПорядокРасчетов) Тогда
		ПорядокРасчетов = ДокументПриобретения.Соглашение.ПорядокРасчетов;
	Иначе
		ПорядокРасчетов = ДокументПриобретения.Договор.ПорядокРасчетов;  
	КонецЕсли;
	
	Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
		ДокументРасчетов  = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ДокументПриобретения.Ссылка); 
	Иначе
		ДокументРасчетов  = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ДокументПриобретения.Договор); 
	КонецЕсли;		  
	//- ИнфоСофт Заварин К.В. 21.11.24 УА #86791
	
	ДокументВзаимозачет.Дата = ОтчетКомиссионера.Дата;
	ДокументВзаимозачет.Организация = ДокументПриобретения.Организация; 
	
	ДокументВзаимозачет.КонтрагентДебитор = ДокументПриобретения.Контрагент;
	ДокументВзаимозачет.КонтрагентКредитор = ДокументПриобретения.Контрагент; 
	
	ДокументВзаимозачет.СуммаДокумента = ДокументПриобретения.СуммаДокумента;
	ДокументВзаимозачет.Валюта = ДокументПриобретения.Валюта;
	ДокументВзаимозачет.ВидОперации = Перечисления.ВидыОперацийВзаимозачетаЗадолженности.Произвольный;
	ДокументВзаимозачет.ТипДебитора = Перечисления.ТипыУчастниковВзаимозачета.Клиент;
	ДокументВзаимозачет.ТипКредитора = Перечисления.ТипыУчастниковВзаимозачета.Поставщик;
	ДокументВзаимозачет.СуммаРегл = ИС_WB_СерверУТ11_5.ПересчитатьВСуммуРегл(ДокументПриобретения.СуммаДокумента, ДокументПриобретения.Валюта, ДокументПриобретения.Дата); 
	ДокументВзаимозачет.СуммаУпр = ИС_WB_СерверУТ11_5.ПересчитатьВСуммуУпр(ДокументПриобретения.СуммаДокумента, ДокументПриобретения.Валюта, ДокументПриобретения.Дата); 
	
	ДебиторскаяЗадолженностьТЧ = ДокументВзаимозачет.ДебиторскаяЗадолженность.Добавить();
	ДебиторскаяЗадолженностьТЧ.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	ДебиторскаяЗадолженностьТЧ.Партнер = ДокументПриобретения.Партнер;
	
	//+ ИнфоСофт Заварин К.В. 21.11.24 УА #86791
	//ДебиторскаяЗадолженностьТЧ.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ОтчетКомиссионера);	
	ДебиторскаяЗадолженностьТЧ.ОбъектРасчетов = ОбъектРасчетов;
	//- ИнфоСофт Заварин К.В. 21.11.24 УА #86791 
	
	ДебиторскаяЗадолженностьТЧ.СуммаВзаиморасчетов = ДокументПриобретения.СуммаДокумента;
	ДебиторскаяЗадолженностьТЧ.ВалютаВзаиморасчетов = ДокументПриобретения.ВалютаВзаиморасчетов;
	ДебиторскаяЗадолженностьТЧ.Организация = ДокументПриобретения.Организация; 
	ДебиторскаяЗадолженностьТЧ.СуммаРегл = ДокументВзаимозачет.СуммаРегл; 
	ДебиторскаяЗадолженностьТЧ.СуммаУпр = ДокументВзаимозачет.СуммаУпр;
	
	КредиторскаяЗадолженностьТЧ = ДокументВзаимозачет.КредиторскаяЗадолженность.Добавить();
	КредиторскаяЗадолженностьТЧ.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	КредиторскаяЗадолженностьТЧ.Партнер = ДокументПриобретения.Партнер;
	
	//+ ИнфоСофт Заварин К.В. 21.11.24 УА #86791
	//КредиторскаяЗадолженностьТЧ.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", ДокументПриобретения.Ссылка);	
	КредиторскаяЗадолженностьТЧ.ОбъектРасчетов = ДокументРасчетов;
	//- ИнфоСофт Заварин К.В. 21.11.24 УА #86791
	
	КредиторскаяЗадолженностьТЧ.СуммаВзаиморасчетов = ДокументПриобретения.СуммаДокумента;
	КредиторскаяЗадолженностьТЧ.ВалютаВзаиморасчетов = ДокументПриобретения.ВалютаВзаиморасчетов;
	КредиторскаяЗадолженностьТЧ.Организация = ДокументПриобретения.Организация;
	КредиторскаяЗадолженностьТЧ.СуммаРегл = ДокументВзаимозачет.СуммаРегл; 
	КредиторскаяЗадолженностьТЧ.СуммаУпр = ДокументВзаимозачет.СуммаУпр;
	
	Попытка
		ДокументВзаимозачет.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		ДокументВзаимозачет.Записать();
	КонецПопытки;  
	
	Возврат ДокументВзаимозачет.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 18.12.2023 УА #65730

//+ ИнфоСофт Стояк Ю.К. 21.01.2024 УА #61983
Функция ПолучитьНастройкиСопоставления() Экспорт
	
	Событие = "ПолучитьНастройкиСопоставления";
	Параметры = Новый Структура;
	
	МассивНаименованийПараметров = Новый Массив;  	
	МассивНаименованийПараметров.Добавить("РазделительФотографий");
	МассивНаименованийПараметров.Добавить("ЗначениеАртикулаПоУмолчанию");
	МассивНаименованийПараметров.Добавить("РасширенияДляВыгрузкиКартинок");
	МассивНаименованийПараметров.Добавить("ВесовойТовар_МинимальныйВес");
	МассивНаименованийПараметров.Добавить("ВесовойТовар_МаксимальныйВес");
	МассивНаименованийПараметров.Добавить("ВесовойТовар_ПризнакВесовогоТовара");
	МассивНаименованийПараметров.Добавить("ВесовойТовар_Квант");
	МассивНаименованийПараметров.Добавить("ВесовойТовар_МинимальноеКоличество");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Наименование КАК Наименование,
	|	ИС_MP_Настройки.Значение КАК Значение
	|ИЗ
	|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.Наименование В(&МассивПараметров)";
	
	Запрос.УстановитьПараметр("МассивПараметров", МассивНаименованийПараметров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Настройки = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Настройки.Вставить(Выборка.Наименование, Выборка.Значение);		
	КонецЦикла;
	
	//Если Настройки.Количество() = 0 Тогда
	//	Текст = "Настройки сопоставленмя не установлены";
	//	ЗаписьЖурналаРегистрации("ИС.OZON." + Событие, УровеньЖурналаРегистрации.Ошибка, , , Текст);
	//	ОбщегоНазначения.СообщитьПользователю(Текст);
	//	Возврат Ложь;
	//КонецЕсли;
			
	Если Настройки["РазделительФотографий"] <> Неопределено Тогда
		Параметры.Вставить("РазделительФотографий", Настройки["РазделительФотографий"]);
	Иначе
		Параметры.Вставить("РазделительФотографий", "");
	КонецЕсли;
	
	Если Настройки["ЗначениеАртикулаПоУмолчанию"] <> Неопределено Тогда
		Параметры.Вставить("ЗначениеАртикулаПоУмолчанию", Настройки["ЗначениеАртикулаПоУмолчанию"]);
	Иначе
		Параметры.Вставить("ЗначениеАртикулаПоУмолчанию", Перечисления.ИС_Ozon_ЗначениеАртикулаПоУмолчанию.GUID);
	КонецЕсли; 
	
	Если Настройки["РасширенияДляВыгрузкиКартинок"] <> Неопределено Тогда
		Параметры.Вставить("РасширенияДляВыгрузкиКартинок", Настройки["РасширенияДляВыгрузкиКартинок"]);
	Иначе
		Параметры.Вставить("РасширенияДляВыгрузкиКартинок", "");
	КонецЕсли;
	
	
	
	Если Настройки["ВесовойТовар_МинимальныйВес"] <> Неопределено Тогда
		Параметры.Вставить("ВесовойТовар_МинимальныйВес", Настройки["ВесовойТовар_МинимальныйВес"]);
	Иначе
		Параметры.Вставить("ВесовойТовар_МинимальныйВес", Справочники.ИС_Ozon_Характеристики.ПустаяСсылка());
	КонецЕсли;
	
	Если Настройки["ВесовойТовар_МаксимальныйВес"] <> Неопределено Тогда
		Параметры.Вставить("ВесовойТовар_МаксимальныйВес", Настройки["ВесовойТовар_МаксимальныйВес"]);
	Иначе
		Параметры.Вставить("ВесовойТовар_МаксимальныйВес", Справочники.ИС_Ozon_Характеристики.ПустаяСсылка());
	КонецЕсли; 
	
	Если Настройки["ВесовойТовар_ПризнакВесовогоТовара"] <> Неопределено Тогда
		Параметры.Вставить("ВесовойТовар_ПризнакВесовогоТовара", Настройки["ВесовойТовар_ПризнакВесовогоТовара"]);
	Иначе
		Параметры.Вставить("ВесовойТовар_ПризнакВесовогоТовара", Справочники.ИС_Ozon_Характеристики.ПустаяСсылка());
	КонецЕсли;  
	
	Если Настройки["ВесовойТовар_Квант"] <> Неопределено Тогда
		Параметры.Вставить("ВесовойТовар_Квант", Настройки["ВесовойТовар_Квант"]);
	Иначе
		Параметры.Вставить("ВесовойТовар_Квант", Справочники.ИС_Ozon_Характеристики.ПустаяСсылка());
	КонецЕсли;
	
	Если Настройки["ВесовойТовар_МинимальноеКоличество"] <> Неопределено Тогда
		Параметры.Вставить("ВесовойТовар_МинимальноеКоличество", Настройки["ВесовойТовар_МинимальноеКоличество"]);
	Иначе
		Параметры.Вставить("ВесовойТовар_МинимальноеКоличество", Справочники.ИС_Ozon_Характеристики.ПустаяСсылка());
	КонецЕсли; 
	
	Возврат Параметры;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 21.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 21.01.2024 УА #61983
Функция ЕстьНедопустимыеСимволыВСтроке(ПроверяемаяСтрока) Экспорт

	Результат = Истина;

	Диапазоны = Новый Массив;
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 32, 35)); 		// Спец. символы ( ПРОБЕЛ ! " #)
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 37, 47)); 		// Спец. символы ( % & ' ( ) * + , - . / )
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 48, 57)); 		// Цифры
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 58, 60)); 		// Спец. символы ( : ; < )
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 62, 64)); 		// Спец. символы ( > ? @ )
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 65, 90)); 		// Латиница большие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 95, 95)); 		// Символ "_"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 97, 122)); 		// Латиница маленькие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1040, 1103)); 	// Кириллица
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1025, 1025)); 	// Символ "Ё"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1105, 1105)); 	// Символ "ё"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 8470, 8470)); 	// Символ "№"
	РазмерСтроки = СтрДлина(ПроверяемаяСтрока);

	Для Позиция = 1 По РазмерСтроки Цикл
		КодСимвола = КодСимвола(ПроверяемаяСтрока, Позиция);

		Результат = Истина;
		Для Каждого Диапазон Из Диапазоны Цикл
			Если КодСимвола >= Диапазон.Мин И КодСимвола <= Диапазон.Макс Тогда
				//Символ входит в диапазон
				Результат = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если Результат Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 21.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция СоответствиеСтавокНДС() Экспорт
	 
	Возврат ИС_Ozon_СерверПовтИсп.СоответствиеСтавокНДС();

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция Артикул(Номенклатура, Характеристика, Упаковка) Экспорт

	Ozon_Константы = ПолучитьНастройкиСопоставления();
	ЗначениеАртикулаПоУмолчанию = Ozon_Константы.ЗначениеАртикулаПоУмолчанию;

	Если ЗначениеАртикулаПоУмолчанию = ПредопределенноеЗначение("Перечисление.ИС_Ozon_ЗначениеАртикулаПоУмолчанию.GUID") Тогда
		Артикул = Строка(Новый УникальныйИдентификатор);
	Иначе		
		Артикул = СтрШаблон("%1-%2-%3", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "Артикул"), Характеристика, Упаковка);
	КонецЕсли;

	Возврат Артикул;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ТипРеквизита(type, МножественныйВыбор, ЗначенияИзСправочника) Экспорт

	Тип = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная));
	typeНР = НРег(type);
	Если ЗначенияИзСправочника И Не МножественныйВыбор Тогда
		Тип = Новый ОписаниеТипов("СправочникСсылка.ИС_Ozon_ЗначенияХарактеристик");
	ИначеЕсли МножественныйВыбор Тогда
		Тип = Новый ОписаниеТипов("СписокЗначений");
	ИначеЕсли typeНР = "decimal" Тогда
		Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3, ДопустимыйЗнак.Любой));
	ИначеЕсли typeНР = "integer" Тогда
		Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой));
	ИначеЕсли typeНР = "boolean" Тогда
		Тип = Новый ОписаниеТипов("Булево");
	ИначеЕсли typeНР = "multiline" Тогда
		Тип = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная));
	КонецЕсли;

	Возврат Тип;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ЗаполнитьСтруктуруДобавленияТовара(Источник, ПоляАтрибутов, Категория) Экспорт

	СтруктураТовара = СтруктураДобавленияТовара();
	СоответствиеСтавокНДС = СоответствиеСтавокНДС();

	СтруктураТовара.name 			= Источник.Название;
	СтруктураТовара.barcode 		= Источник.Штрихкод;
	СтруктураТовара.offer_id 		= Источник.Артикул;
	//@skip-check wrong-string-literal-content
	//+ ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269	
	//СтруктураТовара.category_id 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Категория, "Код");
	СтруктураТовара.description_category_id 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Категория, "Код");
	//- ИнфоСофт Стояк Ю.К. 05.03.2024 УА #71269
	СтруктураТовара.price 			= Формат(Источник.Цена, "ЧРД=.; ЧН=0; ЧГ=0");
	СтруктураТовара.old_price 		= Формат(Источник.ЦенаДоСкидки, "ЧРД=.; ЧН=0; ЧГ=0");
	СтруктураТовара.min_price 		= Формат(Источник.ЦенаМинимальная, "ЧРД=.; ЧН=0; ЧГ=0");
	СтруктураТовара.vat 			= СоответствиеСтавокНДС.Получить(Источник.СтавкаНДС);
	СтруктураТовара.depth 			= Источник.ДлинаУпаковки;
	СтруктураТовара.width 			= Источник.ШиринаУпаковки;
	СтруктураТовара.height 			= Источник.ВысотаУпаковки;
	СтруктураТовара.dimension_unit 	= "mm";
	СтруктураТовара.weight 			= Источник.ВесУпаковки;
	СтруктураТовара.weight_unit 	= "g";
	СтруктураТовара.attributes		= МассивЗначенийХарактеристикДобавлениеТовара(Источник, ПоляАтрибутов);
	СтруктураТовара.primary_image	= Источник.СсылкаНаГлавноеФото;
	СтруктураТовара.color_image		= Источник.МаркетинговыйЦвет;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтруктураТовара.images, Источник.Изображения.ВыгрузитьЗначения(),
		Истина);

	Возврат СтруктураТовара;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция СтруктураДобавленияТовара()

	Результат = Новый Структура;
	Результат.Вставить("name", ""); // Строка - Название товара. До 500 символов.
	Результат.Вставить("barcode", ""); // Строка - Штрихкод товара.
	Результат.Вставить("offer_id", ""); // Строка - Идентификатор товара в системе продавца - артикул.
	//+ ИнфоСофт Стояк Ю.К. 22.03.2024 УА #72805	
	//Результат.Вставить("category_id", 0);  // Число  - Идентификатор категории.
	Результат.Вставить("description_category_id", 0);  // Число  - Идентификатор категории.
	//- ИнфоСофт Стояк Ю.К. 22.03.2024 УА #72805
	Результат.Вставить("color_image", ""); // Строка - Маркетинговый цвет.
	Результат.Вставить("old_price", ""); // Строка - Цена до скидок (будет зачеркнута на карточке товара). Указывается в рублях. Разделитель дробной части - точка, до двух знаков после точки.
	Результат.Вставить("price", ""); // Строка - Цена товара с учетом скидок, отображается на карточке товара. Если на товар нет скидок - укажите значение old_price.
	Результат.Вставить("min_price", ""); // Строка - Минимальная цена товара после применения акций.
	Результат.Вставить("vat", ""); // Строка - Ставка НДС для товара. 0 - не облагается НДС, 0.1 - 10%, 0.2 - 20%.
	Результат.Вставить("depth", 0);  // Число  - Глубина упаковки.
	Результат.Вставить("width", 0);  // Число  - Ширина упаковки.
	Результат.Вставить("height", 0);  // Число  - Высота упаковки.
	Результат.Вставить("dimension_unit", ""); // Строка - Единица измерения габаритов. mm - миллиметры, cm - сантиметры, in - дюймы.
	Результат.Вставить("weight", 0);  // Число  - Вес товара в упаковке. Предельное значение - 1000 килограмм или конвертированная величина в других единицах измерения.
	Результат.Вставить("weight_unit", ""); // Строка - Единицы измерения веса: g - граммы, kg - килограммы, lb - фунты.
	
	//+ ИнфоСофт Мурсалимов Д.Р. 21.04.25 УА #96982
	//Результат.Вставить("image_group_id", ""); // Строка - Идентификатор для последующей пакетной загрузки изображений.
	//- ИнфоСофт Мурсалимов Д.Р. 21.04.25 УА #96982
	
	Результат.Вставить("primary_image", ""); // Строка - Ссылка на главное изображение товара.
	Результат.Вставить("images", Новый Массив); // Массив из Строка - Массив с изображениями, не больше 10.
	Результат.Вставить("pdf_list", Новый Массив); // Массив из Структура - Список pdf-файлов.
	Результат.Вставить("complex_attributes", Новый Массив); // Массив из Структура - Массив характеристик, у которых есть вложенные аттрибуты.
	Результат.Вставить("attributes", Новый Массив); // Массив из Структура - Массив с характеристиками товара.

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция МассивЗначенийХарактеристикДобавлениеТовара(Источник, ПоляАтрибутов)

	Результат = Новый Массив;

	Для Каждого Поле Из ПоляАтрибутов Цикл

		ЗначениеХарактеристики = Источник[Поле.Имя];
		Если Не ЗначениеЗаполнено(ЗначениеХарактеристики) Тогда
			Продолжить;	
		КонецЕсли;
		
		ИдХарактеристики = Число(СтрРазделить(Поле.Имя, "_")[1]);
		СтруктураХарактеристики = СтруктуруХарактеристикиДобавлениеТовара(ИДХарактеристики);

		Если ТипЗнч(ЗначениеХарактеристики) = Тип("СписокЗначений") Тогда
			МассивВыбранныхЗначений = ЗначениеХарактеристики.ВыгрузитьЗначения();
			Для Каждого Значение Из МассивВыбранныхЗначений Цикл
				Если ЗначениеЗаполнено(Значение) Тогда
					СтруктураЗначения = СтруктураЗначенияХарактеристикиДобавлениеТовара(Значение);
					СтруктураХарактеристики.values.Добавить(СтруктураЗначения);
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если ТипЗнч(ЗначениеХарактеристики) = Тип("Строка") И Поле.МногострочныйРежим <> Неопределено
				И Поле.МногострочныйРежим И Не ТекстСодержитJSON(ЗначениеХарактеристики) Тогда
				ТекстВHTML = ПреобразоватьМногострочныйТекстВHTML(
					ЗначениеХарактеристики);
				СтруктураЗначения = СтруктураЗначенияХарактеристикиДобавлениеТовара(ТекстВHTML);
			Иначе
				СтруктураЗначения = СтруктураЗначенияХарактеристикиДобавлениеТовара(ЗначениеХарактеристики);
			КонецЕсли;
			СтруктураХарактеристики.values.Добавить(СтруктураЗначения);
		КонецЕсли;

		Результат.Добавить(СтруктураХарактеристики);

	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция СтруктуруХарактеристикиДобавлениеТовара(ИДХарактеристики)

	Результат = Новый Структура;
	Результат.Вставить("complex_id", 0);
	Результат.Вставить("id", 0);
	Результат.Вставить("values", Новый Массив);  // {"dictionary_value_id": 0, "value": "string" }

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ozon_Характеристики.Код КАК Код,
	|	Ozon_Характеристики.ИдентификаторГруппы КАК ИдентификаторГруппы
	|ИЗ
	|	Справочник.ИС_Ozon_Характеристики КАК Ozon_Характеристики
	|ГДЕ
	|	Ozon_Характеристики.Код = &Код";

	Запрос.УстановитьПараметр("Код", ИДХарактеристики);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Результат.id 			= Выборка.Код;
		Результат.complex_id 	= Выборка.ИдентификаторГруппы;
	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция СтруктураЗначенияХарактеристикиДобавлениеТовара(Значение)

	Результат = Новый Структура;
	Результат.Вставить("dictionary_value_id", 0);
	Результат.Вставить("value", "");

	Если ТипЗнч(Значение) = Тип("СправочникСсылка.ИС_Ozon_ЗначенияХарактеристик") Тогда
		Результат.dictionary_value_id 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Значение, "Код");
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		Результат.value = Формат(Значение, "ЧГ=0");
	Иначе
		Результат.value = Строка(Значение);
	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ПреобразоватьHTMLВМногострочныйТекст(ТекстHTML) Экспорт

	Вложения = Новый Структура;

	Док = Новый ФорматированныйДокумент;
	Док.УстановитьHTML(ТекстHTML, Вложения);

	МногострочныйТекст = Док.ПолучитьТекст();

	Возврат МногострочныйТекст;
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983  

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ПреобразоватьМногострочныйТекстВHTML(МногострочныйТекст) Экспорт

	Если Не ЗначениеЗаполнено(МногострочныйТекст) Тогда
		Возврат "";
	КонецЕсли;

	HTMLДокумент = "";
	Вложения = Новый Структура;
	Док = Новый ФорматированныйДокумент;
	Док.Добавить(МногострочныйТекст, ТипЭлементаФорматированногоДокумента.Текст);

	Док.ПолучитьHTML(HTMLДокумент, Вложения);

	НачПоз =  СтрНайти(HTMLДокумент, "<p>") + СтрДлина("<p>");
	КонПоз = СтрНайти(HTMLДокумент, "</p>");

	ТекстВHTML = Сред(HTMLДокумент, НачПоз, КонПоз - НачПоз);

	Возврат ТекстВHTML;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ТекстСодержитJSON(Текст)

	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Текст);
		//@skip-check module-unused-local-variable
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		Результат = Истина;
	Исключение
		Результат = Ложь;
	КонецПопытки;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ПолучитьКартинкиПоВладельцу(ВладелецФайлов, РасширенияДляВыгрузкиКартинок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрисоединенныеФайлы.Ссылка КАК Ссылка,
	|	ПрисоединенныеФайлы.Расширение КАК Расширение,
	|	ПрисоединенныеФайлы.Размер КАК Размер
	|ИЗ
	|	ИсточникДанных КАК ПрисоединенныеФайлы
	|ГДЕ
	|	ПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайлов";

	ИмяТаблицы = "Справочник." + ВладелецФайлов.Метаданные().Имя + "ПрисоединенныеФайлы";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсточникДанных", ИмяТаблицы);

	Запрос.УстановитьПараметр("ВладелецФайлов", ВладелецФайлов);

	МассивСсылок = Новый Массив;

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивСсылок;

	КонецЕсли;

	СтрокаРасширений = ВРег(РасширенияДляВыгрузкиКартинок);
	Выборка = РезультатЗапроса.Выбрать();
	ОграничениеПоРазмеруФото = 10 * 1000 * 1000;
	Пока Выборка.Следующий() Цикл
		Если СтрНайти(СтрокаРасширений, ВРег(Выборка.Расширение)) > 0 И Выборка.Размер < ОграничениеПоРазмеруФото
			И Выборка.Ссылка <> ВладелецФайлов.ФайлКартинки Тогда
			МассивСсылок.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;

	Возврат МассивСсылок;
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983 

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ОбработатьСсылки(ЗначениеХарактеристикиOzon) Экспорт

	Если ТипЗнч(ЗначениеХарактеристикиOzon) = Тип("Массив") Тогда
		Счетчик = 0;
		МассивРезультата = Новый Массив;
		Для Каждого СтрокаМассива Из ЗначениеХарактеристикиOzon Цикл

			МассивРезультата.Добавить(ОбработатьСсылку(СтрокаМассива));
			Счетчик = Счетчик + 1;

			Если Счетчик = 14 Тогда
				Прервать;
			КонецЕсли;

		КонецЦикла;

		Возврат МассивРезультата;
	Иначе
		Возврат ОбработатьСсылку(ЗначениеХарактеристикиOzon);
	КонецЕсли;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ОбработатьСсылку(ЗначениеХарактеристикиOzon)

	Если ТипЗнч(ЗначениеХарактеристикиOzon) = Тип("Строка") Тогда

		Возврат ПолучитьАдресИзСсылкиИзHTMLТэга(ЗначениеХарактеристикиOzon);

	ИначеЕсли ТипЗнч(ЗначениеХарактеристикиOzon) = Тип("СправочникСсылка.НоменклатураПрисоединенныеФайлы")
		Или (КраткоеНаименованиеОсновнойПодсистемы() = "УНФ" 
		И ТипЗнч(ЗначениеХарактеристикиOzon) = Тип("СправочникСсылка.ХарактеристикиНоменклатурыПрисоединенныеФайлы")) Тогда

		Возврат ПолучитьВнешнююСсылкуНаКартинку(ЗначениеХарактеристикиOzon);

	КонецЕсли;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ПолучитьАдресИзСсылкиИзHTMLТэга(Знач СтрокаСоСсылкой) Экспорт

	Адрес = "";
	ПозицияНачалаСсылки = Найти(НРег(СтрокаСоСсылкой), "<a");
	Если ПозицияНачалаСсылки > 0 Тогда
		СтрокаСоСсылкой = Сред(СтрокаСоСсылкой, ПозицияНачалаСсылки);
		МассивИзСтрок = СтрРазделить(СтрокаСоСсылкой, """");
		Если МассивИзСтрок.Количество() > 1 Тогда
			Адрес = МассивИзСтрок[1];
		КонецЕсли;
	Иначе
		Адрес = СтрокаСоСсылкой;
	КонецЕсли;

	Возврат Адрес;  
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ПолучитьВнешнююСсылкуНаКартинку(ПрисоединенныйФайл) Экспорт

	СсылкаНаКартинку = "";

	Если Не ЗначениеЗаполнено(ПрисоединенныйФайл) Тогда
		Возврат СсылкаНаКартинку;
	КонецЕсли;

	Расширение = ПрисоединенныйФайл.Расширение;

	Попытка
		ДвоичныеДанныеКартинки = РаботаСФайлами.ДвоичныеДанныеФайла(ПрисоединенныйФайл);
	Исключение
		//Ozon_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить ссылку на картинку: Проблема с прикрепленным файлом. Подробности см. в Журнале регистрации ");
		ТекстОшибки = СтрШаблон("Не удалось получить ссылку на картинку для %1. Проблема с прикрепленным файлом.",
			ПрисоединенныйФайл.ВладелецФайла);
		Возврат СсылкаНаКартинку;
	КонецПопытки;
				
	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();	
	ПараметрыЗапроса.Порт = 80;
	ПараметрыЗапроса.ЗащищенноеСоединение = Ложь;
	ПараметрыЗапроса.Сервер = "picabox.ru";
	ПараметрыЗапроса.АдресРесурса = "/image/upload";
	
	ИспользоватьЯндексДиск = Ложь;
	Если ИспользоватьЯндексДиск Тогда
		//СтруктураРезультата = Ozon_ИнтернетЗапросыВызовСервера.СтруктураРезультатаЗапроса("ЯндексДиск.ЗагрузкаФайла");
		//СтруктураРезультата.Вставить("ВладелецФайла", ПрисоединенныйФайл.ВладелецФайла);
		//ЗагрузитьФайлНаЯндексДиск(СтруктураРезультата, ДвоичныеДанныеКартинки, Расширение);
	Иначе				
		//+ ИнфоСофт Стояк Ю.К. 20.02.2025 УА #93500		
		//СсылкаНаКартинку = ЗагрузитьФайлНаPicabox(ПараметрыЗапроса, ДвоичныеДанныеКартинки, Расширение);
		СсылкаНаКартинку = ЗагрузитьФайлНаPicabox(ПараметрыЗапроса, ДвоичныеДанныеКартинки, ПрисоединенныйФайл);
		//- ИнфоСофт Стояк Ю.К. 20.02.2025 УА #93500
	КонецЕсли;

	Возврат СсылкаНаКартинку;   
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983 

//+ ИнфоСофт Стояк Ю.К. 20.02.2025 УА #93500
//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
//Функция ЗагрузитьФайлНаPicabox(СтруктураРезультата, ДвоичныеДанныеКартинки, Расширение)
Функция ЗагрузитьФайлНаPicabox(СтруктураРезультата, ДвоичныеДанныеКартинки, ПрисоединенныйФайл)
//- ИнфоСофт Стояк Ю.К. 20.02.2025 УА #93500

	//+ ИнфоСофт Стояк Ю.К. 20.02.2025 УА #93500	
	Тип = ПрисоединенныйФайл.Расширение;
	
	Если Тип = "jpg" Тогда
		Тип = "jpeg";	
	КонецЕсли;
	
	ПоляФормы = Новый Массив;
	
	ПолеФормы = Новый Структура;	
	
	ПолеФормы.Вставить("ИмяПоля",  "ImagesForm[imageFiles][0]");
	ПолеФормы.Вставить("ИмяФайла", ПрисоединенныйФайл.Наименование + "." + Тип);
	ПолеФормы.Вставить("Тип",      "image/" + Тип);
	ПолеФормы.Вставить("Тело",     ДвоичныеДанныеКартинки);
	
	ПоляФормы.Добавить(ПолеФормы);
	
	ПолеФормы = Новый Структура;
	
	ПолеФормы.Вставить("ИмяПоля",  "ImagesForm[text]");
	ПолеФормы.Вставить("ИмяФайла", "");
	ПолеФормы.Вставить("Тип",      "");
	ПолеФормы.Вставить("Тело",     "");
	
	ПоляФормы.Добавить(ПолеФормы);
	
	ДанныеПреобразования = ИС_МП_РаботаСHTTPЗапросами.ДвоичныеДанныеPOSTЗапросаКакФорма(ПоляФормы);
	СтруктураРезультата.ТелоДвоичныеДанные = ДанныеПреобразования.ДвоичныеДанные;
	Размер      = ДанныеПреобразования.Размер;    
	
	СтруктураРезультата.Заголовки.Вставить("Content-Type",   "multipart/form-data; boundary=" + ДанныеПреобразования.Разделитель);
	СтруктураРезультата.Заголовки.Вставить("Content-Lenght", Формат(Размер, "ЧН=0; ЧГ=0;"));

	Результат = ИС_Ozon_API.ОтправитьФайлКартинкиНаPicabox(СтруктураРезультата);
	//- ИнфоСофт Стояк Ю.К. 20.02.2025 УА #93500
	
	Возврат Результат;
		
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура ПодготовитьФайлДанных(Знач Boundary, Знач ИмяФайлаДляЗагрузки, Знач ИмяФайлаОтправки)
	
	//Определяем массив для процедуры ОбъединитьФайлы 
	МассивФайловДляОбъединения = Новый Массив; 
	
	//Формируем начальный фрагмент файла POST-запроса 
	//@skip-check missing-temporary-file-deletion
	ИмяФайлаОтправкиНачало = ПолучитьИмяВременногоФайла("txt");
	ФайлОтправкиНачало = Новый ЗаписьТекста(ИмяФайлаОтправкиНачало, КодировкаТекста.ANSI, Символы.ПС, Ложь);
	ФайлОтправкиНачало.ЗаписатьСтроку("--" + Boundary); 
	//Указываем имя файла для передачи 
	ФайлОтправкиНачало.ЗаписатьСтроку("Content-Disposition: form-data; name=""ImagesForm[imageFiles][0]""; filename="""
		+ ИмяФайлаДляЗагрузки + """"); 
	//Указываем тип передаваемых данных. 
	ФайлОтправкиНачало.ЗаписатьСтроку("Content-Type: application/x-octet-stream");
	ФайлОтправкиНачало.ЗаписатьСтроку("");
	ФайлОтправкиНачало.Закрыть();

	МассивФайловДляОбъединения.Добавить(ИмяФайлаОтправкиНачало); 
	
	//Добавляем файл в массив для объединения
	МассивФайловДляОбъединения.Добавить(ИмяФайлаДляЗагрузки); 
	
	
	//Формируем конечный фрагмент файла POST-запроса 
	//@skip-check missing-temporary-file-deletion
	ИмяФайлаОтправкиКонец = ПолучитьИмяВременногоФайла("txt");
	ФайлОтправкиКонец = Новый ЗаписьТекста(ИмяФайлаОтправкиКонец, КодировкаТекста.ANSI, Символы.ПС, Ложь);
	ФайлОтправкиКонец.ЗаписатьСтроку("--" + Boundary); 
	
	//Определяем раздел для каких либо других POST-данных, например содержимого полей виртуальной HTML-формы. 
	ФайлОтправкиКонец.ЗаписатьСтроку("--" + Boundary);
	ФайлОтправкиКонец.ЗаписатьСтроку("Content-disposition: form-data; name=""ImagesForm[text]""" + Символы.ПС);
	ФайлОтправкиКонец.ЗаписатьСтроку(Null); 
	
	//Завершение сообщения для сервера 
	ФайлОтправкиКонец.ЗаписатьСтроку("--" + Boundary + "--");
	ФайлОтправкиКонец.Закрыть();

	МассивФайловДляОбъединения.Добавить(ИмяФайлаОтправкиКонец); 
	
	//Теперь сформированные фрагменты сообщения для сервера объединяем в один файл POST-запроса 
	ОбъединитьФайлы(МассивФайловДляОбъединения, ИмяФайлаОтправки);

	//Удаляем файлы фрагментов сообщения. Больше они не нужны 
	Попытка
		Для Каждого ЭлементМассива Из МассивФайловДляОбъединения Цикл
			УдалитьФайлы(ЭлементМассива);
		КонецЦикла;
	Исключение
		Комментарий = СтрШаблон("Не удалось удалось временный файл после использования: %1%2", Символы.ПС,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));		
	КонецПопытки;
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура УстановитьЗаголовокЭлементаФормы(Форма, ИмяЭлемента) Экспорт

	КраткоеНаименованиеОсновнойПодсистемы = КраткоеНаименованиеОсновнойПодсистемы();
	Если КраткоеНаименованиеОсновнойПодсистемы = "УНФ" Тогда

		Если Форма.ИмяФормы = "Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаСозданияНоменклатуры" Тогда

			ЭлементФормы = Форма.Элементы.Найти(ИмяЭлемента);
			Если ЭлементФормы <> Неопределено Тогда
				ЭлементФормы.Заголовок = "Категория номенклатуры";
				ЭлементФормы.РасширеннаяПодсказка.Заголовок = "Категория – группа товаров с общими свойствами. Категория описывает общие характеристики входящих в нее товаров – например, категория шампуни, общие свойства – тип волос, назначение – против перхоти или для окрашенных волос и т.п..";
			КонецЕсли
			;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура УстановитьСвязиПараметровВыбораХарактеристикиИУпаковки(Форма, ИмяТЧ = "Товары") Экспорт

	ЭлементХарактеристика = Форма.Элементы.Найти("ХарактеристикаНоменклатуры");
	ЭлементУпаковка = Форма.Элементы.Найти("Упаковка");

	КраткоеНаименованиеОсновнойПодсистемы = КраткоеНаименованиеОсновнойПодсистемы();

	СвязиПараметровВыбора = Новый Массив;
	ПараметрыВыбораУпаковки = Новый Массив;

	Если КраткоеНаименованиеОсновнойПодсистемы = "УНФ" Тогда
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", СтрШаблон(
			"Элементы.%1.ТекущиеДанные.Номенклатура", ИмяТЧ), РежимИзмененияСвязанногоЗначения.Очищать));
		ПараметрыВыбораУпаковки.Добавить(Новый ПараметрВыбора("НеИспользоватьКлассификатор", Истина));
	Иначе
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Номенклатура", СтрШаблон(
			"Элементы.%1.ТекущиеДанные.Номенклатура", ИмяТЧ), РежимИзмененияСвязанногоЗначения.Очищать));
	КонецЕсли;

	Если Не ЭлементХарактеристика = Неопределено Тогда
		ЭлементХарактеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	КонецЕсли;

	Если Не ЭлементУпаковка = Неопределено Тогда
		ЭлементУпаковка.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
		ЭлементУпаковка.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораУпаковки);
	КонецЕсли;
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура УстановитьПараметровВыбораНоменклатураУслуга(Форма, ИмяЭлемента) Экспорт

	Элемент = Форма.Элементы.Найти(ИмяЭлемента);
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КраткоеНаименованиеОсновнойПодсистемы = КраткоеНаименованиеОсновнойПодсистемы();

	ПараметрыВыбора = Новый Массив;

	Если КраткоеНаименованиеОсновнойПодсистемы = "УНФ" Тогда

		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ТипНоменклатуры", ПредопределенноеЗначение(
			"Перечисление.ТипыНоменклатуры.Услуга")));

	Иначе
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ТипНоменклатуры", ПредопределенноеЗначение(
			"Перечисление.ТипыНоменклатуры.Услуга")));
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ИспользованиеХарактеристик", ПредопределенноеЗначение(
			"Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать")));
	КонецЕсли;

	Элемент.ПараметрыВыбора 		= Новый ФиксированныйМассив(ПараметрыВыбора);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция КраткоеНаименованиеОсновнойПодсистемы() Экспорт

	Результат = "";

	ПоддерживаемыеПодсистемы = Новый Соответствие;
	ПоддерживаемыеПодсистемы.Вставить("УправлениеТорговлей", "УТ");
	ПоддерживаемыеПодсистемы.Вставить("УправлениеНебольшойФирмой", "УНФ");	

	Модуль_СтандартныеПодсистемыСервер = ОбщегоНазначения.ОбщийМодуль("СтандартныеПодсистемыСервер");
	Модуль_СтандартныеПодсистемыПовтИсп = ОбщегоНазначения.ОбщийМодуль("СтандартныеПодсистемыПовтИсп");

	ОписаниеПодсистемКонфигурации = Модуль_СтандартныеПодсистемыПовтИсп.ОписанияПодсистем().ПоИменам;

	Для Каждого КлючИЗначение Из ПоддерживаемыеПодсистемы Цикл
		ОписаниеПодсистемы = ОписаниеПодсистемКонфигурации.Получить(КлючИЗначение.Ключ + ?(
			Модуль_СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации(), "Базовая", ""));
		Если ОписаниеПодсистемы <> Неопределено Тогда
			Результат = КлючИЗначение.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
 
//+ ИнфоСофт Стояк Ю.К. 21.01.2024 УА #61983
Процедура ЗаписатьНастройкиСопоставления(Параметры) Экспорт
	
	 Событие = ПолучитьИмяСобытия("ЗаписатьНастройкиСопоставления");
    
	МассивНаименований = Новый Массив;
	
	Для Каждого Элемент Из Параметры Цикл
		МассивНаименований.Добавить(Элемент.Ключ);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_MP_Настройки.Ссылка КАК Ссылка,
		|	ИС_MP_Настройки.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
		|ГДЕ
		|	ИС_MP_Настройки.Наименование В(&Наименование)";
		
	Запрос.УстановитьПараметр("Наименование", МассивНаименований);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	
	Пока Выборка.Следующий() Цикл
	
		ОбъектЗаписи = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗаписи.Значение = Параметры[Выборка.Наименование];
		Параметры.Удалить(Выборка.Наименование);
		
		Попытка
			ОбъектЗаписи.Записать();
		Исключение    
		    ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));		    
		КонецПопытки;
		
	КонецЦикла;
	
	Для Каждого Элемент Из Параметры Цикл
	
		ОбъектЗаписи = Справочники.ИС_MP_Настройки.СоздатьЭлемент();				
		ОбъектЗаписи.Наименование = Элемент.Ключ;
		ОбъектЗаписи.Значение = Элемент.Значение;
	
		Попытка
			ОбъектЗаписи.Записать();
		Исключение
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.01.2024 УА #61983

//+ ИнфоСофт Мурсалимов Д.Р. 26.01.24 УА #62628
Процедура ДобавитьСоответствиеНоменклатуры(Профиль, НоменклатураOzon, Номенклатура, 
	Характеристика, Упаковка, ТекНоменклатура = Неопределено, ТекХарактеристика = Неопределено) Экспорт

	НаборЗаписей = РегистрыСведений.ИС_Ozon_СоответствиеХарактеристик.СоздатьНаборЗаписей();
		
	НаборЗаписей.Отбор.НоменклатураOzon.Установить(НоменклатураOzon);
		
	НаборЗаписей.Прочитать(); 
	
	ТребуетсяНоваяЗапись = Истина;	
	Если НаборЗаписей.Количество() > 0 Тогда 
		
		Для Каждого Запись Из НаборЗаписей Цикл
		
			Если Запись.Номенклатура = ТекНоменклатура И Запись.Характеристика = ТекХарактеристика Тогда
			
				Запись.Номенклатура 	= Номенклатура;
				Запись.Характеристика 	= Характеристика;
				Запись.Упаковка 		= Упаковка;
        		ТребуетсяНоваяЗапись 	= Ложь;
        		Прервать;
			
			КонецЕсли;
		
		КонецЦикла; 	
	
	КонецЕсли;
   
    Если ТребуетсяНоваяЗапись Тогда
	
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.НоменклатураOzon 	= НоменклатураOzon;
		НоваяЗапись.Номенклатура 		= Номенклатура; 
		НоваяЗапись.Характеристика 		= Характеристика;
		НоваяЗапись.Упаковка 			= Упаковка;
		
	КонецЕсли;
				
	НаборЗаписей.Записывать = Истина; 
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 26.01.24 УА #62628

//+ ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621
Процедура ЗаполчитьКэшПараметров(Кэш, Исключения)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_ПараметрыОтчетовРеализации.Ссылка КАК Ссылка,
	|	ИС_Ozon_ПараметрыОтчетовРеализации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ИС_Ozon_ПараметрыОтчетовРеализации КАК ИС_Ozon_ПараметрыОтчетовРеализации
	|ГДЕ
	|	ИС_Ozon_ПараметрыОтчетовРеализации.ПометкаУдаления = ЛОЖЬ
	|	И ИС_Ozon_ПараметрыОтчетовРеализации.Исключать";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИсключения = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаИсключения.Следующий() Цикл
		Исключения.Вставить(ВыборкаИсключения.Наименование, ВыборкаИсключения.Ссылка);		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_Ozon_ПараметрыОтчетовРеализации.Ссылка КАК Ссылка,
	|	ИС_Ozon_ПараметрыОтчетовРеализации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ИС_Ozon_ПараметрыОтчетовРеализации КАК ИС_WB_ПараметрыОтчетовРеализации
	|ГДЕ                                          
	|	ИС_Ozon_ПараметрыОтчетовРеализации.ПометкаУдаления = ЛОЖЬ
	|	И ИС_Ozon_ПараметрыОтчетовРеализации.Исключать = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКэш = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаКэш.Следующий() Цикл
		Кэш.Вставить(ВыборкаКэш.Наименование, ВыборкаКэш.Ссылка);		
	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 15.02.2024 УА #62621

//+ ИнфоСофт Стояк Ю.К. 20.02.2024 УА #62585
Функция ПолучитьНомерЗадания(Профиль, Склад, Создавать = Ложь
	//+ ИнфоСофт Заварин К.В. 11.04.25 УА #77376
	, Грузоместа = 0)
	//- ИнфоСофт Заварин К.В. 11.04.25 УА #77376
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ.delivery_method_id КАК delivery_method_id,
		|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ.Склад КАК Склад,
		|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ КАК Заказ,
		|	ИС_Ozon_СтатусыСборочныхЗаданий.status КАК status,
		|	ИС_Ozon_СтатусыСборочныхЗаданий.shipment_date КАК shipment_date,
		|	ИС_Ozon_СтатусыСборочныхЗаданий.id КАК id
		|ИЗ
		|	РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
		|ГДЕ
		//+ ИнфоСофт Стояк Ю.К. 19.03.2025 УА #88294		
		//|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ.shipment_date МЕЖДУ &НачалоДня И &КонецДня
		|	(ИС_Ozon_СтатусыСборочныхЗаданий.shipment_date МЕЖДУ &НачалоДня И &КонецДня
		|			ИЛИ ИС_Ozon_СтатусыСборочныхЗаданий.recommended_shipment_date МЕЖДУ &НачалоДня И &КонецДня)
		//- ИнфоСофт Стояк Ю.К. 19.03.2025 УА #88294
		|	И ИС_Ozon_СтатусыСборочныхЗаданий.Профиль = &Профиль
		|	И ИС_Ozon_СтатусыСборочныхЗаданий.Заказ.Склад = &Склад
		//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
		|	И НЕ ИС_Ozon_СтатусыСборочныхЗаданий.Заказ.ЗаказФБО
		//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
		//+ ИнфоСофт Стояк Ю.К. 19.03.2025 УА #88924		
		|
		|УПОРЯДОЧИТЬ ПО
		|	shipment_date";                         
		//- ИнфоСофт Стояк Ю.К. 19.03.2025 УА #88924		
	
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	СписокЗаданий = РезультатЗапроса.Выгрузить();  
	
	//+ ИнфоСофт Стояк Ю.К. 19.03.2025 УА #8829	
	//ПроверкаЗаполненогоИД = СписокЗаданий.Скопировать(, "shipment_date, id"); 
	//ПроверкаЗаполненогоИД.Свернуть("shipment_date, id");  
	ПроверкаЗаполненогоИД = СписокЗаданий.Скопировать(, "id"); 
	ПроверкаЗаполненогоИД.Свернуть("id");  
	//- ИнфоСофт Стояк Ю.К. 19.03.2025 УА #88294
	
	Если ПроверкаЗаполненогоИД.Количество() = 1 И ПроверкаЗаполненогоИД[0].id <> 0 И Не Создавать Тогда
		Возврат ПроверкаЗаполненогоИД[0].id;
	КонецЕсли;
	
	Если СписокЗаданий.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Нет заказов по складу " + Склад + " готовых к формированию документов.");
		Возврат Неопределено;
	КонецЕсли;
	
	Непринятые = СписокЗаданий.Скопировать(Новый Структура("status", Перечисления.ИС_Ozon_СтатусыОтправлений.not_accepted));
	ОжидаютУпаковки = СписокЗаданий.Скопировать(Новый Структура("status", Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_packaging));	
	
	Если Непринятые.Количество() > 0 Или ОжидаютУпаковки.Количество() > 0 Тогда 
		
		ТекстВопроса  = СтрШаблон("Проверьте, что вы собрали все отправления. Изменить состав отгрузки потом будет нельзя.
		|Отправлений: %1
		|Ожидающих сборки: %2
		|Не принятых на сортировочном центре: %3
		|По складу %4", СписокЗаданий.Количество(),
		ОжидаютУпаковки.Количество(), Непринятые.Количество(), Склад);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстВопроса);
		
		Возврат Неопределено;
		
	КонецЕсли;    
		
	ИДметода = СписокЗаданий[0].delivery_method_id;
	Дата = СписокЗаданий[0].shipment_date;
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	Тело = Новый Структура; 
	
	//+ ИнфоСофт Заварин К.В. 11.04.25 УА #77376
	Если Не Грузоместа = 0 Тогда
		Тело.Вставить("containers_count", Грузоместа);
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 11.04.25 УА #77376
	
	Тело.Вставить("delivery_method_id", ИДметода);
	Тело.Вставить("departure_date", ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(Дата, ФорматДатыJSON.ISO
	, ВариантЗаписиДатыJSON.УниверсальнаяДата));
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Тело);
	
	Результат = ИС_Ozon_API.СформироватьАктИНакладную(Профиль, ПараметрыЗапроса);

	Если ЗначениеЗаполнено(Результат) Тогда
		
		Для Каждого Задание Из СписокЗаданий Цикл 
			
			МенеджерЗаписи = РегистрыСведений.ИС_Ozon_СтатусыСборочныхЗаданий.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Профиль = Профиль;
			МенеджерЗаписи.Заказ = Задание.Заказ;
			
			МенеджерЗаписи.Прочитать();
			
			МенеджерЗаписи.Профиль = Профиль;
			МенеджерЗаписи.Заказ = Задание.Заказ;
			МенеджерЗаписи.status = МенеджерЗаписи.status;
			МенеджерЗаписи.posting_number = МенеджерЗаписи.posting_number;
			
			МенеджерЗаписи.id = Результат;
			
			Попытка
				МенеджерЗаписи.Записать(Истина);	
			Исключение
				Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю("Запись id задания в статусы заказов Ozon", Текст);
			КонецПопытки;  
			
		КонецЦикла; 
		
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю("Создано задание на формирование документов. Нажмите на кнопку повторно, чтобы узнать статус формирования / получить документы.");
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.02.2024 УА #62585

//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
Функция СтатусФормированияАктовИНакладных(Профиль, Номер)
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	Тело = Новый Структура;
	Тело.Вставить("id", Номер);
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Тело);
	
	Результат = ИС_Ozon_API.СтатусФормированияАктовИНакладных(Профиль, ПараметрыЗапроса);
	
	Если Результат.result.Свойство("act_type") И Результат.result.act_type = "ozon_digital" Тогда
		Результат = ИС_Ozon_API.СтатусФормированияАктовИНакладных(Профиль, ПараметрыЗапроса, Истина);
	Иначе
		Возврат Результат.result.status;
	КонецЕсли;                          
	
	Возврат Результат.status
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585

//+ ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585
Функция ПолучитьАктыИНакладныеСOzon(ЭлектроннаяВерсия = Ложь, Номер, Профиль);      
	
	НастройкиСоединения = ПолучитьНастройкиСоединенияПрофиля(Профиль);
	ПараметрыЗапроса = ПроверитьИЗаполнитьПараметрыЗапроса(НастройкиСоединения);
	
	Тело = Новый Структура;
	Тело.Вставить("id", Номер);
	
	Если ЭлектроннаяВерсия Тогда
		Тело.Вставить("doc_type", "act_of_acceptance");
	КонецЕсли;
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Тело);
	
	Возврат ИС_Ozon_API.ПолучитьАктыИНакладныеСOzon(Профиль, ПараметрыЗапроса, ЭлектроннаяВерсия);
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 19.02.2024 УА #62585

//+ ИнфоСофт Заварин К.В. 28.11.24 УА #74680
Функция СоздатьДокументРТУ(Профиль, ДанныеДокумента, ЗаголовокСтруктура, КомиссионнаяОперация) Экспорт
	
	Документ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	
	ФункциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	ДатаДокумента = ЗаголовокСтруктура.ПериодOzon.ДатаОкончания;
	Склад = ФункциональныеОпции.OzonСкладРеализации;
	
	Документ.Дата = ДатаДокумента;
			
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Партнер", ФункциональныеОпции.ПартнерOzon);
	ПараметрыФормы.Вставить("Контрагент", ФункциональныеОпции.КонтрагентOzon);
	
	Если КомиссионнаяОперация Тогда
		ПараметрыФормы.Вставить("Договор", ФункциональныеОпции.ДоговорOzon);
		Документ.Заполнить(ПараметрыФормы);
		Документ.Договор = ФункциональныеОпции.ДоговорOzon; 
		Документ.Соглашение = ФункциональныеОпции.СоглашениеOzon;
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;
	Иначе
		ПараметрыФормы.Вставить("Договор", ФункциональныеОпции.OzonДоговорРеализации);
		Документ.Заполнить(ПараметрыФормы);
		Документ.Договор = ФункциональныеОпции.OzonДоговорРеализации; 
		Документ.Соглашение = ФункциональныеОпции.OzonСоглашениеРеализации;
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	КонецЕсли;
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	ЗаполнитьВалюту = Истина;
	
	Если ИспользоватьСоглашенияСКлиентами Тогда 
		Валюта = Документ.Соглашение.Валюта;
		ЗаполнитьВалюту = Ложь;
	КонецЕсли;
	
	Если ЗаполнитьВалюту И ИспользоватьДоговорыСКлиентами Тогда 
		Валюта = Документ.Договор.ВалютаВзаиморасчетов;
	КонецЕсли;
	
	Документ.Валюта = Валюта;

	
	Документ.Контрагент = ФункциональныеОпции.КонтрагентOzon;
	
	Документ.Комментарий = ЗаголовокСтруктура.Комментарий;
	
	Документ.Организация = Профиль.Организация;    
	
	Документ.Склад = Склад; 
		
	Документ.Подразделение = ФункциональныеОпции.ПодразделениеOzon;
	
	Документ.ЦенаВключаетНДС = Истина; 
	
	Документ.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	
	Документ.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;  
	
	Документ.СкидкиРассчитаны = Истина; 

	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	//ОблагаетсяНДС = ИС_WB_СерверУТ11_5.ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация);
	//
	//Если ОблагаетсяНДС Тогда
	//	Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;			
	//Иначе
	//	Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
	//КонецЕсли;
	НастройкиУчета = УчетНДСУП.ПараметрыУчетаПоОрганизации(Профиль.Организация, ТекущаяДатаСеанса());	
	Документ.НалогообложениеНДС = НастройкиУчета.ОсновноеНалогообложениеНДСПродажи;
	
	Если Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС
		Или Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН Тогда  	
		ПродажаОблагаетсяНДС = Истина;
	Иначе
		ПродажаОблагаетсяНДС = Ложь;
	КонецЕсли;
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	
	СуммаДокумента = 0;
	
	Для Каждого Элемент Из ДанныеДокумента Цикл
		
		Цена = Элемент.ЦенаРеализация;
		
		Если Элемент.ЭтоНабор Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Элемент.Номенклатура,
			"ТипНоменклатуры, ВидНоменклатуры");
			
			Если Элемент.Количество > 0 Тогда
				
				ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
				
				ПараметрыКомплектующих.Номенклатура   		= Элемент.Номенклатура;
				ПараметрыКомплектующих.НоменклатураНабора   = Элемент.Номенклатура;
				ПараметрыКомплектующих.ХарактеристикаНабора = Элемент.ХарактеристикаНоменклатуры;				
				ПараметрыКомплектующих.КоличествоУпаковок	= Элемент.Количество;
				ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
				ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
				ПараметрыКомплектующих.ЭтоТовар 			= Истина;
				ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
				
				Склады = Новый Массив;
				
				ДополнительныеПараметры = Новый Структура;
				
				ДополнительныеПараметры.Вставить("Дата", 						Документ.Дата);
				ДополнительныеПараметры.Вставить("Валюта", 						Документ.Валюта);
				ДополнительныеПараметры.Вставить("Склады", 						Склады);
				ДополнительныеПараметры.Вставить("Соглашение", 					Документ.Соглашение);
				ДополнительныеПараметры.Вставить("Цена", 						Цена);				
				ДополнительныеПараметры.Вставить("СтоимостьДопУслуг", 			0);	
				ДополнительныеПараметры.Вставить("ВидЦены", 					ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
				ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", 	Цена);
				ДополнительныеПараметры.Вставить("Комиссия", 					0);
				
				Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
				
				Для Каждого стрКомплекта Из Комплектующие Цикл			
					НоваяСтрока = Документ.Товары.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
					
					НоваяСтрока.Количество 					= НоваяСтрока.КоличествоУпаковок;
					НоваяСтрока.Сумма 						= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок
					+ стрКомплекта.Погрешность;
					
					СуммаДокумента							= СуммаДокумента + НоваяСтрока.Сумма;
					
					//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
					//Если ОблагаетсяНДС Тогда
					//	НДС = стрКомплекта.Номенклатура.СтавкаНДС.Ставка;
					//	НоваяСтрока.СтавкаНДС = стрКомплекта.Номенклатура.СтавкаНДС; 
					//	Если НДС = Неопределено Или НДС = 0 Тогда 
					//		НоваяСтрока.СуммаНДС = 0;		
					//	Иначе							
					//		//+ ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94698							
					//		//НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
					//		НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.Сумма, НДС, Истина);
					//		//- ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94698
					//	КонецЕсли;	
					//Иначе
					//	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
					//КонецЕсли;
					//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
					
					НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;  
					
					//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
					Если ПродажаОблагаетсяНДС Тогда
						СтавкаНДС = ИС_МП_УправлениеОтчетами.РассчитатьСтавкуНДС( Документ.Организация
																				, ТекущаяДатаСеанса()
																				, Документ.НалогообложениеНДС
																				, стрКомплекта.Номенклатура);
						НДС 						= СтавкаНДС.Ставка;
						НоваяСтрока.СтавкаНДС 		= СтавкаНДС; 	
						
						Если Не ЗначениеЗаполнено(НДС) Или НДС = 0 Тогда 
							НоваяСтрока.СуммаНДС = 0;						
						Иначе
							НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.СуммаСНДС, НДС, Истина);						
						КонецЕсли;
						
					Иначе
						НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
					КонецЕсли;
					//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
					
					//+ ИнфоСофт Мурсалимов Д.Р. 12.03.25 УА #95966
					НоваяСтрока.Склад = Склад;
					//- ИнфоСофт Мурсалимов Д.Р. 12.03.25 УА #95966
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе		
			
			Если Элемент.Количество > 0 Тогда
				
				НоваяСтрока = Документ.Товары.Добавить();
				
				НоваяСтрока.Номенклатура 					= Элемент.Номенклатура;
				НоваяСтрока.Характеристика 					= Элемент.ХарактеристикаНоменклатуры;				
				НоваяСтрока.Количество 						= Элемент.Количество;
				НоваяСтрока.КоличествоУпаковок 				= Элемент.Количество;	
				НоваяСтрока.Цена 							= Цена;
				НоваяСтрока.Сумма 							= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
				
				//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				//Если ОблагаетсяНДС Тогда
				//	НДС = Элемент.Номенклатура.СтавкаНДС.Ставка;
				//	НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС; 
				//	Если НДС = Неопределено Или НДС = 0 Тогда 
				//		НоваяСтрока.СуммаНДС = 0;		
				//	Иначе
				//		//+ ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94698							
				//		//НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
				//		НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.Сумма, НДС, Истина);
				//		//- ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94698
				//	КонецЕсли;	
				//Иначе
				//	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
				//КонецЕсли;
				//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				
				НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
				
				//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				Если ПродажаОблагаетсяНДС Тогда
					СтавкаНДС = ИС_МП_УправлениеОтчетами.РассчитатьСтавкуНДС( Документ.Организация
																		, ТекущаяДатаСеанса()
																		, Документ.НалогообложениеНДС
																		, Элемент.Номенклатура); 
					НДС 						= СтавкаНДС.Ставка;
					НоваяСтрока.СтавкаНДС 		= СтавкаНДС; 
					
					Если Не ЗначениеЗаполнено(НДС) Или НДС = 0 Тогда 					
						НоваяСтрока.СуммаНДС = 0;						
					Иначе
						НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.СуммаСНДС, НДС, Истина); 	
					КонецЕсли;
				
				Иначе
					НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
				КонецЕсли;
				//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				
				СуммаДокумента 								= СуммаДокумента + НоваяСтрока.Сумма; 
				
				//+ ИнфоСофт Мурсалимов Д.Р. 12.03.25 УА #95966
				НоваяСтрока.Склад = Склад;
				//- ИнфоСофт Мурсалимов Д.Р. 12.03.25 УА #95966
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Документ.СуммаДокумента = СуммаДокумента;	
	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		Документ.Записать();
	КонецПопытки; 
	
	Возврат Документ;
	
КонецФункции //- ИнфоСофт Заварин К.В. 28.11.24 УА #74680

//+ ИнфоСофт Заварин К.В. 29.11.24 УА #74680
Функция СоздатьДокументВозвратТоваровВыкупленныхТоваров(Профиль, ДанныеДокумента, ЗаголовокСтруктура, КомиссионнаяОперация = Ложь) Экспорт
			
	Документ = Документы.ВозвратТоваровОтКлиента.СоздатьДокумент();
	
	ФункциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	ДатаДокумента = ЗаголовокСтруктура.ПериодOzon.ДатаОкончания - 1;
	Склад = ФункциональныеОпции.OzonСкладРеализации;
	
	Документ.Дата = ДатаДокумента;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Партнер", ФункциональныеОпции.ПартнерOzon);
	ПараметрыФормы.Вставить("Контрагент", ФункциональныеОпции.КонтрагентOzon);
	
	Если КомиссионнаяОперация Тогда
		ПараметрыФормы.Вставить("Договор", ФункциональныеОпции.ДоговорOzon);
		Документ.Соглашение = ФункциональныеОпции.СоглашениеOzon;
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера;
	Иначе
		ПараметрыФормы.Вставить("Договор", ФункциональныеОпции.OzonДоговорРеализации);
		Документ.Соглашение = ФункциональныеОпции.OzonСоглашениеРеализации;
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента;
	КонецЕсли;
	
	Документ.Заполнить(ПараметрыФормы);
	
	//+ ИнфоСофт Заварин К.В. 19.03.25 УА #96620
	Если КомиссионнаяОперация Тогда
		Документ.Договор = ФункциональныеОпции.ДоговорOzon;
		Документ.Соглашение = ФункциональныеОпции.СоглашениеOzon;
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера;
	Иначе
		Документ.Договор = ФункциональныеОпции.OzonДоговорРеализации;
		Документ.Соглашение = ФункциональныеОпции.OzonСоглашениеРеализации;
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента;
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 19.03.25 УА #96620
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	ЗаполнитьВалюту = Истина;
	
	Если ИспользоватьСоглашенияСКлиентами Тогда 
		Валюта = Документ.Соглашение.Валюта;
		ЗаполнитьВалюту = Ложь;
	КонецЕсли;
	
	Если ЗаполнитьВалюту И ИспользоватьДоговорыСКлиентами Тогда 
		Валюта = Документ.Договор.ВалютаВзаиморасчетов;
	КонецЕсли;
	
	Документ.Валюта = Валюта;	
	
	Документ.Контрагент = ФункциональныеОпции.КонтрагентOzon;
	
	Документ.Комментарий = ЗаголовокСтруктура.Комментарий;
	
	Документ.Организация = Профиль.Организация;    
	
	Документ.Склад = Склад; 
	
	Документ.Подразделение = ФункциональныеОпции.ПодразделениеOzon;
	
	Документ.ЦенаВключаетНДС = Истина; 
		
	//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	//ОблагаетсяНДС = ИС_WB_СерверУТ11_5.ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация);
	//
	//Если ОблагаетсяНДС Тогда
	//	Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;			
	//Иначе
	//	Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
	//КонецЕсли;
	НастройкиУчета = УчетНДСУП.ПараметрыУчетаПоОрганизации(Профиль.Организация, ТекущаяДатаСеанса());
	Документ.НалогообложениеНДС = НастройкиУчета.ОсновноеНалогообложениеНДСПродажи;
	
	Если Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС
		Или Документ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН Тогда  	
		ПродажаОблагаетсяНДС = Истина;
	Иначе
		ПродажаОблагаетсяНДС = Ложь;
	КонецЕсли;
	//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
	
	СуммаДокумента = 0;
	
	Для Каждого Элемент Из ДанныеДокумента Цикл
		
		Цена = Элемент.ИсходныеСтоимостныеДанные;
		
		Если Элемент.ЭтоНабор Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Элемент.Номенклатура,
			"ТипНоменклатуры, ВидНоменклатуры");
			
			Если Элемент.Количество > 0 Тогда
				
				ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
				
				ПараметрыКомплектующих.Номенклатура   		= Элемент.Номенклатура;
				ПараметрыКомплектующих.НоменклатураНабора   = Элемент.Номенклатура;
				ПараметрыКомплектующих.ХарактеристикаНабора = Элемент.ХарактеристикаНоменклатуры;				
				ПараметрыКомплектующих.КоличествоУпаковок	= Элемент.Количество;
				ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
				ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
				ПараметрыКомплектующих.ЭтоТовар 			= Истина;
				ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
				
				Склады = Новый Массив;
				
				ДополнительныеПараметры = Новый Структура;
				
				ДополнительныеПараметры.Вставить("Дата", 						Документ.Дата);
				ДополнительныеПараметры.Вставить("Валюта", 						Документ.Валюта);
				ДополнительныеПараметры.Вставить("Склады", 						Склады);
				ДополнительныеПараметры.Вставить("Соглашение", 					Документ.Соглашение);
				ДополнительныеПараметры.Вставить("Цена", 						Цена);				
				ДополнительныеПараметры.Вставить("СтоимостьДопУслуг", 			0);	
				ДополнительныеПараметры.Вставить("ВидЦены", 					ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
				ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", 	Цена);
				ДополнительныеПараметры.Вставить("Комиссия", 					0);
				
				Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
				
				Для Каждого стрКомплекта Из Комплектующие Цикл			
					НоваяСтрока = Документ.Товары.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
					
					НоваяСтрока.Количество 					= НоваяСтрока.КоличествоУпаковок;
					НоваяСтрока.Сумма 						= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок
					+ стрКомплекта.Погрешность;
					
					СуммаДокумента							= СуммаДокумента + НоваяСтрока.Сумма;
					
					//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
					//Если ОблагаетсяНДС Тогда
					//	НДС = стрКомплекта.Номенклатура.СтавкаНДС.Ставка;
					//	НоваяСтрока.СтавкаНДС = стрКомплекта.Номенклатура.СтавкаНДС; 
					//	Если НДС = Неопределено Или НДС = 0 Тогда 
					//		НоваяСтрока.СуммаНДС = 0;		
					//	Иначе
					//		//+ ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94698							
					//		//НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
					//		НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.Сумма, НДС, Истина);
					//		//- ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94698
					//	КонецЕсли;	
					//Иначе
					//	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
					//КонецЕсли;
					//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
					
					НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
					
					//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
					Если ПродажаОблагаетсяНДС Тогда
						СтавкаНДС = ИС_МП_УправлениеОтчетами.РассчитатьСтавкуНДС( Документ.Организация
																				, ТекущаяДатаСеанса()
																				, Документ.НалогообложениеНДС
																				, стрКомплекта.Номенклатура);
						НДС 						= СтавкаНДС.Ставка;
						НоваяСтрока.СтавкаНДС 		= СтавкаНДС; 
						
						Если Не ЗначениеЗаполнено(НДС) Или НДС = 0 Тогда 
							НоваяСтрока.СуммаНДС = 0;						
						Иначе
							НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.СуммаСНДС, НДС, Истина);						
						КонецЕсли;	
						
					Иначе
						НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
					КонецЕсли;
					//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе		
			
			Если Элемент.Количество > 0 Тогда
				
				НоваяСтрока = Документ.Товары.Добавить();
				
				НоваяСтрока.Номенклатура 					= Элемент.Номенклатура;
				НоваяСтрока.Характеристика 					= Элемент.ХарактеристикаНоменклатуры;				
				НоваяСтрока.Количество 						= Элемент.Количество;
				НоваяСтрока.КоличествоУпаковок 				= Элемент.Количество;
				НоваяСтрока.Сумма 							= Цена;
				НоваяСтрока.Цена 							= НоваяСтрока.Сумма / НоваяСтрока.КоличествоУпаковок;
				
				//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				//Если ОблагаетсяНДС Тогда
				//	НДС = Элемент.Номенклатура.СтавкаНДС.Ставка;
				//	НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС; 
				//	Если НДС = Неопределено Или НДС = 0 Тогда 
				//		НоваяСтрока.СуммаНДС = 0;		
				//	Иначе						
				//		//+ ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94698							
				//		//НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
				//		НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.Сумма, НДС, Истина);
				//		//- ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94698
				//	КонецЕсли;	
				//Иначе
				//	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
				//КонецЕсли;
				//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				
				НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
				
				//+ ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				Если ПродажаОблагаетсяНДС Тогда
					СтавкаНДС = ИС_МП_УправлениеОтчетами.РассчитатьСтавкуНДС( Документ.Организация
																			, ТекущаяДатаСеанса()
																			, Документ.НалогообложениеНДС
																			, Элемент.Номенклатура);
					НДС 						= СтавкаНДС.Ставка;
					НоваяСтрока.СтавкаНДС 		= СтавкаНДС; 
						
					Если Не ЗначениеЗаполнено(НДС) Или НДС = 0 Тогда 					
						НоваяСтрока.СуммаНДС = 0;						
					Иначе
						НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.СуммаСНДС, НДС, Истина); 	
					КонецЕсли;
				
				Иначе
					НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
				КонецЕсли;
				//- ИнфоСофт Тимофеева А.А. 09.04.2025 УА #97337
				
				СуммаДокумента 								= СуммаДокумента + НоваяСтрока.Сумма;  
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Документ.СуммаДокумента = СуммаДокумента;	
	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		Документ.Записать();
	КонецПопытки; 
	
	Возврат Документ;
	
КонецФункции //- ИнфоСофт Заварин К.В. 29.11.24 УА #74680

//+ ИнфоСофт Мурсалимов Д.Р. 25.03.25 УА #96800
Функция СоздатьРеализациюУслугПоЮрЛицам(СтруктураДанных) Экспорт
	
	Номенклатура 	= СтруктураДанных.Номенклатура;
	Соглашение 		= СтруктураДанных.Соглашение;
	Договор 		= СтруктураДанных.Договор;	
	ЗаказКлиента 	= СтруктураДанных.ЗаказКлиента; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Событие 			= "Создание реализации"; 
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(СтруктураДанных.Профиль);
	
	ДокументОбъект 		= Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
	
	Если ЗаказКлиента = Неопределено Тогда
		
		ДанныеЗаполнения 	= Новый Структура;
		
		ДанныеЗаполнения.Вставить("Организация", 			ФукнциональныеОпции.Организация);
		ДанныеЗаполнения.Вставить("Соглашение", 			Соглашение);
		ДанныеЗаполнения.Вставить("Договор", 				Договор);
		ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", 	Истина);
		
		ДокументОбъект.Заполнить(ДанныеЗаполнения);
		
	Иначе	
		ДокументОбъект.Заполнить(ЗаказКлиента.Ссылка);	
	КонецЕсли;
		
	ДокументОбъект.ЦенаВключаетНДС = Истина;
	
	ПродажаОблагаетсяНДС = ИС_МП_УправлениеЗаказами.ПолучитьПрименениеНДСОрганизации(СтруктураДанных.Профиль.Организация);
	
	Если ПродажаОблагаетсяНДС Тогда 		
		ДокументОбъект.НалогообложениеНДС	= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС; 
	Иначе
		ДокументОбъект.НалогообложениеНДС 	= Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
	КонецЕсли;
	
	ХозОперация 							= ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту");	
	ИспользоватьДоговорыСКлиентами 			= ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	ДокументОбъект.Дата 					= СтруктураДанных.ТаблицаПродаж[0].ДатаСчетФактуры;
	ДокументОбъект.ХозяйственнаяОперация 	= ХозОперация;   
	ДокументОбъект.Организация				= ФукнциональныеОпции.Организация;	
	
	ДокументОбъект.СкидкиРассчитаны         = Истина;
	ДокументОбъект.Склад           			= ФукнциональныеОпции.OzonСкладРеализации; 	
	ДокументОбъект.Соглашение				= Соглашение;
	ДокументОбъект.Договор					= Договор;
	ДокументОбъект.Контрагент				= ФукнциональныеОпции.КонтрагентOzon;
	ДокументОбъект.Партнер					= ФукнциональныеОпции.ПартнерOzon;	
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.Соглашение) Или Не ЗначениеЗаполнено(ДокументОбъект.Соглашение.ПорядокРасчетов) Тогда
		ДокументОбъект.ПорядокРасчетов 		= ДокументОбъект.Договор.ПорядокРасчетов;
	Иначе
		ДокументОбъект.ПорядокРасчетов 		= ДокументОбъект.Соглашение.ПорядокРасчетов;	
	КонецЕсли;
	
	Склад 									= ДокументОбъект.Склад;
	
	ДокументОбъект.Товары.Очистить();
	
	Для Каждого Транзакция Из СтруктураДанных.ТаблицаПродаж Цикл
		
		СуммаЛояльностиРеализации 	= Окр(Транзакция.СуммаЛояльностиРеализации / Транзакция.Количество, 2);
		
		Цена 						= СуммаЛояльностиРеализации;
		
		Если Транзакция.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		
		НоваяСтрока.Номенклатура 					= Номенклатура;
		НоваяСтрока.Количество 						= Транзакция.Количество;
		НоваяСтрока.КоличествоУпаковок 				= Транзакция.Количество;
		НоваяСтрока.Цена 							= Цена;
		НоваяСтрока.Сумма 							= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
		
		Если Склад <> Неопределено Тогда
			НоваяСтрока.Склад 						= Склад;	
		КонецЕсли; 
		
		Если ЗаказКлиента <> Неопределено Тогда
			НоваяСтрока.ЗаказКлиента 				= ЗаказКлиента.Ссылка;
		КонецЕсли;	
		
	КонецЦикла; 
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
		ДокументОбъект.Организация, ДокументОбъект.НалогообложениеНДС, ДокументОбъект.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
		ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект));
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС", ДокументОбъект.ЦенаВключаетНДС));	
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокументОбъект.Товары, СтруктураДействий, Неопределено);
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		
		Попытка
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			ТекстСообщения = СтрШаблон("Не удалось провести документ реализации товаров: %1%2%3", ДокументОбъект.Ссылка, Символы.ПС, 
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка);
			
		Исключение
			
			ТекстСообщения = СтрШаблон("Не удалось записать документ реализации товаров по контрагенту: %1%2%3", ДокументОбъект.Контрагент, Символы.ПС,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			Возврат Неопределено;
			
		КонецПопытки;
		
	КонецПопытки;        
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 25.03.25 УА #96800

//+ ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648
Функция ПолучитьДетальныйСтатусСборочногоЗадания(Статус, ДетальныйСтатус)

	Если ДетальныйСтатус = "posting_transferring_to_delivery" Тогда
		Возврат Перечисления.ИС_Ozon_ДетальныеСтатусыОтправлений[ДетальныйСтатус + "_" + Статус];	
	Иначе
		Возврат Перечисления.ИС_Ozon_ДетальныеСтатусыОтправлений[ДетальныйСтатус];	
	КонецЕсли;      
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 18.04.2025 УА #98648

//+ ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628
Функция УпаковкаНоменклатурыПоУмолчанию(Номенклатура)

	Результат = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	НаборыУпаковок.Ссылка КАК НаборУпаковок,
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка
	|ПОМЕСТИТЬ вт_Упаковки
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыУпаковок КАК НаборыУпаковок
	|		ПО Номенклатура.НаборУпаковок = НаборыУпаковок.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ПО (НаборыУпаковок.Ссылка = УпаковкиЕдиницыИзмерения.Владелец)
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|	И Номенклатура.Ссылка = &Номенклатура
	|			
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	НаборыУпаковок.Ссылка,
	|	УпаковкиЕдиницыИзмерения.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыУпаковок КАК НаборыУпаковок
	|		ПО Номенклатура.НаборУпаковок = НаборыУпаковок.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ПО Номенклатура.Ссылка = УпаковкиЕдиницыИзмерения.Владелец
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|	И Номенклатура.Ссылка = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Упаковки.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_Упаковки.Упаковка) КАК Упаковка
	|ПОМЕСТИТЬ вт_КоличествоУпаковок
	|ИЗ
	|	вт_Упаковки КАК вт_Упаковки
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_Упаковки.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_Упаковки.Упаковка) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_КоличествоУпаковок.Номенклатура КАК Номенклатура,
	|	вт_Упаковки.Упаковка КАК Упаковка
	|ИЗ
	|	вт_КоличествоУпаковок КАК вт_КоличествоУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Упаковки КАК вт_Упаковки
	|		ПО вт_КоличествоУпаковок.Номенклатура = вт_Упаковки.Номенклатура";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Результат = Выборка.Упаковка;
	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2023 УА #54628

//+ ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005 
Функция ДобавитьСопоставлениеNew(ТаблицаТранзакций, Профиль) Экспорт
	
	МассивSKU 					= ТаблицаТранзакций.ВыгрузитьКолонку("SKU");
	МассивSKU 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивSKU);
	SKUТоваров					= ОчиститьПустыеЗначенияМассива(МассивSKU);
	ОсновныеТоварыПоУцененным 	= ОсновныеТоварыПоУцененным(Профиль, SKUТоваров);
	
	Для Каждого транзакция Из ТаблицаТранзакций Цикл
		
		Если Не ОсновныеТоварыПоУцененным.Получить(транзакция.sku) = Неопределено Тогда
			транзакция.sku = ОсновныеТоварыПоУцененным.Получить(транзакция.sku);
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса =
	
	//+ ИнфоСофт Мурсалимов Д.Р. 25.10.24 УА #85566
	"ВЫБРАТЬ
	|	втТаблицаТранзакций.НаименованиеТовара КАК НаименованиеТовара,
	|	втТаблицаТранзакций.offer_id КАК offer_id,
	|	втТаблицаТранзакций.SKU КАК SKU,
	|	втТаблицаТранзакций.ШтрихКодТовара КАК ШтрихКодТовара,
	|	втТаблицаТранзакций.ЦенаПродовцаСУчетомСкидки КАК ЦенаПродовцаСУчетомСкидки,
	|	втТаблицаТранзакций.КомиссияЗаПродажуПоКатегорииПроцент КАК КомиссияЗаПродажуПоКатегорииПроцент,
	|	втТаблицаТранзакций.ЦенаРеализация КАК ЦенаРеализация,	
	|	втТаблицаТранзакций.СуммаЛояльностиРеализации КАК СуммаЛояльностиРеализации,
	|	втТаблицаТранзакций.Количество КАК Количество,
	|	втТаблицаТранзакций.НомерДокумента КАК НомерДокумента,
    |	втТаблицаТранзакций.РеализованоНаСумму КАК РеализованоНаСумму,
	|	втТаблицаТранзакций.ДоплатаЗаСчетOzon КАК ДоплатаЗаСчетOzon,
	|	втТаблицаТранзакций.ИтогиКомиссияСУчетомСкидокИНаценок КАК ИтогиКомиссияСУчетомСкидокИНаценок,
	|	втТаблицаТранзакций.ИтогиКНачислению КАК ИтогиКНачислению,
	|	втТаблицаТранзакций.ВозвратЦенаРеализации КАК ВозвратЦенаРеализации,
	|	втТаблицаТранзакций.СуммаЛояльностиВозврата КАК СуммаЛояльностиВозврата,
	|	втТаблицаТранзакций.ВозвратКоличество КАК ВозвратКоличество,
	|	втТаблицаТранзакций.ВозвращеноНаСумму КАК ВозвращеноНаСумму,
	|	втТаблицаТранзакций.ВозвратДоплатаЗаСчетOzon КАК ВозвратДоплатаЗаСчетOzon,
	|	втТаблицаТранзакций.ВозвратИтогиКомиссияСУчетомСкидокИНаценок КАК ВозвратИтогиКомиссияСУчетомСкидокИНаценок,
	|	втТаблицаТранзакций.ИтогоВозвращено КАК ИтогоВозвращено,
	|	втТаблицаТранзакций.НомерОтправления КАК НомерОтправления,
	|	втТаблицаТранзакций.ДатаОтправления КАК ДатаОтправления,
	|	втТаблицаТранзакций.ПродажаЮрЛицу КАК ПродажаЮрЛицу,
	|	втТаблицаТранзакций.ЭтоНабор КАК ЭтоНабор,
	|	втТаблицаТранзакций.ИННПокупателя КАК ИННПокупателя,
	|	втТаблицаТранзакций.НомерСчетФактуры КАК НомерСчетФактуры,
	|	втТаблицаТранзакций.ДатаСчетФактуры КАК ДатаСчетФактуры,
	|	втТаблицаТранзакций.Упаковка КАК Упаковка,
	|	втТаблицаТранзакций.КоэффициентУпаковки КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ втТаблицаТранзакций
	|ИЗ
	|	&ТаблицаТранзакций КАК втТаблицаТранзакций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблицаТранзакций.НаименованиеТовара КАК НаименованиеТовара,
	|	втТаблицаТранзакций.offer_id КАК offer_id,
	|	втТаблицаТранзакций.SKU КАК SKU,
	|	втТаблицаТранзакций.ШтрихКодТовара КАК ШтрихКодТовара,
	|	втТаблицаТранзакций.ЦенаПродовцаСУчетомСкидки КАК ЦенаПродовцаСУчетомСкидки,
	|	втТаблицаТранзакций.КомиссияЗаПродажуПоКатегорииПроцент КАК КомиссияЗаПродажуПоКатегорииПроцент,
	|	втТаблицаТранзакций.ЦенаРеализация КАК ЦенаРеализация,
	|	втТаблицаТранзакций.СуммаЛояльностиРеализации КАК СуммаЛояльностиРеализации,
	|	втТаблицаТранзакций.Количество КАК Количество,
	|	втТаблицаТранзакций.НомерДокумента КАК НомерДокумента,
    |	втТаблицаТранзакций.РеализованоНаСумму КАК РеализованоНаСумму,
	|	втТаблицаТранзакций.ДоплатаЗаСчетOzon КАК ДоплатаЗаСчетOzon,
	|	втТаблицаТранзакций.ИтогиКомиссияСУчетомСкидокИНаценок КАК ИтогиКомиссияСУчетомСкидокИНаценок,
	|	втТаблицаТранзакций.ИтогиКНачислению КАК ИтогиКНачислению,
	|	втТаблицаТранзакций.ВозвратЦенаРеализации КАК ВозвратЦенаРеализации,
	|	втТаблицаТранзакций.СуммаЛояльностиВозврата КАК СуммаЛояльностиВозврата,
	|	втТаблицаТранзакций.ВозвратКоличество КАК ВозвратКоличество,
	|	втТаблицаТранзакций.ВозвращеноНаСумму КАК ВозвращеноНаСумму,
	|	втТаблицаТранзакций.ВозвратДоплатаЗаСчетOzon КАК ВозвратДоплатаЗаСчетOzon,
	|	втТаблицаТранзакций.ВозвратИтогиКомиссияСУчетомСкидокИНаценок КАК ВозвратИтогиКомиссияСУчетомСкидокИНаценок,
	|	втТаблицаТранзакций.ИтогоВозвращено КАК ИтогоВозвращено,
	|	втТаблицаТранзакций.НомерОтправления КАК НомерОтправления,
	|	втТаблицаТранзакций.ДатаОтправления КАК ДатаОтправления,
	|	втТаблицаТранзакций.НомерСчетФактуры КАК НомерСчетФактуры,
	|	втТаблицаТранзакций.ДатаСчетФактуры КАК ДатаСчетФактуры,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоНабор,
	|	втТаблицаТранзакций.ПродажаЮрЛицу КАК ПродажаЮрЛицу,
	|	втТаблицаТранзакций.ЭтоНабор КАК ЭтоНабор1,
	|	втТаблицаТранзакций.ИННПокупателя КАК ИННПокупателя,
	|	втТаблицаТранзакций.Упаковка КАК Упаковка,
	|	втТаблицаТранзакций.КоэффициентУпаковки КАК КоэффициентУпаковки
	|ИЗ
	|	втТаблицаТранзакций КАК втТаблицаТранзакций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО (ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль = &Профиль)
	|			И (втТаблицаТранзакций.offer_id = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id
	|				ИЛИ втТаблицаТранзакций.SKU = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku_fbs
	|				ИЛИ втТаблицаТранзакций.SKU = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku_fbo)
	//+ ИнфоСофт Заварин К.В. 18.12.24 УА #89626
	|			И (втТаблицаТранзакций.SKU = СТРОКА(ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku))";
	//- ИнфоСофт Заварин К.В. 18.12.24 УА #89626
	//- ИнфоСофт Мурсалимов Д.Р. 25.10.24 УА #85566
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Профиль", 			Профиль);
	Запрос.УстановитьПараметр("ТаблицаТранзакций", 	ТаблицаТранзакций);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат РезультатЗапроса;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 09.09.24 УА #82005

//+ ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924
Функция СоздатьРеализациюТоваровЧерезКомиссионера(СтруктураДанных) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Событие = "Создание реализации через комиссионера"; 
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(СтруктураДанных.Профиль);
	
	ДокументОбъект = Документы["РеализацияТоваровУслуг"].СоздатьДокумент(); 
	
	Если СтруктураДанных.ЗаказКлиента <> Неопределено Тогда		
		ДокументОбъект.Заполнить(СтруктураДанных.ЗаказКлиента.Ссылка);
	Иначе
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Организация", ФукнциональныеОпции.Организация);
		ДанныеЗаполнения.Вставить("Соглашение", ФукнциональныеОпции.СоглашениеOzon);
		ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина);
		ДанныеЗаполнения.Вставить("Договор", ФукнциональныеОпции.ДоговорOzon);
		ДокументОбъект.Заполнить(ДанныеЗаполнения);		
	КонецЕсли;	
		
	ДокументОбъект.ЦенаВключаетНДС = Истина;
	
	//+ ИнфоСофт Власова И.С. 21.04.25 УА #99527
	//ПродажаОблагаетсяНДС = ИС_WB_СерверУТ11_5.ПолучитьРезультатПроверкиУчетаНДС(СтруктураДанных.Профиль.Организация);
	//
	//Если ПродажаОблагаетсяНДС Тогда 		
	//	ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС; 
	//Иначе
	//	ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
	//КонецЕсли;
	//- ИнфоСофт Власова И.С. 21.04.25 УА #99527
	
	//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
	//Если Не ЗначениеЗаполнено(ФукнциональныеОпции.КонтрагентOzon) Тогда	
	//	
	//	ТекстСообщения = СтрШаблон(
	//		"Не заполнен контрагент в настройках Ozon для аккаунта: %1. Документ отчет комиссионера не создан.",
	//		СтруктураДанных.Профиль);
	//	ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
	//	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	//	
	//	Возврат Неопределено;
	//	
	//КонецЕсли;
	//- ИнфоСофт Власова И.С. 06.08.24 УА #67453
	
	Если СтруктураДанных.РеализацияЧерезКомиссионера Тогда
		ХозОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионера");
	Иначе
		ХозОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту");	
	КонецЕсли;
	
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	//+ ИнфоСофт Власова И.С. 09.08.24 УА #67453
	//Если ИспользоватьДоговорыСКлиентами Тогда 
	//	Если ЗначениеЗаполнено(СтруктураДанных.ТаблицаПродаж[0].Договор) Тогда	
	//		Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(СтруктураДанных.ТаблицаПродаж[0].Договор, "ХозяйственнаяОперация") = ХозОперация Тогда
	//			
	//			ТекстСообщения = СтрШаблон(
	//			"договор контрагента: %1 имеет хозяйственную операцию отличающуюся от ""Реализация через комиссионера"". Документ не создан.",
	//			СтруктураДанных.Профиль);
	//			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
	//			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	//			
	//			Возврат Неопределено;
	//		КонецЕсли;
	//			
	//	Иначе	
	//		ТекстСообщения = СтрШаблон(
	//			"Не заполнен договор контрагента: %1. Документ не создан.",
	//			СтруктураДанных.Профиль);
	//			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
	//			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	//			
	//			Возврат Неопределено;
	//	
	//	КонецЕсли;
	//КонецЕсли;
	//- ИнфоСофт Власова И.С. 09.08.24 УА #67453
	
	//+ ИнфоСофт Заварин К.В. 02.05.24 УА #67073
	//ДокументОбъект.Дата 					= СтруктураДанных.Период.ДатаОкончания;
	ДокументОбъект.Дата 					= СтруктураДанных.ТаблицаПродаж[0].ДатаСчетФактуры;
	ДокументОбъект.Комментарий 				= "Номер Счет фактуры " + СтруктураДанных.ТаблицаПродаж[0].НомерСчетФактуры; 
	//- ИнфоСофт Заварин К.В. 02.05.24 УА #67073
	ДокументОбъект.ХозяйственнаяОперация 	= ХозОперация;   
	
	//+ ИнфоСофт Заварин К.В. 25.12.24 УА #89535
	ДокументОбъект.Организация				= ФукнциональныеОпции.Организация;
	//- ИнфоСофт Заварин К.В. 25.12.24 УА #89535
	
	//+ ИнфоСофт Власова И.С. 21.04.25 УА #99527
	НастройкиУчета = УчетНДСУП.ПараметрыУчетаПоОрганизации(ДокументОбъект.Организация, ДокументОбъект.Дата);
	ДокументОбъект.НалогообложениеНДС = НастройкиУчета.ОсновноеНалогообложениеНДСПродажи;
	//- ИнфоСофт Власова И.С. 21.04.25 УА #99527
	
	Если СтруктураДанных.РеализацияЧерезКомиссионера Тогда	
		ДокументОбъект.Партнер					= ФукнциональныеОпции.ПартнерOzon;
		ДокументОбъект.Контрагент				= ФукнциональныеОпции.КонтрагентOzon;
		ДокументОбъект.Договор					= ФукнциональныеОпции.ДоговорOzon;
		ДокументОбъект.Соглашение				= ФукнциональныеОпции.СоглашениеOzon;
		ДокументОбъект.КлиентКонтрагент			= СтруктураДанных.ТаблицаПродаж[0].Контрагент;
		ДокументОбъект.КлиентПартнер			= СтруктураДанных.ТаблицаПродаж[0].Партнер;
		ДокументОбъект.КлиентДоговор			= СтруктураДанных.ТаблицаПродаж[0].Договор;
		//+ ИнфоСофт Стояк Ю.К. 10.06.2024 УА #77407			
		ДокументОбъект.Статус					= ПредопределенноеЗначение("Перечисление.СтатусыРеализацийТоваровУслуг.Отгружено");	
		//- ИнфоСофт Стояк Ю.К. 10.06.2024 УА #77407
	Иначе	
		ДокументОбъект.СкидкиРассчитаны         = Истина;
		
		//+ ИнфоСофт Заварин К.В. 12.02.25 УА #93659
		//ДокументОбъект.Склад           		= СтруктураДанных.Профиль.Склад;
		ДокументОбъект.Склад           			= ФукнциональныеОпции.OzonСкладРеализации; 
		//- ИнфоСофт Заварин К.В. 12.02.25 УА #93659
			
		ДокументОбъект.Соглашение				= СтруктураДанных.ТаблицаПродаж[0].Соглашение;
		ДокументОбъект.Контрагент				= СтруктураДанных.ТаблицаПродаж[0].Контрагент;
		ДокументОбъект.Партнер					= СтруктураДанных.ТаблицаПродаж[0].Партнер;
		ДокументОбъект.Договор					= СтруктураДанных.ТаблицаПродаж[0].Договор;
		
		Если Не ЗначениеЗаполнено(ДокументОбъект.Соглашение) Или Не ЗначениеЗаполнено(ДокументОбъект.Соглашение.ПорядокРасчетов) Тогда
			ДокументОбъект.Порядокрасчетов = ДокументОбъект.Договор.ПорядокРасчетов;
		Иначе
			ДокументОбъект.Порядокрасчетов = ДокументОбъект.Соглашение.ПорядокРасчетов;	
		КонецЕсли;
		
		//+ ИнфоСофт Власова И.С. 22.04.25 УА #99526			
		ДокументОбъект.Статус					= ПредопределенноеЗначение("Перечисление.СтатусыРеализацийТоваровУслуг.Отгружено");	
		//- ИнфоСофт Власова И.С. 22.04.25 УА #99526
		
	КонецЕсли;  
	
	//+ ИнфоСофт Стояк Ю.К. 10.04.2025 УА #97954	
	ВидЦены = Неопределено;
	
	Если СтруктураДанных.Свойство("Профиль") Тогда
		
		МассивПараметров = ПолучитьСписокПараметровЦен();	
		Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(СтруктураДанных.Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, МассивПараметров);	
		СтруктураЦен = ПолучитьСтруктуруПараметровЦен();	
		ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
		ВидЦены = СтруктураЦен.ВидЦеныСоСкидкой; 
		
	КонецЕсли;		
	//- ИнфоСофт Стояк Ю.К. 10.04.2025 УА #97954
	
	Если СтруктураДанных.ЗаказКлиента = Неопределено Тогда			
		//+ ИнфоСофт Стояк Ю.К. 10.04.2025 УА #97954
		//ЗаполнитьТЧРеализации(ДокументОбъект, СтруктураДанных.ТаблицаПродаж, ДокументОбъект.Склад, СтруктураДанных.ЗаказКлиента);
		ЗаполнитьТЧРеализации(ДокументОбъект, СтруктураДанных.ТаблицаПродаж, ДокументОбъект.Склад, СтруктураДанных.ЗаказКлиента, ВидЦены);
		//- ИнфоСофт Стояк Ю.К. 10.04.2025 УА #97954
	КонецЕсли; 
		
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
	ДокументОбъект.Организация, ДокументОбъект.НалогообложениеНДС, ДокументОбъект.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
	ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект));
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
	ДокументОбъект.ЦенаВключаетНДС));	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокументОбъект.Товары, СтруктураДействий, Неопределено);
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		
		//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
		//ТекстСообщения = СтрШаблон("Не удалось провести документ отчет комиссионера: %1%2", Символы.ПС,
		//	ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		//
		//Попытка
		//	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		//Исключение
		//	
		//	//+ ИнфоСофт Власова И.С. 06.08.24 УА #67453
		//	//ТекстСообщения = СтрШаблон("Не удалось записать документ отчет комиссионера: %1%2", Символы.ПС,
		//	ТекстСообщения = СтрШаблон("Не удалось записать документ реализации товаров по контрагенту: %1%2%3", ДокументОбъект.Контрагент, Символы.ПС,
		//	//- ИнфоСофт Власова И.С. 06.08.24 УА #67453
		//		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		//	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		//	
		//КонецПопытки;
		
		Попытка
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			ТекстСообщения = СтрШаблон("Не удалось провести документ реализации товаров: %1%2%3", ДокументОбъект.Ссылка, Символы.ПС, 
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка);
			
		Исключение
			
			ТекстСообщения = СтрШаблон("Не удалось записать документ реализации товаров по контрагенту: %1%2%3", ДокументОбъект.Контрагент, Символы.ПС,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			Возврат Неопределено;
			
		КонецПопытки;
		//- ИнфоСофт Власова И.С. 06.08.24 УА #67453
		
	КонецПопытки;        
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 19.10.2023 УА #63924

//+ ИнфоСофт Мурсалимов Д.Р. 25.03.25 УА #96800
Процедура ЗаполнитьТЧРеализации(Документ, ТаблицаТранзакций, Склад = Неопределено, ЗаказКлиента = Неопределено
	//+ ИнфоСофт Стояк Ю.К. 10.04.2025 УА #97954	
	, ВидЦены = Неопределено)
	//- ИнфоСофт Стояк Ю.К. 10.04.2025 УА #97954
	
	Документ.Товары.Очистить(); 
	
	Если ТипЗнч(Документ.Ссылка) <> Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Документ.ВидыЗапасов.Очистить(); 	
		ТребуетсяСтатусСтроки = Ложь;
	Иначе		
		ТребуетсяСтатусСтроки = Истина;	
	КонецЕсли;
	
	Для Каждого Транзакция Из ТаблицаТранзакций Цикл
		
		Цена = Транзакция.ЦенаРеализация;
		
		Если Транзакция.ЭтоНабор Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Транзакция.Номенклатура,
			"ТипНоменклатуры, ВидНоменклатуры");
			
			Если Транзакция.Количество > 0 Тогда
				
				ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
				
				ПараметрыКомплектующих.Номенклатура   		= Транзакция.Номенклатура;
				ПараметрыКомплектующих.НоменклатураНабора   = Транзакция.Номенклатура;
				ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.ХарактеристикаНоменклатуры;				
				ПараметрыКомплектующих.КоличествоУпаковок	= Транзакция.Количество;
				ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
				ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
				ПараметрыКомплектующих.ЭтоТовар 			= Истина;
				ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
				
				Склады = Новый Массив;
				
				ДополнительныеПараметры = Новый Структура;
				
				ДополнительныеПараметры.Вставить("Дата", 						Документ.Дата);
				ДополнительныеПараметры.Вставить("Валюта", 						Документ.Валюта);
				ДополнительныеПараметры.Вставить("Склады", 						Склады);
				ДополнительныеПараметры.Вставить("Соглашение", 					Документ.Соглашение);
				ДополнительныеПараметры.Вставить("Цена", 						Цена);				
				ДополнительныеПараметры.Вставить("СтоимостьДопУслуг", 			0);	
				//ДополнительныеПараметры.Вставить("ВидЦены", 					ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
				//+ ИнфоСофт Стояк Ю.К. 10.04.2025 УА #97954
				Если ЗначениеЗаполнено(ВидЦены) Тогда
					ДополнительныеПараметры.Вставить("ВидЦены", 				ВидЦены);
				Иначе
					ДополнительныеПараметры.Вставить("ВидЦены", 				ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
				КонецЕсли;
				//- ИнфоСофт Стояк Ю.К. 10.04.2025 УА #97954
				ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", 	Цена);
				ДополнительныеПараметры.Вставить("Комиссия", 					0);
				
				Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
				
				Для Каждого стрКомплекта Из Комплектующие Цикл			
					НоваяСтрока = Документ.Товары.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
					
					НоваяСтрока.Количество 					= НоваяСтрока.КоличествоУпаковок;
					НоваяСтрока.Сумма 						= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок
															+ стрКомплекта.Погрешность;
					
					Если Склад <> Неопределено Тогда
						НоваяСтрока.Склад 					= Склад;	
					КонецЕсли;
					
					Если ТребуетсяСтатусСтроки Тогда
						НоваяСтрока.ВариантОбеспечения 		= Перечисления.ВариантыОбеспечения.Отгрузить;	
					КонецЕсли;
					
					Если ЗаказКлиента <> Неопределено Тогда
						НоваяСтрока.ЗаказКлиента 			= ЗаказКлиента.Ссылка;
					КонецЕсли;	
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе		
			
			Если Транзакция.Количество > 0 Тогда
				
				НоваяСтрока = Документ.Товары.Добавить();
				
				НоваяСтрока.Номенклатура 					= Транзакция.Номенклатура;
				НоваяСтрока.Характеристика 					= Транзакция.ХарактеристикаНоменклатуры;				
				НоваяСтрока.Количество 						= Транзакция.Количество;
				НоваяСтрока.КоличествоУпаковок 				= Транзакция.Количество;
				НоваяСтрока.Цена 							= Цена;
				НоваяСтрока.Сумма 							= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
				
				Если ТребуетсяСтатусСтроки Тогда
					НоваяСтрока.ВариантОбеспечения 			= Перечисления.ВариантыОбеспечения.Отгрузить;	
				КонецЕсли;
				
				Если Склад <> Неопределено Тогда
					НоваяСтрока.Склад 						= Склад;	
				КонецЕсли; 
				
				Если ЗаказКлиента <> Неопределено Тогда
					НоваяСтрока.ЗаказКлиента 				= ЗаказКлиента.Ссылка;
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 25.03.25 УА #96800

//+ ИнфоСофт Сумин Д.В. 22.08.2023 УА #63924
Функция СоздатьЗаказКлиента(СтруктураДанных) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	Событие = "Создание заказа клиента";
	
	ДокументОбъект = Документы["ЗаказКлиента"].СоздатьДокумент();
	
	ФукнциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(СтруктураДанных.Профиль);
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", ФукнциональныеОпции.Организация);
	ДанныеЗаполнения.Вставить("Соглашение", СтруктураДанных.ТаблицаПродаж[0].Соглашение);
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина);
	ДанныеЗаполнения.Вставить("Контрагент", СтруктураДанных.ТаблицаПродаж[0].Контрагент);
	ДанныеЗаполнения.Вставить("Партнер", СтруктураДанных.ТаблицаПродаж[0].Партнер);
	ДанныеЗаполнения.Вставить("Договор", ФукнциональныеОпции.ДоговорOzon);
	
	ДокументОбъект.Заполнить(ДанныеЗаполнения); 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 27.02.25 УА #94784
	СтруктураСтатусов = ИС_MP_Сервер.ПолучитьЗначенияСтатусовЗаказа();
	
	Если ЗначениеЗаполнено(ФукнциональныеОпции.OzonСтатусЗаказа) Тогда
		ДокументОбъект.Статус = ФукнциональныеОпции.OzonСтатусЗаказа; 
	Иначе
		ДокументОбъект.Статус = СтруктураСтатусов.СтатусЗаказа; 
	КонецЕсли;  
	//- ИнфоСофт Мурсалимов Д.Р. 27.02.25 УА #94784
	
	ДокументОбъект.ЦенаВключаетНДС = Истина;
	
	ПродажаОблагаетсяНДС = ИС_WB_СерверУТ11_5.ПолучитьРезультатПроверкиУчетаНДС(СтруктураДанных.Профиль.Организация);
	
	Если ПродажаОблагаетсяНДС Тогда 		
		ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС; 
	Иначе
		ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;			
	КонецЕсли;
	
	//+ ИнфоСофт Мурсалимов Д.Р. 08.04.24 УА #73296
	Если Не ЗначениеЗаполнено(ФукнциональныеОпции.КонтрагентOzon) Тогда	
		
		ТекстСообщения = СтрШаблон(
		"Не заполнен контрагент в настройках профиля: %1. Документ отчет комиссионера не создан.",
		СтруктураДанных.Профиль);
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
		
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 08.04.24 УА #73296 
	
	ХозОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту");	
	
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	Если ИспользоватьДоговорыСКлиентами Тогда
		Если ЗначениеЗаполнено(СтруктураДанных.ТаблицаПродаж[0].Договор) Тогда	
			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(СтруктураДанных.ТаблицаПродаж[0].Договор, "ХозяйственнаяОперация") = ХозОперация Тогда
				
				ТекстСообщения = СтрШаблон(
				"договор контрагента: %1 имеет хозяйственную операцию отличающуюся от ""Реализация клиенту"". Документ не создан.",
				СтруктураДанных.Профиль);
				ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат Неопределено;		
			КонецЕсли;
			
		Иначе	
			ТекстСообщения = СтрШаблон(
			"Не заполнен договор контрагента: %1. Документ не создан.",
			СтруктураДанных.Профиль);
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;	
		КонецЕсли;
	КонецЕсли; 
	
	//+ ИнфоСофт Мурсалимов Д.Р. 12.03.25 УА #95232
	//ДокументОбъект.Дата 					= СтруктураДанных.Период.ДатаОкончания;
	ДокументОбъект.Дата 					= СтруктураДанных.ТаблицаПродаж[0].ДатаСчетФактуры;
	//- ИнфоСофт Мурсалимов Д.Р. 12.03.25 УА #95232

	ДокументОбъект.ДатаОтгрузки             = СтруктураДанных.Период.ДатаОкончания;
	ДокументОбъект.ХозяйственнаяОперация 	= ХозОперация;   
	ДокументОбъект.СкидкиРассчитаны         = Истина;
	
	//+ ИнфоСофт Заварин К.В. 12.02.25 УА #93659
	//ДокументОбъект.Склад           		= СтруктураДанных.Профиль.Склад;
	ДокументОбъект.Склад           			= ФукнциональныеОпции.OzonСкладРеализации; 
	//- ИнфоСофт Заварин К.В. 12.02.25 УА #93659
	
	ДокументОбъект.Соглашение				= СтруктураДанных.ТаблицаПродаж[0].Соглашение;
	ДокументОбъект.Контрагент				= СтруктураДанных.ТаблицаПродаж[0].Контрагент;
	ДокументОбъект.Партнер					= СтруктураДанных.ТаблицаПродаж[0].Партнер;
	ДокументОбъект.Договор					= СтруктураДанных.ТаблицаПродаж[0].Договор;	
	ДокументОбъект.Согласован   			= Истина;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.Соглашение) Или Не ЗначениеЗаполнено(ДокументОбъект.Соглашение.ПорядокРасчетов) Тогда
		ДокументОбъект.Порядокрасчетов = ДокументОбъект.Договор.ПорядокРасчетов;
	Иначе
		ДокументОбъект.Порядокрасчетов = ДокументОбъект.Соглашение.ПорядокРасчетов;	
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 10.04.2025 УА #97954
	ВидЦены = Неопределено;
	
	Если СтруктураДанных.Свойство("Профиль") Тогда
		
		МассивПараметров = ПолучитьСписокПараметровЦен();	
		Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(СтруктураДанных.Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, МассивПараметров);	
		СтруктураЦен = ПолучитьСтруктуруПараметровЦен();	
		ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
		ВидЦены = СтруктураЦен.ВидЦеныСоСкидкой; 
		
	КонецЕсли;
	
	//ЗаполнитьТЧРеализации(ДокументОбъект, СтруктураДанных.ТаблицаПродаж, ДокументОбъект.Склад);
	ЗаполнитьТЧРеализации(ДокументОбъект, СтруктураДанных.ТаблицаПродаж, ДокументОбъект.Склад, , ВидЦены);
	//- ИнфоСофт Стояк Ю.К. 10.04.2025 УА #97954
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
	ДокументОбъект.Организация, ДокументОбъект.НалогообложениеНДС, ДокументОбъект.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
	ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект));
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
	ДокументОбъект.ЦенаВключаетНДС));	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокументОбъект.Товары, СтруктураДействий, Неопределено);
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстСообщения = СтрШаблон("Не удалось провести документ отчет комиссионера: %1%2", Символы.ПС,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ТекстСообщения = СтрШаблон("Не удалось записать документ отчет комиссионера: %1%2", Символы.ПС,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
	КонецПопытки;        
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 22.08.2023 УА #63924

//+ ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897
Функция ЗаполнитьСуммыПоВидуЦен(ВидЦены, ДатаЗаполнения, ВалютаДокумента, Номенклатура, Характеристика, Упаковка) 
	
	Если НЕ ЗначениеЗаполнено(ВидЦены) ИЛИ НЕ ЗначениеЗаполнено(ДатаЗаполнения) Тогда
		Возврат 0;
	КонецЕсли;
	
	СтруктураПараметровОтбора = Новый Структура;
	СтруктураПараметровОтбора.Вставить("Валюта", ВалютаДокумента);
	СтруктураПараметровОтбора.Вставить("Дата", ДатаЗаполнения);
	СтруктураПараметровОтбора.Вставить("ВидЦены", ВидЦены);
	СтруктураПараметровОтбора.Вставить("Номенклатура", Номенклатура);
	СтруктураПараметровОтбора.Вставить("Характеристика", Характеристика);
	СтруктураПараметровОтбора.Вставить("Упаковка", Упаковка);
	СтруктураПараметровОтбора.Вставить("Серия", "");
	
	Цена = ЦеныПредприятияЗаполнениеСервер.ПолучитьЦенуПоОтбору(СтруктураПараметровОтбора);
	
	Возврат Цена;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 30.05.2024 УА #74897

//+ ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595
//+ ИнфоСофт Заварин К.В. 20.03.25 УА #96732
//Процедура СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25)
Процедура СоздатьРеализацию(Выборка, ФукнциональныеОпции, Комиссия25, МассивДляЗаполнения = Неопределено)
//- ИнфоСофт Заварин К.В. 20.03.25 УА #96732

	Событие = ПолучитьИмяСобытия("СоздатьРеализации1С");
	
	Если Комиссия25 Тогда
		ДокументРеализация = Документы.ПередачаТоваровХранителю.СоздатьДокумент();	
	Иначе
		ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 20.03.25 УА #96732
	Если Не МассивДляЗаполнения = Неопределено Тогда
		
		Попытка	
			
			Если Комиссия25 Тогда
				СтруктураЗаполнения = СозданиеНаОснованииУТВызовСервера.ПередачаТоваровХранителюПараметрыОткрытияФормы(МассивДляЗаполнения);
			Иначе
				СтруктураЗаполнения = СозданиеНаОснованииУТВызовСервера.РеализацияТоваровУслугПараметрыОткрытияФормы(МассивДляЗаполнения);
			КонецЕсли;
			
			Если СтруктураЗаполнения = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			ДокументРеализация.Заполнить(СтруктураЗаполнения.Основание); 
			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки; 
		
	Иначе
	//- ИнфоСофт Заварин К.В. 20.03.25 УА #96732
	
	Попытка
		//+ ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981		
		//ДокументРеализация.Заполнить(Выборка.Заказ);
		ДокументРеализация.Заполнить(Выборка.ЗаказКлиента);
		//- ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981
	Исключение
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
	КонецПопытки; 
	
	//+ ИнфоСофт Заварин К.В. 20.03.25 УА #96732
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 20.03.25 УА #96732
	
	//+ ИнфоСофт Мурсалимов Д.Р. 04.03.25 УА #95186
	Если ДокументРеализация.Товары.Количество() = 0 Тогда
		
		ДокументРеализация.ЗаказКлиента 	= Неопределено;
		ДокументРеализация.ПометкаУдаления 	= Истина;
		 
		Попытка
			ДокументРеализация.Записать(РежимЗаписиДокумента.Запись);			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
			
	КонецЕсли;
	//- ИнфоСофт Мурсалимов Д.Р. 04.03.25 УА #95186
	
	Если Не ФукнциональныеОпции.ДатаОтгрузкиИлиТекущаяДатаВРеализациюOzon Тогда
		//+ ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981		
		//Если ЗначениеЗаполнено(Выборка.shipment_date) Тогда
		//	ДокументРеализация.Дата = Выборка.shipment_date;		
		Если ЗначениеЗаполнено(Выборка.ДатаОтгрузки) Тогда
			ДокументРеализация.Дата = Выборка.ДатаОтгрузки;		
		//- ИнфоСофт Стояк Ю.К. 07.10.2024 УА #80981
		Иначе                                                 
			ДокументРеализация.Дата = ТекущаяДатаСеанса();
		КонецЕсли;	
	Иначе
		ДокументРеализация.Дата = ТекущаяДатаСеанса();	
	КонецЕсли;
	
	ДокументРеализация.Комментарий = Выборка.Комментарий;
	
	Если Не Комиссия25 Тогда
		ДокументРеализация.СкидкиРассчитаны = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФукнциональныеОпции.ПодразделениеOzon) Тогда  
		ДокументРеализация.Подразделение = ФукнциональныеОпции.ПодразделениеOzon;
	КонецЕсли;		
	
	ЗаписыватьДокумент = Ложь;
	
	Если ФукнциональныеОпции.ПроводитьРеализацииOzon Тогда
		
		Попытка
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписыватьДокумент = Истина;
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст); 
		КонецПопытки;
		
	Иначе
		ЗаписыватьДокумент = Истина;	
	КонецЕсли;
	
	Если ЗаписыватьДокумент Тогда	
		
		Попытка
			ДокументРеализация.Записать();			
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 13.06.24 УА #77595

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Функция Комплектующие(Параметры, ДополнительныеПараметры)
		
	Возврат НаборыВызовСервера.Комплектующие(Параметры, ДополнительныеПараметры);

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Функция ВариантКомплектацииНоменклатурыПоУмолчанию(Знач Номенклатура, Знач Характеристика)

	ВариантКомплектацииНоменклатуры = Неопределено;

	Если Характеристика = Неопределено Тогда
		Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
						  |	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектацииНоменклатуры
						  |ИЗ
						  |	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
						  |ГДЕ
						  |	ВариантыКомплектацииНоменклатуры.Владелец = &Владелец
						  |	И ВариантыКомплектацииНоменклатуры.Характеристика = &Характеристика
						  |
						  |УПОРЯДОЧИТЬ ПО
						  |	ВариантыКомплектацииНоменклатуры.Основной УБЫВ,
						  |	ВариантыКомплектацииНоменклатуры.ПометкаУдаления");

	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВариантКомплектацииНоменклатуры = Выборка.ВариантКомплектацииНоменклатуры;
	КонецЕсли;

	Возврат ВариантКомплектацииНоменклатуры;

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008
Функция КоэффициентыРаспределенияПоДолям(ТабличнаяЧасть, Параметры)

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	Таблица.НомерСтроки                                       КАК НомерСтроки,
						  |	Таблица.НоменклатураНабора                                КАК НоменклатураНабора,
						  |	Таблица.ХарактеристикаНабора                              КАК ХарактеристикаНабора,
						  |	Таблица.Номенклатура                                      КАК Номенклатура,
						  |	Таблица.Характеристика                                    КАК Характеристика,
						  |	Таблица.Упаковка                                          КАК Упаковка,
						  |	Таблица.Количество                                        КАК Количество,
						  |	Таблица.КоличествоУпаковок                                КАК КоличествоУпаковок
						  |ПОМЕСТИТЬ Таблица
						  |ИЗ
						  |	&ТабличнаяЧасть КАК Таблица
						  |;
						  |
						  |//////////////////////////
						  |ВЫБРАТЬ
						  |	Таблица.НомерСтроки                                       КАК НомерСтроки,
						  |	Таблица.НоменклатураНабора                                КАК НоменклатураНабора,
						  |	Таблица.ХарактеристикаНабора                              КАК ХарактеристикаНабора,
						  |	Таблица.Номенклатура                                      КАК Номенклатура,
						  |	Таблица.Характеристика                                    КАК Характеристика,
						  |	Таблица.Упаковка                                          КАК Упаковка,
						  |	Таблица.Количество                                        КАК Количество,
						  |	Таблица.КоличествоУпаковок                                КАК КоличествоУпаковок,
						  |	ВариантыКомплектацииНоменклатуры.Ссылка                   КАК ВариантыКомплектацииНоменклатуры,
						  |	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора
						  |ПОМЕСТИТЬ ТаблицаСВариантамиКомплектации
						  |ИЗ
						  |	Таблица КАК Таблица
						  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
						  |		ПО Таблица.НоменклатураНабора = ВариантыКомплектацииНоменклатуры.Владелец
						  |			И Таблица.ХарактеристикаНабора = ВариантыКомплектацииНоменклатуры.Характеристика
						  |			И ВариантыКомплектацииНоменклатуры.Основной
						  |;
						  |
						  |/////
						  |ВЫБРАТЬ
						  |	Товары.Ссылка            КАК ВариантыКомплектацииНоменклатуры,
						  |	Товары.Номенклатура      КАК Номенклатура,
						  |	Товары.Характеристика    КАК Характеристика,
						  |	СУММА(ВЫБОР
						  |			КОГДА Товары.Количество <> 0
						  |				ТОГДА Выбор Когда Товары.ДоляСтоимости = 0 Тогда 1 Иначе  Товары.ДоляСтоимости Конец/ Товары.Количество
						  |			ИНАЧЕ 0
						  |		КОНЕЦ) КАК ДоляСтоимости
						  |ПОМЕСТИТЬ ДолиСтоимости
						  |ИЗ
						  |	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Товары
						  |
						  |СГРУППИРОВАТЬ ПО
						  |	Товары.Номенклатура,
						  |	Товары.Характеристика,
						  |	Товары.Ссылка
						  |;
						  |
						  |/////
						  |ВЫБРАТЬ
						  |	Таблица.НомерСтроки                                           КАК НомерСтроки,
						  |	Таблица.НоменклатураНабора                                    КАК НоменклатураНабора,
						  |	Таблица.ХарактеристикаНабора                                  КАК ХарактеристикаНабора,
						  |	Таблица.Номенклатура                                          КАК Номенклатура,
						  |	Таблица.Характеристика                                        КАК Характеристика,
						  |	Таблица.Упаковка                                              КАК Упаковка,
						  |	Таблица.Количество                                            КАК Количество,
						  |	Таблица.КоличествоУпаковок                                    КАК КоличествоУпаковок,
						  |	ВЫРАЗИТЬ(Таблица.Количество * ЕСТЬNULL(ДолиСтоимости.ДоляСтоимости, 0) КАК Число(15,2)) КАК Цена,
						  |	Таблица.ВариантыКомплектацииНоменклатуры                      КАК ВариантыКомплектацииНоменклатуры,
						  |	Таблица.ВариантРасчетаЦеныНабора                              КАК ВариантРасчетаЦеныНабора
						  |ИЗ
						  |	ТаблицаСВариантамиКомплектации КАК Таблица
						  |		ЛЕВОЕ СОЕДИНЕНИЕ ДолиСтоимости КАК ДолиСтоимости
						  |		ПО ДолиСтоимости.ВариантыКомплектацииНоменклатуры = Таблица.ВариантыКомплектацииНоменклатуры
						  |			И Таблица.Номенклатура = ДолиСтоимости.Номенклатура
						  |			И Таблица.Характеристика = ДолиСтоимости.Характеристика
						  |");
	
	// Выгрузить из таблицы источника
	Если ТипЗнч(ТабличнаяЧасть) = Тип("ТаблицаЗначений") Тогда
		Запрос.Параметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть.Скопировать());
	Иначе
		Запрос.Параметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть.Выгрузить());
	КонецЕсли;

	ПараметрыРасчета = Новый Структура;
	Для Каждого Параметр Из Параметры Цикл
		ПараметрыРасчета.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	ПараметрыРасчета.Вставить("РассчитыватьНаборы", Ложь);

	ТЧ = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрокаТЧ Из ТЧ Цикл
		СтрокаТЧ.Цена = Окр(СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок, 2);
	КонецЦикла;

	Возврат ТЧ;

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.05.2023 УА #58008

//+ ИнфоСофт Сумин Д.В. 23.08.2023 УА #63924
Функция ПолучитьКомплектующие(Параметры, ДополнительныеПараметры)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Параметры.ВариантКомплектацииНоменклатуры) Тогда
		ВариантКомплектацииНоменклатуры = ВариантКомплектацииНоменклатурыПоУмолчанию(
		Параметры.НоменклатураНабора, Параметры.ХарактеристикаНабора);
	Иначе
		ВариантКомплектацииНоменклатуры = Параметры.ВариантКомплектацииНоменклатуры;
	КонецЕсли;
	
	Если Не Параметры.Свойство("КоличествоУпаковок") Тогда
		Параметры.Вставить("КоличествоУпаковок", 1);
	КонецЕсли;
	
	ПодобранныеТовары = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ВариантКомплектацииНоменклатуры) Тогда
		ТекстОшибки = СтрШаблон("Для номенклатуры %1 %2 не определен состав набора", Параметры.НоменклатураНабора,
		Параметры.ХарактеристикаНабора);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат ПодобранныеТовары;
	КонецЕсли;
	
	Колонки = Новый Массив;
	Колонки.Добавить("НомерСтроки");
	Колонки.Добавить("НоменклатураКомплекта");
	Колонки.Добавить("ХарактеристикаКомплекта");
	Колонки.Добавить("Номенклатура");
	Колонки.Добавить("Характеристика");
	Колонки.Добавить("Цена");
	Колонки.Добавить("ВидЦены");
	Колонки.Добавить("Упаковка");
	Колонки.Добавить("Количество");
	Колонки.Добавить("КоличествоУпаковок");
	Колонки.Добавить("ПроцентРучнойСкидки");
	Колонки.Добавить("СуммаРучнойСкидки");
	Колонки.Добавить("Доступно");
	Колонки.Добавить("ВНаличии");
	
	Комплектующие = НаборыСервер.СоздатьТаблицуСоставаНабора(Колонки);
	Комплектующие.Колонки.Добавить("ТипНоменклатуры", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ВидНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Комплектующие.Колонки.Добавить("Комиссия", Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки КАК НомерСтроки,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
	|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости,
	|	СУММА(ЕСТЬNULL(ДоступностьТоваров.ВНаличии, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)) КАК ВНаличии,
	|	СУММА(ЕСТЬNULL(ДоступностьТоваров.Свободно, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)) КАК Доступно
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ДоступностьТоваров
	|		ПО ДоступностьТоваров.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
	|			И ДоступностьТоваров.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика
	|			И ДоступностьТоваров.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|			И ДоступностьТоваров.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			И &ФильтрСклады
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ТипНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество,
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
	Справочники["УпаковкиЕдиницыИзмерения"].ТекстЗапросаКоэффициентаУпаковки(
	"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения)",
	"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Справочник.Номенклатура)"));
	
	Запрос.УстановитьПараметр("Ссылка", ВариантКомплектацииНоменклатуры);
	
	Если ДополнительныеПараметры.Свойство("Склады") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрСклады", "ДоступностьТоваров.Склад В (&Склады)");
		Запрос.УстановитьПараметр("Склады", ДополнительныеПараметры.Склады);
	Иначе
		Запрос.УстановитьПараметр("ФильтрСклады", Истина);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.НоменклатураНабора   = Параметры.НоменклатураНабора;
		НоваяСтрока.ХарактеристикаНабора = Параметры.ХарактеристикаНабора;
		
	КонецЦикла;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И ДополнительныеПараметры.Свойство("Соглашение")
		И ЗначениеЗаполнено(ДополнительныеПараметры.Соглашение) Тогда
		
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
		ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
		ПараметрыРасчета.Вставить("Соглашение", ДополнительныеПараметры.Соглашение);
		ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");
		
	Иначе
		
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
		ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
		ПараметрыРасчета.Вставить("ВидЦены", ДополнительныеПараметры.ВидЦены);
		ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");
		
	КонецЕсли;
	
	КоэффициентыПропорциональностиРасчетаЦенНаборов = КоэффициентыРаспределенияПоДолям(Комплектующие.Скопировать(),
	ПараметрыРасчета);
	
	ОбщаяСтоимость = 0;
	Для Каждого ТекущаяСтрока Из КоэффициентыПропорциональностиРасчетаЦенНаборов Цикл
		ОбщаяСтоимость = ОбщаяСтоимость + ТекущаяСтрока.Цена;
	КонецЦикла;
	
	СуммаКРаспределению = ДополнительныеПараметры.Цена * Параметры.КоличествоУпаковок;
	
	СлужебнаяТЧ = Новый ТаблицаЗначений;
	СлужебнаяТЧ.Колонки.Добавить("СтрокаТЧ");
	СлужебнаяТЧ.Колонки.Добавить("НомерСтроки");
	
	Комплектующие.Сортировать("КоличествоУпаковок Убыв");
	Для Каждого ТекущаяСтрока Из Комплектующие Цикл
		
		Стоимость = КоэффициентыПропорциональностиРасчетаЦенНаборов.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки").Цена;
		
		ПараметрыТовара = ПодборТоваровКлиентСервер.ПараметрыТовара();
		ЗаполнитьЗначенияСвойств(ПараметрыТовара, Параметры);
		
		ПараметрыТовара.Номенклатура       = ТекущаяСтрока.Номенклатура;
		ПараметрыТовара.Характеристика     = ТекущаяСтрока.Характеристика;
		ПараметрыТовара.Упаковка           = ТекущаяСтрока.Упаковка;
		ПараметрыТовара.ТипНоменклатуры    = ТекущаяСтрока.ТипНоменклатуры;
		ПараметрыТовара.ВидНоменклатуры    = ТекущаяСтрока.ВидНоменклатуры;
		ПараметрыТовара.ЕдиницаИзмерения   = ТекущаяСтрока.ЕдиницаИзмерения;
		ПараметрыТовара.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок * Параметры.КоличествоУпаковок;
		ПараметрыТовара.Количество         = ТекущаяСтрока.Количество * Параметры.КоличествоУпаковок;
		ПараметрыТовара.Вставить("ПогрешностьКомиссия", 0);
		ПараметрыТовара.Вставить("ПогрешностьСуммаПродажи", 0);
		
		Если ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
			Или ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") Тогда
			ПараметрыТовара.Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ВидЦены") Тогда
			ПараметрыТовара.ВидЦены = ДополнительныеПараметры.ВидЦены;
		Иначе
			ПараметрыТовара.ВидЦены =ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		КонецЕсли;
		
		Если ПараметрыТовара.КоличествоУпаковок <> 0 И ОбщаяСтоимость <> 0 Тогда
			ПараметрыТовара.Цена = Окр(((Стоимость / ОбщаяСтоимость) * СуммаКРаспределению)
			/ ПараметрыТовара.КоличествоУпаковок, 2);
		Иначе
			ПараметрыТовара.Цена = 0;
		КонецЕсли;
		
		ОбщаяСтоимость = ОбщаяСтоимость - Стоимость;
		СуммаКРаспределению 		= СуммаКРаспределению - ПараметрыТовара.Цена * ПараметрыТовара.КоличествоУпаковок;
		
		ПараметрыТовара.Доступно = ТекущаяСтрока.Доступно;
		ПараметрыТовара.ВНаличии = ТекущаяСтрока.ВНаличии;
		
		ПараметрыТовара.ХарактеристикиИспользуются = ?(ЗначениеЗаполнено(ПараметрыТовара.Характеристика), Истина, Ложь);
		
		СлужебнаяСтрока = СлужебнаяТЧ.Добавить();
		СлужебнаяСтрока.СтрокаТЧ = ПараметрыТовара;
		СлужебнаяСтрока.НомерСтроки = ТекущаяСтрока.НомерСтроки;
		
	КонецЦикла;
	
	Если СуммаКРаспределению <> 0 И СлужебнаяТЧ.Количество() > 0 Тогда
		
		ПоследняяСтрока = СлужебнаяТЧ[СлужебнаяТЧ.Количество() - 1];
		ИсходнаяСтрока = ПоследняяСтрока.СтрокаТЧ;
		ИсходнаяСтрока.Погрешность 				= СуммаКРаспределению;
		
	КонецЕсли;
	
	СлужебнаяТЧ.Сортировать("НомерСтроки Возр");
	Для Каждого СтрокаТЧ Из СлужебнаяТЧ Цикл
		ПодобранныеТовары.Добавить(СтрокаТЧ.СтрокаТЧ);
	КонецЦикла;
	
	Возврат ПодобранныеТовары;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 23.08.2023 УА #63924

//+ ИнфоСофт Сумин Д.В. 15.12.2023 УА #65730
Функция ОбработатьРезультат(МассивУслуг)
	
	ТаблицаУслуг = Новый ТаблицаЗначений();
	
	ТаблицаУслуг.Колонки.Добавить("НаименованиеУслуги", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150)));
	ТаблицаУслуг.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,2)));
	
	Для Каждого Элемент Из МассивУслуг Цикл
		НоваяСтрока = ТаблицаУслуг.Добавить();
		НоваяСтрока.НаименованиеУслуги = Элемент.operation_type_name;
		НоваяСтрока.Сумма = Элемент.amount;
	КонецЦикла;
	
	ТаблицаУслуг.Свернуть("НаименованиеУслуги", "Сумма");
	
	Возврат ТаблицаУслуг;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 15.12.2023 УА #65730

//+ ИнфоСофт Заварин К.В. 27.11.24 УА #74680
Функция СоздатьДокументЗаявкаНаВозврат(Профиль, Данные, ЗаголовокСтруктура) Экспорт 

	ОблагаетсяНДС = ИС_WB_СерверУТ11_5.ПолучитьРезультатПроверкиУчетаНДС(Профиль.Организация);
		
	ФункциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	ДатаДокумента = ЗаголовокСтруктура.ПериодOzon.ДатаОкончания - 2;
	Склад = ФункциональныеОпции.OzonСкладРеализации;  
	
	Документ = Документы.ЗаявкаНаВозвратТоваровОтКлиента.СоздатьДокумент(); 
	Документ.Статус = Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату;
	Документ.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	Документ.Дата = ДатаДокумента; 
	Документ.ЦенаВключаетНДС = Истина;
	Документ.Партнер = ФункциональныеОпции.ПартнерOzon;
	Документ.Контрагент = ФункциональныеОпции.КонтрагентOzon;
	Документ.Соглашение = ФункциональныеОпции.СоглашениеOzon;
	Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера; 
	Документ.Организация = Профиль.Организация;
	Документ.Договор = ФункциональныеОпции.ДоговорOzon;
	Документ.Комментарий = ЗаголовокСтруктура.Комментарий;
	Документ.Склад = Склад; 
	Документ.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	//+ ИнфоСофт Заварин К.В. 28.03.25 УА #97195
	УказатьСкладВСтроке = Ложь;
			
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ.ВозвращаемыеТовары,"Склад") Тогда
		УказатьСкладВСтроке = Истина;	
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 28.03.25 УА #97195
	
    ЗаполнитьВалюту = Истина;
    
    Если ИспользоватьСоглашенияСКлиентами Тогда 
    	Валюта = Профиль.Соглашение.Валюта;
    	ЗаполнитьВалюту = Ложь;
    КонецЕсли;
    
    Если ЗаполнитьВалюту И ИспользоватьДоговорыСКлиентами Тогда 
    	Валюта = Профиль.Договор.ВалютаВзаиморасчетов;
    КонецЕсли;
    Документ.Валюта = Валюта;

    Документ.Подразделение = ФункциональныеОпции.ПодразделениеOzon; 
    Документ.ДатаПоступления = ДатаДокумента;  
	Документ.ПоступлениеОднойДатой = Истина;
	Документ.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	Документ.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	Документ.ОплатаВВалюте = Ложь; 
	
	СуммаДокумента = 0;
		
	Для Каждого Элемент Из Данные Цикл
		
		Цена = Элемент.ИсходныеСтоимостныеДанные;
		
		Если Элемент.ЭтоНабор Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Элемент.Номенклатура,
			"ТипНоменклатуры, ВидНоменклатуры");
			
			Если Элемент.Количество > 0 Тогда
				
				ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
				
				ПараметрыКомплектующих.Номенклатура   		= Элемент.Номенклатура;
				ПараметрыКомплектующих.НоменклатураНабора   = Элемент.Номенклатура;
				ПараметрыКомплектующих.ХарактеристикаНабора = Элемент.ХарактеристикаНоменклатуры;				
				ПараметрыКомплектующих.КоличествоУпаковок	= Элемент.Количество;
				ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
				ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
				ПараметрыКомплектующих.ЭтоТовар 			= Истина;
				ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
				
				Склады = Новый Массив;
				
				ДополнительныеПараметры = Новый Структура;
				
				ДополнительныеПараметры.Вставить("Дата", 						Документ.Дата);
				ДополнительныеПараметры.Вставить("Валюта", 						Документ.Валюта);
				ДополнительныеПараметры.Вставить("Склады", 						Склады);
				ДополнительныеПараметры.Вставить("Соглашение", 					Документ.Соглашение);
				ДополнительныеПараметры.Вставить("Цена", 						Цена);				
				ДополнительныеПараметры.Вставить("СтоимостьДопУслуг", 			0);	
				ДополнительныеПараметры.Вставить("ВидЦены", 					ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
				ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", 	Цена);
				ДополнительныеПараметры.Вставить("Комиссия", 					0);
				
				Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
				
				Для Каждого стрКомплекта Из Комплектующие Цикл			
					НоваяСтрока = Документ.ВозвращаемыеТовары.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
					
					НоваяСтрока.Количество 					= НоваяСтрока.КоличествоУпаковок;
					НоваяСтрока.Сумма 						= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок
					+ стрКомплекта.Погрешность;
					
					СуммаДокумента							= СуммаДокумента + НоваяСтрока.Сумма;
					
					Если ОблагаетсяНДС Тогда
						НДС = стрКомплекта.Номенклатура.СтавкаНДС.Ставка;
						НоваяСтрока.СтавкаНДС = стрКомплекта.Номенклатура.СтавкаНДС; 
						Если НДС = Неопределено Или НДС = 0 Тогда 
							НоваяСтрока.СуммаНДС = 0;		
						Иначе							
							//+ ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94698							
							//НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
							НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.Сумма, НДС, Истина);
							//- ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94698
						КонецЕсли;	
					Иначе
						НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
					КонецЕсли;
					
					НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
					
					//+ ИнфоСофт Заварин К.В. 28.03.25 УА #97195
					Если УказатьСкладВСтроке Тогда
						НоваяСтрока.Склад = Документ.Склад;		
					КонецЕсли;
					//- ИнфоСофт Заварин К.В. 28.03.25 УА #97195
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе		
			
			Если Элемент.Количество > 0 Тогда
				
				НоваяСтрока = Документ.ВозвращаемыеТовары.Добавить();
				
				НоваяСтрока.Номенклатура 					= Элемент.Номенклатура;
				НоваяСтрока.Характеристика 					= Элемент.ХарактеристикаНоменклатуры;				
				НоваяСтрока.Количество 						= Элемент.Количество;
				НоваяСтрока.КоличествоУпаковок 				= Элемент.Количество;
				НоваяСтрока.Сумма 							= Цена;
				НоваяСтрока.Цена 							= НоваяСтрока.Сумма / НоваяСтрока.КоличествоУпаковок;
				
				Если ОблагаетсяНДС Тогда
					НДС = Элемент.Номенклатура.СтавкаНДС.Ставка;
					НоваяСтрока.СтавкаНДС = Элемент.Номенклатура.СтавкаНДС; 
					Если НДС = Неопределено Или НДС = 0 Тогда 
						НоваяСтрока.СуммаНДС = 0;		
					Иначе
						//+ ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94698							
						//НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.Цена, НДС, Истина);
						НоваяСтрока.СуммаНДС = ИС_WB_СерверУТ11_5.РассчитатьСуммуНДС(НоваяСтрока.Сумма, НДС, Истина);
						//- ИнфоСофт Стояк Ю.К. 27.02.2025 УА #94698
					КонецЕсли;	
				Иначе
					НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
				КонецЕсли;
				
				НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
				
				//+ ИнфоСофт Заварин К.В. 28.03.25 УА #97195
				Если УказатьСкладВСтроке Тогда
					НоваяСтрока.Склад = Документ.Склад;		
				КонецЕсли;
				//- ИнфоСофт Заварин К.В. 28.03.25 УА #97195
				
				СуммаДокумента 								= СуммаДокумента + НоваяСтрока.Сумма; 
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Документ.СуммаДокумента = СуммаДокумента;
	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		Документ.Записать();
	КонецПопытки; 
	
	Возврат Документ;
	
КонецФункции //- ИнфоСофт Заварин К.В. 27.11.24 УА #74680 

//+ ИнфоСофт Заварин К.В. 28.11.24 УА #74680
Функция СоздатьДокументПоступлениеТоваровОтХранителя(ДокументЗаявкаНаВозвратКомиссия = Неопределено, Профиль, Данные, ЗаголовокСтруктура) Экспорт 
	
	Документ = Документы.ПоступлениеТоваровОтХранителя.СоздатьДокумент();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("АктОРасхождениях", Документы.АктОРасхожденияхПослеПриемки.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ДополнятьСериямиПоЗаявке", Ложь);
	ДанныеЗаполнения.Вставить("ИмяПоляЗаказ", "Распоряжение");
	ДанныеЗаполнения.Вставить("КлючевыеПоля", "Распоряжение, Номенклатура, Характеристика");
	ДанныеЗаполнения.Вставить("ОснованиеАкта", Документы.ПоступлениеТоваровОтХранителя.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ОформлениеЧерезРМ", Ложь);  
	ДанныеЗаполнения.Вставить("ФормаОткрыта", Ложь);
	
	РеквизитыШапки = Новый Структура;
	РеквизитыШапки.Вставить("Валюта", Справочники.Валюты.НайтиПоКоду("643"));
	РеквизитыШапки.Вставить("НаправлениеДеятельности", Справочники.НаправленияДеятельности.ПустаяСсылка());
	РеквизитыШапки.Вставить("Сделка", Справочники.СделкиСКлиентами.ПустаяСсылка());

	Если ДокументЗаявкаНаВозвратКомиссия <> Неопределено И ЗначениеЗаполнено(ДокументЗаявкаНаВозвратКомиссия.Ссылка) Тогда
		Документ.Дата = ДокументЗаявкаНаВозвратКомиссия.Дата + 1;   
		
		МассивЗаказов = Новый массив;
		МассивЗаказов.Добавить(ДокументЗаявкаНаВозвратКомиссия.Ссылка);
		ДанныеЗаполнения.Вставить("МассивЗаказов", МассивЗаказов);
		ДанныеЗаполнения.Вставить("Организация", ДокументЗаявкаНаВозвратКомиссия.Организация);				
		ДанныеЗаполнения.Вставить("Подразделение", ДокументЗаявкаНаВозвратКомиссия.Подразделение);  		
		
		РеквизитыШапки.Вставить("Договор", ДокументЗаявкаНаВозвратКомиссия.Договор);
		РеквизитыШапки.Вставить("Контрагент", ДокументЗаявкаНаВозвратКомиссия.Контрагент);		
		РеквизитыШапки.Вставить("Организация", ДокументЗаявкаНаВозвратКомиссия.Организация);
		РеквизитыШапки.Вставить("Партнер", ДокументЗаявкаНаВозвратКомиссия.Партнер); 
		РеквизитыШапки.Вставить("Подразделение", ДокументЗаявкаНаВозвратКомиссия.Подразделение); 		
		РеквизитыШапки.Вставить("Склад", ДокументЗаявкаНаВозвратКомиссия.Склад);
		РеквизитыШапки.Вставить("Соглашение", ДокументЗаявкаНаВозвратКомиссия.Соглашение);
		РеквизитыШапки.Вставить("ХозяйственнаяОперация", ДокументЗаявкаНаВозвратКомиссия.ХозяйственнаяОперация);	
		
		ДанныеЗаполнения.Вставить("РеквизитыШапки", РеквизитыШапки);
		ДанныеЗаполнения.Вставить("Склад", ДокументЗаявкаНаВозвратКомиссия.Склад);		
		ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", ДокументЗаявкаНаВозвратКомиссия.ХозяйственнаяОперация);
		
		Документ.Заполнить(ДанныеЗаполнения); 
		
		Документ.Комментарий = ДокументЗаявкаНаВозвратКомиссия.Комментарий;
		
		Документ.Товары.Очистить();
		
		Для Каждого Элемент Из ДокументЗаявкаНаВозвратКомиссия.ВозвращаемыеТовары Цикл
			НоваяСтрока = Документ.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		КонецЦикла;	
		
	Иначе
		
		ФункциональныеОпции = ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
		
		ДатаДокумента = ЗаголовокСтруктура.ПериодOzon.ДатаОкончания - 1;
		Склад = ФункциональныеОпции.OzonСкладРеализации;		
		
		Документ.Дата = ДатаДокумента;   
		
		ДанныеЗаполнения.Вставить("Организация", Профиль.Организация);				
		ДанныеЗаполнения.Вставить("Подразделение", ФункциональныеОпции.ПодразделениеOzon);  		
		
		РеквизитыШапки.Вставить("Договор", ФункциональныеОпции.ДоговорOzon);
		РеквизитыШапки.Вставить("Контрагент", ФункциональныеОпции.КонтрагентOzon);		
		РеквизитыШапки.Вставить("Организация", Профиль.Организация);
		РеквизитыШапки.Вставить("Партнер", ФункциональныеОпции.ПартнерOzon); 
		РеквизитыШапки.Вставить("Подразделение", ФункциональныеОпции.ПодразделениеOzon); 		
		РеквизитыШапки.Вставить("Склад", Склад);
		РеквизитыШапки.Вставить("Соглашение", ФункциональныеОпции.СоглашениеOzon);
		РеквизитыШапки.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера);	
		
		ДанныеЗаполнения.Вставить("РеквизитыШапки", РеквизитыШапки);
		ДанныеЗаполнения.Вставить("Склад", Склад);		
		ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера);
		
		Документ.Заполнить(ДанныеЗаполнения); 
		
		Документ.Партнер 	= ФункциональныеОпции.ПартнерOzon; 
		Документ.Контрагент = ФункциональныеОпции.КонтрагентOzon;
		Документ.Договор 	= ФункциональныеОпции.ДоговорOzon;
		Документ.Соглашение = ФункциональныеОпции.СоглашениеOzon;				
		
		Документ.Комментарий = ЗаголовокСтруктура.Комментарий;
		
		ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
		ИспользоватьДоговорыСКлиентами 	 = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
		
		ЗаполнитьВалюту = Истина;
		
		Если ИспользоватьСоглашенияСКлиентами Тогда 
			Валюта = ФункциональныеОпции.СоглашениеOzon.Валюта;
			ЗаполнитьВалюту = Ложь;
		КонецЕсли;
		
		Если ЗаполнитьВалюту И ИспользоватьДоговорыСКлиентами Тогда 
			Валюта = ФункциональныеОпции.ДоговорOzon.ВалютаВзаиморасчетов;
		КонецЕсли;
		
		Документ.Валюта = Валюта;
		
		Документ.Товары.Очистить();		
				
		СуммаДокумента = 0;
		
		Для Каждого Элемент Из Данные Цикл
			
			Цена = Элемент.ИсходныеСтоимостныеДанные;
			
			Если Элемент.ЭтоНабор Тогда
				РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Элемент.Номенклатура,
				"ТипНоменклатуры, ВидНоменклатуры");
				
				Если Элемент.Количество > 0 Тогда
					
					ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
					
					ПараметрыКомплектующих.Номенклатура   		= Элемент.Номенклатура;
					ПараметрыКомплектующих.НоменклатураНабора   = Элемент.Номенклатура;
					ПараметрыКомплектующих.ХарактеристикаНабора = Элемент.ХарактеристикаНоменклатуры;				
					ПараметрыКомплектующих.КоличествоУпаковок	= Элемент.Количество;
					ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
					ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
					ПараметрыКомплектующих.ЭтоТовар 			= Истина;
					ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
					
					Склады = Новый Массив;
					
					ДополнительныеПараметры = Новый Структура;
					
					ДополнительныеПараметры.Вставить("Дата", 						Документ.Дата);
					ДополнительныеПараметры.Вставить("Валюта", 						Документ.Валюта);
					ДополнительныеПараметры.Вставить("Склады", 						Склады);
					ДополнительныеПараметры.Вставить("Соглашение", 					Документ.Соглашение);
					ДополнительныеПараметры.Вставить("Цена", 						Цена);				
					ДополнительныеПараметры.Вставить("СтоимостьДопУслуг", 			0);	
					ДополнительныеПараметры.Вставить("ВидЦены", 					ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
					ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", 	Цена);
					ДополнительныеПараметры.Вставить("Комиссия", 					0);
					
					Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
					
					Для Каждого стрКомплекта Из Комплектующие Цикл			
						НоваяСтрока = Документ.Товары.Добавить();
						
						ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
						
						НоваяСтрока.Количество 					= НоваяСтрока.КоличествоУпаковок;
						НоваяСтрока.Сумма 						= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок
						+ стрКомплекта.Погрешность;
						
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе		
				
				Если Элемент.Количество > 0 Тогда
					
					НоваяСтрока = Документ.Товары.Добавить();
					
					НоваяСтрока.Номенклатура 					= Элемент.Номенклатура;
					НоваяСтрока.Характеристика 					= Элемент.ХарактеристикаНоменклатуры;				
					НоваяСтрока.Количество 						= Элемент.Количество;
					НоваяСтрока.КоличествоУпаковок 				= Элемент.Количество;
					НоваяСтрока.Сумма 							= Цена;
					НоваяСтрока.Цена 							= НоваяСтрока.Сумма / НоваяСтрока.КоличествоУпаковок;
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		Документ.Записать();
	КонецПопытки; 
	
	Возврат Документ;  
	
КонецФункции //- ИнфоСофт Заварин К.В. 28.11.24 УА #74680

#КонецОбласти

