
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 06.10.21 УА #38646
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	АвтоПодбор = Истина;	
	РежимОтладки = Ложь;
	РежимВыгрузкиФото = "Номенклатура";
	
	СформироватьСписокКатегорий();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 30.08.24 УА #74933
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаПосикКартинок.Видимость = Ложь;
	Элементы.ТаблицаИзображенийГруппаФайл.Видимость = Ложь;
	Элементы.ТаблицаИзображенийФайлКартинки.Видимость = Истина;
	
	Если РежимВыгрузкиФото = "Файл" Тогда
		Элементы.ГруппаПосикКартинок.Видимость = Истина;
		Элементы.ТаблицаИзображенийГруппаФайл.Видимость = Истина;
		Элементы.ТаблицаИзображенийФайлКартинки.Видимость = Ложь;
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
	Элементы.СопоставитьНоменклатуруАвтоматически.Видимость = СоздатьКарточкиПослеВыгрузки;
	//- ИнфоСофт Власова И.С. 02.12.24 УА #62619

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.08.24 УА #74933

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
&НаКлиенте
Процедура СписокКатегорийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
	    Возврат;
	КонецЕсли;

	ТекДанные = Элементы.СписокКатегорий.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	ПерейтиКФормированиюВыгрузки(ТекДанные.Категория);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 11.10.21 УА #38646
&НаКлиенте
Процедура ТаблицаВыгрузкиПриАктивизацииЯчейки(Элемент)

	Имя = Элемент.ТекущийЭлемент.Имя;

	Если Лев(Имя, 1) = "П" Тогда
		НастроитьПараметрыПоля(Имя);	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 11.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 11.10.21 УА #38646
&НаКлиенте
Процедура ТаблицаВыгрузкиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если АвтоПодбор Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьСписокПодбора(Профиль, Категория, Элемент.Имя, Текст);
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 11.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 12.10.21 УА #38646
&НаКлиенте
Процедура ТаблицаВыгрузкиНоменклатураПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаВыгрузки.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Строка = Элементы.ТаблицаВыгрузки.ТекущаяСтрока;	
	Номенклатура = ТекДанные.Номенклатура; 	
	
	//+ ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481	
	ПриИзмененииНаСервере(Номенклатура, Строка);
	//- ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.10.21 УА #38464

//+ ИнфоСофт Ивонин К.А. 12.10.21 УА #38646
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаВыбораГруппИЭлементов" Тогда
		ПодборНаСервере(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ИС_WB_Номенклатура.ФормаВыбора" Тогда
		ПодборНоменклатурыWBНаСервере(ВыбранноеЗначение);
	КонецЕсли;                                  
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаКлиенте
Процедура ТаблицаВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    ТекДанные = Элементы.ТаблицаВыгрузки.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
    
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = ПолучитьСтруктуруПараметровВыбор(Элемент.Имя, ТекДанные[Элемент.Имя]);
	ОткрытьФорму("Обработка.ИС_WB_ВыгрузкаКарточекТоваров.Форма.ФормаВыбораСпискаЗначений", ПараметрыОткрытия, Элемент);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 18.03.24 УА #72137
&НаКлиенте   
Процедура ОбработкаВыбораЭлемента(Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
    
    Если ДанныеВыбора = Неопределено Тогда
    	СтандартнаяОбработка = Ложь;
    	Возврат;
    КонецЕсли;
    
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 18.03.24 УА #72137

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаКлиенте
Процедура РежимОтладки(Команда)
	
	РежимОтладки = Не РежимОтладки;
	
	Если РежимОтладки Тогда
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	Иначе

		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;

		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаТестирование Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыгрузка;	
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаКлиенте
Процедура ТестовыйЗапрос(Команда)
	ОчиститьСообщения();
	ЗапросНаСервере();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 26.11.21 УА #40333
&НаКлиенте
Процедура ТаблицаВыгрузкиФотоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ДоступныеТипы = Новый ОписаниеТипов("Строка");
	Элемент.Родитель.ТекущиеДанные.Фото.ТипЗначения = ДоступныеТипы; 
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.11.21 УА #40333

//+ ИнфоСофт Ивонин К.А. 30.08.24 УА #74933
&НаКлиенте
Процедура ДекорацияВыгрузитьФотоНажатие(Элемент)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыгрузкаКартинок;
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.08.24 УА #74933

//+ ИнфоСофт Ивонин К.А. 30.08.24 УА #74933
&НаКлиенте
Процедура РежимВыгрузкиФотоПриИзменении(Элемент)

	Элементы.ГруппаПосикКартинок.Видимость = Ложь;
	Элементы.ТаблицаИзображенийГруппаФайл.Видимость = Ложь;
	Элементы.ТаблицаИзображенийФайлКартинки.Видимость = Истина;
	
	Если РежимВыгрузкиФото = "Файл" Тогда
		Элементы.ГруппаПосикКартинок.Видимость = Истина;
		Элементы.ТаблицаИзображенийГруппаФайл.Видимость = Истина;
		Элементы.ТаблицаИзображенийФайлКартинки.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.08.24 УА #74933

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481
&НаКлиенте
Процедура УнифицироватьАртикул(Команда)
	УнифицироватьАртикулНаСервере();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
&НаКлиенте
Процедура КомандаОбновить(Команда)
	СформироватьСписокКатегорий();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38464
&НаКлиенте
Процедура КомандаВыбрать(Команда)

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
	    Возврат;
	КонецЕсли;
		
	ТекДанные = Элементы.СписокКатегорий.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	ПерейтиКФормированиюВыгрузки(ТекДанные.Категория);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 06.10.21 УА #38646
&НаКлиенте
Процедура ЗагрузитьКатегорию(Команда)

	Если Не ЗначениеЗаполнено(Профиль) Тогда
	    ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль", , , "Профиль");
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("Профиль", Профиль);
	ОткрытьФорму("Обработка.ИС_WB_ВыгрузкаКарточекТоваров.Форма.ФормаЗагрузкиКатегорий", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 12.10.21 УА #38646
&НаКлиенте
Процедура СопоставитьПоля(Команда)
	ОткрытьФорму("Обработка.ИС_WB_ВыгрузкаКарточекТоваров.Форма.ФормаСопоставленияПолейНоменклатуры", , ЭтотОбъект);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
&НаКлиенте
Процедура Назад(Команда)

	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыгрузка Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыборКатегории;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыгрузка;	
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 12.10.21 УА #38646
&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 12.10.21 УА #38646
&НаКлиенте
Процедура ВыгрузитьКарточкиНаМаркетплейс(Команда)

	ОчиститьСообщения();
	
	СформироватьТелоЗапросаВыгрузкиКарточек();

	Если РежимОтладки Тогда	
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаТестирование;
	Иначе
		//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
		//ЗапросНаСервере();
		ВыгрузитьКарточкиНаМаркетплейсНаСервере();
		//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаКлиенте
Процедура ЗаполнитьСтолбец(Команда)

	ТекДанные = Элементы.ТаблицаВыгрузки.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Имя = СтрЗаменить(Элементы.ТаблицаВыгрузки.ТекущийЭлемент.Имя, "ТаблицаВыгрузки", ""); 
	Значение = ТекДанные[Имя];
	
	Для Каждого Строка Из ТаблицаВыгрузки Цикл
		Строка[Имя] = Значение;
	КонецЦикла;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
     
//+ ИнфоСофт Ивонин К.А. 25.11.21 УА #40333
&НаКлиенте
Процедура ПутьКИзображениямНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораПапки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораПапки.Заголовок = "Выберите папку с фотографиями для загрузки на WildBerries";
	ДиалогВыбораПапки.МножественныйВыбор = Ложь;
	
	ДиалогВыбораПапки.Показать(Новый ОписаниеОповещения("ПутьКИзображениямНачалоВыбораЗавершение", ЭтотОбъект));
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.11.21 УА #40333
        
//+ ИнфоСофт Ивонин К.А. 26.11.21 УА #40333
&НаКлиенте
Процедура Очистить(Команда)
	ТаблицаИзображений.Очистить();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.11.21 УА #40333
         
//+ ИнфоСофт Ивонин К.А. 26.11.21 УА #40333
&НаКлиенте
Процедура ПодобратьНоменклатуруПоАртикулу(Команда)
	ПодобратьНоменклатуруПоАртикулуНаСервере();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.11.21 УА #40333 
        
//+ ИнфоСофт Ивонин К.А. 26.11.21 УА #40333
&НаКлиенте
Процедура ВыгрузитьИзображенияНаWB(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
	    ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыгрузитьИзображенияНаWBНаСервере();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.11.21 УА #40333
             
//+ ИнфоСофт Ивонин К.А. 26.11.21 УА #40333
&НаКлиенте
Процедура ЗаполнитьПоНайденным(Команда)
	
	Для Каждого Строка Из ТаблицаИзображений Цикл
		
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			НайденныеСтроки = ТаблицаВыгрузки.НайтиСтроки(Новый Структура("Номенклатура", Строка.Номенклатура));
			
			Попытка
				УИД = Новый УникальныйИдентификатор(Строка.Результат);
			Исключение
			   	Продолжить;
			КонецПопытки;
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].Фото.Добавить(Строка.Результат);	
			КонецЕсли;
					
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.11.21 УА #40333

//+ ИнфоСофт Ивонин К.А. 26.11.21 УА #40333
&НаКлиенте
Процедура ЗагрузкаФотографий(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыгрузкаКартинок;
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.11.21 УА #40333

//+ ИнфоСофт Ивонин К.А. 24.04.24 УА #73304
&НаКлиенте
Процедура ПерезагрузитьКатегорию(Команда)
	
	ОчиститьСообщения();
	
	ТекДанные = Элементы.СписокКатегорий.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПерезагрузитьКатегориюНаСервере(Профиль, ТекДанные.Категория);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.04.24 УА #73304

//+ ИнфоСофт Ивонин К.А. 30.08.24 УА #74933
&НаКлиенте
Процедура ПодобратьНоменклатуруWB(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.ИС_WB_Номенклатура.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.08.24 УА #74933

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
&НаКлиенте
Процедура СоздатьКарточкиПослеВыгрузкиПриИзменении(Элемент)
	
	Элементы.СопоставитьНоменклатуруАвтоматически.Видимость = СоздатьКарточкиПослеВыгрузки;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
&НаСервере
Процедура СформироватьСписокКатегорий()

	СписокКатегорий.Очистить();
	
	Категории = Справочники.ИС_WB_Категории.Выбрать();
	
	Пока Категории.Следующий() Цикл	
		НоваяСтрока = СписокКатегорий.Добавить();
		НоваяСтрока.Категория = Категории.Ссылка;		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
&НаКлиенте
Процедура ПерейтиКФормированиюВыгрузки(ВыбраннаяКатегория)

	Категория = ВыбраннаяКатегория;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыгрузка;
	Элементы.ДекорацияКатегория.Заголовок = "Категория: " + Категория;
	
	СформироватьТаблицуДляВыгрузки(Категория);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
&НаСервере
Процедура СформироватьТаблицуДляВыгрузки(ВыбраннаяКатегория)

	МассивУдаления = Новый Массив;

	Для Каждого Элемент Из ПолучитьРеквизиты("ТаблицаВыгрузки") Цикл
			
		Если Лев(Элемент.Имя, 1) = "П" Тогда
			МассивУдаления.Добавить("ТаблицаВыгрузки." + Элемент.Имя);
			Элементы.Удалить(Элементы[Элемент.Имя]);
		КонецЕсли;
	
	КонецЦикла;
	
	ИзменитьРеквизиты(, МассивУдаления);

	СоответствиеПолей = Новый Соответствие;
		
	ОписаниеТиповЧислоВещественное = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3, ДопустимыйЗнак.Любой));
	ОписаниеТиповСтрока     	   = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1024));
	ОписаниеТиповСписокЗначений	   = Новый ОписаниеТипов("СписокЗначений");
		    
	ТЗ = Новый ТаблицаЗначений;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_КатегорииХарактеристики.Поле КАК Поле,
	|	ИС_WB_ХарактеристикиКатегорий.Наименование КАК Наименование,
	|	ИС_WB_ХарактеристикиКатегорий.charcID КАК charcID,
	|	ИС_WB_КатегорииХарактеристики.Обязательное КАК Обязательное,
	|	ИС_WB_ХарактеристикиКатегорий.dictionary КАК dictionary,
	|	ИС_WB_ХарактеристикиКатегорий.maxCount КАК maxCount,
	|	ИС_WB_ХарактеристикиКатегорий.unitName КАК unitName,
	|	ИС_WB_ХарактеристикиКатегорий.popular КАК popular
	|ИЗ
	|	Справочник.ИС_WB_Категории.Характеристики КАК ИС_WB_КатегорииХарактеристики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_ХарактеристикиКатегорий КАК ИС_WB_ХарактеристикиКатегорий
	|		ПО ИС_WB_КатегорииХарактеристики.Поле = ИС_WB_ХарактеристикиКатегорий.Ссылка
	|ГДЕ
	|	ИС_WB_КатегорииХарактеристики.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	popular УБЫВ,
	|	Наименование";
		
	Запрос.УстановитьПараметр("Ссылка", ВыбраннаяКатегория);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекущийИдЭлемента = 0;
	Пока Выборка.Следующий() Цикл
		
		СтруктураПоля = Новый Структура;
		СтруктураПоля.Вставить("Поле", Выборка.Поле);
		СтруктураПоля.Вставить("charcID", Выборка.charcID);
		СтруктураПоля.Вставить("Наименование", Выборка.Наименование);
		СтруктураПоля.Вставить("Обязательное", Выборка.Обязательное);
		СтруктураПоля.Вставить("Справочник", Выборка.dictionary);
		СтруктураПоля.Вставить("МаксимальноеКоличество", Выборка.maxCount);
		СтруктураПоля.Вставить("ЕдиницаИзмерения", Выборка.unitName);
		СтруктураПоля.Вставить("Популярная", Выборка.popular);
			
		СоответствиеПолей.Вставить("Поле" + ТекущийИдЭлемента, СтруктураПоля);
		
		Если Выборка.maxCount > 1 Тогда
			ТЗ.Колонки.Добавить("Поле" + ТекущийИдЭлемента, ОписаниеТиповСписокЗначений);		
		ИначеЕсли Выборка.unitName <> "" Тогда
			ТЗ.Колонки.Добавить("Поле" + ТекущийИдЭлемента, ОписаниеТиповЧислоВещественное);
		Иначе
		    ТЗ.Колонки.Добавить("Поле" + ТекущийИдЭлемента, ОписаниеТиповСтрока);
		КонецЕсли;
		
		ТекущийИдЭлемента = ТекущийИдЭлемента + 1;
	
	КонецЦикла;
	
	ХранилищеОбщихНастроек.Сохранить("ИС_НастройкиПолей", , СоответствиеПолей);
	
	НовыеРеквизиты = Новый Массив;
	
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Реквизит = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, 
			"ТаблицаВыгрузки", СоответствиеПолей[Колонка.Имя].Наименование);
		НовыеРеквизиты.Добавить(Реквизит);
	КонецЦикла;
	
	ИзменитьРеквизиты(НовыеРеквизиты);
		
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		                                   
		НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), Элементы["ТаблицаВыгрузки"]);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "ТаблицаВыгрузки." + Колонка.Имя;
		
		Характеристика = СоответствиеПолей[Колонка.Имя];
		
		Если Характеристика.Справочник <> "" И Характеристика.МаксимальноеКоличество < 2 Тогда
		
			Если Характеристика.Справочник <> "tnved" Тогда
			
				НовыйЭлемент.РежимВыбораИзСписка = Истина;
				СписокВыбора = ИС_WB_Сервер.ПолучитьЗначенияХарактеристики(Профиль, Характеристика.Справочник);
				Если СписокВыбора = Неопределено Тогда
					НовыйЭлемент.РежимВыбораИзСписка = Ложь;	
				Иначе
					НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(СписокВыбора.ВыгрузитьЗначения()); 
				КонецЕсли;			
				
			Иначе	
				НовыйЭлемент.УстановитьДействие("АвтоПодбор", "ТаблицаВыгрузкиАвтоПодбор"); 
		    КонецЕсли;
		
		КонецЕсли;
		
		Если Характеристика.МаксимальноеКоличество > 1 Тогда
			НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ТаблицаВыгрузкиНачалоВыбора");
			НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", "ОбработкаВыбораЭлемента");
		КонецЕсли;

		Если Характеристика.Обязательное Тогда
			НовыйЭлемент.ЦветФонаЗаголовка = ЦветаСтиля.ЦветАкцента;
			НовыйЭлемент.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветТекстаВыделенияПоля;
		КонецЕсли;
					
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 11.10.21 УА #38646
&НаСервере
Процедура НастроитьПараметрыПоля(Имя)

	СоответствиеПолей = ХранилищеОбщихНастроек.Загрузить("ИС_НастройкиПолей");
	Наименование = СоответствиеПолей[Имя].Наименование;
	Обязательное = СоответствиеПолей[Имя].Обязательное;
	Справочник = СоответствиеПолей[Имя].Справочник;
	МаксимальноеКоличество = СоответствиеПолей[Имя].МаксимальноеКоличество;
	ЕдиницаИзмерения = СоответствиеПолей[Имя].ЕдиницаИзмерения;
	Популярная = СоответствиеПолей[Имя].Популярная;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 11.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 11.10.21 УА #38646
&НаСервереБезКонтекста
Функция ПолучитьСписокПодбора(Профиль, Категория, Имя, Текст)

	СоответствиеПолей = ХранилищеОбщихНастроек.Загрузить("ИС_НастройкиПолей");
	Справочник = СоответствиеПолей[Имя].Справочник;
			
	Возврат ИС_WB_Сервер.ПолучитьЗначенияХарактеристики(Профиль, Справочник, Категория.subjectID, Текст);
	
КонецФункции //- ИнфоСофт Ивонин К.А. 11.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 12.10.21 УА #38646
&НаСервере
Процедура ПодборНаСервере(МассивВыбора)
	
	//+ ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481
	//ТаблицаСопоставления = ПолучитьТаблицуСопоставления(Категория);	
    	
	Для Каждого Элемент Из МассивВыбора Цикл
		ПриИзмененииНаСервере(Элемент, Неопределено)		
	КонецЦикла;                                 
	//- ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 12.10.21 УА #38646
&НаСервере
Процедура ПодобратьПоля(Элемент, ТаблицаСопоставления, Знач Строка = Неопределено, ДопПараметры)
    
   	Если ТаблицаСопоставления = Неопределено Тогда
		ТаблицаСопоставления = ПолучитьТаблицуСопоставления(Категория);
	КонецЕсли;

	Если ТипЗнч(Строка) = Тип("Число") Тогда  	
		Строка = ТаблицаВыгрузки.НайтиПоИдентификатору(Строка);
	Иначе
		Строка = ТаблицаВыгрузки.Добавить();
	КонецЕсли;

	Строка.Номенклатура = Элемент; 
	
	//+ ИнфоСофт Ивонин К.А. 12.03.24 УА #72137
	////+ ИнфоСофт Стояк Ю.К. 27.06.2023 УА #59660
	//НайденныйСтроки = ТаблицаВыгрузки.НайтиСтроки(Новый Структура("Номенклатура", Строка.Номенклатура)); 
	//	
	//Если НайденныйСтроки.Количество() > 1 И ХарактеристикаКакРазмер Тогда
	//	Строка.ЭтоРазмер = Истина;	
	//КонецЕсли;                                  
	////- ИнфоСофт Стояк Ю.К. 27.06.2023 УА #59660
	//- ИнфоСофт Ивонин К.А. 12.03.24 УА #72137
	
	//+ ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481	
	Если ДопПараметры.Свойство("Штрихкод") Тогда
		Строка.barcode = ДопПараметры.Штрихкод;	
	КонецЕсли;
	
	Если ДопПараметры.Свойство("Характеристика") Тогда
		Строка.Характеристика = ДопПараметры.Характеристика;	
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481
	
	Если ЗначениеЗаполнено(ВидЦены) Тогда
		Строка.РозничнаяЦена = ПолучитьЗначениеЦены(ВидЦены, Строка.Номенклатура, Строка.Характеристика);
	КонецЕсли;
	
	Строка.object = Категория;
	
	СоответствиеПолей = ХранилищеОбщихНастроек.Загрузить("ИС_НастройкиПолей");
	
	Для Каждого СтрокаТаблицы Из ТаблицаСопоставления Цикл
	
		Если СтрокаТаблицы.Характеристика = "Артикул" Тогда
			Строка.vendorCode = ПолучитьЗначениеПараметра(Элемент, СтрокаТаблицы.Поле1С, СтрокаТаблицы.Раздел1С, Строка.Характеристика);
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.Характеристика = "Бренд" Тогда
			Строка.Бренд = ПолучитьЗначениеПараметра(Элемент, СтрокаТаблицы.Поле1С, СтрокаТаблицы.Раздел1С, Строка.Характеристика);
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.Характеристика = "Наименование" Тогда
			Строка.Наименование = ПолучитьЗначениеПараметра(Элемент, СтрокаТаблицы.Поле1С, СтрокаТаблицы.Раздел1С, Строка.Характеристика);
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.Характеристика = "Описание" Тогда
			Строка.Описание = ПолучитьЗначениеПараметра(Элемент, СтрокаТаблицы.Поле1С, СтрокаТаблицы.Раздел1С, Строка.Характеристика);
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.Характеристика = "Длина упаковки (см)" Тогда
			Строка.ДлинаУпаковки = ПолучитьЗначениеПараметра(Элемент, СтрокаТаблицы.Поле1С, СтрокаТаблицы.Раздел1С, Строка.Характеристика);
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.Характеристика = "Ширина упаковки (см)" Тогда
			Строка.ШиринаУпаковки = ПолучитьЗначениеПараметра(Элемент, СтрокаТаблицы.Поле1С, СтрокаТаблицы.Раздел1С, Строка.Характеристика);
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.Характеристика = "Высота упаковки (см)" Тогда
			Строка.ВысотаУпаковки = ПолучитьЗначениеПараметра(Элемент, СтрокаТаблицы.Поле1С, СтрокаТаблицы.Раздел1С, Строка.Характеристика);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.barcode) Тогда
			Если СтрокаТаблицы.Характеристика = "Штрихкод" Тогда
				Строка.barcode = ПолучитьЗначениеПараметра(Элемент, СтрокаТаблицы.Поле1С, СтрокаТаблицы.Раздел1С, Строка.Характеристика);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
			
		Для Каждого ЭлементСоответствия Из СоответствиеПолей Цикл
		
			Если ЭлементСоответствия.Значение.Поле.Наименование = СтрокаТаблицы.Характеристика Тогда
				
				//+ ИнфоСофт Стояк Ю.К. 26.05.2023 УА #58481				
				Если ЭлементСоответствия.Значение.МаксимальноеКоличество > 1 Тогда
					Строка[ЭлементСоответствия.Ключ].Добавить(ПолучитьЗначениеПараметра(Элемент, СтрокаТаблицы.Поле1С, СтрокаТаблицы.Раздел1С, Строка.Характеристика)) 
				Иначе
				//+ ИнфоСофт Ивонин К.А. 12.03.24 УА #72137
					
					ЗначениеПараметра = ПолучитьЗначениеПараметра(Элемент, СтрокаТаблицы.Поле1С, СтрокаТаблицы.Раздел1С, Строка.Характеристика);
					
					Если ЗначениеПараметра = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ЭлементСоответствия.Значение.ЕдиницаИзмерения) Тогда
					
						Попытка
							Строка[ЭлементСоответствия.Ключ] = Число(ЗначениеПараметра);
						Исключение
							Строка[ЭлементСоответствия.Ключ] = 0;
						КонецПопытки;	
					
					Иначе
						Строка[ЭлементСоответствия.Ключ] = Строка(ЗначениеПараметра);
					КонецЕсли;
					//Если Не Строка[ЭлементСоответствия.Ключ] = ПолучитьЗначениеПараметра(Элемент, СтрокаТаблицы.Поле1С, СтрокаТаблицы.Раздел1С, Строка.Характеристика) Тогда
					//	Попытка
					//		Строка[ЭлементСоответствия.Ключ] = Число(ПолучитьЗначениеПараметра(Элемент, СтрокаТаблицы.Поле1С, СтрокаТаблицы.Раздел1С, Строка.Характеристика));
					//	Исключение                                                                                                                                            
					//		Строка[ЭлементСоответствия.Ключ] = Строка(ПолучитьЗначениеПараметра(Элемент, СтрокаТаблицы.Поле1С, СтрокаТаблицы.Раздел1С, Строка.Характеристика));
					//	КонецПопытки;
					//КонецЕсли;
				//- ИнфоСофт Ивонин К.А. 12.03.24 УА #72137	
				КонецЕсли;
				//- ИнфоСофт Стояк Ю.К. 26.05.2023 УА #58481
		    	Прервать;	
			
			КонецЕсли;
		
		КонецЦикла;	
	
	КонецЦикла;
	
	ТаблицаСопоставления = Неопределено;
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 12.10.21 УА #38646
&НаСервере
Процедура СформироватьТелоЗапросаВыгрузкиКарточек()

	Результат = Новый Массив; 
	                  
    ТаблицаФоримрованияЗапроса = ТаблицаВыгрузки.Выгрузить();
    
    СоответствиеПолей = ХранилищеОбщихНастроек.Загрузить("ИС_НастройкиПолей");
    
    Размер = Неопределено;
    РосРазмер = Неопределено;
    
    Для Каждого Элемент Из СоответствиеПолей Цикл
        
        Если Элемент.Значение.Наименование = "Размер" Тогда
        	Размер = Элемент.Ключ;
        	Продолжить;
        КонецЕсли;
        
        Если Элемент.Значение.Наименование = "Рос. размер" Тогда
        	РосРазмер = Элемент.Ключ;
        	Продолжить;
        КонецЕсли;
           
    КонецЦикла;
    
    Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ.Номенклатура КАК Номенклатура,
	|	ВТ_ТЧ.Характеристика КАК Характеристика
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|ИТОГИ ПО
	|	Номенклатура";

	Запрос.УстановитьПараметр("ТЧ", ТаблицаФоримрованияЗапроса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатуры = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
    	
    	ВыборкаХакартеристики = ВыборкаНоменклатуры.Выбрать();
    	
    	СтруктураТовара = Новый Структура;
    	
    	МассивVariants = Новый Массив;
    	
    	ВыборкаХакартеристики.Следующий();
    	
		НайденныеСтроки = ТаблицаФоримрованияЗапроса.НайтиСтроки(
			Новый Структура("Номенклатура, Характеристика", ВыборкаХакартеристики.Номенклатура, ВыборкаХакартеристики.Характеристика));	
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураVariant = Новый Структура;
		МассивSizes = Новый Массив;
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			
			СтруктураТовара.Вставить("subjectID", Строка.object.subjectID);	
		
			Если Не ЗначениеЗаполнено(Строка.vendorCode) Тогда
				Продолжить;
			КонецЕсли;
				
			СтруктураVariant.Вставить("vendorCode", Строка.vendorCode);
			СтруктураVariant.Вставить("title", Строка.Наименование);
			СтруктураVariant.Вставить("description", Строка.Описание);
			СтруктураVariant.Вставить("brand", Строка.Бренд);
			
			СтруктураDimensions = Новый Структура;
			
			СтруктураDimensions.Вставить("length", Строка.ДлинаУпаковки);
			СтруктураDimensions.Вставить("width", Строка.ШиринаУпаковки);
			СтруктураDimensions.Вставить("height", Строка.ВысотаУпаковки);
            
            СтруктураVariant.Вставить("dimensions", СтруктураDimensions);
            
            МассивCharacteristics = СформироватьМассивCharacteristics(Строка, СоответствиеПолей);
           	СтруктураVariant.Вставить("characteristics", МассивCharacteristics); 
			
			СтруктураSizes = Новый Структура;
			
			Если Размер <> Неопределено Тогда
				СтруктураSizes.Вставить("techSize", Строка[Размер]);
			КонецЕсли;
			
			Если РосРазмер <> Неопределено Тогда		
				СтруктураSizes.Вставить("wbSize", Строка[РосРазмер]);   
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.РозничнаяЦена) Тогда	
				СтруктураSizes.Вставить("price", Строка.РозничнаяЦена);    
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.barcode) Тогда
				
				МассивBarcodes = Новый Массив;
				МассивBarcodes.Добавить(Строка.barcode);
				
				СтруктураSizes.Вставить("skus", МассивBarcodes); 
			
			КонецЕсли;
			
			Если СтруктураSizes.Количество() > 0 Тогда
				МассивSizes.Добавить(СтруктураSizes);
			КонецЕсли;
				
			СтруктураVariant.Вставить("sizes", МассивSizes);
			
			МассивVariants.Добавить(СтруктураVariant);
			
			СтруктураТовара.Вставить("variants", МассивVariants);
		
		КонецЦикла;
		
		Пока ВыборкаХакартеристики.Следующий() Цикл
    	
			НайденныеСтроки = ТаблицаФоримрованияЗапроса.НайтиСтроки(
				Новый Структура("Номенклатура, Характеристика", ВыборкаХакартеристики.Номенклатура, ВыборкаХакартеристики.Характеристика));	
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ХарактеристикаКакРазмер Тогда	    
			    
			    Для Каждого Строка Из НайденныеСтроки Цикл
				
					СтруктураSizes = Новый Структура;
					
					Если Размер <> Неопределено Тогда
						СтруктураSizes.Вставить("techSize", Строка[Размер]);
					КонецЕсли;
					
					Если РосРазмер <> Неопределено Тогда		
						СтруктураSizes.Вставить("wbSize", Строка[РосРазмер]);   
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Строка.РозничнаяЦена) Тогда	
						СтруктураSizes.Вставить("price", Строка.РозничнаяЦена);    
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Строка.barcode) Тогда
						
						МассивBarcodes = Новый Массив;
						МассивBarcodes.Добавить(Строка.barcode);
						
						СтруктураSizes.Вставить("skus", МассивBarcodes); 
					
					КонецЕсли;
					
					Если СтруктураSizes.Количество() > 0 Тогда
						МассивSizes.Добавить(СтруктураSizes);
					КонецЕсли;
				
				КонецЦикла;
			
			Иначе // Цвет
			
				СтруктураVariant = Новый Структура;
				
				Для Каждого Строка Из НайденныеСтроки Цикл
					
					СтруктураТовара.Вставить("subjectID", Строка.object.subjectID);	
				
					Если Не ЗначениеЗаполнено(Строка.vendorCode) Тогда
						Продолжить;
					КонецЕсли;
						
					СтруктураVariant.Вставить("vendorCode", Строка.vendorCode);
					СтруктураVariant.Вставить("title", Строка.Наименование);
					СтруктураVariant.Вставить("description", Строка.Описание);
					СтруктураVariant.Вставить("brand", Строка.Бренд);
					
					СтруктураDimensions = Новый Структура;
					
					СтруктураDimensions.Вставить("length", Строка.ДлинаУпаковки);
					СтруктураDimensions.Вставить("width", Строка.ШиринаУпаковки);
					СтруктураDimensions.Вставить("height", Строка.ВысотаУпаковки);
					            
		            СтруктураVariant.Вставить("dimensions", СтруктураDimensions);
		            
		            МассивCharacteristics = СформироватьМассивCharacteristics(Строка, СоответствиеПолей);
		           	СтруктураVariant.Вставить("characteristics", МассивCharacteristics); 
					
					МассивSizes = Новый Массив;
					СтруктураSizes = Новый Структура;
					
					Если Размер <> Неопределено Тогда
						СтруктураSizes.Вставить("techSize", Строка[Размер]);
					КонецЕсли;
					
					Если РосРазмер <> Неопределено Тогда		
						СтруктураSizes.Вставить("wbSize", Строка[РосРазмер]);   
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Строка.РозничнаяЦена) Тогда	
						СтруктураSizes.Вставить("price", Строка.РозничнаяЦена);    
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Строка.barcode) Тогда
						
						МассивBarcodes = Новый Массив;
						МассивBarcodes.Добавить(Строка.barcode);
						
						СтруктураSizes.Вставить("skus", МассивBarcodes); 
					
					КонецЕсли;
					
					Если СтруктураSizes.Количество() > 0 Тогда
						МассивSizes.Добавить(СтруктураSizes);
					КонецЕсли;
						
					СтруктураVariant.Вставить("sizes", МассивSizes);
					
					МассивVariants.Добавить(СтруктураVariant);
				
				КонецЦикла;
			
			КонецЕсли; 
			
		КонецЦикла;
    	
    	Результат.Добавить(СтруктураТовара);
    	   
	КонецЦикла;
	
	РезультатФормирования = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(Результат);
                                             
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 13.10.21 УА #38646
&НаСервере
Функция СформироватьМассивCharacteristics(Строка, СоответствиеПолей)
		
	Результат = Новый Массив;
	
	Для Каждого Элемент Из СоответствиеПолей Цикл
		
		Если Элемент.Значение.Наименование = "Размер" Тогда
        	Продолжить;
        КонецЕсли;
        
        Если Элемент.Значение.Наименование = "Рос. размер" Тогда
        	Продолжить;
        КонецЕсли;
        
        Если Элемент.Значение.Наименование = "Наименование" Тогда
        	Продолжить;
        КонецЕсли;
        
		Если Элемент.Значение.Наименование = "Описание" Тогда
        	Продолжить;
        КонецЕсли;
        
		Если Элемент.Значение.Наименование = "Бренд" Тогда
        	Продолжить;
        КонецЕсли;
        
		Если Элемент.Значение.Наименование = "Длина упаковки" Тогда
        	Продолжить;
        КонецЕсли;
        
		Если Элемент.Значение.Наименование = "Ширина упаковки" Тогда
        	Продолжить;
        КонецЕсли;
        
		Если Элемент.Значение.Наименование = "Высота упаковки" Тогда
        	Продолжить;
        КонецЕсли;

		
		Если Элемент.Значение.МаксимальноеКоличество = 0 Тогда
			
			Если ЗначениеЗаполнено(Строка[Элемент.Ключ]) Тогда
				
				СтруктураПоля = Новый Структура;
				
				СтруктураПоля.Вставить("id", Элемент.Значение.charcID);
				СтруктураПоля.Вставить("name", Элемент.Значение.Наименование);
				СтруктураПоля.Вставить("value", Строка[Элемент.Ключ]);
				
				Результат.Добавить(СтруктураПоля);
				
			КонецЕсли;
			
		ИначеЕсли Элемент.Значение.МаксимальноеКоличество = 1 Тогда
			
			Если ЗначениеЗаполнено(Строка[Элемент.Ключ]) Тогда
				
				СтруктураПоля = Новый Структура;
				МассивЗначения = Новый Массив;
				МассивЗначения.Добавить(Строка[Элемент.Ключ]);
				
				СтруктураПоля.Вставить("id", Элемент.Значение.charcID);
				СтруктураПоля.Вставить("name", Элемент.Значение.Наименование);
				СтруктураПоля.Вставить("value", МассивЗначения);
				
				Результат.Добавить(СтруктураПоля);
				
			КонецЕсли;
			
		Иначе
			
			Если Строка[Элемент.Ключ].Количество() > 0 Тогда
			
				СтруктураПоля = Новый Структура;
				МассивЗначения = Новый Массив;                        
				
				Для Каждого ЭлементСписка Из Строка[Элемент.Ключ] Цикл
					МассивЗначения.Добавить(ЭлементСписка.Значение);        
				КонецЦикла;
				
				СтруктураПоля.Вставить("id", Элемент.Значение.charcID);
				СтруктураПоля.Вставить("name", Элемент.Значение.Наименование);
				СтруктураПоля.Вставить("value", МассивЗначения);
				
				Результат.Добавить(СтруктураПоля);
								
			КонецЕсли;
			
		КонецЕсли;			
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 13.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Функция ПолучитьСтруктуруПараметровВыбор(Имя, Значение)
	
	СоответствиеПолей = ХранилищеОбщихНастроек.Загрузить("ИС_НастройкиПолей");
	
	Поле = СоответствиеПолей[Имя];
	Если Поле = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = Новый Структура;                 	
	Результат.Вставить("Имя", Поле.Наименование);	
	Результат.Вставить("Справочник", Поле.Справочник);	
	Результат.Вставить("МаксимальноеКоличество", Поле.МаксимальноеКоличество);
	Результат.Вставить("ЭтоЧисло", Поле.ЕдиницаИзмерения);
	Результат.Вставить("Профиль", Профиль);
	Результат.Вставить("Категория", Категория); 
	Результат.Вставить("АвтоПодбор", АвтоПодбор);
	Результат.Вставить("Значение", Значение);
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Функция ЗапросНаСервере()
        
	КодОтвета = "";
	
	Результат = ИС_WB_Сервер.ВыгрузитьКарточкиТоваров(Профиль, РезультатФормирования);

	Если Не Результат = Неопределено Тогда 	
		
		КодОтвета = Результат.КодОтвета;  
		РезультатВыгрузки = Результат.Ответ;
		
		Если Результат.КодОтвета = 200 Тогда   
			
			//+ ИнфоСофт Мурсалимов Д.Р. 25.03.24 УА #71529
			Если ЗаписыватьСгенерированныйШтрихкод Тогда
				
				Для Каждого Строка Из ТаблицаВыгрузки Цикл
					
					Если Строка.ШтрихкодСгенерирован Тогда
						
						СохранитьШтрихкодНоменклатуры(Строка.Номенклатура, Строка.Характеристика, Строка.barcode);
						
					КонецЕсли; 
					
				КонецЦикла;
				
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 25.03.24 УА #71529
			
			ОбщегоНазначения.СообщитьПользователю("Выгрузка успешно завершена"); 
			Возврат Истина; 
			
		КонецЕсли;
		
		Возврат Ложь;
		
	КонецЕсли;               
	
	Возврат Ложь;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 25.10.21 УА #38646
&НаСервереБезконтекста
Функция ПолучитьТаблицуСопоставления(Категория)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_НастройкиСопоставленияХарактеристикТоваров.Категория КАК Категория,
	|	ИС_WB_НастройкиСопоставленияХарактеристикТоваров.Характеристика КАК Характеристика,
	|	ИС_WB_НастройкиСопоставленияХарактеристикТоваров.Раздел1С КАК Раздел1С,
	|	ИС_WB_НастройкиСопоставленияХарактеристикТоваров.Поле1С КАК Поле1С
	|ИЗ
	|	РегистрСведений.ИС_WB_НастройкиСопоставленияХарактеристикТоваров КАК ИС_WB_НастройкиСопоставленияХарактеристикТоваров
	|ГДЕ
	|	ИС_WB_НастройкиСопоставленияХарактеристикТоваров.Категория = &Категория
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_WB_НастройкиСопоставленияХарактеристикТоваров.Категория,
	|	ИС_WB_НастройкиСопоставленияХарактеристикТоваров.Характеристика,
	|	ИС_WB_НастройкиСопоставленияХарактеристикТоваров.Раздел1С,
	|	ИС_WB_НастройкиСопоставленияХарактеристикТоваров.Поле1С
	|ИЗ
	|	РегистрСведений.ИС_WB_НастройкиСопоставленияХарактеристикТоваров КАК ИС_WB_НастройкиСопоставленияХарактеристикТоваров
	|ГДЕ
	|	ИС_WB_НастройкиСопоставленияХарактеристикТоваров.Категория = ЗНАЧЕНИЕ(Справочник.ИС_WB_Категории.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Категория";
	
	Запрос.УстановитьПараметр("Категория", Категория);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаСопоставления = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаСопоставления;

КонецФункции //- ИнфоСофт Ивонин К.А. 25.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 27.10.21 УА #38646
&НаСервереБезконтекста
Функция ПолучитьЗначениеПараметра(Знач Номенклатура, Поле1С, Раздел1С, Знач Характеристика)
	
	Запрос = Новый Запрос;
	Условие = Истина;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	ПолеКопия = Поле1С;
	
	Если Раздел1С = "Справочник.Номенклатура" Тогда
		Условие = "Источник.Ссылка = &Номенклатура";   
		
		Для Каждого Владелец Из Метаданные.НайтиПоПолномуИмени(Раздел1С).Владельцы Цикл
			
			Если Владелец.Имя = "Номенклатура" Тогда
				Условие = "Источник.Владелец = &Номенклатура";
				Прервать;						
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;   
	
	//+ ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481	
	Если Раздел1С = "Справочник.ХарактеристикиНоменклатуры" Тогда
		Условие = "Источник.Владелец = &Номенклатура И Источник.Ссылка = &Характеристика";
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		Если Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры Тогда			
			Номенклатура = Номенклатура.ВидНоменклатуры;
		КонецЕсли;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481  
	
	//+ ИнфоСофт Стояк Ю.К. 13.03.2025 УА #95826
	Если Раздел1С = "РегистрСведений.ДополнительныеСведения" Тогда		
		Условие = "Источник.Объект = &Номенклатура И Источник.Свойство.Имя = """ + ПолеКопия + """";
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		ПолеКопия = "Значение";
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 13.03.2025 УА #95826
	
	Если СтрНайти(Раздел1С, "РегистрСведений") <> 0 Тогда                               
		
		Для Каждого Измерение Из Метаданные.НайтиПоПолномуИмени(Раздел1С).Измерения Цикл
			
			Если Измерение.Имя = "Номенклатура" Тогда
				Условие = "Источник.Номенклатура = &Номенклатура И Источник.Характеристика = &Характеристика";
				Запрос.УстановитьПараметр("Характеристика", Характеристика);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Условие = Истина Тогда 
			
			Для Каждого Ресурс Из Метаданные.НайтиПоПолномуИмени(Раздел1С).Ресурсы Цикл
				
				Если Ресурс.Имя = "Номенклатура" Тогда
					Условие = "Источник.Номенклатура = &Номенклатура И Источник.Характеристика = &Характеристика"; 
					Запрос.УстановитьПараметр("Характеристика", Характеристика);
					Прервать;
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли;
		
		Если Раздел1С = "РегистрСведений.ЦеныНоменклатуры" Тогда 
			Раздел1С = "РегистрСведений.ЦеныНоменклатуры.СрезПоследних ";
		КонецЕсли;
		
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 23.08.2023 УА #62239
	//Далее немного говнокод, времени на разборку много нет, пока так оставил
	Если Раздел1С = "Справочник.Номенклатура.ДополнительныеРеквизиты" Тогда 
		
		ПолеКопия = СтрЗаменить(ПолеКопия, """", """""");
		Условие = "Источник.Ссылка = &Номенклатура И Источник.Свойство.Имя = """ + ПолеКопия + """";
		ПолеКопия = "Значение"; 
		
	КонецЕсли;
	
	Если Раздел1С = "Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты" Тогда 
		
		ПолеКопия = СтрЗаменить(ПолеКопия, """", """""");
		Условие = "Источник.Ссылка = &Номенклатура И Источник.Свойство.Имя = """ + ПолеКопия + """";
		ПолеКопия = "Значение";
		Запрос.УстановитьПараметр("Номенклатура", Характеристика);
		
	КонецЕсли;
	
	Если Раздел1С = "ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения" Тогда 
		
		Раздел1С = "Справочник.Номенклатура.ДополнительныеРеквизиты"; 
		ПолеКопия = СтрЗаменить(ПолеКопия, """", """""");
		Условие = "Источник.Ссылка = &Номенклатура И Источник.Свойство.Имя = """ + ПолеКопия + """";
		ПолеКопия = "Значение"; 
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	| Источник." + ПолеКопия + " КАК Поле1С
	|ИЗ
	| " + Раздел1С + " КАК Источник
	|ГДЕ
	| " + Условие;
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда

		Если ТипЗнч(Выборка.Поле1С) = Тип("Строка") Или ТипЗнч(Выборка.Поле1С) = Тип("Число") Тогда
			Возврат Выборка.Поле1С;
		КонецЕсли;
		
		Возврат Строка(Выборка.Поле1С);
			
	ИначеЕсли Раздел1С = "Справочник.Номенклатура.ДополнительныеРеквизиты" Тогда 
		
		Раздел1С = "Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты";
		ПолеКопия = СтрЗаменить(Поле1С, """", """""");
		Условие = "Источник.Ссылка = &Номенклатура И Источник.Свойство.Имя = """ + ПолеКопия + """";
		ПолеКопия = "Значение";
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		| Источник." + ПолеКопия + " КАК Поле1С
		|ИЗ
		| " + Раздел1С + " КАК Источник
		|ГДЕ
		| " + Условие;
		
		Запрос.УстановитьПараметр("Номенклатура", Характеристика); 
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Если ТипЗнч(Выборка.Поле1С) = Тип("Строка") Или ТипЗнч(Выборка.Поле1С) = Тип("Число") Тогда
				Возврат Выборка.Поле1С;
			КонецЕсли;
			
			Возврат Строка(Выборка.Поле1С);
			
		КонецЕсли;
		
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 23.08.2023 УА #62239
	Возврат Неопределено;

КонецФункции //- ИнфоСофт Ивонин К.А. 27.10.21 УА #38646
                
//+ ИнфоСофт Ивонин К.А. 25.11.21 УА #40333
&НаКлиенте
Процедура ПутьКИзображениямНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКИзображениям = Результат[0];

	НачатьПоискФайлов(Новый ОписаниеОповещения("ПоискФайловЗавершение", ЭтотОбъект), ПутьКИзображениям, "*.pjp", ВключаяВложенныеКаталоги);
	НачатьПоискФайлов(Новый ОписаниеОповещения("ПоискФайловЗавершение", ЭтотОбъект), ПутьКИзображениям, "*.jpg", ВключаяВложенныеКаталоги);
	НачатьПоискФайлов(Новый ОписаниеОповещения("ПоискФайловЗавершение", ЭтотОбъект), ПутьКИзображениям, "*.pjpeg", ВключаяВложенныеКаталоги);
	НачатьПоискФайлов(Новый ОписаниеОповещения("ПоискФайловЗавершение", ЭтотОбъект), ПутьКИзображениям, "*.jpeg", ВключаяВложенныеКаталоги);
	НачатьПоискФайлов(Новый ОписаниеОповещения("ПоискФайловЗавершение", ЭтотОбъект), ПутьКИзображениям, "*.jfif", ВключаяВложенныеКаталоги);
	НачатьПоискФайлов(Новый ОписаниеОповещения("ПоискФайловЗавершение", ЭтотОбъект), ПутьКИзображениям, "*.png", ВключаяВложенныеКаталоги);    
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.11.21 УА #40333     

//+ ИнфоСофт Ивонин К.А. 25.11.21 УА #40333
&НаКлиенте
Процедура ПоискФайловЗавершение(Результат, ДополнительныеПараметры) Экспорт
        
    Для Каждого Элемент Из Результат Цикл
    	
    	НоваяСтрока = ТаблицаИзображений.Добавить();
    	НоваяСтрока.Имя = Элемент.ИмяБезРасширения;
    	НоваяСтрока.Расширение = Элемент.Расширение;
    	НоваяСтрока.ПутьКФайлу = Элемент.ПолноеИмя;
    	
    КонецЦикла;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.11.21 УА #40333           
   
//+ ИнфоСофт Ивонин К.А. 26.11.21 УА #40333
&НаСервере
Процедура ПодобратьНоменклатуруПоАртикулуНаСервере()
	
	Для Каждого Элемент Из ТаблицаВыгрузки Цикл
	  
	  	Артикул = Элемент.Номенклатура.Артикул;
	  	 
		Для Каждого Строка Из ТаблицаИзображений Цикл
		
			Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			  
			Если Найти(Строка.Имя, Артикул) <> 0 Тогда
				Строка.Номенклатура = Элемент.Номенклатура;
				Строка.Выгружать = Истина;
			КонецЕсли;  
		
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.11.21 УА #40333
                                                  
//+ ИнфоСофт Ивонин К.А. 26.11.21 УА #40333
&НаСервере
Процедура ВыгрузитьИзображенияНаWBНаСервере()
	
	Для Каждого Строка Из ТаблицаИзображений Цикл
		
		Если Не Строка.Выгружать Тогда
			Продолжить;                            
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.ФайлКартинки) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(Строка.ФайлКартинки);
		ДоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Строка.ФайлКартинки);
		
		Результат = ИС_WB_Сервер.ЗагрузитьИзображениеНаWB(Профиль, ДанныеФайла, ДоичныеДанные, Строка.NMid); 
		
		Если Результат = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Строка.Результат = Результат;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.11.21 УА #40333

//+ ИнфоСофт Стояк Ю.К. 10.06.2022 УА #46606
&НаКлиенте
Процедура ТаблицаВыгрузкиПослеУдаления(Элемент)
	Элементы.ТаблицаВыгрузки.Обновить();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 10.06.2022 УА #46606

//+ ИнфоСофт Стояк Ю.К. 10.06.2022 УА #46606
&НаКлиенте
Процедура СгенерироватьШтрихкод(Команда) 
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран личный Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.ТаблицаВыгрузки.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат; 
	КонецЕсли;
		
	СгенерироватьШтрихкодНаСервере();
	Элементы.ТаблицаВыгрузки.Обновить();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 10.06.2022 УА #46606

//+ ИнфоСофт Стояк Ю.К. 10.06.2022 УА #46606
&НаСервере 
Процедура СгенерироватьШтрихкодНаСервере()   
	
	ВыделенныеСтроки = Элементы.ТаблицаВыгрузки.ВыделенныеСтроки;
	Количество = ВыделенныеСтроки.Количество();		
	
	Штрихкоды = ИС_WB_Сервер.СгенерироватьБаркоды(Профиль, Количество);    
	
	Для Каждого Индекс Из ВыделенныеСтроки Цикл 
		
		Строка = ТаблицаВыгрузки.НайтиПоИдентификатору(Индекс); 
		
		Если Не ЗначениеЗаполнено(Строка.barcode) Тогда  			
			
			Строка.barcode = Штрихкоды[0];
			
			Штрихкоды.Удалить(0);         
			
			//+ ИнфоСофт Мурсалимов Д.Р. 25.03.24 УА #71529
			Строка.ШтрихкодСгенерирован = Истина;
			//- ИнфоСофт Мурсалимов Д.Р. 25.03.24 УА #71529
			
		КонецЕсли;     
		
	КонецЦикла;			
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 10.06.2022 УА #46606

//+ ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481
&НаСервере 
Процедура ПриИзмененииНаСервере(Номенклатура, Строка)   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ПодобратьПоля(Номенклатура, Неопределено, Строка, Новый Структура);
		Возврат;	
	КонецЕсли;
		
	ВыборкаШтрихкодов = РезультатЗапроса.Выгрузить();	
	
	Для Каждого Запись Из ВыборкаШтрихкодов Цикл 
		
		ДопПараметры = Новый Структура;
		
		Если ЗначениеЗаполнено(Запись.Штрихкод) Тогда
			ДопПараметры.Вставить("Штрихкод", Запись.Штрихкод);
		КонецЕсли;                     
		
		Если ЗначениеЗаполнено(Запись.Характеристика) Тогда
			ДопПараметры.Вставить("Характеристика", Запись.Характеристика);
		КонецЕсли;                                             
		
		ПодобратьПоля(Номенклатура, Неопределено, Строка, ДопПараметры);
		
		Строка = Неопределено;
		
	КонецЦикла;			
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481

//+ ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481
&НаСервере
Процедура УнифицироватьАртикулНаСервере()
	
	Для Каждого Индекс Из Элементы.ТаблицаВыгрузки.ВыделенныеСтроки Цикл
		Строка = ТаблицаВыгрузки.НайтиПоИдентификатору(Индекс); 
		ИмяХарактеристики = Строка.Характеристика.Наименование; 
		Строка.vendorCode = Строка.Номенклатура.Артикул + СтрЗаменить(ИмяХарактеристики, " ", ""); 
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.05.2023 УА #58481

//+ ИнфоСофт Ивонин К.А. 28.01.24 УА #62605
&НаСервереБезКонтекста
Функция ПолучитьЗначениеЦены(ВидЦены, Номенклатура, Характеристика)

	ИспользуетсяЦенообразование25 = Константы.ИспользуетсяЦенообразование25.Получить();
    
    Запрос = Новый Запрос;
    
    Если ИспользуетсяЦенообразование25 Тогда 
    
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(&Характеристика КАК Справочник.ХарактеристикиНоменклатуры).ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)) КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныНоменклатуры25СрезПоследних.Цена, 0) КАК Цена
		|ПОМЕСТИТЬ ВТ_Наборы
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		|				,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТ.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ВТ_Номенклатура КАК ВТ)
		|					И ВидЦены = &ВидЦены) КАК ЦеныНоменклатуры25СрезПоследних
		|		ПО ВТ_Номенклатура.Номенклатура = ЦеныНоменклатуры25СрезПоследних.Номенклатура
		|			И ВТ_Номенклатура.Характеристика = ЦеныНоменклатуры25СрезПоследних.ХарактеристикаЦО
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ЦеныНоменклатуры25СрезПоследних.Цена, 0) * ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Количество, 0))
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныНоменклатуры25СрезПоследних
		|			ПО ВариантыКомплектацииНоменклатурыТовары.Номенклатура = ЦеныНоменклатуры25СрезПоследних.Номенклатура
		|				И ВариантыКомплектацииНоменклатурыТовары.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования = ЦеныНоменклатуры25СрезПоследних.ХарактеристикаЦО
		|		ПО ВТ_Номенклатура.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
		|ГДЕ
		|	ВТ_Номенклатура.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|	И ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_Наборы.Цена) КАК Цена
		|ИЗ
		|	ВТ_Наборы КАК ВТ_Наборы";
		
	Иначе
		
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	&Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
		|ПОМЕСТИТЬ ВТ_Наборы
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				,
		|				(Номенклатура, Характеристика) В
		|						(ВЫБРАТЬ
		|							ВТ.Номенклатура КАК Номенклатура,
		|							ВТ.Характеристика КАК Характеристика
		|						ИЗ
		|							ВТ_Номенклатура КАК ВТ)
		|					И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО (ВТ_Номенклатура.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
		|			И (ВТ_Номенклатура.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Количество, 0))
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|			ПО (ВариантыКомплектацииНоменклатурыТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
		|				И (ВариантыКомплектацииНоменклатурыТовары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика)
		|		ПО (ВТ_Номенклатура.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец)
		|			И (ВТ_Номенклатура.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика)
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)
		|	И ВТ_Номенклатура.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_Наборы.Цена) КАК Цена
		|ИЗ
		|	ВТ_Наборы КАК ВТ_Наборы";
		
	КонецЕсли;
	 

	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Цена;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.01.24 УА #62605 

//+ ИнфоСофт Мурсалимов Д.Р. 25.03.24 УА #71529
&НаСервереБезКонтекста 
Процедура СохранитьШтрихкодНоменклатуры(Номенклатура, Характеристика, Штрихкод)   	
	
	НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Штрихкод.Установить(Штрихкод);
		
	НаборЗаписей.Прочитать(); 
	
	ТребуетсяНоваяЗапись = Истина;	
	Если НаборЗаписей.Количество() > 0 Тогда 
		
		Для Каждого Запись Из НаборЗаписей Цикл
			
			Запись.Номенклатура 	= Номенклатура;
			Запись.Характеристика 	= Характеристика;
			Запись.Штрихкод 		= Штрихкод;
			ТребуетсяНоваяЗапись 	= Ложь;
			Прервать;
			
		КонецЦикла; 	
	
	КонецЕсли;
   
    Если ТребуетсяНоваяЗапись Тогда
	
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Номенклатура 		= Номенклатура; 
		НоваяЗапись.Характеристика 		= Характеристика;
		НоваяЗапись.Штрихкод 			= Штрихкод;
		
	КонецЕсли;
				
	НаборЗаписей.Записывать = Истина; 
	
	НаборЗаписей.Записать(Истина);
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 25.03.24 УА #71529

//+ ИнфоСофт Ивонин К.А. 24.04.24 УА #73304
&НаСервереБезКонтекста
Процедура ПерезагрузитьКатегориюНаСервере(Профиль, Категория)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_Категории.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ИС_WB_Категории КАК ИС_WB_Категории
	|ГДЕ
	|	ИС_WB_Категории.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Категория);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбраная категория не найдена, возможно она была удалена");
		Возврат;
	КонецЕсли;
	
	ВыборкаКатегорий = РезультатЗапроса.Выбрать();
	ВыборкаКатегорий.Следующий();	
    
	ЗагруженнаяКатегория = ИС_WB_Сервер.ЗагрузитьКатегорию(Профиль, ВыборкаКатегорий.Наименование, Истина);
	Если ЗагруженнаяКатегория <> Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Категория %1 успешно загружена", ЗагруженнаяКатегория));
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 24.04.24 УА #73304

//+ ИнфоСофт Ивонин К.А. 30.08.24 УА #74933
&НаСервере
Процедура ПодборНоменклатурыWBНаСервере(МассивВыбора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_РазмерыНоменклатур.Ссылка КАК Ссылка,
	|	ИС_WB_РазмерыНоменклатур.Владелец КАК Номенклатура,
	|	ИС_WB_РазмерыНоменклатур.Владелец.Код КАК NMid
	|ПОМЕСТИТЬ ВТ_Размеры
	|ИЗ
	|	Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|ГДЕ
	|	ИС_WB_РазмерыНоменклатур.Владелец В(&Владелец)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Размеры.Номенклатура КАК НоменклатураWB,
	|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Номенклатура) КАК Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.ФайлКартинки КАК ФайлКартинки,
	|	ВТ_Размеры.NMid КАК NMid
	|ИЗ
	|	ВТ_Размеры КАК ВТ_Размеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ВТ_Размеры.Ссылка = ИС_WB_СоответствиеРазмеров.РазмерWB
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Размеры.Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.ФайлКартинки,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Артикул,
	|	ВТ_Размеры.NMid";
	
	Запрос.УстановитьПараметр("Владелец", МассивВыбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПодбора = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаПодбора.Следующий() Цикл	
		
		НоваяСтрока = ТаблицаИзображений.Добавить();  
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПодбора);
		
		Если ЗначениеЗаполнено(НоваяСтрока.ФайлКартинки) Тогда
			НоваяСтрока.Выгружать = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 30.08.24 УА #74933

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
&НаСервере
Процедура ВыгрузитьКарточкиНаМаркетплейсНаСервере()
	
	РезультатВыгрузки = ЗапросНаСервере();
	
	Если РезультатВыгрузки И СоздатьКарточкиПослеВыгрузки Тогда
		
		РезультатЗагрузки = ИС_ВБ_Сервер.ЗагрузитьТовары(Профиль);
		
		Если Не РезультатЗагрузки = Неопределено И СопоставитьНоменклатуруАвтоматически Тогда
			СопоставитьНоменклатуру();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

//+ ИнфоСофт Власова И.С. 03.02.25 УА #92619
&НаСервере
Процедура СопоставитьНоменклатуру()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаВыгрузки.Номенклатура КАК Номенклатура,
		|	ТаблицаВыгрузки.Характеристика КАК Характеристика,
		|	ТаблицаВыгрузки.vendorCode КАК Артикул,
		|	ТаблицаВыгрузки.barcode КАК Штрихкод
		|ПОМЕСТИТЬ ВТ_ТаблицаВыгрузки
		|ИЗ
		|	&ТаблицаВыгрузки КАК ТаблицаВыгрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВТ_ТаблицаВыгрузки.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ВТ_ТаблицаВыгрузки.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
		|	ВТ_ТаблицаВыгрузки.Артикул КАК Артикул,
		|	ВТ_ТаблицаВыгрузки.Штрихкод КАК Штрихкод
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	ВТ_ТаблицаВыгрузки КАК ВТ_ТаблицаВыгрузки
		|ГДЕ
		|	НЕ ВТ_ТаблицаВыгрузки.Артикул = """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.Характеристика КАК Характеристика,
		|	ИС_WB_ШтрихкодыРазмеров.Размер КАК Размер,
		|	ВЫБОР
		|		КОГДА ШтрихкодыНоменклатуры.Упаковка ЕСТЬ NULL
		|			ТОГДА ВТ_Номенклатура.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка
		|	КОНЕЦ КАК Упаковка
		|ПОМЕСТИТЬ ВТ_ОтборРазмеров
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
		|		ПО ВТ_Номенклатура.Штрихкод = ИС_WB_ШтрихкодыРазмеров.Штрихкод
		|			И (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ВТ_Номенклатура.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
		|			И ВТ_Номенклатура.Характеристика = ШтрихкодыНоменклатуры.Характеристика
		|			И ВТ_Номенклатура.Штрихкод = ШтрихкодыНоменклатуры.Штрихкод
		|ГДЕ
		|	НЕ ВТ_Номенклатура.Штрихкод = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ИС_WB_РазмерыНоменклатур.Ссылка,
		|	ВТ_Номенклатура.Номенклатура.ЕдиницаИзмерения
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
		|		ПО ВТ_Номенклатура.Артикул = ИС_WB_РазмерыНоменклатур.Владелец.vendorCode
		|ГДЕ
		|	ВТ_Номенклатура.Штрихкод = """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОтборРазмеров.Номенклатура КАК Номенклатура,
		|	ВТ_ОтборРазмеров.Характеристика КАК Характеристика,
		|	ВТ_ОтборРазмеров.Упаковка КАК Упаковка,
		|	ВТ_ОтборРазмеров.Размер КАК Размер,
		|	ВЫБОР
		|		КОГДА ИС_WB_СоответствиеРазмеров.РазмерWB = ЗНАЧЕНИЕ(Справочник.ИС_WB_РазмерыНоменклатур.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		КОГДА ИС_WB_СоответствиеРазмеров.РазмерWB ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяСопоставление
		|ПОМЕСТИТЬ ВТ_ОтборНесопоставленных
		|ИЗ
		|	ВТ_ОтборРазмеров КАК ВТ_ОтборРазмеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО ВТ_ОтборРазмеров.Номенклатура = ИС_WB_СоответствиеРазмеров.Номенклатура
		|			И ВТ_ОтборРазмеров.Характеристика = ИС_WB_СоответствиеРазмеров.Характеристика
		|			И ВТ_ОтборРазмеров.Упаковка = ИС_WB_СоответствиеРазмеров.Упаковка
		|			И (ИС_WB_СоответствиеРазмеров.Профиль = &Профиль)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОтборНесопоставленных.Номенклатура КАК Номенклатура,
		|	ВТ_ОтборНесопоставленных.Характеристика КАК Характеристика,
		//+ ИнфоСофт Власова И.С. 05.02.25 УА #92726
		|	ВТ_ОтборНесопоставленных.Упаковка КАК Упаковка,
		//- ИнфоСофт Власова И.С. 05.02.25 УА #92726
		|	ВТ_ОтборНесопоставленных.Размер КАК РазмерВБ,
		|	ВТ_ОтборНесопоставленных.ТребуетсяСопоставление КАК ТребуетсяСопоставление
		|ИЗ
		|	ВТ_ОтборНесопоставленных КАК ВТ_ОтборНесопоставленных
		|ГДЕ
		|	ВТ_ОтборНесопоставленных.ТребуетсяСопоставление";
	
	Запрос.УстановитьПараметр("ТаблицаВыгрузки", ТаблицаВыгрузки.Выгрузить());
	Запрос.УстановитьПараметр("Профиль",         Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСопоставление = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаСопоставление.Следующий() Цикл
		
		ИС_WB_Сервер.ДобавитьСоответствиеРазмеров(Профиль, ВыборкаСопоставление.РазмерВБ, ВыборкаСопоставление.Номенклатура,
			ВыборкаСопоставление.Характеристика, ВыборкаСопоставление.Упаковка);
		
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Власова И.С. 03.02.25 УА #92619

#КонецОбласти
