
#Область ОбработчикиСобытийФормы
 //+ ИнфоСофт Сумин Д.В. 09.11.22 УА #51482
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201	
	Если Параметры.ДокументыРеализации Тогда    
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПередачаТоваровХранителю.Ссылка КАК Документ
		|ИЗ
		|	Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
		|ГДЕ
		|	ПередачаТоваровХранителю.ЗаказКлиента = &ЗаказКлиента
		|	И НЕ ПередачаТоваровХранителю.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПередачаТоваровХранителюТовары.Ссылка
		|ИЗ
		|	Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
		|ГДЕ
		|	ПередачаТоваровХранителюТовары.ЗаказКлиента = &ЗаказКлиента
		|	И НЕ ПередачаТоваровХранителюТовары.Ссылка.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.ЗаказКлиента = &ЗаказКлиента
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.ЗаказКлиента = &ЗаказКлиента
		|	И НЕ РеализацияТоваровУслугТовары.Ссылка.ПометкаУдаления";
	//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Документ,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение		
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям		
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &ЗаказКлиента
		|	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ПометкаУдаления"
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЗаказКлиента", Параметры.Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Выборка = РезультатЗапроса.Выбрать();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Документы.Загрузить(Выгрузка);
	
	//Пока Выборка.Следующий() Цикл
	//	
	//	ЭлементТЧ = Документы.Добавить();
	//	ЭлементТЧ.РеализацияТоваровУслуг = Выборка.РТУ;
	//	
	//КонецЦикла;
	//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 09.11.22 УА #51482

#КонецОбласти
