#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Заварин К.В. 02.11.24 УА #83978
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЭтоВыбор Тогда
		
		ТекДанные = Элементы.Список.ТекущиеДанные;
		
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("Характеристика", ТекДанные.Владелец);
		ПараметрыЗакрытия.Вставить("Категория", 	 ТекДанные.Категория); 
		
		Оповестить("ВыборХарактеристики", ПараметрыЗакрытия, ЭтотОбъект);
		
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Заварин К.В. 02.11.24 УА #83978

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Заварин К.В. 02.11.24 УА #83978
&НаКлиенте
Процедура Выбрать(Команда)
	ЭтоВыбор = Истина;
	Закрыть();	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 02.11.24 УА #83978

#КонецОбласти

