
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Категория", Категория);
	Профиль = Параметры.Профиль;  
			
	МассивПараметров = Новый Массив;
	
	МассивПараметров.Добавить("ЦенаЯМ");
	МассивПараметров.Добавить("ЦенаЯМДоСкидок");	
	
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивПараметров);
	
	Если Настройки <> Неопределено Тогда	
		Price = Настройки["ЦенаЯМДоСкидок"];
		discount_price = Настройки["ЦенаЯМ"];			
	Иначе
		Price = Справочники.ВидыЦен.ПустаяСсылка();			
		discount_price = Справочники.ВидыЦен.ПустаяСсылка();
	КонецЕсли;
	
	Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Price, "ВалютаЦены");   
	
	ИС_MP_ВыгрузкаКарточек.УстановитьСвязиПараметровВыбораХарактеристикиИУпаковки(ЭтотОбъект);

	СписокОбязательныхХарактеристик = Новый ФиксированныйМассив(Новый Массив);

	ИнициализироватьХарактеристики();	
	
	//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
	Элементы.СопоставитьНоменклатуруАвтоматически.Видимость = СоздатьКарточкиПослеВыгрузки;
	//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	ПроверяемыеРеквизиты.Очистить();
	ПроверяемыеРеквизиты.Добавить("Номенклатура");	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПроверяемыеРеквизиты, СписокОбязательныхХарактеристик);

	РеквизитыТаблицы = ПолучитьРеквизиты("Товары");

	НомерСтроки = 1;
	Для Каждого стр Из Товары Цикл

		ИндексСтрокой = Формат(Товары.Индекс(стр), "ЧН=0; ЧГ=");
		Для Каждого реквизит Из РеквизитыТаблицы Цикл
			Если Не ПроверяемыеРеквизиты.Найти(реквизит.Имя) = Неопределено И Не ЗначениеЗаполнено(стр[реквизит.Имя])
				И Не (ТипЗнч(стр[реквизит.Имя]) = Тип("Число") И СтрНайти(Реквизит.Имя, "Атрибут_") > 1) Тогда

				ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон("В строке: %1  не заполнена колонка: %2", НомерСтроки, реквизит.Заголовок), , СтрШаблон(
					"Товары[%1].%2", ИндексСтрокой, реквизит.Имя));

				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		//Проверим Поле "Название" на наличие недопустимых символов
		Если ЗначениеЗаполнено(Стр.name) И ИС_Ozon_Сервер.ЕстьНедопустимыеСимволыВСтроке(
			Стр.name) Тогда

			ДопустимыеСимволы = "a-z A-Z а-я А-Я ёЁ 0-9 () "" ' & ; , : . / ? ! % * # № @ < > _ + -"
				+ " и символ ПРОБЕЛА";
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон("В строке: %1 колонка 'Название' содержит недопустимые символы!
						  |	Разрешены к использованию только: %2", НомерСтроки, ДопустимыеСимволы), , СтрШаблон(
				"Товары[%1].%2", ИндексСтрокой, "Название"));

			Отказ = Истина;

		КонецЕсли;

		НомерСтроки = НомерСтроки + 1;

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)

	ИнициализироватьХарактеристики();

КонецПроцедуры

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
&НаКлиенте
Процедура СоздатьКарточкиПослеВыгрузкиПриИзменении(Элемент)
	
	Элементы.СопоставитьНоменклатуруАвтоматически.Видимость = СоздатьКарточкиПослеВыгрузки;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Не КатегорияЗаполнена() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если Копирование = Истина Тогда
		ИДСтроки = Элементы.Товары.ТекущаяСтрока;
		ТекущаяСтрока = Товары.НайтиПоИдентификатору(ИДСтроки);
		ТекущаяСтрока.offerId = "";
		ЗаполнитьЗависимыРеквизиты(ИДСтроки);
	КонецЕсли;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура ХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ИДстрокой = СтрРазделить(Элемент.Имя, "_")[1];
	ХарактеристикаЯМ = ХарактеристикаПоКоду(ИДстрокой);
	СтруктураПараметров = Новый Структура;	
	СтруктураПараметров.Вставить("ХарактеристикаЯМ", ХарактеристикаЯМ);
	СтруктураПараметров.Вставить("Категория", Категория);
	
	Ограничение = ПолучитьРеквизит(ХарактеристикаЯМ, "limitingParameterId");
		
	Если Ограничение <> 0 Тогда
		ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
		ЗначениеРеквизита = ТекущаяСтрока["Атрибут_" + Формат(Ограничение, "ЧГ=0")];
		
		КодЗначения = ПолучитьРеквизит(ЗначениеРеквизита, "Код");
		МассивЗначений = ПолучитьКоды(КодЗначения);
		
		СтруктураПараметров.Вставить("Значения", МассивЗначений); 
		
	КонецЕсли;	

	ОткрытьФорму("Справочник.ИС_ЯМ_ЗначенияХарактеристик.ФормаВыбора", СтруктураПараметров, Элемент, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура ХарактеристикаНачалоМножественногоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ИДстрокой = СтрРазделить(Элемент.Имя, "_")[1];
	ХарактеристикаЯМ = ХарактеристикаПоКоду(ИДстрокой);
	ВыбранныеЗначения = ТекущаяСтрока[Элемент.Имя].ВыгрузитьЗначения();	

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВыбранныеЗначения", ВыбранныеЗначения);
	СтруктураПараметров.Вставить("Категория", Категория);
	СтруктураПараметров.Вставить("ХарактеристикаЯМ", ХарактеристикаЯМ); 
	
	Ограничение = ПолучитьРеквизит(ХарактеристикаЯМ, "limitingParameterId");
		
	Если Ограничение <> 0 Тогда		
		ЗначениеРеквизита = ТекущаяСтрока["Атрибут_" + Формат(Ограничение, "ЧГ=0")];
		
		КодЗначения = ПолучитьРеквизит(ЗначениеРеквизита, "Код");
		МассивЗначений = ПолучитьКоды(КодЗначения);
		
		СтруктураПараметров.Вставить("Значения", МассивЗначений); 
		
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ИС_ЯМ_ВыгрузкаКарточекТоваров.Форма.ФормаМножественногоВыбораАтрибута", СтруктураПараметров, Элемент, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура ХарактеристикаОбработкаМножественногоВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока[Элемент.Имя].ЗагрузитьЗначения(ВыбранноеЗначение);	

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ИДСтроки = Элементы.Товары.ТекущаяСтрока;
	ЗаполнитьЗависимыРеквизиты(ИДСтроки);
	
КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура ХарактеристикаНоменклатурыПриИзменении(Элемент)	
	
	ИДСтроки = Элементы.Товары.ТекущаяСтрока;
	ЗаполнитьЗависимыРеквизиты(ИДСтроки);
	
КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	
	ИДСтроки = Элементы.Товары.ТекущаяСтрока;
	ЗаполнитьЗависимыРеквизиты(ИДСтроки);
	
КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура ШтрихкодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Штрихкод = ВыбранноеЗначение;
	
	
КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура ШтрихкодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.ЗагрузитьЗначения(ШтрихкодыНоменклатуры(ТекущаяСтрока.Номенклатура,
		ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.Упаковка));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура ОткрытьПодбор(Команда)

	Если Не ЗначениеЗаполнено(Категория) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена Категория товаров", , "Категория");
		Возврат;
	КонецЕсли;

	ПараметрыФормыПодбораТоваров = ПараметрыФормыПодбораТоваров(Профиль, Валюта,
		УникальныйИдентификатор, Price);

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПодбора", ЭтотОбъект);
	ОткрытьФорму(ПараметрыФормыПодбораТоваров.ИмяФормы, ПараметрыФормыПодбораТоваров.ПараметрыФормы, ЭтотОбъект, , , ,
		Оповещение);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура ЗаполнитьКолонкуТекущимЗначением(Команда)

	ТекущиеДанные 	= Элементы.Товары.ТекущиеДанные;
	ИмяКолонки 		= Элементы.Товары.ТекущийЭлемент.Имя;

	ЭтоСписок = ТипЗнч(ТекущиеДанные[ИмяКолонки]) = Тип("СписокЗначений");
	Если ЭтоСписок Тогда
		Значение = ТекущиеДанные[ИмяКолонки].ВыгрузитьЗначения();
	Иначе
		Значение = ТекущиеДанные[ИмяКолонки];
	КонецЕсли;

	Для Каждого стр Из Товары Цикл

		Если ЭтоСписок Тогда
			стр[ИмяКолонки].ЗагрузитьЗначения(Значение);
		Иначе
			стр[ИмяКолонки] = Значение;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура ЗаполнитьКолонкуСопоставленнымиЗначениями(Команда)

	ИмяКолонки = Элементы.Товары.ТекущийЭлемент.Имя;
	Если ИмяКолонки = "offerId" Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьКолонкуСопоставленнымиЗначениямиНаСервере(ИмяКолонки);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура СохранитьТовары(Команда)

	Если ПроверитьХарактеристики() Тогда
		СохранитьТоварыНаСервере();		
	КонецЕсли;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура Подсказка(Команда)

	ТекущаяКолонка = Элементы.Товары.ТекущийЭлемент;

	Если ТекущаяКолонка <> Неопределено Тогда
		ТекстПодсказки = Элементы.Товары.ТекущийЭлемент.РасширеннаяПодсказка.Заголовок;
		ПоказатьПредупреждение( , ТекстПодсказки, , ТекущаяКолонка.Заголовок);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Функция КатегорияЗаполнена()

	Результат = Истина;

	Если Не ЗначениеЗаполнено(Категория) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена Категория товаров", , "Категория");
		Результат = Ложь;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#Область ПроцедурыОповещения

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаКлиенте
Процедура ПослеЗакрытияПодбора(Результат, СтруктураПараметров) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		Если Результат.Свойство("АдресТоваровВХранилище") Тогда
			ПослеЗакрытияПодбораНаСервере(Результат.АдресТоваровВХранилище);
		Иначе
			ПослеЗакрытияПодбораНаСервере(Результат.АдресКорзиныВХранилище);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Процедура ПослеЗакрытияПодбораНаСервере(АдресТоваровВХранилище)

	ТаблицаПодбора = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);

	ТаблицаНоменклатуры = ТаблицаНоменклатурыПоТаблицеПодбора(ТаблицаПодбора);

	ТаблицаТоваров = ПолучитьДанныеПоНоменклатуре(ТаблицаНоменклатуры);
	ЕстьНастройкиОсновныхРеквизитовДляКатегории = ИС_ЯМ_Сервер.ЕстьНастройкиОсновныхРеквизитовДляКатегории(
		Категория);
	ТаблицаСоответствийЗначений = ИС_ЯМ_Сервер.ТаблицаСоответствийДопРеквизитов(Категория,
		ЕстьНастройкиОсновныхРеквизитовДляКатегории);
	СтруктураПараметровЗначенийРеквизитовНоменклатуры = ИС_ЯМ_Сервер.СтруктураПараметровЗначенийРеквизитовНоменклатуры(
		Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории);
	СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры = ИС_ЯМ_Сервер.СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры(
		Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории);

	Для Каждого ДанныеНоменклатуры Из ТаблицаТоваров Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьСтрокуТовара(НоваяСтрока, ДанныеНоменклатуры, ТаблицаСоответствийЗначений,
			СтруктураПараметровЗначенийРеквизитовНоменклатуры,
			СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Процедура ЗаполнитьТовары(МассивРедактируемыхТоваров)

	Для Каждого СтруктураТовара Из МассивРедактируемыхТоваров Цикл
		стрТовары = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(стрТовары, СтруктураТовара);
	КонецЦикла;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Процедура ЗаполнитьЗависимыРеквизиты(ИДСтроки)

	ТаблицаНоменклатуры = ТаблицаЗначенийНоменклатуры();

	ТекущаяСтрока = Товары.НайтиПоИдентификатору(ИДСтроки);

	СтрНоменклатуры = ТаблицаНоменклатуры.Добавить();
	СтрНоменклатуры.Номенклатура 	= ТекущаяСтрока.Номенклатура;
	СтрНоменклатуры.Характеристика 	= ТекущаяСтрока.ХарактеристикаНоменклатуры;
	СтрНоменклатуры.Упаковка 		= ТекущаяСтрока.Упаковка;

	ТаблицаТоваров = ПолучитьДанныеПоНоменклатуре(ТаблицаНоменклатуры);
	ЕстьНастройкиОсновныхРеквизитовДляКатегории = ИС_ЯМ_Сервер.ЕстьНастройкиОсновныхРеквизитовДляКатегории(
		Категория);

	Если ТаблицаТоваров.Количество() Тогда
		ЗаполнитьСтрокуТовара(ТекущаяСтрока, ТаблицаТоваров[0],
			ИС_ЯМ_Сервер.ТаблицаСоответствийДопРеквизитов(Категория,
			ЕстьНастройкиОсновныхРеквизитовДляКатегории),
			ИС_ЯМ_Сервер.СтруктураПараметровЗначенийРеквизитовНоменклатуры(Категория,
			ЕстьНастройкиОсновныхРеквизитовДляКатегории),
			ИС_ЯМ_Сервер.СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры(Категория,
			ЕстьНастройкиОсновныхРеквизитовДляКатегории));
	КонецЕсли;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Функция ПолучитьДанныеПоНоменклатуре(ТаблицаНоменклатуры)

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	СтруктураПараметров.Вставить("Price", Price);	
	СтруктураПараметров.Вставить("discount_price", discount_price);
	СтруктураПараметров.Вставить("Аккаунт", Профиль);
	СтруктураПараметров.Вставить("Категория", Категория);
	СтруктураПараметров.Вставить("Валюта", Валюта);

	ТаблицаТоваров = ЗависимыеРеквизитыНоменклатуры(СтруктураПараметров);

	Возврат ТаблицаТоваров;

КонецФункции

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Процедура ЗаполнитьСтрокуТовара(СтрокаТаблицы, ДанныеЗаполнения, ТаблицаСоответствийЗначений,
	
	СтруктураПараметровЗначенийРеквизитовНоменклатуры, СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры)
	
	СтрокаТаблицы.Номенклатура 					= ДанныеЗаполнения.Номенклатура;
	СтрокаТаблицы.Упаковка 						= ДанныеЗаполнения.Упаковка;
	СтрокаТаблицы.ХарактеристикаНоменклатуры 	= ДанныеЗаполнения.Характеристика;
	СтрокаТаблицы.offerId						= "";
	СтрокаТаблицы.Штрихкод 						= ДанныеЗаполнения.Штрихкод;

	СтрокаТаблицы.Цена							= ДанныеЗаполнения.Цена;
	СтрокаТаблицы.ЦенаСоСкидкой					= ДанныеЗаполнения.ЦенаСоСкидкой;	
	СтрокаТаблицы.ДлинаУпаковки 				= Макс(ДанныеЗаполнения.Высота, ДанныеЗаполнения.Глубина,
		ДанныеЗаполнения.Ширина);
	СтрокаТаблицы.ВысотаУпаковки 				= Мин(ДанныеЗаполнения.Высота, ДанныеЗаполнения.Глубина,
		ДанныеЗаполнения.Ширина);
	СтрокаТаблицы.ШиринаУпаковки 				= (ДанныеЗаполнения.Высота + ДанныеЗаполнения.Глубина
		+ ДанныеЗаполнения.Ширина) - (СтрокаТаблицы.ДлинаУпаковки + СтрокаТаблицы.ВысотаУпаковки);
	СтрокаТаблицы.ВесУпаковки 					= ДанныеЗаполнения.ВесУпаковки;
	СтрокаТаблицы.ИспользоватьХарактеристики 	= ДанныеЗаполнения.ИспользоватьХарактеристики;
	СтрокаТаблицы.ИспользоватьУпаковки 			= ДанныеЗаполнения.ИспользоватьУпаковки;
	
	РазделительФотографий = "";
	ИС_ЯМ_Сервер.ЗаполнитьЗначенияПоДопРеквизитам(СтрокаТаблицы, ТаблицаСоответствийЗначений,
	РазделительФотографий);
	ИС_ЯМ_Сервер.ЗаполнитьЗначенияПоРеквизитамНоменклатуры(СтрокаТаблицы,
	СтруктураПараметровЗначенийРеквизитовНоменклатуры, РазделительФотографий);
	ИС_ЯМ_Сервер.ЗаполнитьЗначенияПоРеквизитамХарактеристикиНоменклатуры(СтрокаТаблицы,
	СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры, РазделительФотографий);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Процедура ИнициализироватьХарактеристики()
	
	УдалитьХарактеристики();
	
	Элементы.ГруппаШапкаПредупреждение.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Категория) Тогда
		
		Элементы.ГруппаТаблица.Доступность 		= Истина;
		Элементы.СохранитьТовары.Доступность 	= Истина;
		ИмяТабличнойЧасти = "Товары";
		
		ОбязательныеХарактеристики 	= Новый Массив;
		АспектныеХарактеристики 	= Новый Массив;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИС_ЯМ_Характеристика.Наименование КАК Наименование,
		|	ИС_ЯМ_Характеристика.multivalue КАК НаборЗначений,		
		|	ИС_ЯМ_Характеристика.type КАК type,
		|	ИС_ЯМ_КатегорииТоваровproperties.required КАК Обязательная,
		|	ИС_ЯМ_Характеристика.Код КАК Код
		|ИЗ
		|	Справочник.ИС_ЯМ_КатегорииТоваров.properties КАК ИС_ЯМ_КатегорииТоваровproperties
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Характеристика КАК ИС_ЯМ_Характеристика
		|		ПО ИС_ЯМ_КатегорииТоваровproperties.Характеристика = ИС_ЯМ_Характеристика.Ссылка
		|ГДЕ
		|	ИС_ЯМ_КатегорииТоваровproperties.Ссылка = &Категория
		|
		|УПОРЯДОЧИТЬ ПО
		|	Обязательная УБЫВ";
		
		Запрос.УстановитьПараметр("Категория", Категория);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();		
			
		Пока Выборка.Следующий() Цикл
			
			ЦветФона = Новый Цвет(255, 255, 255);
			ИмяРеквизита 		= "Атрибут_" + Формат(Выборка.Код, "ЧГ=0");
			МножественныйВыбор  = Выборка.НаборЗначений;    
			
			Тип = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная));
			typeНР = НРег(Выборка.type);
			Если typeНР = "enum" И Не МножественныйВыбор Тогда
				Тип = Новый ОписаниеТипов("СправочникСсылка.ИС_ЯМ_ЗначенияХарактеристик");
			ИначеЕсли Выборка.НаборЗначений Тогда
				Тип = Новый ОписаниеТипов("СписокЗначений");			
			ИначеЕсли typeНР = "numeric" Тогда
				Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой));
			ИначеЕсли typeНР = "boolean" Тогда
				Тип = Новый ОписаниеТипов("Булево");			
			КонецЕсли;
			
			ПутьКДанным  		= ?(ИмяТабличнойЧасти = "", ИмяРеквизита, ИмяТабличнойЧасти + "." + ИмяРеквизита);
			СоздатьРеквизитФормы(ИмяРеквизита, Тип, Выборка.Наименование, ИмяТабличнойЧасти);
			
			Если Выборка.Обязательная Тогда
				ОбязательныеХарактеристики.Добавить(ИмяРеквизита);
				ЦветФона = Новый Цвет(0, 160, 70);
			КонецЕсли;
			
			СоздатьПолеФормы(Выборка, ИмяРеквизита, ПутьКДанным, МножественныйВыбор, ЦветФона);
						
		КонецЦикла;
		
		СписокОбязательныхХарактеристик = Новый ФиксированныйМассив(ОбязательныеХарактеристики);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Процедура УдалитьХарактеристики()

	ЭлементыХарактеристик = Элементы.ГруппаХарактеристики.ПодчиненныеЭлементы;

	УдаляемыеПоля = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;

	Для Каждого Элемент Из ЭлементыХарактеристик Цикл
		УдаляемыеПоля.Добавить(Элемент);
		УдаляемыеРеквизиты.Добавить(Элемент.ПутьКДанным);
	КонецЦикла;

	Для Каждого Элемент Из УдаляемыеПоля Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;

	ИзменитьРеквизиты( , УдаляемыеРеквизиты);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Процедура СоздатьРеквизитФормы(ИмяРеквизита, Тип, ЗаголовокПоля = "", ИмяТабличнойЧасти = "")

	ДобавляемыеРеквизиты = Новый Массив;

	ИмяРеквизита = ИмяРеквизита;
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Тип, ИмяТабличнойЧасти, ЗаголовокПоля);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);

	ИзменитьРеквизиты(ДобавляемыеРеквизиты);

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Процедура СоздатьПолеФормы(Выборка, ИмяРеквизита, ПутьКДанным, МножественныйВыбор, ЦветФона)

	ГруппаФормы = Элементы.ГруппаХарактеристики;
	type 		= НРег(Выборка.type);
	ВидПоля		= ВидПоля(type);
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), ГруппаФормы);
	НовыйЭлемент.ПутьКДанным 	= ПутьКДанным;
	НовыйЭлемент.Вид 			= ВидПоля;
	НовыйЭлемент.Заголовок		= Выборка.Наименование + ?(Выборка.Обязательная, "*", "");
	
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.ЦветФонаЗаголовка 				= ЦветФона;  
	
	Если Не НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка Тогда
		НовыйЭлемент.РастягиватьПоГоризонтали 	= Истина;
		НовыйЭлемент.АвтоМаксимальнаяШирина 	= Ложь;
		НовыйЭлемент.АвтоОтметкаНезаполненного 	= Выборка.Обязательная;
		НовыйЭлемент.КнопкаОчистки 	= Истина;
	КонецЕсли;
	
	// Выбор из списка
	Если Не МножественныйВыбор И type = "enum" Тогда
		НовыйЭлемент.КнопкаВыбора 				= Истина;
		НовыйЭлемент.ОтображениеКнопкиВыбора 	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		НовыйЭлемент.ИсторияВыбораПриВводе  	= ИсторияВыбораПриВводе.НеИспользовать;
		НовыйЭлемент.КнопкаВыпадающегоСписка 	= Ложь;
		НовыйЭлемент.КнопкаСоздания 			= Ложь;
		НовыйЭлемент.КнопкаОткрытия 			= Ложь;
		НовыйЭлемент.РедактированиеТекста 		= Ложь;
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ХарактеристикаНачалоВыбора");
	КонецЕсли;

	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ХарактеристикаПриИзменении");

	Если МножественныйВыбор Тогда
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ХарактеристикаНачалоМножественногоВыбора");
		НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", "ХарактеристикаОбработкаМножественногоВыбора");
		НовыйЭлемент.КнопкаВыбора 	= Истина;
	КонецЕсли;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Процедура ЗаполнитьКолонкуСопоставленнымиЗначениямиНаСервере(ИмяКолонки)

	ЕстьНастройкиОсновныхРеквизитовДляКатегории = ИС_АЛИ_Сервер.ЕстьНастройкиОсновныхРеквизитовДляКатегории(
		Категория);
	ТаблицаСоответствийЗначений = ИС_АЛИ_Сервер.ТаблицаСоответствийДопРеквизитов(Категория,
		ЕстьНастройкиОсновныхРеквизитовДляКатегории);
	СтруктураПараметровЗначенийРеквизитовНоменклатуры = ИС_АЛИ_Сервер.СтруктураПараметровЗначенийРеквизитовНоменклатуры(
		Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории);
	СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры = ИС_АЛИ_Сервер.СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры(
		Категория, ЕстьНастройкиОсновныхРеквизитовДляКатегории);
			
	РазделительФотографий = "";

	Для Каждого СтрокаТаблицы Из Товары Цикл

		ИС_ЯМ_Сервер.ЗаполнитьЗначенияПоДопРеквизитам(СтрокаТаблицы, ТаблицаСоответствийЗначений,
			РазделительФотографий, ИмяКолонки);
		ИС_ЯМ_Сервер.ЗаполнитьЗначенияПоРеквизитамНоменклатуры(СтрокаТаблицы,
			СтруктураПараметровЗначенийРеквизитовНоменклатуры, РазделительФотографий, ИмяКолонки);
		ИС_ЯМ_Сервер.ЗаполнитьЗначенияПоРеквизитамХарактеристикиНоменклатуры(СтрокаТаблицы,
			СтруктураПараметровЗначенийРеквизитовХарактеристикиНоменклатуры, РазделительФотографий, ИмяКолонки);

	КонецЦикла;

КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Процедура СохранитьТоварыНаСервере()

	МассивТоваров = Новый Массив;
	ПоляАтрибутов = Элементы.ГруппаХарактеристики.ПодчиненныеЭлементы; 	
			
	Для Каждого стр Из Товары Цикл
						
        	СтруктураТовара = СтруктураДобавленияТовара();
			СтруктураТовара = ЗаполнитьСтруктуруДобавленияТовара(стр, Категория, СтруктураТовара);
			СтруктураТовара.parameterValues = ЗаполнениеХарактеристик(стр, ПоляАтрибутов);			
			
			Товар = Новый Структура;
			
			Товар.Вставить("offer", СтруктураТовара);
			
			Если стр.marketSku <> 0 Тогда
				МаркетСКУ = Новый Структура("marketSku", стр.marketSku);
				Товар.Вставить("mapping", МаркетСКУ);
			КонецЕсли;
			
			//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
			Если СопоставитьНоменклатуруАвтоматически Тогда	
				
				ДанныеСопоставления = СтруктураСопоставленияТовара();
				ЗаполнитьЗначенияСвойств(ДанныеСопоставления, стр);
				
				Если Не ЗначениеЗаполнено(ДанныеСопоставления.Упаковка) Тогда			
					ДанныеСопоставления.Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(стр.Номенклатура, "ЕдиницаИзмерения");		
				КонецЕсли;
				
				Товар.Вставить("ДанныеСопоставления", ДанныеСопоставления);
				
			КонецЕсли;
			//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
			
			МассивТоваров.Добавить(Товар);
			
	КонецЦикла;
	
	ИС_ЯМ_Сервер.ВыгрузитьКарточкиТовара(Профиль, МассивТоваров);
	
	//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
	Если СоздатьКарточкиПослеВыгрузки Тогда
		СоздатьСопоставитьНоменклатуру(МассивТоваров);
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 02.12.24 УА #62619
	
КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Функция ЗначенияРавны(Знач1, Знач2) 
		
	Если ТипЗнч(Знач1) = Тип("СписокЗначений") Тогда
	
		Если Знач1.Количество() = Знач2.Количество() Тогда
			Результат = Истина;
			Для Каждого элем Из Знач1 Цикл
				Если знач2.НайтиПоЗначению(элем.Значение) = Неопределено Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;		
			КонецЦикла;	
		Иначе
			Результат = Ложь;	
		КонецЕсли;
		
	Иначе	
		Результат = Знач1 = Знач2;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Функция СтруктураДобавленияТовара()

	Результат = Новый Структура;

	Результат.Вставить("marketCategoryId", 0); 	
	Результат.Вставить("offerId", "");
	Результат.Вставить("name", ""); 
	Результат.Вставить("pictures", Новый Массив); 	
	Результат.Вставить("description", "");  
	Результат.Вставить("vendorCode", ""); 			
	Результат.Вставить("parameterValues", Новый Массив); 	

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Функция ЗаполнитьСтруктуруДобавленияТовара(Источник, Категория, СтруктураТовара)
	

	СтруктураТовара.marketCategoryId	= Категория.Код;
	СтруктураТовара.offerId		= Источник.offerId;
	СтруктураТовара.name		= Источник.name;
	СтруктураТовара.description	= Источник.description;
	СтруктураТовара.vendorCode	= Источник.vendorCode;	
				
	СтруктураТовара.pictures.Добавить(Источник.pictures);
	
	Габариты = Новый Структура("length, width, height, weight", 0, 0, 0, 0);
	Габариты.weight = Источник.ВесУпаковки;
	Габариты.width = Источник.ШиринаУпаковки;
	Габариты.height = Источник.ВысотаУпаковки;
	Габариты.length = Источник.ДлинаУпаковки; 
	
	СтруктураТовара.Вставить("weightDimensions", Габариты);		
		
	Если ЗначениеЗаполнено(Источник.Штрихкод) Тогда 
		БуферныйМассив = Новый Массив;
		БуферныйМассив.Добавить(Строка(Источник.Штрихкод));
		СтруктураТовара.Вставить("barcodes", БуферныйМассив);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.vendor) Тогда
		СтруктураТовара.Вставить("vendor", Источник.vendor);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.certificates) Тогда
		
		БуферныйМассив = Новый Массив;
		
		МассивВыбранныхЗначений = Источник.certificates.ВыгрузитьЗначения(); 
				
		Для Каждого Значение Из МассивВыбранныхЗначений Цикл
			БуферныйМассив.Добавить(Строка(Значение));
		КонецЦикла;
		
		СтруктураТовара.Вставить("certificates", БуферныйМассив);		
		
	КонецЕсли; 
	
	Если Источник.boxCount > 1 Тогда
		СтруктураТовара.Вставить("boxCount", Источник.boxCount);		
	КонецЕсли; 
	
	Если Источник.downloadable Тогда
		СтруктураТовара.Вставить("downloadable", Источник.downloadable);		
	КонецЕсли; 
	
	Если Источник.adult Тогда
		СтруктураТовара.Вставить("adult", Источник.adult);		
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(Источник.customsCommodityCode) Тогда
		СтруктураТовара.Вставить("customsCommodityCode", Источник.customsCommodityCode);		
	КонецЕсли; 
	
	//+ ИнфоСофт Стояк Ю.К. 25.07.2024 УА #79507	
	Если ЗначениеЗаполнено(Источник.type) И Источник.type <> "DEFAULT" Тогда       
	//Если Источник.type <> "DEFAULT" Тогда       
	//- ИнфоСофт Стояк Ю.К. 25.07.2024 УА #79507
		СтруктураТовара.Вставить("type", Источник.type);		
	КонецЕсли;	
	
	Возврат СтруктураТовара;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Функция ЗаполнениеХарактеристик(Источник, ПоляАтрибутов)

	Результат = Новый Массив;

	Для Каждого Поле Из ПоляАтрибутов Цикл

		ЗначениеАтрибута = Источник[Поле.Имя];
		Если Не ЗначениеЗаполнено(ЗначениеАтрибута) Тогда
			Продолжить;	
		КонецЕсли;
		
		ИдАтрибута = Число(СтрРазделить(Поле.Имя, "_")[1]);
		//+ ИнфоСофт Стояк Ю.К. 03.12.2024 УА #88925
		Если ТипЗнч(ЗначениеАтрибута) = Тип("СписокЗначений") Тогда
			СтруктураАтрибута = СтруктураОсновногоАтрибутаДобавлениеТовара(ИдАтрибута, ЗначениеАтрибута[0].Значение);
		Иначе
			СтруктураАтрибута = СтруктураОсновногоАтрибутаДобавлениеТовара(ИдАтрибута, ЗначениеАтрибута);
		КонецЕсли;
		//СтруктураАтрибута = СтруктураОсновногоАтрибутаДобавлениеТовара(ИдАтрибута, ЗначениеАтрибута);
		//- ИнфоСофт Стояк Ю.К. 03.12.2024 УА #88925
		Если СтруктураАтрибута.parameterId = 0 Тогда
			Продолжить;
		КонецЕсли;	
			
		Если ТипЗнч(ЗначениеАтрибута) = Тип("СписокЗначений") Тогда 
			
			МассивВыбранныхЗначений = ЗначениеАтрибута.ВыгрузитьЗначения();
			
			Для Каждого Значение Из МассивВыбранныхЗначений Цикл 
				
				БуферСтруктуры = СтруктураАтрибута; 
				
				Если ЗначениеЗаполнено(Значение) Тогда					
					
					Если БуферСтруктуры.Свойство("valueId") Тогда
						БуферСтруктуры.valueId = Значение.Код;
						БуферСтруктуры.value = Значение.Наименование;
					ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
						БуферСтруктуры.value = ?(Значение = Ложь, "false", "true");		
					Иначе
						БуферСтруктуры.value = Строка(Значение.Наименование);
					КонецЕсли;
					
					Результат.Добавить(БуферСтруктуры);          
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		Иначе  
			
			Если СтруктураАтрибута.Свойство("valueId") Тогда
					СтруктураАтрибута.valueId = ЗначениеАтрибута.Код;
					СтруктураАтрибута.value = ЗначениеАтрибута.Наименование;
			ИначеЕсли ТипЗнч(ЗначениеАтрибута) = Тип("Булево") Тогда
				СтруктураАтрибута.value = ?(ЗначениеАтрибута = Ложь, "false", "true");		
			Иначе
				//+ ИнфоСофт Стояк Ю.К. 26.11.2024 УА #88295				
				//СтруктураАтрибута.value = Строка(Значение.Наименование);
				СтруктураАтрибута.value = Строка(ЗначениеАтрибута);
				//- ИнфоСофт Стояк Ю.К. 26.11.2024 УА #88295
			КонецЕсли;		
			Результат.Добавить(СтруктураАтрибута);  
			
		КонецЕсли;
		

	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724
&НаСервере
Функция СтруктураОсновногоАтрибутаДобавлениеТовара(ИДАтрибута, ЗначениеАтрибута)

	Результат = Новый Структура;
	Результат.Вставить("parameterId", 0);
	Результат.Вставить("value", ""); 

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИС_ЯМ_Характеристика.Код КАК Код,
	|	ИС_ЯМ_Характеристика.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА ИС_ЯМ_Характеристика.type = ""ENUM""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК enum
	|ИЗ
	|	Справочник.ИС_ЯМ_Характеристика КАК ИС_ЯМ_Характеристика
	|ГДЕ
	|	ИС_ЯМ_Характеристика.Код = &Код";

	Запрос.УстановитьПараметр("Код", ИДАтрибута);	

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда		
		Результат.parameterId = Выборка.Код; 
		
		Если Выборка.enum Тогда
			Результат.Вставить("valueId", ЗначениеАтрибута.Код);		
		КонецЕсли; 
		
	КонецЕсли; 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод
		|ИЗ
		|	РегистрСведений.ИС_ЯМ_СоответствиеЗначенийХарактеристик КАК ИС_ЯМ_СоответствиеЗначенийХарактеристик
		|ГДЕ
		|	ИС_ЯМ_СоответствиеЗначенийХарактеристик.Категория = &Категория
		|	И ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЗначениеХарактеристикиЯМ = &ЗначениеХарактеристикиЯМ
		|	И ИС_ЯМ_СоответствиеЗначенийХарактеристик.ХарактеристикаЯМ.Код = &Код
		|	И НЕ ИС_ЯМ_СоответствиеЗначенийХарактеристик.ЕдиницаИзмерения ЕСТЬ NULL";
		//- ИнфоСофт Стояк Ю.К. 03.12.2024 УА #88925
	
	Запрос.УстановитьПараметр("ЗначениеХарактеристикиЯМ", ЗначениеАтрибута);
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("Код", ИДАтрибута);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Вставить("unitId", ВыборкаДетальныеЗаписи.ЕдиницаИзмеренияКод);	
	КонецЦикла;		

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 13.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724
&НаСервереБезКонтекста
Функция ПолучитьРеквизит(Ссылка, Имя)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Имя);
КонецФункции //- ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724
&НаСервере
Функция ПолучитьКоды(КодЗначения) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_ЯМ_ХарактеристикаvalueRestrictions.id КАК id
		|ИЗ
		|	Справочник.ИС_ЯМ_Характеристика.valueRestrictions КАК ИС_ЯМ_ХарактеристикаvalueRestrictions
		|ГДЕ
		|	ИС_ЯМ_ХарактеристикаvalueRestrictions.limitingOptionValueId = &limitingOptionValueId";
	
	Запрос.УстановитьПараметр("limitingOptionValueId", КодЗначения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("id");	
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724

//+ ИнфоСофт Стояк Ю.К. 29.05.2024 УА #65724
&НаСервере
Функция ПроверитьХарактеристики()
	
	ПоляАтрибутов = Элементы.ГруппаХарактеристики.ПодчиненныеЭлементы; 
	
	Для Каждого Стр Из Товары Цикл 
		
		Для Каждого Поле Из ПоляАтрибутов Цикл
						
			ЗначениеАтрибута = Стр[Поле.Имя]; 
			
			Если Не ЗначениеЗаполнено(ЗначениеАтрибута) Тогда
				Продолжить;	
			КонецЕсли;
			
			ИдАтрибута = Число(СтрРазделить(Поле.Имя, "_")[1]);
			ХарактеристикаЯМ = ХарактеристикаПоКоду(ИдАтрибута);
			
			Если ТипЗнч(ЗначениеАтрибута) = Тип("СписокЗначений") Тогда  
				
				МассивВыбранныхЗначений = ЗначениеАтрибута.ВыгрузитьЗначения(); 
				
				Для Каждого Значение Из МассивВыбранныхЗначений Цикл  
					
					Если ЗначениеЗаполнено(Значение) Тогда 
						
						Ограничение = ХарактеристикаЯМ.limitingParameterId;
						
						Если Ограничение <> 0 Тогда	
							
							ЗначениеРеквизитаОграничения = Стр["Атрибут_" + Формат(Ограничение, "ЧГ=0")];														
						
							КодЗначенияОграничения = ЗначениеРеквизитаОграничения.Код;
							МассивЗначений = ПолучитьКоды(КодЗначенияОграничения);
							
							КодЗначения = Значение.Код;
							
							ЭлементМассива = МассивЗначений.Найти(КодЗначения);
							
							Если Не ЗначениеЗаполнено(ЭлементМассива) Тогда
								ОбщегоНазначения.СообщитьПользователю("Значение " + Значение + " характеристики " +
								ХарактеристикаЯМ.Наименование + " не входит в список допустимых к выгрузке " +
								"из-за ограничения по текущему значению характеристики " + ЗначениеРеквизитаОграничения.Владелец);								
								Возврат Ложь;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла; 
				
			Иначе 
				
				Если ЗначениеЗаполнено(ЗначениеАтрибута) Тогда 
					
					Ограничение = ХарактеристикаЯМ.limitingParameterId;
					
					Если Ограничение <> 0 Тогда	
						
						ЗначениеРеквизитаОграничения = Стр["Атрибут_" + Формат(Ограничение, "ЧГ=0")];
						
						КодЗначенияОграничения = ЗначениеРеквизитаОграничения.Код; 												
						МассивЗначений = ПолучитьКоды(КодЗначенияОграничения);
						
						КодЗначения = ЗначениеАтрибута.Код;
						
						ЭлементМассива = МассивЗначений.Найти(КодЗначения);
						
						Если Не ЗначениеЗаполнено(ЭлементМассива) Тогда
							ОбщегоНазначения.СообщитьПользователю("Значение " + Значение + " характеристики " +
							ХарактеристикаЯМ.Наименование + " не входит в список допустимых к выгрузке " +
							"из-за ограничения по текущему значению характеристики " + ЗначениеРеквизитаОграничения.Владелец);								
							Возврат Ложь;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;				
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 29.05.2024 УА #65724

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
&НаСервере
Функция СтруктураСопоставленияТовара()
	
	СтруктураСопоставления = Новый Структура;
	
	СтруктураСопоставления.Вставить("Номенклатура");
	СтруктураСопоставления.Вставить("ХарактеристикаНоменклатуры");
	СтруктураСопоставления.Вставить("Упаковка");
	
	Возврат СтруктураСопоставления;
	
КонецФункции //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

//+ ИнфоСофт Власова И.С. 02.12.24 УА #62619
&НаСервере
Процедура СоздатьСопоставитьНоменклатуру(МассивТоваров)
	
	Перезаполнять = Истина;
	
	МассивИдентификаторов = Новый Массив;
	
	Для Каждого Товар Из МассивТоваров Цикл
		МассивИдентификаторов.Добавить(Товар.offerId);
	КонецЦикла;	
	
	МассивНоменклатуры = ИС_ЯМ_Сервер.СоздатьИзменитьНоменклатуруПоИдентификаторам(Профиль, МассивИдентификаторов, Перезаполнять);
	
	Если МассивНоменклатуры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СопоставитьНоменклатуруАвтоматически Тогда
		
		Для Каждого Элемент Из МассивНоменклатуры Цикл
			
			НайденныеСтроки = МассивТоваров.НайтиСтроки(Новый Структура("offerId", Элемент.offerId));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				ДанныеСопоставления = НайденныеСтроки[0].ДанныеСопоставления;
				
				Если Не ЗначениеЗаполнено(ДанныеСопоставления.Упаковка) Тогда			
					ДанныеСопоставления.Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСопоставления.Номенклатура, "ЕдиницаИзмерения");		
				КонецЕсли;
				
				ИС_ЯМ_Сервер.ДобавитьСоответствиеНоменклатуры(Профиль, Элемент.НоменклатураЯМ, 
					ДанныеСопоставления.Номенклатура, ДанныеСопоставления.ХарактеристикаНоменклатуры, ДанныеСопоставления.Упаковка);
				
			КонецЕсли;
			
		КонецЦикла; 
		
	Конецесли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 02.12.24 УА #62619

//----------------------------------------------------------
&НаСервереБезКонтекста
Функция ХарактеристикаПоКоду(ИДстрокой)
	Возврат ИС_ЯМ_Сервер.ХарактеристикаПоКоду(ИДстрокой);	
КонецФункции

&НаСервере
Функция ПреобразоватьJSONВСоответствие(JSONСтрокой, ИменаСвойствСоЗначениямиДата = Неопределено,
	ОжидаемыйФорматДаты = Неопределено, ИмяФункцииВосстановления = Неопределено,
	МодульФункцииВосстановления = Неопределено, ИменаСвойствДляОбработкиВосстановления = Неопределено)

	ИспользуемыйФорматДаты = ?(ОжидаемыйФорматДаты = Неопределено, ФорматДатыJSON.ISO, ОжидаемыйФорматДаты);

	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(JSONСтрокой);
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Истина, ИменаСвойствСоЗначениямиДата, ИспользуемыйФорматДаты,
			ИмяФункцииВосстановления, МодульФункцииВосстановления, , ИменаСвойствДляОбработкиВосстановления);
		ЧтениеJSON.Закрыть();
	Исключение
		ИмяСобытия 	= "ПреобразоватьJSONВСоответствие";
		Комментарий = "Не удалось прочитать JSON: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДанныеJSON = Новый Соответствие;
	КонецПопытки;

	Возврат ДанныеJSON;

КонецФункции 

&НаСервереБезКонтекста
Функция ВидПоля(type)

	ВидПоля = ВидПоляФормы.ПолеВвода;

	Если НРег(type) = "boolean" Тогда
		ВидПоля = ВидПоляФормы.ПолеФлажка;
	КонецЕсли;

	Возврат ВидПоля;

КонецФункции 

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
&НаСервереБезКонтекста
Функция ПреобразоватьДанныеВJSON(Данные, Знач ВариантЗаписиДаты = Неопределено)

	Результат = "";
	Если ВариантЗаписиДаты = Неопределено Тогда
		ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	КонецЕсли;

	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);
		НастройкиСериализации = Новый НастройкиСериализацииJSON;
		НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДаты;
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, Данные, НастройкиСериализации);
		Результат = ЗаписьJSON.Закрыть();
	Исключение
		ИмяСобытия 	= "ПреобразоватьДанныеВJSON";
		Комментарий = "Не удалось записать JSON: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

// УНИКАЛЬНЫЕ УТ -------------------------------------------- 
&НаСервере
Функция ШтрихкодыНоменклатуры(Номенклатура, Характеристика, Упаковка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
		|	И ШтрихкодыНоменклатуры.Характеристика = &Характеристика
		|	И ШтрихкодыНоменклатуры.Упаковка = &Упаковка";
	
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Упаковка", 		Упаковка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Штрихкод");
	
	Возврат Результат;
	
КонецФункции   

&НаСервере
Функция ПараметрыФормыПодбораТоваров(Профиль, Валюта, УникальныйИдентификатор, ВидЦены)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Соглашение", Неопределено);
	ПараметрыФормы.Вставить("Организация", Профиль.Организация);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Ложь);
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки", Ложь);
	ПараметрыФормы.Вставить("Валюта", Валюта);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Подбор товаров';"));
	ПараметрыФормы.Вставить("Дата", ТекущаяДатаСеанса());
	ПараметрыФормы.Вставить("Документ", ПредопределенноеЗначение("Документ.ЗаказКлиента.ПустаяСсылка"));
	ПараметрыФормы.Вставить("ПодборВариантовОбеспечения", Ложь);
	ПараметрыФормы.Вставить("ОстаткиПоВсемСкладам", Истина);
	ПараметрыФормы.Вставить("ВидЦены", ВидЦены);
	ПараметрыФормы.Вставить("РежимПодбораБезСоглашенийСКлиентами", Истина);

	Результат = Новый Структура;
	Результат.Вставить("ИмяФормы", "Обработка.ПодборТоваровВДокументПродажи.Форма");
	Результат.Вставить("ПараметрыФормы", ПараметрыФормы);

	Возврат Результат;

КонецФункции 

&НаСервереБезКонтекста
Функция ТаблицаНоменклатурыПоТаблицеПодбора(ТаблицаПодбора)

	Результат = ТаблицаПодбора.Скопировать( , "Номенклатура, Упаковка, Характеристика");

	Возврат Результат;

КонецФункции 

&НаСервереБезКонтекста
Функция ТаблицаЗначенийНоменклатуры()

	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатуры.Колонки.Добавить("Характеристика",
		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаНоменклатуры.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));

	Возврат ТаблицаНоменклатуры;

КонецФункции 

&НаСервере
Функция ЗависимыеРеквизитыНоменклатуры(СтруктураПараметров)

	ИспользуетсяЦенообразование25 = Не Метаданные.ФункциональныеОпции.Найти("ИспользуетсяЦенообразование25")
		= Неопределено И ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование25");

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ТаблицаНоменклатуры.Упаковка КАК Упаковка,
		|	ТаблицаНоменклатуры.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ вт_ТаблицаНоменклатуры
		|ИЗ
		|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	НаборыУпаковок.Ссылка КАК НаборУпаковок,
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка
		|ПОМЕСТИТЬ вт_Упаковки
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыУпаковок КАК НаборыУпаковок
		|		ПО Номенклатура.НаборУпаковок = НаборыУпаковок.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО (НаборыУпаковок.Ссылка = УпаковкиЕдиницыИзмерения.Владелец)
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И Номенклатура.ИспользоватьУпаковки
		|	И НЕ Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
		|	И Номенклатура.Ссылка В
		|			(ВЫБРАТЬ
		|				вт_ТаблицаНоменклатуры.Номенклатура
		|			ИЗ
		|				вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	НаборыУпаковок.Ссылка,
		|	УпаковкиЕдиницыИзмерения.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыУпаковок КАК НаборыУпаковок
		|		ПО Номенклатура.НаборУпаковок = НаборыУпаковок.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО Номенклатура.Ссылка = УпаковкиЕдиницыИзмерения.Владелец
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И Номенклатура.ИспользоватьУпаковки
		|	И Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
		|	И Номенклатура.Ссылка В
		|			(ВЫБРАТЬ
		|				вт_ТаблицаНоменклатуры.Номенклатура
		|			ИЗ
		|				вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Упаковки.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_Упаковки.Упаковка) КАК Упаковка
		|ПОМЕСТИТЬ вт_КоличествоУпаковок
		|ИЗ
		|	вт_Упаковки КАК вт_Упаковки
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_Упаковки.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_Упаковки.Упаковка) = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_КоличествоУпаковок.Номенклатура КАК Номенклатура,
		|	вт_Упаковки.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ вт_УпаковкаПоУмолчанию
		|ИЗ
		|	вт_КоличествоУпаковок КАК вт_КоличествоУпаковок
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Упаковки КАК вт_Упаковки
		|		ПО вт_КоличествоУпаковок.Номенклатура = вт_Упаковки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА вт_ТаблицаНоменклатуры.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				И НЕ вт_УпаковкаПоУмолчанию.Упаковка ЕСТЬ NULL
		|			ТОГДА вт_УпаковкаПоУмолчанию.Упаковка
		|		ИНАЧЕ вт_ТаблицаНоменклатуры.Упаковка
		|	КОНЕЦ КАК Упаковка,
		|	вт_ТаблицаНоменклатуры.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ вт_ТаблицаНоменклатурыДополненная
		|ИЗ
		|	вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_УпаковкаПоУмолчанию КАК вт_УпаковкаПоУмолчанию
		|		ПО вт_ТаблицаНоменклатуры.Номенклатура = вт_УпаковкаПоУмолчанию.Номенклатура
		|;" 
		
		+ ?(ИспользуетсяЦенообразование25,
		
		"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|	КОНЕЦ КАК Числитель,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|	КОНЕЦ КАК Знаменатель,
		|	ЦеныНоменклатурыСрезПоследних.Период КАК ДатаУстановкиЦены,
		|	ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) / ЕСТЬNULL(КурсВалютВалюта.Курс, 1) * ЕСТЬNULL(КурсВалютВалюта.Кратность, 1) КАК ЧИСЛО(15, 2)) КАК Цена
		|ПОМЕСТИТЬ вт_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		|			,
		|			(Номенклатура, ХарактеристикаЦО) В
		|				(ВЫБРАТЬ
		|					вт_ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|					ВЫБОР
		|						КОГДА вт_ТаблицаНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|							ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
		|						ИНАЧЕ вт_ТаблицаНоменклатуры.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования
		|					КОНЕЦ
		|				ИЗ
		|					вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО ЦеныНоменклатурыСрезПоследних.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Валюта) КАК КурсВалютВалюта
		|		ПО (ИСТИНА)
		|;"
		
		,
		
		"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|	КОНЕЦ КАК Числитель,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|	КОНЕЦ КАК Знаменатель,
		|	ЦеныНоменклатурыСрезПоследних.Период КАК ДатаУстановкиЦены,
		|	ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) / ЕСТЬNULL(КурсВалютВалюта.Курс, 1) * ЕСТЬNULL(КурсВалютВалюта.Кратность, 1) КАК ЧИСЛО(15, 2)) КАК Цена
		|ПОМЕСТИТЬ вт_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			(Номенклатура, Характеристика) В
		|				(ВЫБРАТЬ
		|					вт_ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|					вт_ТаблицаНоменклатуры.Характеристика КАК Характеристика
		|				ИЗ
		|					вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО (ЦеныНоменклатурыСрезПоследних.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Валюта) КАК КурсВалютВалюта		
		|		ПО (ИСТИНА)
		|;") 
		
		+ 
		
		"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вт_ТаблицаНоменклатурыДополненная.Номенклатура КАК Номенклатура,
		|	вт_ТаблицаНоменклатурыДополненная.Характеристика КАК Характеристика,
		|	вт_ТаблицаНоменклатурыДополненная.Упаковка КАК Упаковка,
		|	СпрНоменклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	СпрНоменклатура.СтавкаНДС КАК СтавкаНДС,
		|	ВЫБОР
		|		КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ИспользоватьХарактеристики,
		|	СпрНоменклатура.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
		|	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод,
		|	ВЫБОР
		|		КОГДА СпрНоменклатура.ИспользоватьУпаковки
		|				И НЕ УпаковкиЕдиницыИзмерения.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА УпаковкиЕдиницыИзмерения.ВесЕдиницаИзмерения.МеждународноеСокращение = ""KGM""
		|						ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0)
		//+ ИнфоСофт Стояк Ю.К. 26.07.2024 УА #79508		
		//|					ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0)
		|					ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0) / 1000
		//- ИнфоСофт Стояк Ю.К. 26.07.2024 УА #79508
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СпрНоменклатура.ВесИспользовать
		|						И СпрНоменклатура.ВесЗнаменатель > 0
		|					ТОГДА ВЫБОР
		|							КОГДА СпрНоменклатура.ВесЕдиницаИзмерения.МеждународноеСокращение = ""KGM""
		|								ТОГДА СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель
		//+ ИнфоСофт Стояк Ю.К. 26.07.2024 УА #79508		
		//|							ИНАЧЕ СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель
		|							ИНАЧЕ СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель / 1000
		//- ИнфоСофт Стояк Ю.К. 26.07.2024 УА #79508
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК ВесУпаковки,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0)
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 100
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0)
		|	КОНЕЦ КАК Высота,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0)
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 100
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0)
		|	КОНЕЦ КАК Глубина,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0)
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 100
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0)
		|	КОНЕЦ КАК Ширина,
		|	ВЫБОР
		|		КОГДА вт_цены_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_цены_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_цены_price.Цена, 0) * ЕСТЬNULL(вт_цены_price.Знаменатель, 1) / ЕСТЬNULL(вт_цены_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА вт_цены_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_Цены_old_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_Цены_old_price.Цена, 0) * ЕСТЬNULL(вт_Цены_old_price.Знаменатель, 1) / ЕСТЬNULL(вт_Цены_old_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаСоСкидкой,
		|	ВЫБОР
		|		КОГДА вт_Цены_min_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_Цены_min_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_Цены_min_price.Цена, 0) * ЕСТЬNULL(вт_Цены_min_price.Знаменатель, 1) / ЕСТЬNULL(вт_Цены_min_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаМинимальная
		|ИЗ
		|	вт_ТаблицаНоменклатурыДополненная КАК вт_ТаблицаНоменклатурыДополненная
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Упаковка = ШтрихкодыНоменклатуры.Упаковка)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = ШтрихкодыНоменклатуры.Характеристика)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = СпрНоменклатура.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_цены_price"
		
		+ ?(ИспользуетсяЦенообразование25, 
		
		"
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_цены_price.Номенклатура)
		|			И (ВЫБОР
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка) = вт_цены_price.Характеристика
		|				ИНАЧЕ вт_ТаблицаНоменклатурыДополненная.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования = вт_цены_price.Характеристика
		|			КОНЕЦ)
		|			И (ВЫБОР 
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке =  Значение(Перечисление.ВариантОтбораДляКлючаЦен.Использовать) 
		|					ТОГДА вт_ТаблицаНоменклатурыДополненная.Упаковка =  вт_цены_price.Упаковка
		|				ИНАЧЕ
		|					Истина
		|				КОНЕЦ)
		|			И (вт_цены_price.ВидЦены = &price)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_Цены_old_price
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_Цены_old_price.Номенклатура)
		|			И (ВЫБОР
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка) = вт_Цены_old_price.Характеристика
		|				ИНАЧЕ вт_ТаблицаНоменклатурыДополненная.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования = вт_Цены_old_price.Характеристика
		|			КОНЕЦ)
		|			И (ВЫБОР 
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке =  Значение(Перечисление.ВариантОтбораДляКлючаЦен.Использовать) 
		|					ТОГДА вт_ТаблицаНоменклатурыДополненная.Упаковка =  вт_Цены_old_price.Упаковка
		|				ИНАЧЕ
		|					Истина
		|				КОНЕЦ)
		|			И (вт_Цены_old_price.ВидЦены = &discount_price)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_Цены_min_price
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_Цены_min_price.Номенклатура)
		|			И (ВЫБОР
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка) = вт_Цены_min_price.Характеристика
		|				ИНАЧЕ вт_ТаблицаНоменклатурыДополненная.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования = вт_Цены_min_price.Характеристика
		|			КОНЕЦ)
		|			И (ВЫБОР 
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке =  Значение(Перечисление.ВариантОтбораДляКлючаЦен.Использовать) 
		|					ТОГДА вт_ТаблицаНоменклатурыДополненная.Упаковка =  вт_Цены_min_price.Упаковка
		|				ИНАЧЕ
		|					Истина
		|				КОНЕЦ)
		|			И (вт_Цены_min_price.ВидЦены = &min_price)"
		
		,
		
		"
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_цены_price.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = вт_цены_price.Характеристика)
		|			И (вт_цены_price.ВидЦены = &price)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_Цены_old_price
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_Цены_old_price.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = вт_Цены_old_price.Характеристика)
		|			И (вт_Цены_old_price.ВидЦены = &discount_price)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_Цены_min_price
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_Цены_min_price.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = вт_Цены_min_price.Характеристика)
		|			И (вт_Цены_min_price.ВидЦены = &min_price)")
		
		+
		
		"
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ТаблицаНоменклатурыДополненная.Номенклатура,
		|	вт_ТаблицаНоменклатурыДополненная.Характеристика,
		|	вт_ТаблицаНоменклатурыДополненная.Упаковка,
		|	СпрНоменклатура.НаименованиеПолное,
		|	СпрНоменклатура.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ,
		|	СпрНоменклатура.ИспользоватьУпаковки,
		|	ВЫБОР
		|		КОГДА вт_цены_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_цены_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_цены_price.Цена, 0) * ЕСТЬNULL(вт_цены_price.Знаменатель, 1) / ЕСТЬNULL(вт_цены_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА вт_цены_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_Цены_old_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_Цены_old_price.Цена, 0) * ЕСТЬNULL(вт_Цены_old_price.Знаменатель, 1) / ЕСТЬNULL(вт_Цены_old_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА вт_Цены_min_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_Цены_min_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_Цены_min_price.Цена, 0) * ЕСТЬNULL(вт_Цены_min_price.Знаменатель, 1) / ЕСТЬNULL(вт_Цены_min_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0)
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 100
		|		КОГДА УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0)
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 100
		|		КОГДА УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""CMT""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0)
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""MTR""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 100
		|		КОГДА УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.МеждународноеСокращение = ""INH""
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * 2.54
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СпрНоменклатура.ИспользоватьУпаковки
		|				И НЕ УпаковкиЕдиницыИзмерения.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА УпаковкиЕдиницыИзмерения.ВесЕдиницаИзмерения.МеждународноеСокращение = ""KGM""
		|						ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0)
		//+ ИнфоСофт Стояк Ю.К. 26.07.2024 УА #79508		
		//|					ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0)
		|					ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0) / 1000
		//- ИнфоСофт Стояк Ю.К. 26.07.2024 УА #79508
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СпрНоменклатура.ВесИспользовать
		|						И СпрНоменклатура.ВесЗнаменатель > 0
		|					ТОГДА ВЫБОР
		|							КОГДА СпрНоменклатура.ВесЕдиницаИзмерения.МеждународноеСокращение = ""KGM""
		|								ТОГДА СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель
		//+ ИнфоСофт Стояк Ю.К. 26.07.2024 УА #79508		
		//|							ИНАЧЕ СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель
		|							ИНАЧЕ СпрНоменклатура.ВесЧислитель / СпрНоменклатура.ВесЗнаменатель / 1000
		//- ИнфоСофт Стояк Ю.К. 26.07.2024 УА #79508
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", СтруктураПараметров.ТаблицаНоменклатуры);
	Запрос.УстановитьПараметр("price", СтруктураПараметров.Price);
	Запрос.УстановитьПараметр("discount_price", СтруктураПараметров.discount_price);
	Запрос.УстановитьПараметр("min_price", СтруктураПараметров.Price);
	Запрос.УстановитьПараметр("Аккаунт", СтруктураПараметров.Аккаунт);
	Запрос.УстановитьПараметр("Категория", СтруктураПараметров.Категория);
	Запрос.УстановитьПараметр("Валюта", СтруктураПараметров.Валюта);

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаТоваров = РезультатЗапроса.Выгрузить();

	Возврат ТаблицаТоваров;

КонецФункции

#КонецОбласти  
