
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Мурсалимов Д.Р. 09.08.24 УА #81255
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВариантыОтчета = "ВаловаяПрибыль";
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 09.08.24 УА #81255

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Мурсалимов Д.Р. 09.08.24 УА #81255
&НаКлиенте
Процедура ОбновитьВариантОтчета(Команда)	
	
	ОписаниеФайла = ПолучитьФайлИзМакетаНаСервере(ВариантыОтчета);
	
	ОбновитьВариантОтчетаИзФайла(ОписаниеФайла); 
	УдалитьВременныеФайлыНаСервере(ОписаниеФайла);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 09.08.24 УА #81255

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Мурсалимов Д.Р. 09.08.24 УА #81255
&НаКлиенте
Процедура ОбновитьВариантОтчетаИзФайла(ОписаниеФайла)  	
	
	СвойстваВариантаОтчетаОснования = ВариантыОтчетовКлиент.СвойстваВариантаОтчетаОснования();

	Если ОписаниеФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Версия = ИС_МП_ВызовСервера.ВерсияБезРедакции();
	
	//+ ИнфоСофт Мурсалимов Д.Р. 19.09.24 УА #83860	           
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.12.270") < 0 Тогда
		СвойстваВариантаОтчета = ВариантыОтчетовВызовСервера.СвойстваВариантаОтчетаИзФайла(
		ОписаниеФайла, СвойстваВариантаОтчетаОснования.Ссылка);
	Иначе
		СвойстваВариантаОтчета = ВариантыОтчетовВызовСервера.ОбновитьВариантОтчетаИзФайла(
		ОписаниеФайла, СвойстваВариантаОтчетаОснования.Ссылка);
	КонецЕсли;                                  
	//- ИнфоСофт Мурсалимов Д.Р. 19.09.24 УА #83860
	
	ИзменитьАвтораОтчетаНаСервере(СвойстваВариантаОтчета.Ссылка);
	
	ПараметрыОбновленияФормы = Новый Структура("КлючВарианта");
	ЗаполнитьЗначенияСвойств(ПараметрыОбновленияФормы, СвойстваВариантаОтчета);
	
	ВариантыОтчетовКлиент.ОбновитьОткрытыеФормы(ПараметрыОбновленияФормы);
	ПоказатьОповещениеПользователя(НСтр("ru = 'Вариант отчета обновлен из файла'"));
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 09.08.24 УА #81255

//+ ИнфоСофт Мурсалимов Д.Р. 09.08.24 УА #81255
&НаСервере
Функция ПолучитьФайлИзМакетаНаСервере(НаименованиеОтчета)
	
	ДвоичныеДанные = Обработки.ИС_WB_ФормированиеВариантовОтчетов.ПолучитьМакет(НаименованиеОтчета);
	
	АдресДанныхВовременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор); 
	
	ОписаниеФайла = Новый Структура;  
	ОписаниеФайла.Вставить("Имя", 		"");
	ОписаниеФайла.Вставить("Хранение", 	АдресДанныхВовременномХранилище);
	
	Возврат ОписаниеФайла;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 09.08.24 УА #81255	

//+ ИнфоСофт Мурсалимов Д.Р. 09.08.24 УА #81255
&НаСервере
Процедура ИзменитьАвтораОтчетаНаСервере(ВариантОтчетаСсылка);
	
	ВариантОтчетаОбъект = ВариантОтчетаСсылка.ПолучитьОбъект();
	ВариантОтчетаОбъект.Автор = ПользователиКлиентСервер.ТекущийПользователь();
	ВариантОтчетаОбъект.ТолькоДляАвтора = Истина;
	ВариантОтчетаОбъект.Записать();	
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 09.08.24 УА #81255

//+ ИнфоСофт Мурсалимов Д.Р. 09.08.24 УА #81255
&НаСервере
Процедура УдалитьВременныеФайлыНаСервере(ОписаниеФайла) 
	УдалитьИзВременногоХранилища(ОписаниеФайла.Хранение);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 09.08.24 УА #81255

#КонецОбласти	
