
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Мурсалимов Д.Р. 14.10.24 УА #83503
// На вход требуется временная таблица "ВТ_Сопоставление", которая сожержит 4 обязательных поля:
// 		ПолеСопоставление - поле которое будет использовано для соединения в финальном пакете
//		Номенклатура - Номенклатура для получения цен
//		Характеристика - Характеристика для получения цен
//
// Также имеются следующие обязательные параметры для установки:
//		Склад1С - Определяет склад, список складов или Группу складов. В случае использования группы складов
//		необходимо сделать замену %1 в тексте на "ИЕРАРХИИ", в остальных случаях на ""
//
// Возвращаемое значение:
//  Строка - Текст запроса остатков
//
Функция ТекстЗапросаЦен() Экспорт
	
	ИспользуетсяЦенообразование25 = Константы.ИспользуетсяЦенообразование25.Получить();
	
	Если ИспользуетсяЦенообразование25 Тогда 
		
		Текст = 
		//+ ИнфоСофт Власова И.С. 11.12.24 УА #88633
		//"ВЫБРАТЬ
		//|	ЦеныНоменклатуры25.Номенклатура КАК Номенклатура,
		//|	ЦеныНоменклатуры25.ХарактеристикаЦО КАК ХарактеристикаЦО,
		//|	ЕСТЬNULL(ЦеныНоменклатуры25.Цена, 0) КАК Цена,
		//|	0 КАК ЦенаСоСкидкой,
		//|	0 КАК ЦенаМинимальная,
		//|	0 КАК ЦенаFBO
		//|ПОМЕСТИТЬ ВТ_ЦеныТоваров
		//|ИЗ
		//|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		//|			,
		//|			ВидЦены = &ВидЦены
		//|				И (Номенклатура, ХарактеристикаЦО) В
		//|					(ВЫБРАТЬ
		//|						ВТ.Номенклатура КАК Номенклатура,
		//|						ВТ.ХарактеристикаЦО КАК ХарактеристикаЦО
		//|					ИЗ
		//|						ВТ_Сопоставление КАК ВТ)) КАК ЦеныНоменклатуры25
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ЦеныНоменклатуры25СоСкидкой.Номенклатура,
		//|	ЦеныНоменклатуры25СоСкидкой.ХарактеристикаЦО,
		//|	0,
		//|	ЕСТЬNULL(ЦеныНоменклатуры25СоСкидкой.Цена, 0),
		//|	0,
		//|	0
		//|ИЗ
		//|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		//|			,
		//|			ВидЦены = &ВидЦеныСоСкидкой
		//|				И (Номенклатура, ХарактеристикаЦО) В
		//|					(ВЫБРАТЬ
		//|						ВТ.Номенклатура КАК Номенклатура,
		//|						ВТ.ХарактеристикаЦО КАК ХарактеристикаЦО
		//|					ИЗ
		//|						ВТ_Сопоставление КАК ВТ)) КАК ЦеныНоменклатуры25СоСкидкой
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ЦеныМинимальные25СрезПоследних.Номенклатура,
		//|	ЦеныМинимальные25СрезПоследних.ХарактеристикаЦО,
		//|	0,
		//|	0,
		//|	ЕСТЬNULL(ЦеныМинимальные25СрезПоследних.Цена, 0),
		//|	0
		//|ИЗ
		//|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		//|			,
		//|			ВидЦены = &ВидЦеныМинимальный
		//|				И (Номенклатура, ХарактеристикаЦО) В
		//|					(ВЫБРАТЬ
		//|						ВТ.Номенклатура КАК Номенклатура,
		//|						ВТ.ХарактеристикаЦО КАК ХарактеристикаЦО
		//|					ИЗ
		//|						ВТ_Сопоставление КАК ВТ)) КАК ЦеныМинимальные25СрезПоследних
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ЦеныНоменклатуры25FBO.Номенклатура,
		//|	ЦеныНоменклатуры25FBO.ХарактеристикаЦО,
		//|	0,
		//|	0,
		//|	0,
		//|	ЕСТЬNULL(ЦеныНоменклатуры25FBO.Цена, 0)
		//|ИЗ
		//|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		//|			,
		//|			ВидЦены = &ВидЦеныFBO
		//|				И (Номенклатура, ХарактеристикаЦО) В
		//|					(ВЫБРАТЬ
		//|						ВТ.Номенклатура КАК Номенклатура,
		//|						ВТ.ХарактеристикаЦО КАК ХарактеристикаЦО
		//|					ИЗ
		//|						ВТ_Сопоставление КАК ВТ)) КАК ЦеныНоменклатуры25FBO
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_ЦеныТоваров.Номенклатура КАК Номенклатура,
		//|	ВТ_ЦеныТоваров.ХарактеристикаЦО КАК ХарактеристикаЦО,
		//|	СУММА(ВТ_ЦеныТоваров.Цена) КАК Цена,
		//|	СУММА(ВТ_ЦеныТоваров.ЦенаСоСкидкой) КАК ЦенаСоСкидкой,
		//|	СУММА(ВТ_ЦеныТоваров.ЦенаМинимальная) КАК ЦенаМинимальная,
		//|	СУММА(ВТ_ЦеныТоваров.ЦенаFBO) КАК ЦенаFBO
		//|ПОМЕСТИТЬ ВТ_ЦеныТоваровОбъединение
		//|ИЗ
		//|	ВТ_ЦеныТоваров КАК ВТ_ЦеныТоваров
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ЦеныТоваров.Номенклатура,
		//|	ВТ_ЦеныТоваров.ХарактеристикаЦО
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ИСТИНА КАК РассчитываетсяИзЦенКомплектующих,
		//|	ВариантыКомплектацииНоменклатуры.Владелец КАК Номенклатура,
		//|	ВариантыКомплектацииНоменклатуры.Характеристика КАК Характеристика,
		//|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК НоменклатураНабора,
		//|	ВЫБОР
		//|		КОГДА ВидыНоменклатуры.НастройкиКлючаЦенПоХарактеристике = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		//|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
		//|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка))
		//|	КОНЕЦ КАК ХарактеристикаНабора,
		//|	ВЫБОР
		//|		КОГДА ВариантыКомплектацииНоменклатурыТовары.Упаковка.Числитель = 0
		//|			ТОГДА 1
		//|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка.Числитель, 1)
		//|	КОНЕЦ / ВЫБОР
		//|		КОГДА ВариантыКомплектацииНоменклатурыТовары.Упаковка.Знаменатель = 0
		//|			ТОГДА 1
		//|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка.Знаменатель, 1)
		//|	КОНЕЦ КАК КоэффициентУпаковки,
		//|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК КоличествоНабора
		//|ПОМЕСТИТЬ ВТ_СоставНаборов
		//|ИЗ
		//|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		//|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		//|		ПО ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
		//|ГДЕ
		//|	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)
		//|	И (ВариантыКомплектацииНоменклатуры.Владелец, ВариантыКомплектацииНоменклатуры.Характеристика) В
		//|			(ВЫБРАТЬ
		//|				ВТ.Номенклатура КАК Номенклатура,
		//|				ВТ.Характеристика КАК Характеристика
		//|			ИЗ
		//|				ВТ_Сопоставление КАК ВТ
		//|			ГДЕ
		//|				ВТ.ЭтоНабор)
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_СоставНаборов.РассчитываетсяИзЦенКомплектующих КАК РассчитываетсяИзЦенКомплектующих,
		//|	ВТ_СоставНаборов.Номенклатура КАК Номенклатура,
		//|	ВТ_СоставНаборов.Характеристика КАК Характеристика,
		//|	ВТ_СоставНаборов.НоменклатураНабора КАК НоменклатураНабора,
		//|	ВТ_СоставНаборов.ХарактеристикаНабора КАК ХарактеристикаНабора,
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСТЬNULL(Цены25СрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 < 0
		//|				ТОГДА 0
		//|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Цены25СрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|		КОНЕЦ) КАК Цена,
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСТЬNULL(ЦеныСоСкидкой25СрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 < 0
		//|				ТОГДА 0
		//|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныСоСкидкой25СрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|		КОНЕЦ) КАК ЦенаСоСкидкой,
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСТЬNULL(ЦеныМинимальные25СрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 < 0
		//|				ТОГДА 0
		//|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныМинимальные25СрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|		КОНЕЦ) КАК ЦенаМинимальная,
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСТЬNULL(ЦеныFBO25СрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 < 0
		//|				ТОГДА 0
		//|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныFBO25СрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|		КОНЕЦ) КАК ЦенаFBO
		//|ПОМЕСТИТЬ ВТ_ЦеныНаборовИтог
		//|ИЗ
		//|	ВТ_СоставНаборов КАК ВТ_СоставНаборов
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(, ВидЦены = &ВидЦены) КАК Цены25СрезПоследних
		//|		ПО ВТ_СоставНаборов.НоменклатураНабора = Цены25СрезПоследних.Номенклатура
		//|			И ВТ_СоставНаборов.ХарактеристикаНабора = Цены25СрезПоследних.ХарактеристикаЦО
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(, ВидЦены = &ВидЦеныСоСкидкой) КАК ЦеныСоСкидкой25СрезПоследних
		//|		ПО ВТ_СоставНаборов.НоменклатураНабора = ЦеныСоСкидкой25СрезПоследних.Номенклатура
		//|			И ВТ_СоставНаборов.ХарактеристикаНабора = ЦеныСоСкидкой25СрезПоследних.ХарактеристикаЦО
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(, ВидЦены = &ВидЦеныМинимальный) КАК ЦеныМинимальные25СрезПоследних
		//|		ПО ВТ_СоставНаборов.НоменклатураНабора = ЦеныМинимальные25СрезПоследних.Номенклатура
		//|			И ВТ_СоставНаборов.ХарактеристикаНабора = ЦеныМинимальные25СрезПоследних.ХарактеристикаЦО
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(, ВидЦены = &ВидЦеныFBO) КАК ЦеныFBO25СрезПоследних
		//|		ПО ВТ_СоставНаборов.НоменклатураНабора = ЦеныFBO25СрезПоследних.Номенклатура
		//|			И ВТ_СоставНаборов.ХарактеристикаНабора = ЦеныFBO25СрезПоследних.ХарактеристикаЦО
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_СоставНаборов.Номенклатура,
		//|	ВТ_СоставНаборов.Характеристика,
		//|	ВТ_СоставНаборов.РассчитываетсяИзЦенКомплектующих,
		//|	ВТ_СоставНаборов.НоменклатураНабора,
		//|	ВТ_СоставНаборов.ХарактеристикаНабора
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_ЦеныНаборовИтог.РассчитываетсяИзЦенКомплектующих КАК РассчитываетсяИзЦенКомплектующих,
		//|	ВТ_ЦеныНаборовИтог.Номенклатура КАК Номенклатура,
		//|	ВТ_ЦеныНаборовИтог.Характеристика КАК Характеристика,
		//|	СУММА(ВТ_ЦеныНаборовИтог.Цена) КАК Цена,
		//|	СУММА(ВТ_ЦеныНаборовИтог.ЦенаСоСкидкой) КАК ЦенаСоСкидкой,
		//|	СУММА(ВТ_ЦеныНаборовИтог.ЦенаМинимальная) КАК ЦенаМинимальная,
		//|	СУММА(ВТ_ЦеныНаборовИтог.ЦенаFBO) КАК ЦенаFBO
		//|ПОМЕСТИТЬ ВТ_ЦеныНаборов
		//|ИЗ
		//|	ВТ_ЦеныНаборовИтог КАК ВТ_ЦеныНаборовИтог
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ЦеныНаборовИтог.РассчитываетсяИзЦенКомплектующих,
		//|	ВТ_ЦеныНаборовИтог.Номенклатура,
		//|	ВТ_ЦеныНаборовИтог.Характеристика
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_Сопоставление.ПолеСопоставления КАК ПолеСопоставления,
		//|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		//|	ВТ_Сопоставление.ХарактеристикаЦО КАК ХарактеристикаЦО,
		//|	ВЫБОР
		//|		КОГДА ВТ_Сопоставление.ЭтоНабор
		//|				И ВТ_ЦеныНаборов.РассчитываетсяИзЦенКомплектующих
		//|			ТОГДА ВТ_ЦеныНаборов.Цена
		//|		ИНАЧЕ ВТ_ЦеныТоваровОбъединение.Цена
		//|	КОНЕЦ КАК Цена,
		//|	ВЫБОР
		//|		КОГДА ВТ_Сопоставление.ЭтоНабор
		//|				И ВТ_ЦеныНаборов.РассчитываетсяИзЦенКомплектующих
		//|			ТОГДА ВТ_ЦеныНаборов.ЦенаСоСкидкой
		//|		ИНАЧЕ ВТ_ЦеныТоваровОбъединение.ЦенаСоСкидкой
		//|	КОНЕЦ КАК ЦенаСоСкидкой,
		//|	ВЫБОР
		//|		КОГДА ВТ_Сопоставление.ЭтоНабор
		//|				И ВТ_ЦеныНаборов.РассчитываетсяИзЦенКомплектующих
		//|			ТОГДА ВТ_ЦеныНаборов.ЦенаМинимальная
		//|		ИНАЧЕ ВТ_ЦеныТоваровОбъединение.ЦенаМинимальная
		//|	КОНЕЦ КАК ЦенаМинимальная,
		//|	ВЫБОР
		//|		КОГДА ВТ_Сопоставление.ЭтоНабор
		//|				И ВТ_ЦеныНаборов.РассчитываетсяИзЦенКомплектующих
		//|			ТОГДА ВТ_ЦеныНаборов.ЦенаFBO
		//|		ИНАЧЕ ВТ_ЦеныТоваровОбъединение.ЦенаFBO
		//|	КОНЕЦ КАК ЦенаFBO
		//|ПОМЕСТИТЬ ВТ_ЦеныОбъединение
		//|ИЗ
		//|	ВТ_Сопоставление КАК ВТ_Сопоставление
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровОбъединение КАК ВТ_ЦеныТоваровОбъединение
		//|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныТоваровОбъединение.Номенклатура
		//|			И ВТ_Сопоставление.ХарактеристикаЦО = ВТ_ЦеныТоваровОбъединение.ХарактеристикаЦО
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНаборов КАК ВТ_ЦеныНаборов
		//|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныНаборов.Номенклатура
		//|			И ВТ_Сопоставление.Характеристика = ВТ_ЦеныНаборов.Характеристика
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_Сопоставление.ПолеСопоставления КАК ПолеСопоставления,
		//|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		//|	ВТ_Сопоставление.Характеристика КАК Характеристика,
		//|	ВТ_Сопоставление.ХарактеристикаЦО КАК ХарактеристикаЦО,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ВТ_ЦеныОбъединение.Цена, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
		//|			ТОГДА 0
		//|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныОбъединение.Цена, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|	КОНЕЦ КАК Цена,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ВТ_ЦеныОбъединение.ЦенаСоСкидкой, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
		//|			ТОГДА 0
		//|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныОбъединение.ЦенаСоСкидкой, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|	КОНЕЦ КАК ЦенаСоСкидкой,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ВТ_ЦеныОбъединение.ЦенаМинимальная, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
		//|			ТОГДА 0
		//|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныОбъединение.ЦенаМинимальная, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|	КОНЕЦ КАК ЦенаМинимальная,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ВТ_ЦеныОбъединение.ЦенаFBO, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
		//|			ТОГДА 0
		//|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныОбъединение.ЦенаFBO, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|	КОНЕЦ КАК ЦенаFBO
		//|ПОМЕСТИТЬ ВТ_Цены
		//|ИЗ
		//|	ВТ_Сопоставление КАК ВТ_Сопоставление
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныОбъединение КАК ВТ_ЦеныОбъединение
		//|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_ЦеныОбъединение.ПолеСопоставления";
		
		"ВЫБРАТЬ
		|	ИСТИНА КАК РассчитываетсяИзЦенКомплектующих,
		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатуры.Характеристика КАК Характеристика,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК НоменклатураНабора,
		|	ВЫБОР
		|		КОГДА ВидыНоменклатуры.НастройкиКлючаЦенПоХарактеристике = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
		|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка))
		|	КОНЕЦ КАК ХарактеристикаНабора,
		|	ВЫБОР
		|		КОГДА ВариантыКомплектацииНоменклатурыТовары.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ВариантыКомплектацииНоменклатурыТовары.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка.Знаменатель, 1)
		|	КОНЕЦ КАК КоэффициентУпаковки,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоНабора,
		|	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК УпаковкаНабора
		|ПОМЕСТИТЬ ВТ_СоставНаборов
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
		|ГДЕ
		|	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)
		|	И (ВариантыКомплектацииНоменклатуры.Владелец, ВариантыКомплектацииНоменклатуры.Характеристика) В
		|			(ВЫБРАТЬ
		|				ВТ.Номенклатура КАК Номенклатура,
		|				ВТ.Характеристика КАК Характеристика
		|			ИЗ
		|				ВТ_Сопоставление КАК ВТ
		|			ГДЕ
		|				ВТ.ЭтоНабор)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатуры25.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатуры25.ХарактеристикаЦО КАК ХарактеристикаЦО,
		|	ЕСТЬNULL(ЦеныНоменклатуры25.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатуры25.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры25.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ЦеныНоменклатуры25.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры25.Упаковка.Знаменатель, 1)
		|	КОНЕЦ КАК КоэффициентУпаковкиЦена,
		|	ЕСТЬNULL(ЦеныНоменклатуры25.УпаковкаЦО, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК УпаковкаЦена
		|ПОМЕСТИТЬ ВТ_ЦеныТоваров
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		|			,
		|			ВидЦены = &ВидЦены
		|				И (Номенклатура, ХарактеристикаЦО) В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура КАК Номенклатура,
		|						ВТ.ХарактеристикаЦО КАК ХарактеристикаЦО	
		|					ИЗ
		|						ВТ_Сопоставление КАК ВТ
		|
		|					ОБЪЕДИНИТЬ ВСЕ
		|
		|					ВЫБРАТЬ
		|						ВТ_СоставНаборов.НоменклатураНабора,
		|						ВТ_СоставНаборов.ХарактеристикаНабора
		|					ИЗ
		|						ВТ_СоставНаборов КАК ВТ_СоставНаборов)) КАК ЦеныНоменклатуры25
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатуры25СоСкидкой.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатуры25СоСкидкой.ХарактеристикаЦО КАК ХарактеристикаЦО,
		|	ЕСТЬNULL(ЦеныНоменклатуры25СоСкидкой.Цена, 0) КАК ЦенаСоСкидкой,
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатуры25СоСкидкой.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры25СоСкидкой.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ЦеныНоменклатуры25СоСкидкой.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры25СоСкидкой.Упаковка.Знаменатель, 1)
		|	КОНЕЦ КАК КоэффициентУпаковкиЦенаСоСкидкой,
		|	ЦеныНоменклатуры25СоСкидкой.УпаковкаЦО КАК УпаковкаЦенаСоСкидкой
		|ПОМЕСТИТЬ ВТ_ЦеныТоваровСоСкидкой
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		|			,
		|			ВидЦены = &ВидЦеныСоСкидкой
		|				И (Номенклатура, ХарактеристикаЦО) В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура КАК Номенклатура,
		|						ВТ.ХарактеристикаЦО КАК ХарактеристикаЦО	
		|					ИЗ
		|						ВТ_Сопоставление КАК ВТ
		|
		|					ОБЪЕДИНИТЬ ВСЕ
		|
		|					ВЫБРАТЬ
		|						ВТ_СоставНаборов.НоменклатураНабора,
		|						ВТ_СоставНаборов.ХарактеристикаНабора
		|					ИЗ
		|						ВТ_СоставНаборов КАК ВТ_СоставНаборов)) КАК ЦеныНоменклатуры25СоСкидкой
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныМинимальные25СрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныМинимальные25СрезПоследних.ХарактеристикаЦО КАК ХарактеристикаЦО,
		|	ЕСТЬNULL(ЦеныМинимальные25СрезПоследних.Цена, 0) КАК ЦенаМинимальная,
		|	ВЫБОР
		|		КОГДА ЦеныМинимальные25СрезПоследних.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныМинимальные25СрезПоследних.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ЦеныМинимальные25СрезПоследних.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныМинимальные25СрезПоследних.Упаковка.Знаменатель, 1)
		|	КОНЕЦ КАК КоэффициентУпаковкиЦенаМинимальная,
		|	ЦеныМинимальные25СрезПоследних.УпаковкаЦО КАК УпаковкаЦенаМинимальная
		|ПОМЕСТИТЬ ВТ_ЦеныТоваровМинимальная
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		|			,
		|			ВидЦены = &ВидЦеныМинимальный
		|				И (Номенклатура, ХарактеристикаЦО) В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура КАК Номенклатура,
		|						ВТ.ХарактеристикаЦО КАК ХарактеристикаЦО	
		|					ИЗ
		|						ВТ_Сопоставление КАК ВТ
		|
		|					ОБЪЕДИНИТЬ ВСЕ
		|
		|					ВЫБРАТЬ
		|						ВТ_СоставНаборов.НоменклатураНабора,
		|						ВТ_СоставНаборов.ХарактеристикаНабора
		|					ИЗ
		|						ВТ_СоставНаборов КАК ВТ_СоставНаборов)) КАК ЦеныМинимальные25СрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатуры25FBO.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатуры25FBO.ХарактеристикаЦО КАК ХарактеристикаЦО,
		|	ЕСТЬNULL(ЦеныНоменклатуры25FBO.Цена, 0) КАК ЦенаFBO,
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатуры25FBO.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры25FBO.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ЦеныНоменклатуры25FBO.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры25FBO.Упаковка.Знаменатель, 1)
		|	КОНЕЦ КАК КоэффициентУпаковкиЦенаFBO,
		|	ЦеныНоменклатуры25FBO.УпаковкаЦО КАК УпаковкаЦенаFBO
		|ПОМЕСТИТЬ ВТ_ЦеныТоваровFBO
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		|			,
		|			ВидЦены = &ВидЦеныFBO
		|				И (Номенклатура, ХарактеристикаЦО) В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура КАК Номенклатура,
		|						ВТ.ХарактеристикаЦО КАК ХарактеристикаЦО	
		|					ИЗ
		|						ВТ_Сопоставление КАК ВТ
		|
		|					ОБЪЕДИНИТЬ ВСЕ
		|
		|					ВЫБРАТЬ
		|						ВТ_СоставНаборов.НоменклатураНабора,
		|						ВТ_СоставНаборов.ХарактеристикаНабора
		|					ИЗ
		|						ВТ_СоставНаборов КАК ВТ_СоставНаборов)) КАК ЦеныНоменклатуры25FBO
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СоставНаборов.РассчитываетсяИзЦенКомплектующих КАК РассчитываетсяИзЦенКомплектующих,
		|	ВТ_СоставНаборов.Номенклатура КАК Номенклатура,
		|	ВТ_СоставНаборов.Характеристика КАК Характеристика,
		|	ВТ_СоставНаборов.НоменклатураНабора КАК НоменклатураНабора,
		|	ВТ_СоставНаборов.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ЦеныТоваров.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора - 0.5 < 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваров.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора - 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК Цена,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровСоСкидкой.ЦенаСоСкидкой, 0) * ВТ_СоставНаборов.КоличествоНабора - 0.5 < 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровСоСкидкой.ЦенаСоСкидкой, 0) * ВТ_СоставНаборов.КоличествоНабора - 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК ЦенаСоСкидкой,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровМинимальная.ЦенаМинимальная, 0) * ВТ_СоставНаборов.КоличествоНабора - 0.5 < 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровМинимальная.ЦенаМинимальная, 0) * ВТ_СоставНаборов.КоличествоНабора - 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК ЦенаМинимальная,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровFBO.ЦенаFBO, 0) * ВТ_СоставНаборов.КоличествоНабора - 0.5 < 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровFBO.ЦенаFBO, 0) * ВТ_СоставНаборов.КоличествоНабора - 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК ЦенаFBO
		|ПОМЕСТИТЬ ВТ_ЦеныНаборовИтог
		|ИЗ
		|	ВТ_СоставНаборов КАК ВТ_СоставНаборов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваров КАК ВТ_ЦеныТоваров
		|		ПО ВТ_СоставНаборов.НоменклатураНабора = ВТ_ЦеныТоваров.Номенклатура
		|			И ВТ_СоставНаборов.ХарактеристикаНабора = ВТ_ЦеныТоваров.ХарактеристикаЦО
		|			И ВТ_СоставНаборов.УпаковкаНабора = ВТ_ЦеныТоваров.УпаковкаЦена
		|			И ВТ_СоставНаборов.НоменклатураНабора.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.Использовать)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровСоСкидкой КАК ВТ_ЦеныТоваровСоСкидкой
		|		ПО ВТ_СоставНаборов.НоменклатураНабора = ВТ_ЦеныТоваровСоСкидкой.Номенклатура
		|			И ВТ_СоставНаборов.ХарактеристикаНабора = ВТ_ЦеныТоваровСоСкидкой.ХарактеристикаЦО
		|			И ВТ_СоставНаборов.УпаковкаНабора = ВТ_ЦеныТоваровСоСкидкой.УпаковкаЦенаСоСкидкой
		|			И ВТ_СоставНаборов.НоменклатураНабора.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.Использовать)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровМинимальная КАК ВТ_ЦеныТоваровМинимальная
		|		ПО ВТ_СоставНаборов.НоменклатураНабора = ВТ_ЦеныТоваровМинимальная.Номенклатура
		|			И ВТ_СоставНаборов.ХарактеристикаНабора = ВТ_ЦеныТоваровМинимальная.ХарактеристикаЦО
		|			И ВТ_СоставНаборов.УпаковкаНабора = ВТ_ЦеныТоваровМинимальная.УпаковкаЦенаМинимальная
		|			И ВТ_СоставНаборов.НоменклатураНабора.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.Использовать)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровFBO КАК ВТ_ЦеныТоваровFBO
		|		ПО ВТ_СоставНаборов.НоменклатураНабора = ВТ_ЦеныТоваровFBO.Номенклатура
		|			И ВТ_СоставНаборов.ХарактеристикаНабора = ВТ_ЦеныТоваровFBO.ХарактеристикаЦО
		|			И ВТ_СоставНаборов.УпаковкаНабора = ВТ_ЦеныТоваровFBO.УпаковкаЦенаFBO
		|			И ВТ_СоставНаборов.НоменклатураНабора.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.Использовать)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СоставНаборов.Номенклатура,
		|	ВТ_СоставНаборов.Характеристика,
		|	ВТ_СоставНаборов.РассчитываетсяИзЦенКомплектующих,
		|	ВТ_СоставНаборов.НоменклатураНабора,
		|	ВТ_СоставНаборов.ХарактеристикаНабора
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_СоставНаборов.РассчитываетсяИзЦенКомплектующих КАК РассчитываетсяИзЦенКомплектующих,
		|	ВТ_СоставНаборов.Номенклатура КАК Номенклатура,
		|	ВТ_СоставНаборов.Характеристика КАК Характеристика,
		|	ВТ_СоставНаборов.НоменклатураНабора КАК НоменклатураНабора,
		|	ВТ_СоставНаборов.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ЦеныТоваров.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора 
		|					* ВТ_СоставНаборов.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваров.КоэффициентУпаковкиЦена, 1) - 0.5 < 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваров.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора * ВТ_СоставНаборов.КоэффициентУпаковки
		|					 / ЕСТЬNULL(ВТ_ЦеныТоваров.КоэффициентУпаковкиЦена, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК Цена,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровСоСкидкой.ЦенаСоСкидкой, 0) * ВТ_СоставНаборов.КоличествоНабора 
		|					* ВТ_СоставНаборов.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровСоСкидкой.КоэффициентУпаковкиЦенаСоСкидкой, 1) - 0.5 < 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровСоСкидкой.ЦенаСоСкидкой, 0) * ВТ_СоставНаборов.КоличествоНабора * ВТ_СоставНаборов.КоэффициентУпаковки
		|					 / ЕСТЬNULL(ВТ_ЦеныТоваровСоСкидкой.КоэффициентУпаковкиЦенаСоСкидкой, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК ЦенаСоСкидкой,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровМинимальная.ЦенаМинимальная, 0) * ВТ_СоставНаборов.КоличествоНабора 
		|					* ВТ_СоставНаборов.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровМинимальная.КоэффициентУпаковкиЦенаМинимальная, 1) - 0.5 < 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровМинимальная.ЦенаМинимальная, 0) * ВТ_СоставНаборов.КоличествоНабора * ВТ_СоставНаборов.КоэффициентУпаковки
		|					 / ЕСТЬNULL(ВТ_ЦеныТоваровМинимальная.КоэффициентУпаковкиЦенаМинимальная, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК ЦенаМинимальная,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровFBO.ЦенаFBO, 0) * ВТ_СоставНаборов.КоличествоНабора 
		|					* ВТ_СоставНаборов.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровFBO.КоэффициентУпаковкиЦенаFBO, 1) - 0.5 < 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровFBO.ЦенаFBO, 0) * ВТ_СоставНаборов.КоличествоНабора * ВТ_СоставНаборов.КоэффициентУпаковки
		|					 / ЕСТЬNULL(ВТ_ЦеныТоваровFBO.КоэффициентУпаковкиЦенаFBO, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК ЦенаFBO
		|ИЗ
		|	ВТ_СоставНаборов КАК ВТ_СоставНаборов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваров КАК ВТ_ЦеныТоваров
		|		ПО ВТ_СоставНаборов.НоменклатураНабора = ВТ_ЦеныТоваров.Номенклатура
		|			И ВТ_СоставНаборов.ХарактеристикаНабора = ВТ_ЦеныТоваров.ХарактеристикаЦО
		|			И НЕ ВТ_СоставНаборов.НоменклатураНабора.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.Использовать)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровСоСкидкой КАК ВТ_ЦеныТоваровСоСкидкой
		|		ПО ВТ_СоставНаборов.НоменклатураНабора = ВТ_ЦеныТоваровСоСкидкой.Номенклатура
		|			И ВТ_СоставНаборов.ХарактеристикаНабора = ВТ_ЦеныТоваровСоСкидкой.ХарактеристикаЦО
		|			И НЕ ВТ_СоставНаборов.НоменклатураНабора.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.Использовать)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровМинимальная КАК ВТ_ЦеныТоваровМинимальная
		|		ПО ВТ_СоставНаборов.НоменклатураНабора = ВТ_ЦеныТоваровМинимальная.Номенклатура
		|			И ВТ_СоставНаборов.ХарактеристикаНабора = ВТ_ЦеныТоваровМинимальная.ХарактеристикаЦО
		|			И НЕ ВТ_СоставНаборов.НоменклатураНабора.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.Использовать)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровFBO КАК ВТ_ЦеныТоваровFBO
		|		ПО ВТ_СоставНаборов.НоменклатураНабора = ВТ_ЦеныТоваровFBO.Номенклатура
		|			И ВТ_СоставНаборов.ХарактеристикаНабора = ВТ_ЦеныТоваровFBO.ХарактеристикаЦО
		|			И НЕ ВТ_СоставНаборов.НоменклатураНабора.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.Использовать)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СоставНаборов.Номенклатура,
		|	ВТ_СоставНаборов.Характеристика,
		|	ВТ_СоставНаборов.РассчитываетсяИзЦенКомплектующих,
		|	ВТ_СоставНаборов.НоменклатураНабора,
		|	ВТ_СоставНаборов.ХарактеристикаНабора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныНаборовИтог.РассчитываетсяИзЦенКомплектующих КАК РассчитываетсяИзЦенКомплектующих,
		|	ВТ_ЦеныНаборовИтог.Номенклатура КАК Номенклатура,
		|	ВТ_ЦеныНаборовИтог.Характеристика КАК Характеристика,
		|	СУММА(ЕСТЬNULL(ВТ_ЦеныНаборовИтог.Цена, 0)) КАК Цена,
		|	СУММА(ЕСТЬNULL(ВТ_ЦеныНаборовИтог.ЦенаСоСкидкой, 0)) КАК ЦенаСоСкидкой,
		|	СУММА(ЕСТЬNULL(ВТ_ЦеныНаборовИтог.ЦенаМинимальная, 0)) КАК ЦенаМинимальная,
		|	СУММА(ЕСТЬNULL(ВТ_ЦеныНаборовИтог.ЦенаFBO, 0)) КАК ЦенаFBO
		|ПОМЕСТИТЬ ВТ_ЦеныНаборов
		|ИЗ
		|	ВТ_ЦеныНаборовИтог КАК ВТ_ЦеныНаборовИтог
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныНаборовИтог.РассчитываетсяИзЦенКомплектующих,
		|	ВТ_ЦеныНаборовИтог.Номенклатура,
		|	ВТ_ЦеныНаборовИтог.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сопоставление.ПолеСопоставления КАК ПолеСопоставления,
		|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		|	ВТ_Сопоставление.ХарактеристикаЦО КАК ХарактеристикаЦО,
		|	ВТ_ЦеныНаборов.Цена КАК Цена,
		|	ВТ_ЦеныНаборов.ЦенаСоСкидкой КАК ЦенаСоСкидкой,
		|	ВТ_ЦеныНаборов.ЦенаМинимальная КАК ЦенаМинимальная,
		|	ВТ_ЦеныНаборов.ЦенаFBO КАК ЦенаFBO
		|ПОМЕСТИТЬ ВТ_ЦеныНаборовПоКомплектующим
		|ИЗ
		|	ВТ_Сопоставление КАК ВТ_Сопоставление
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦеныНаборов КАК ВТ_ЦеныНаборов
		|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныНаборов.Номенклатура
		|			И ВТ_Сопоставление.Характеристика = ВТ_ЦеныНаборов.Характеристика
		|			И ВТ_Сопоставление.ЭтоНабор
		|			И ВТ_ЦеныНаборов.РассчитываетсяИзЦенКомплектующих
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сопоставление.ПолеСопоставления КАК ПолеСопоставления,
		|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		|	ВТ_Сопоставление.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦеныТоваров.Цена, 0) * ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваров.Цена, 0) * ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровСоСкидкой.ЦенаСоСкидкой, 0) * ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровСоСкидкой.ЦенаСоСкидкой, 0) * ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		|	КОНЕЦ КАК ЦенаСоСкидкой,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровМинимальная.ЦенаМинимальная, 0) * ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровМинимальная.ЦенаМинимальная, 0) * ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		|	КОНЕЦ КАК ЦенаМинимальная,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровFBO.ЦенаFBO, 0) * ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровFBO.ЦенаFBO, 0) * ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		|	КОНЕЦ КАК ЦенаFBO
		|ПОМЕСТИТЬ ВТ_ЦеныБезКомплектующих
		|ИЗ
		|	ВТ_Сопоставление КАК ВТ_Сопоставление
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваров КАК ВТ_ЦеныТоваров
		|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныТоваров.Номенклатура
		|			И ВТ_Сопоставление.ХарактеристикаЦО = ВТ_ЦеныТоваров.ХарактеристикаЦО
		|			И ((ВТ_Сопоставление.Упаковка.Код = ""796"" И ВТ_ЦеныТоваров.УпаковкаЦена = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) 
		|				ИЛИ ВТ_Сопоставление.Упаковка = ВТ_ЦеныТоваров.УпаковкаЦена)
		|			И ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.Использовать)
		|			И НЕ (ВТ_Сопоставление.Номенклатура, ВТ_Сопоставление.ХарактеристикаЦО) В (ВЫБРАТЬ ВТ_ЦеныНаборовПоКомплектующим.Номенклатура, ВТ_ЦеныНаборовПоКомплектующим.ХарактеристикаЦО ИЗ ВТ_ЦеныНаборовПоКомплектующим КАК ВТ_ЦеныНаборовПоКомплектующим)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровСоСкидкой КАК ВТ_ЦеныТоваровСоСкидкой
		|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныТоваровСоСкидкой.Номенклатура
		|			И ВТ_Сопоставление.ХарактеристикаЦО = ВТ_ЦеныТоваровСоСкидкой.ХарактеристикаЦО
		|			И ((ВТ_Сопоставление.Упаковка.Код = ""796"" И ВТ_ЦеныТоваровСоСкидкой.УпаковкаЦенаСоСкидкой = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) 
		|				ИЛИ ВТ_Сопоставление.Упаковка = ВТ_ЦеныТоваровСоСкидкой.УпаковкаЦенаСоСкидкой)
		|			И ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.Использовать)
		|			И НЕ (ВТ_Сопоставление.Номенклатура, ВТ_Сопоставление.ХарактеристикаЦО) В (ВЫБРАТЬ ВТ_ЦеныНаборовПоКомплектующим.Номенклатура, ВТ_ЦеныНаборовПоКомплектующим.ХарактеристикаЦО ИЗ ВТ_ЦеныНаборовПоКомплектующим КАК ВТ_ЦеныНаборовПоКомплектующим)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровМинимальная КАК ВТ_ЦеныТоваровМинимальная
		|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныТоваровМинимальная.Номенклатура
		|			И ВТ_Сопоставление.ХарактеристикаЦО = ВТ_ЦеныТоваровМинимальная.ХарактеристикаЦО
		|			И ((ВТ_Сопоставление.Упаковка.Код = ""796"" И ВТ_ЦеныТоваровМинимальная.УпаковкаЦенаМинимальная = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) 
		|				ИЛИ ВТ_Сопоставление.Упаковка = ВТ_ЦеныТоваровМинимальная.УпаковкаЦенаМинимальная)
		|			И ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.Использовать)
		|			И НЕ (ВТ_Сопоставление.Номенклатура, ВТ_Сопоставление.ХарактеристикаЦО) В (ВЫБРАТЬ ВТ_ЦеныНаборовПоКомплектующим.Номенклатура, ВТ_ЦеныНаборовПоКомплектующим.ХарактеристикаЦО ИЗ ВТ_ЦеныНаборовПоКомплектующим КАК ВТ_ЦеныНаборовПоКомплектующим)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровFBO КАК ВТ_ЦеныТоваровFBO
		|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныТоваровFBO.Номенклатура
		|			И ВТ_Сопоставление.ХарактеристикаЦО = ВТ_ЦеныТоваровFBO.ХарактеристикаЦО
		|			И ((ВТ_Сопоставление.Упаковка.Код = ""796"" И ВТ_ЦеныТоваровFBO.УпаковкаЦенаFBO = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) 
		|				ИЛИ ВТ_Сопоставление.Упаковка = ВТ_ЦеныТоваровFBO.УпаковкаЦенаFBO)
		|			И ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.Использовать)
		|			И НЕ (ВТ_Сопоставление.Номенклатура, ВТ_Сопоставление.ХарактеристикаЦО) В (ВЫБРАТЬ ВТ_ЦеныНаборовПоКомплектующим.Номенклатура, ВТ_ЦеныНаборовПоКомплектующим.ХарактеристикаЦО ИЗ ВТ_ЦеныНаборовПоКомплектующим КАК ВТ_ЦеныНаборовПоКомплектующим)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Сопоставление.ПолеСопоставления КАК ПолеСопоставления,
		|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		|	ВТ_Сопоставление.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦеныТоваров.Цена, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваров.КоэффициентУпаковкиЦена, 1) - 0.5 < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваров.Цена, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваров.КоэффициентУпаковкиЦена, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровСоСкидкой.ЦенаСоСкидкой, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровСоСкидкой.КоэффициентУпаковкиЦенаСоСкидкой, 1) - 0.5 < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровСоСкидкой.ЦенаСоСкидкой, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровСоСкидкой.КоэффициентУпаковкиЦенаСоСкидкой, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|	КОНЕЦ КАК ЦенаСоСкидкой,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровМинимальная.ЦенаМинимальная, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровМинимальная.КоэффициентУпаковкиЦенаМинимальная, 1) - 0.5 < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровМинимальная.ЦенаМинимальная, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровМинимальная.КоэффициентУпаковкиЦенаМинимальная, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|	КОНЕЦ КАК ЦенаМинимальная,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровFBO.ЦенаFBO, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровFBO.КоэффициентУпаковкиЦенаFBO, 1) - 0.5 < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровFBO.ЦенаFBO, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровFBO.КоэффициентУпаковкиЦенаFBO, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|	КОНЕЦ КАК ЦенаFBO
		|ИЗ
		|	ВТ_Сопоставление КАК ВТ_Сопоставление
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваров КАК ВТ_ЦеныТоваров
		|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныТоваров.Номенклатура
		|			И ВТ_Сопоставление.ХарактеристикаЦО = ВТ_ЦеныТоваров.ХарактеристикаЦО
		//+ ИнфоСофт Власова И.С. 16.01.25 УА #91286
		//|			И ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		|			И (ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		|				ИЛИ ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.ПустаяСсылка))
		//- ИнфоСофт Власова И.С. 16.01.25 УА #91286
		|			И НЕ (ВТ_Сопоставление.Номенклатура, ВТ_Сопоставление.ХарактеристикаЦО) В (ВЫБРАТЬ ВТ_ЦеныНаборовПоКомплектующим.Номенклатура, ВТ_ЦеныНаборовПоКомплектующим.ХарактеристикаЦО ИЗ ВТ_ЦеныНаборовПоКомплектующим КАК ВТ_ЦеныНаборовПоКомплектующим)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровСоСкидкой КАК ВТ_ЦеныТоваровСоСкидкой
		|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныТоваровСоСкидкой.Номенклатура
		|			И ВТ_Сопоставление.ХарактеристикаЦО = ВТ_ЦеныТоваровСоСкидкой.ХарактеристикаЦО
		//+ ИнфоСофт Власова И.С. 16.01.25 УА #91286
		//|			И ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		|			И (ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		|				ИЛИ ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.ПустаяСсылка))
		//- ИнфоСофт Власова И.С. 16.01.25 УА #91286
		|			И НЕ (ВТ_Сопоставление.Номенклатура, ВТ_Сопоставление.ХарактеристикаЦО) В (ВЫБРАТЬ ВТ_ЦеныНаборовПоКомплектующим.Номенклатура, ВТ_ЦеныНаборовПоКомплектующим.ХарактеристикаЦО ИЗ ВТ_ЦеныНаборовПоКомплектующим КАК ВТ_ЦеныНаборовПоКомплектующим)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровМинимальная КАК ВТ_ЦеныТоваровМинимальная
		|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныТоваровМинимальная.Номенклатура
		|			И ВТ_Сопоставление.ХарактеристикаЦО = ВТ_ЦеныТоваровМинимальная.ХарактеристикаЦО
		//+ ИнфоСофт Власова И.С. 27.12.24 УА #90388
		//|			И НЕ ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		//+ ИнфоСофт Власова И.С. 16.01.25 УА #91286
		//|			И ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		|			И (ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		|				ИЛИ ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.ПустаяСсылка))
		//- ИнфоСофт Власова И.С. 16.01.25 УА #91286
		//- ИнфоСофт Власова И.С. 27.12.24 УА #90388
		|			И НЕ (ВТ_Сопоставление.Номенклатура, ВТ_Сопоставление.ХарактеристикаЦО) В (ВЫБРАТЬ ВТ_ЦеныНаборовПоКомплектующим.Номенклатура, ВТ_ЦеныНаборовПоКомплектующим.ХарактеристикаЦО ИЗ ВТ_ЦеныНаборовПоКомплектующим КАК ВТ_ЦеныНаборовПоКомплектующим)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровFBO КАК ВТ_ЦеныТоваровFBO
		|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныТоваровFBO.Номенклатура
		|			И ВТ_Сопоставление.ХарактеристикаЦО = ВТ_ЦеныТоваровFBO.ХарактеристикаЦО
		//+ ИнфоСофт Власова И.С. 16.01.25 УА #91286
		//|			И ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		|			И (ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
		|				ИЛИ ВТ_Сопоставление.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.ПустаяСсылка))
		//- ИнфоСофт Власова И.С. 16.01.25 УА #91286
		|			И НЕ (ВТ_Сопоставление.Номенклатура, ВТ_Сопоставление.ХарактеристикаЦО) В (ВЫБРАТЬ ВТ_ЦеныНаборовПоКомплектующим.Номенклатура, ВТ_ЦеныНаборовПоКомплектующим.ХарактеристикаЦО ИЗ ВТ_ЦеныНаборовПоКомплектующим КАК ВТ_ЦеныНаборовПоКомплектующим)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сопоставление.ПолеСопоставления КАК ПолеСопоставления,
		|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		|	ВТ_Сопоставление.Характеристика КАК Характеристика,
		|	ВТ_Сопоставление.ХарактеристикаЦО КАК ХарактеристикаЦО,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныНаборовПоКомплектующим.Цена, 0) КАК ЧИСЛО(10, 0)) КАК Цена,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныНаборовПоКомплектующим.ЦенаСоСкидкой, 0) КАК ЧИСЛО(10, 0)) ЦенаСоСкидкой,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныНаборовПоКомплектующим.ЦенаМинимальная, 0) КАК ЧИСЛО(10, 0)) ЦенаМинимальная,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныНаборовПоКомплектующим.ЦенаFBO, 0) КАК ЧИСЛО(10, 0)) ЦенаFBO
		|ПОМЕСТИТЬ ВТ_ЦеныОбъединенные
		|ИЗ
		|	ВТ_Сопоставление КАК ВТ_Сопоставление
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНаборовПоКомплектующим КАК ВТ_ЦеныНаборовПоКомплектующим
		|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_ЦеныНаборовПоКомплектующим.ПолеСопоставления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Сопоставление.ПолеСопоставления КАК ПолеСопоставления,
		|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		|	ВТ_Сопоставление.Характеристика КАК Характеристика,
		|	ВТ_Сопоставление.ХарактеристикаЦО КАК ХарактеристикаЦО,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныБезКомплектующих.Цена, 0) КАК ЧИСЛО(10, 0)) КАК Цена,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныБезКомплектующих.ЦенаСоСкидкой, 0) КАК ЧИСЛО(10, 0)) ЦенаСоСкидкой,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныБезКомплектующих.ЦенаМинимальная, 0) КАК ЧИСЛО(10, 0)) ЦенаМинимальная,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныБезКомплектующих.ЦенаFBO, 0) КАК ЧИСЛО(10, 0)) ЦенаFBO
		|ИЗ
		|	ВТ_Сопоставление КАК ВТ_Сопоставление
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныБезКомплектующих КАК ВТ_ЦеныБезКомплектующих
		|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_ЦеныБезКомплектующих.ПолеСопоставления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныОбъединенные.ПолеСопоставления КАК ПолеСопоставления,
		|	ВТ_ЦеныОбъединенные.Номенклатура КАК Номенклатура,
		|	ВТ_ЦеныОбъединенные.Характеристика КАК Характеристика,
		|	ВТ_ЦеныОбъединенные.ХарактеристикаЦО КАК ХарактеристикаЦО,
		|	СУММА(ВТ_ЦеныОбъединенные.Цена) КАК Цена,
		|	СУММА(ВТ_ЦеныОбъединенные.ЦенаСоСкидкой) ЦенаСоСкидкой,
		|	СУММА(ВТ_ЦеныОбъединенные.ЦенаМинимальная) ЦенаМинимальная,
		|	СУММА(ВТ_ЦеныОбъединенные.ЦенаFBO) ЦенаFBO
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	ВТ_ЦеныОбъединенные КАК ВТ_ЦеныОбъединенные
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныОбъединенные.Номенклатура,
		|	ВТ_ЦеныОбъединенные.Характеристика,
		|	ВТ_ЦеныОбъединенные.ПолеСопоставления,
		|	ВТ_ЦеныОбъединенные.ХарактеристикаЦО";
		//- ИнфоСофт Власова И.С. 11.12.24 УА #88633
		
	Иначе
		
		Текст = 	  
		//+ ИнфоСофт Власова И.С. 11.12.24 УА #88633
		//"ВЫБРАТЬ
		//|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		//|	ЦеныНоменклатуры.Характеристика КАК Характеристика,
		//|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена,
		//|	0 КАК ЦенаСоСкидкой,
		//|	0 КАК ЦенаМинимальная,
		//|	0 КАК ЦенаFBO
		//|ПОМЕСТИТЬ ВТ_ЦеныТоваров
		//|ИЗ
		//|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		//|			,
		//|			ВидЦены = &ВидЦены
		//|				И (Номенклатура, Характеристика) В
		//|					(ВЫБРАТЬ
		//|						ВТ.Номенклатура КАК Номенклатура,
		//|						ВТ.Характеристика КАК Характеристика
		//|					ИЗ
		//|						ВТ_Сопоставление КАК ВТ)) КАК ЦеныНоменклатуры
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ЦеныНоменклатурыСоСкидкой.Номенклатура,
		//|	ЦеныНоменклатурыСоСкидкой.Характеристика,
		//|	0,
		//|	ЕСТЬNULL(ЦеныНоменклатурыСоСкидкой.Цена, 0),
		//|	0,
		//|	0
		//|ИЗ
		//|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		//|			,
		//|			ВидЦены = &ВидЦеныСоСкидкой
		//|				И (Номенклатура, Характеристика) В
		//|					(ВЫБРАТЬ
		//|						ВТ.Номенклатура КАК Номенклатура,
		//|						ВТ.Характеристика КАК Характеристика
		//|					ИЗ
		//|						ВТ_Сопоставление КАК ВТ)) КАК ЦеныНоменклатурыСоСкидкой
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ЦеныМинимальныеСрезПоследних.Номенклатура,
		//|	ЦеныМинимальныеСрезПоследних.Характеристика,
		//|	0,
		//|	0,
		//|	ЕСТЬNULL(ЦеныМинимальныеСрезПоследних.Цена, 0),
		//|	0
		//|ИЗ
		//|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		//|			,
		//|			ВидЦены = &ВидЦеныМинимальный
		//|				И (Номенклатура, Характеристика) В
		//|					(ВЫБРАТЬ
		//|						ВТ.Номенклатура КАК Номенклатура,
		//|						ВТ.Характеристика КАК Характеристика
		//|					ИЗ
		//|						ВТ_Сопоставление КАК ВТ)) КАК ЦеныМинимальныеСрезПоследних
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ЦеныНоменклатурыFBO.Номенклатура,
		//|	ЦеныНоменклатурыFBO.Характеристика,
		//|	0,
		//|	0,
		//|	0,
		//|	ЕСТЬNULL(ЦеныНоменклатурыFBO.Цена, 0)
		//|ИЗ
		//|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		//|			,
		//|			ВидЦены = &ВидЦеныFBO
		//|				И (Номенклатура, Характеристика) В
		//|					(ВЫБРАТЬ
		//|						ВТ.Номенклатура КАК Номенклатура,
		//|						ВТ.Характеристика КАК Характеристика
		//|					ИЗ
		//|						ВТ_Сопоставление КАК ВТ)) КАК ЦеныНоменклатурыFBO
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_ЦеныТоваров.Номенклатура КАК Номенклатура,
		//|	ВТ_ЦеныТоваров.Характеристика КАК Характеристика,
		//|	СУММА(ВТ_ЦеныТоваров.Цена) КАК Цена,
		//|	СУММА(ВТ_ЦеныТоваров.ЦенаСоСкидкой) КАК ЦенаСоСкидкой,
		//|	СУММА(ВТ_ЦеныТоваров.ЦенаМинимальная) КАК ЦенаМинимальная,
		//|	СУММА(ВТ_ЦеныТоваров.ЦенаFBO) КАК ЦенаFBO
		//|ПОМЕСТИТЬ ВТ_ЦеныТоваровОбъединение
		//|ИЗ
		//|	ВТ_ЦеныТоваров КАК ВТ_ЦеныТоваров
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ЦеныТоваров.Номенклатура,
		//|	ВТ_ЦеныТоваров.Характеристика
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ИСТИНА КАК РассчитываетсяИзЦенКомплектующих,
		//|	ВариантыКомплектацииНоменклатуры.Владелец КАК Номенклатура,
		//|	ВариантыКомплектацииНоменклатуры.Характеристика КАК Характеристика,
		//|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК НоменклатураНабора,
		//|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК ХарактеристикаНабора,
		//|	ВЫБОР
		//|		КОГДА ВариантыКомплектацииНоменклатурыТовары.Упаковка.Числитель = 0
		//|			ТОГДА 1
		//|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка.Числитель, 1)
		//|	КОНЕЦ / ВЫБОР
		//|		КОГДА ВариантыКомплектацииНоменклатурыТовары.Упаковка.Знаменатель = 0
		//|			ТОГДА 1
		//|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка.Знаменатель, 1)
		//|	КОНЕЦ КАК КоэффициентУпаковки,
		//|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК КоличествоНабора
		//|ПОМЕСТИТЬ ВТ_СоставНаборов
		//|ИЗ
		//|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		//|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		//|		ПО ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
		//|ГДЕ
		//|	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)
		//|	И (ВариантыКомплектацииНоменклатуры.Владелец, ВариантыКомплектацииНоменклатуры.Характеристика) В
		//|			(ВЫБРАТЬ
		//|				ВТ.Номенклатура КАК Номенклатура,
		//|				ВТ.Характеристика КАК Характеристика
		//|			ИЗ
		//|				ВТ_Сопоставление КАК ВТ
		//|			ГДЕ
		//|				ВТ.ЭтоНабор)
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_СоставНаборов.РассчитываетсяИзЦенКомплектующих КАК РассчитываетсяИзЦенКомплектующих,
		//|	ВТ_СоставНаборов.Номенклатура КАК Номенклатура,
		//|	ВТ_СоставНаборов.Характеристика КАК Характеристика,
		//|	ВТ_СоставНаборов.НоменклатураНабора КАК НоменклатураНабора,
		//|	ВТ_СоставНаборов.ХарактеристикаНабора КАК ХарактеристикаНабора,
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 < 0
		//|				ТОГДА 0
		//|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|		КОНЕЦ) КАК Цена,
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСТЬNULL(ЦеныСоСкидкойСрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 < 0
		//|				ТОГДА 0
		//|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныСоСкидкойСрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|		КОНЕЦ) КАК ЦенаСоСкидкой,
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСТЬNULL(ЦеныМинимальныеСрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 < 0
		//|				ТОГДА 0
		//|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныМинимальныеСрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|		КОНЕЦ) КАК ЦенаМинимальная,
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСТЬNULL(ЦеныFBOСрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 < 0
		//|				ТОГДА 0
		//|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныFBOСрезПоследних.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора / ВТ_СоставНаборов.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|		КОНЕЦ) КАК ЦенаFBO
		//|ПОМЕСТИТЬ ВТ_ЦеныНаборовИтог
		//|ИЗ
		//|	ВТ_СоставНаборов КАК ВТ_СоставНаборов
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныСрезПоследних
		//|		ПО ВТ_СоставНаборов.НоменклатураНабора = ЦеныСрезПоследних.Номенклатура
		//|			И ВТ_СоставНаборов.ХарактеристикаНабора = ЦеныСрезПоследних.Характеристика
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦеныСоСкидкой) КАК ЦеныСоСкидкойСрезПоследних
		//|		ПО ВТ_СоставНаборов.НоменклатураНабора = ЦеныСоСкидкойСрезПоследних.Номенклатура
		//|			И ВТ_СоставНаборов.ХарактеристикаНабора = ЦеныСоСкидкойСрезПоследних.Характеристика
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦеныМинимальный) КАК ЦеныМинимальныеСрезПоследних
		//|		ПО ВТ_СоставНаборов.НоменклатураНабора = ЦеныМинимальныеСрезПоследних.Номенклатура
		//|			И ВТ_СоставНаборов.ХарактеристикаНабора = ЦеныМинимальныеСрезПоследних.Характеристика
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦеныFBO) КАК ЦеныFBOСрезПоследних
		//|		ПО ВТ_СоставНаборов.НоменклатураНабора = ЦеныFBOСрезПоследних.Номенклатура
		//|			И ВТ_СоставНаборов.ХарактеристикаНабора = ЦеныFBOСрезПоследних.Характеристика
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_СоставНаборов.Номенклатура,
		//|	ВТ_СоставНаборов.Характеристика,
		//|	ВТ_СоставНаборов.РассчитываетсяИзЦенКомплектующих,
		//|	ВТ_СоставНаборов.НоменклатураНабора,
		//|	ВТ_СоставНаборов.ХарактеристикаНабора
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_ЦеныНаборовИтог.РассчитываетсяИзЦенКомплектующих КАК РассчитываетсяИзЦенКомплектующих,
		//|	ВТ_ЦеныНаборовИтог.Номенклатура КАК Номенклатура,
		//|	ВТ_ЦеныНаборовИтог.Характеристика КАК Характеристика,
		//|	СУММА(ЕСТЬNULL(ВТ_ЦеныНаборовИтог.Цена, 0)) КАК Цена,
		//|	СУММА(ЕСТЬNULL(ВТ_ЦеныНаборовИтог.ЦенаСоСкидкой, 0)) КАК ЦенаСоСкидкой,
		//|	СУММА(ЕСТЬNULL(ВТ_ЦеныНаборовИтог.ЦенаМинимальная, 0)) КАК ЦенаМинимальная,
		//|	СУММА(ЕСТЬNULL(ВТ_ЦеныНаборовИтог.ЦенаFBO, 0)) КАК ЦенаFBO
		//|ПОМЕСТИТЬ ВТ_ЦеныНаборов
		//|ИЗ
		//|	ВТ_ЦеныНаборовИтог КАК ВТ_ЦеныНаборовИтог
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ЦеныНаборовИтог.РассчитываетсяИзЦенКомплектующих,
		//|	ВТ_ЦеныНаборовИтог.Номенклатура,
		//|	ВТ_ЦеныНаборовИтог.Характеристика
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_Сопоставление.ПолеСопоставления КАК ПолеСопоставления,
		//|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		//|	ВТ_Сопоставление.Характеристика КАК Характеристика,
		//|	ВЫБОР
		//|		КОГДА ВТ_Сопоставление.ЭтоНабор
		//|				И ВТ_ЦеныНаборов.РассчитываетсяИзЦенКомплектующих
		//|			ТОГДА ВТ_ЦеныНаборов.Цена
		//|		ИНАЧЕ ВТ_ЦеныТоваровОбъединение.Цена
		//|	КОНЕЦ КАК Цена,
		//|	ВЫБОР
		//|		КОГДА ВТ_Сопоставление.ЭтоНабор
		//|				И ВТ_ЦеныНаборов.РассчитываетсяИзЦенКомплектующих
		//|			ТОГДА ВТ_ЦеныНаборов.ЦенаСоСкидкой
		//|		ИНАЧЕ ВТ_ЦеныТоваровОбъединение.ЦенаСоСкидкой
		//|	КОНЕЦ КАК ЦенаСоСкидкой,
		//|	ВЫБОР
		//|		КОГДА ВТ_Сопоставление.ЭтоНабор
		//|				И ВТ_ЦеныНаборов.РассчитываетсяИзЦенКомплектующих
		//|			ТОГДА ВТ_ЦеныНаборов.ЦенаМинимальная
		//|		ИНАЧЕ ВТ_ЦеныТоваровОбъединение.ЦенаМинимальная
		//|	КОНЕЦ КАК ЦенаМинимальная,
		//|	ВЫБОР
		//|		КОГДА ВТ_Сопоставление.ЭтоНабор
		//|				И ВТ_ЦеныНаборов.РассчитываетсяИзЦенКомплектующих
		//|			ТОГДА ВТ_ЦеныНаборов.ЦенаFBO
		//|		ИНАЧЕ ВТ_ЦеныТоваровОбъединение.ЦенаFBO
		//|	КОНЕЦ КАК ЦенаFBO
		//|ПОМЕСТИТЬ ВТ_ЦеныОбъединение
		//|ИЗ
		//|	ВТ_Сопоставление КАК ВТ_Сопоставление
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровОбъединение КАК ВТ_ЦеныТоваровОбъединение
		//|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныТоваровОбъединение.Номенклатура
		//|			И ВТ_Сопоставление.Характеристика = ВТ_ЦеныТоваровОбъединение.Характеристика
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНаборов КАК ВТ_ЦеныНаборов
		//|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныНаборов.Номенклатура
		//|			И ВТ_Сопоставление.Характеристика = ВТ_ЦеныНаборов.Характеристика
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_Сопоставление.ПолеСопоставления КАК ПолеСопоставления,
		//|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		//|	ВТ_Сопоставление.Характеристика КАК Характеристика,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ВТ_ЦеныОбъединение.Цена, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
		//|			ТОГДА 0
		//|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныОбъединение.Цена, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|	КОНЕЦ КАК Цена,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ВТ_ЦеныОбъединение.ЦенаСоСкидкой, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
		//|			ТОГДА 0
		//|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныОбъединение.ЦенаСоСкидкой, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|	КОНЕЦ КАК ЦенаСоСкидкой,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ВТ_ЦеныОбъединение.ЦенаМинимальная, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
		//|			ТОГДА 0
		//|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныОбъединение.ЦенаМинимальная, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|	КОНЕЦ КАК ЦенаМинимальная,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ВТ_ЦеныОбъединение.ЦенаFBO, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
		//|			ТОГДА 0
		//|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныОбъединение.ЦенаFBO, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
		//|	КОНЕЦ КАК ЦенаFBO
		//|ПОМЕСТИТЬ ВТ_Цены
		//|ИЗ
		//|	ВТ_Сопоставление КАК ВТ_Сопоставление
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныОбъединение КАК ВТ_ЦеныОбъединение
		//|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_ЦеныОбъединение.ПолеСопоставления";
		
		"ВЫБРАТЬ
		|	ИСТИНА КАК РассчитываетсяИзЦенКомплектующих,
		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатуры.Характеристика КАК Характеристика,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК НоменклатураНабора,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК ХарактеристикаНабора,
		|	ВЫБОР
		|		КОГДА ВариантыКомплектацииНоменклатурыТовары.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ВариантыКомплектацииНоменклатурыТовары.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ВариантыКомплектацииНоменклатурыТовары.Упаковка.Знаменатель, 1)
		|	КОНЕЦ КАК КоэффициентУпаковки,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоНабора
		|ПОМЕСТИТЬ ВТ_СоставНаборов
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
		|ГДЕ
		|	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)
		|	И (ВариантыКомплектацииНоменклатуры.Владелец, ВариантыКомплектацииНоменклатуры.Характеристика) В
		|			(ВЫБРАТЬ
		|				ВТ.Номенклатура КАК Номенклатура,
		|				ВТ.Характеристика КАК Характеристика
		|			ИЗ
		|				ВТ_Сопоставление КАК ВТ
		|			ГДЕ
		|				ВТ.ЭтоНабор)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатуры.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена,
		|	0 КАК ЦенаСоСкидкой,
		|	0 КАК ЦенаМинимальная,
		|	0 КАК ЦенаFBO,
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатуры.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ЦеныНоменклатуры.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Упаковка.Знаменатель, 1)
		|	КОНЕЦ КАК КоэффициентУпаковкиЦена,
		|	0 КАК КоэффициентУпаковкиЦенаСоСкидкой,
		|	0 КАК КоэффициентУпаковкиЦенаМинимальная,
		|	0 КАК КоэффициентУпаковкиЦенаFBO
		|ПОМЕСТИТЬ ВТ_ЦеныТоваров
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			ВидЦены = &ВидЦены
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура КАК Номенклатура,
		|						ВТ.Характеристика КАК Характеристика
		|					ИЗ
		|						ВТ_Сопоставление КАК ВТ
		|
		|					ОБЪЕДИНИТЬ ВСЕ
		|
		|					ВЫБРАТЬ
		|						ВТ_СоставНаборов.НоменклатураНабора,
		|						ВТ_СоставНаборов.ХарактеристикаНабора
		|					ИЗ
		|						ВТ_СоставНаборов КАК ВТ_СоставНаборов)) КАК ЦеныНоменклатуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСоСкидкой.Номенклатура,
		|	ЦеныНоменклатурыСоСкидкой.Характеристика,
		|	0,
		|	ЕСТЬNULL(ЦеныНоменклатурыСоСкидкой.Цена, 0),
		|	0,
		|	0
		|	,
		|	0,
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатурыСоСкидкой.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСоСкидкой.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ЦеныНоменклатурыСоСкидкой.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСоСкидкой.Упаковка.Знаменатель, 1)
		|	КОНЕЦ,
		|	0,
		|	0
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			ВидЦены = &ВидЦеныСоСкидкой
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура КАК Номенклатура,
		|						ВТ.Характеристика КАК Характеристика
		|					ИЗ
		|						ВТ_Сопоставление КАК ВТ
		|
		|					ОБЪЕДИНИТЬ ВСЕ
		|
		|					ВЫБРАТЬ
		|						ВТ_СоставНаборов.НоменклатураНабора,
		|						ВТ_СоставНаборов.ХарактеристикаНабора
		|					ИЗ
		|						ВТ_СоставНаборов КАК ВТ_СоставНаборов)) КАК ЦеныНоменклатурыСоСкидкой
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЦеныМинимальныеСрезПоследних.Номенклатура,
		|	ЦеныМинимальныеСрезПоследних.Характеристика,
		|	0,
		|	0,
		|	ЕСТЬNULL(ЦеныМинимальныеСрезПоследних.Цена, 0),
		|	0
		|	,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ЦеныМинимальныеСрезПоследних.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныМинимальныеСрезПоследних.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ЦеныМинимальныеСрезПоследних.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныМинимальныеСрезПоследних.Упаковка.Знаменатель, 1)
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			ВидЦены = &ВидЦеныМинимальный
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура КАК Номенклатура,
		|						ВТ.Характеристика КАК Характеристика
		|					ИЗ
		|						ВТ_Сопоставление КАК ВТ
		|
		|					ОБЪЕДИНИТЬ ВСЕ
		|
		|					ВЫБРАТЬ
		|						ВТ_СоставНаборов.НоменклатураНабора,
		|						ВТ_СоставНаборов.ХарактеристикаНабора
		|					ИЗ
		|						ВТ_СоставНаборов КАК ВТ_СоставНаборов)) КАК ЦеныМинимальныеСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыFBO.Номенклатура,
		|	ЦеныНоменклатурыFBO.Характеристика,
		|	0,
		|	0,
		|	0,
		|	ЕСТЬNULL(ЦеныНоменклатурыFBO.Цена, 0)
		|	,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатурыFBO.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыFBO.Упаковка.Числитель, 1)
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ЦеныНоменклатурыFBO.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыFBO.Упаковка.Знаменатель, 1)
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			ВидЦены = &ВидЦеныFBO
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура КАК Номенклатура,
		|						ВТ.Характеристика КАК Характеристика
		|					ИЗ
		|						ВТ_Сопоставление КАК ВТ
		|
		|					ОБЪЕДИНИТЬ ВСЕ
		|
		|					ВЫБРАТЬ
		|						ВТ_СоставНаборов.НоменклатураНабора,
		|						ВТ_СоставНаборов.ХарактеристикаНабора
		|					ИЗ
		|						ВТ_СоставНаборов КАК ВТ_СоставНаборов)) КАК ЦеныНоменклатурыFBO
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныТоваров.Номенклатура КАК Номенклатура,
		|	ВТ_ЦеныТоваров.Характеристика КАК Характеристика,
		|	СУММА(ВТ_ЦеныТоваров.Цена) КАК Цена,
		|	СУММА(ВТ_ЦеныТоваров.ЦенаСоСкидкой) КАК ЦенаСоСкидкой,
		|	СУММА(ВТ_ЦеныТоваров.ЦенаМинимальная) КАК ЦенаМинимальная,
		|	СУММА(ВТ_ЦеныТоваров.ЦенаFBO) КАК ЦенаFBO,
		|	СУММА(ВТ_ЦеныТоваров.КоэффициентУпаковкиЦена) КАК КоэффициентУпаковкиЦена,
		|	СУММА(ВТ_ЦеныТоваров.КоэффициентУпаковкиЦенаСоСкидкой) КАК КоэффициентУпаковкиЦенаСоСкидкой,
		|	СУММА(ВТ_ЦеныТоваров.КоэффициентУпаковкиЦенаМинимальная) КАК КоэффициентУпаковкиЦенаМинимальная,
		|	СУММА(ВТ_ЦеныТоваров.КоэффициентУпаковкиЦенаFBO) КАК КоэффициентУпаковкиЦенаFBO
		|ПОМЕСТИТЬ ВТ_ЦеныТоваровОбъединениеЦен
		|ИЗ
		|	ВТ_ЦеныТоваров КАК ВТ_ЦеныТоваров
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныТоваров.Номенклатура,
		|	ВТ_ЦеныТоваров.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныТоваровОбъединениеЦен.Номенклатура КАК Номенклатура,
		|	ВТ_ЦеныТоваровОбъединениеЦен.Характеристика КАК Характеристика,
		|	ВТ_ЦеныТоваровОбъединениеЦен.Цена КАК Цена,
		|	ВТ_ЦеныТоваровОбъединениеЦен.ЦенаСоСкидкой КАК ЦенаСоСкидкой,
		|	ВТ_ЦеныТоваровОбъединениеЦен.ЦенаМинимальная КАК ЦенаМинимальная,
		|	ВТ_ЦеныТоваровОбъединениеЦен.ЦенаFBO КАК ЦенаFBO,
		|	ВЫБОР КОГДА ВТ_ЦеныТоваровОбъединениеЦен.КоэффициентУпаковкиЦена = 0 ТОГДА 1 ИНАЧЕ ВТ_ЦеныТоваровОбъединениеЦен.КоэффициентУпаковкиЦена КОНЕЦ КАК КоэффициентУпаковкиЦена,
		|	ВЫБОР КОГДА ВТ_ЦеныТоваровОбъединениеЦен.КоэффициентУпаковкиЦенаСоСкидкой = 0 ТОГДА 1 ИНАЧЕ ВТ_ЦеныТоваровОбъединениеЦен.КоэффициентУпаковкиЦенаСоСкидкой КОНЕЦ КАК КоэффициентУпаковкиЦенаСоСкидкой,
		|	ВЫБОР КОГДА ВТ_ЦеныТоваровОбъединениеЦен.КоэффициентУпаковкиЦенаМинимальная = 0 ТОГДА 1 ИНАЧЕ ВТ_ЦеныТоваровОбъединениеЦен.КоэффициентУпаковкиЦенаМинимальная КОНЕЦ КАК КоэффициентУпаковкиЦенаМинимальная,
		|	ВЫБОР КОГДА ВТ_ЦеныТоваровОбъединениеЦен.КоэффициентУпаковкиЦенаFBO = 0 ТОГДА 1 ИНАЧЕ ВТ_ЦеныТоваровОбъединениеЦен.КоэффициентУпаковкиЦенаFBO КОНЕЦ КАК КоэффициентУпаковкиЦенаFBO
		|ПОМЕСТИТЬ ВТ_ЦеныТоваровОбъединение
		|ИЗ
		|	ВТ_ЦеныТоваровОбъединениеЦен КАК ВТ_ЦеныТоваровОбъединениеЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СоставНаборов.РассчитываетсяИзЦенКомплектующих КАК РассчитываетсяИзЦенКомплектующих,
		|	ВТ_СоставНаборов.Номенклатура КАК Номенклатура,
		|	ВТ_СоставНаборов.Характеристика КАК Характеристика,
		|	ВТ_СоставНаборов.НоменклатураНабора КАК НоменклатураНабора,
		|	ВТ_СоставНаборов.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора 
		|					* ВТ_СоставНаборов.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦена, 1) - 0.5 < 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.Цена, 0) * ВТ_СоставНаборов.КоличествоНабора * ВТ_СоставНаборов.КоэффициентУпаковки
		|					 / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦена, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК Цена,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.ЦенаСоСкидкой, 0) * ВТ_СоставНаборов.КоличествоНабора 
		|					* ВТ_СоставНаборов.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦенаСоСкидкой, 1) - 0.5 < 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.ЦенаСоСкидкой, 0) * ВТ_СоставНаборов.КоличествоНабора * ВТ_СоставНаборов.КоэффициентУпаковки
		|					 / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦенаСоСкидкой, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК ЦенаСоСкидкой,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.ЦенаМинимальная, 0) * ВТ_СоставНаборов.КоличествоНабора 
		|					* ВТ_СоставНаборов.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦенаМинимальная, 1) - 0.5 < 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.ЦенаМинимальная, 0) * ВТ_СоставНаборов.КоличествоНабора * ВТ_СоставНаборов.КоэффициентУпаковки
		|					 / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦенаМинимальная, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК ЦенаМинимальная,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.ЦенаFBO, 0) * ВТ_СоставНаборов.КоличествоНабора 
		|					* ВТ_СоставНаборов.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦенаFBO, 1) - 0.5 < 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.ЦенаFBO, 0) * ВТ_СоставНаборов.КоличествоНабора * ВТ_СоставНаборов.КоэффициентУпаковки
		|					 / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦенаFBO, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК ЦенаFBO
		|ПОМЕСТИТЬ ВТ_ЦеныНаборовИтог
		|ИЗ
		|	ВТ_СоставНаборов КАК ВТ_СоставНаборов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровОбъединение КАК ВТ_ЦеныТоваровОбъединение
		|		ПО ВТ_СоставНаборов.НоменклатураНабора = ВТ_ЦеныТоваровОбъединение.Номенклатура
		|			И ВТ_СоставНаборов.ХарактеристикаНабора = ВТ_ЦеныТоваровОбъединение.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СоставНаборов.Номенклатура,
		|	ВТ_СоставНаборов.Характеристика,
		|	ВТ_СоставНаборов.РассчитываетсяИзЦенКомплектующих,
		|	ВТ_СоставНаборов.НоменклатураНабора,
		|	ВТ_СоставНаборов.ХарактеристикаНабора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныНаборовИтог.РассчитываетсяИзЦенКомплектующих КАК РассчитываетсяИзЦенКомплектующих,
		|	ВТ_ЦеныНаборовИтог.Номенклатура КАК Номенклатура,
		|	ВТ_ЦеныНаборовИтог.Характеристика КАК Характеристика,
		|	СУММА(ЕСТЬNULL(ВТ_ЦеныНаборовИтог.Цена, 0)) КАК Цена,
		|	СУММА(ЕСТЬNULL(ВТ_ЦеныНаборовИтог.ЦенаСоСкидкой, 0)) КАК ЦенаСоСкидкой,
		|	СУММА(ЕСТЬNULL(ВТ_ЦеныНаборовИтог.ЦенаМинимальная, 0)) КАК ЦенаМинимальная,
		|	СУММА(ЕСТЬNULL(ВТ_ЦеныНаборовИтог.ЦенаFBO, 0)) КАК ЦенаFBO
		|ПОМЕСТИТЬ ВТ_ЦеныНаборов
		|ИЗ
		|	ВТ_ЦеныНаборовИтог КАК ВТ_ЦеныНаборовИтог
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныНаборовИтог.РассчитываетсяИзЦенКомплектующих,
		|	ВТ_ЦеныНаборовИтог.Номенклатура,
		|	ВТ_ЦеныНаборовИтог.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сопоставление.ПолеСопоставления КАК ПолеСопоставления,
		|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		|	ВТ_Сопоставление.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ВТ_Сопоставление.ЭтоНабор
		|				И ВТ_ЦеныНаборов.РассчитываетсяИзЦенКомплектующих
		|			ТОГДА ВТ_ЦеныНаборов.Цена
		|		ИНАЧЕ 
		|			ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.Цена, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦена, 1) - 0.5 < 0
		|					ТОГДА 0
		|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.Цена, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦена, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|			КОНЕЦ 
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА ВТ_Сопоставление.ЭтоНабор
		|				И ВТ_ЦеныНаборов.РассчитываетсяИзЦенКомплектующих
		|			ТОГДА ВТ_ЦеныНаборов.ЦенаСоСкидкой
		|		ИНАЧЕ
		|			ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.ЦенаСоСкидкой, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦенаСоСкидкой, 1) - 0.5 < 0
		|					ТОГДА 0
		|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.ЦенаСоСкидкой, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦенаСоСкидкой, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаСоСкидкой,
		|	ВЫБОР
		|		КОГДА ВТ_Сопоставление.ЭтоНабор
		|				И ВТ_ЦеныНаборов.РассчитываетсяИзЦенКомплектующих
		|			ТОГДА ВТ_ЦеныНаборов.ЦенаМинимальная
		|		ИНАЧЕ
		|			ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.ЦенаМинимальная, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦенаМинимальная, 1) - 0.5 < 0
		|					ТОГДА 0
		|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.ЦенаМинимальная, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦенаМинимальная, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаМинимальная,
		|	ВЫБОР
		|		КОГДА ВТ_Сопоставление.ЭтоНабор
		|				И ВТ_ЦеныНаборов.РассчитываетсяИзЦенКомплектующих
		|			ТОГДА ВТ_ЦеныНаборов.ЦенаFBO
		|		ИНАЧЕ
		|			ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.ЦенаFBO, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦенаFBO, 1) - 0.5 < 0
		|					ТОГДА 0
		|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.ЦенаFBO, 0) * ВТ_Сопоставление.КоэффициентУпаковки / ЕСТЬNULL(ВТ_ЦеныТоваровОбъединение.КоэффициентУпаковкиЦенаFBO, 1) - 0.5 КАК ЧИСЛО(10, 0))
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаFBO
		|ПОМЕСТИТЬ ВТ_ЦеныОбъединение
		|ИЗ
		|	ВТ_Сопоставление КАК ВТ_Сопоставление
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныТоваровОбъединение КАК ВТ_ЦеныТоваровОбъединение
		|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныТоваровОбъединение.Номенклатура
		|			И ВТ_Сопоставление.Характеристика = ВТ_ЦеныТоваровОбъединение.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНаборов КАК ВТ_ЦеныНаборов
		|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ЦеныНаборов.Номенклатура
		|			И ВТ_Сопоставление.Характеристика = ВТ_ЦеныНаборов.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сопоставление.ПолеСопоставления КАК ПолеСопоставления,
		|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		|	ВТ_Сопоставление.Характеристика КАК Характеристика,
		|	ВЫРАЗИТЬ(Цена КАК ЧИСЛО(10, 0)) КАК Цена,
		|	ВЫРАЗИТЬ(ЦенаСоСкидкой КАК ЧИСЛО(10, 0)) ЦенаСоСкидкой,
		|	ВЫРАЗИТЬ(ЦенаМинимальная КАК ЧИСЛО(10, 0)) ЦенаМинимальная,
		|	ВЫРАЗИТЬ(ЦенаFBO КАК ЧИСЛО(10, 0)) ЦенаFBO
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	ВТ_Сопоставление КАК ВТ_Сопоставление
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныОбъединение КАК ВТ_ЦеныОбъединение
		|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_ЦеныОбъединение.ПолеСопоставления";
		//- ИнфоСофт Власова И.С. 11.12.24 УА #88633
		
	КонецЕсли;
	
	Текст = Текст + ";";
	
	Возврат Текст;	
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 14.10.24 УА #83503

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьТекстЗапросаЦен(Маркетплейс) Экспорт
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		Возврат ИС_WB_СерверУТ11_5.ПолучитьТекстЗапросаЦен();
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Возврат ИС_Ozon_Сервер.ПолучитьТекстЗапросаЦен();
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Возврат ИС_ЯМ_Сервер.ПолучитьТекстЗапросаЦен();
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		Возврат ИС_Сбер_Сервер.ПолучитьТекстЗапросаЦен();
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Возврат ИС_АЛИ_Сервер.ПолучитьТекстЗапросаЦен();
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	ОбщийМодуль = ИС_МП_Сервер.ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ПолучитьТекстЗапросаЦен();
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901
Процедура УстановитьПараметрыЗапросаЦен(Маркетплейс, Запрос, Профиль) Экспорт

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		ИС_WB_Сервер.УстановитьПараметрыЗапросаЦен(Запрос, Профиль);
		Возврат;
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		ИС_Ozon_Сервер.УстановитьПараметрыЗапросаЦен(Запрос, Профиль);
		Возврат;
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		ИС_ЯМ_Сервер.УстановитьПараметрыЗапросаЦен(Запрос, Профиль);
		Возврат;
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		ИС_Сбер_Сервер.УстановитьПараметрыЗапросаЦен(Запрос, Профиль);
		Возврат;
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		ИС_АЛИ_Сервер.УстановитьПараметрыЗапросаЦен(Запрос, Профиль);
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	ОбщийМодуль = ИС_МП_Сервер.ОбщийМодульМаркетплейса(Маркетплейс);
	ОбщийМодуль.УстановитьПараметрыЗапросаЦен(Запрос, Профиль);
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 03.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901
Функция ПолучитьЦеныFBS(Маркетплейс, Профиль) Экспорт

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		Возврат ИС_WB_Сервер.ПолучитьЦеныFBS(Профиль);
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Возврат ИС_Ozon_Сервер.ПолучитьЦеныFBS(Профиль);
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Возврат ИС_ЯМ_Сервер.ПолучитьЦеныFBS(Профиль);
	КонецЕсли;
    
    // У МегаМаркета нет метода API для получения цен
	//Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
	//	Возврат ИС_Сбер_Сервер.ПолучитьЦеныFBS(Профиль);
	//КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Возврат ИС_АЛИ_Сервер.ПолучитьЦеныFBS(Профиль);
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
		Возврат ИС_Ламода_Сервер.ПолучитьЦеныFBS(Профиль);
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
	Возврат Новый ТаблицаЗначений;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 15.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901
Функция ПолучитьПолеСопоставленияЦен(Маркетплейс) Экспорт

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		Возврат "РазмерWB";
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Возврат "НоменклатураOzon";
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Возврат "НоменклатураЯМ";
	КонецЕсли;
    
    Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		Возврат "НоменклатураСбер";
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Возврат "ВариацияAli";
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
		Возврат "РазмерЛамода";
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
	Возврат "";

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901
Функция ПолучитьПоляДляВидовЦен(Маркетплейс) Экспорт
	
	Результат = Новый Массив;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда	
		Результат.Добавить("ВидЦены");
		Результат.Добавить("ВидЦеныСоСкидкой");	
		Возврат Результат;
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Результат.Добавить("ВидЦены");
		Результат.Добавить("ВидЦеныСоСкидкой");
		Результат.Добавить("ВидЦеныМинимальный");
		Возврат Результат;	
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Результат.Добавить("ВидЦены");
		Результат.Добавить("ВидЦеныСоСкидкой");
		Возврат Результат;
	КонецЕсли;
    
    Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		Результат.Добавить("ВидЦены");
		Возврат Результат;	
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Результат.Добавить("ВидЦены");
		Результат.Добавить("ВидЦеныСоСкидкой");
		Возврат Результат;	
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
		Результат.Добавить("ВидЦены");
		Результат.Добавить("ВидЦеныСоСкидкой");
		Возврат Результат;	
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901
Процедура ЗаписатьРучнуюЦену(Профиль, Маркетплейс, КарточкаМП, Цена, ВидЦеныМаркетплейса) Экспорт		
	
	МенеджерЗаписи = РегистрыСведений.ИС_МП_РучныеЦены.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль				= Профиль;
	МенеджерЗаписи.Маркетплейс 			= Маркетплейс;
	МенеджерЗаписи.КарточкаМП 			= КарточкаМП;
	МенеджерЗаписи.ВидЦеныМаркетплейса 	= ВидЦеныМаркетплейса;
	МенеджерЗаписи.Прочитать();
			
	МенеджерЗаписи.Профиль 				= Профиль;
	МенеджерЗаписи.Маркетплейс 			= Маркетплейс;
	МенеджерЗаписи.КарточкаМП 			= КарточкаМП;
	МенеджерЗаписи.ВидЦеныМаркетплейса 	= ВидЦеныМаркетплейса;
	МенеджерЗаписи.Цена 				= Цена;

	МенеджерЗаписи.Записать(Истина);		
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901
Процедура ЗаписатьПоследнююВыгруженнуюЦену(Профиль, Маркетплейс, КарточкаМП, Цена, ВидЦеныМаркетплейса) Экспорт		
	
	МенеджерЗаписи = РегистрыСведений.ИС_МП_ПоследниеВыгруженныеЦены.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль				= Профиль;
	МенеджерЗаписи.Маркетплейс 			= Маркетплейс;
	МенеджерЗаписи.КарточкаМП 			= КарточкаМП;
	МенеджерЗаписи.ВидЦеныМаркетплейса 	= ВидЦеныМаркетплейса;
	МенеджерЗаписи.Прочитать();
			
	МенеджерЗаписи.Профиль 				= Профиль;
	МенеджерЗаписи.Маркетплейс 			= Маркетплейс;
	МенеджерЗаписи.КарточкаМП 			= КарточкаМП;
	МенеджерЗаписи.ВидЦеныМаркетплейса 	= ВидЦеныМаркетплейса;
	МенеджерЗаписи.Цена 				= Цена;

	МенеджерЗаписи.Записать(Истина);		
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901
Процедура УдалитьРучнуюЦену(Профиль, Маркетплейс, КарточкаМП, ВидЦеныМаркетплейса) Экспорт		
	
	МенеджерЗаписи = РегистрыСведений.ИС_МП_РучныеЦены.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль				= Профиль;
	МенеджерЗаписи.Маркетплейс 			= Маркетплейс;
	МенеджерЗаписи.КарточкаМП 			= КарточкаМП;
	МенеджерЗаписи.ВидЦеныМаркетплейса 	= ВидЦеныМаркетплейса;
	МенеджерЗаписи.Удалить();		
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
Функция ПолучитьПоляДляВыгрузки(Маркетплейс) Экспорт
	
	Результат = Новый Массив;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда	
		Результат.Добавить("РазмерWB");
		Результат.Добавить("nmId");	
		Возврат Результат;
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Результат.Добавить("НоменклатураOzon");
		Результат.Добавить("ProductId");
		Результат.Добавить("OfferId");
		Возврат Результат;	
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Результат.Добавить("НоменклатураЯМ");
		Результат.Добавить("shopSku");
		Возврат Результат;
	КонецЕсли;
    
    Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		Результат.Добавить("НоменклатураСбер");
		Результат.Добавить("offerID");
		Возврат Результат;	
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Результат.Добавить("ВариацияAli");
		Результат.Добавить("product_id");
		Результат.Добавить("КодВариации");
		Возврат Результат;	
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
		Результат.Добавить("РазмерЛамода");
		Результат.Добавить("SellerSKU");
		Возврат Результат;	
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
Процедура ЗаполнитьКолонкиТаблицыВыгрузкиЦен(Маркетплейс, ТаблицаЗначений) Экспорт
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда	
		
		ТаблицаЗначений.Колонки.Добавить("РазмерWB");
		ТаблицаЗначений.Колонки.Добавить("nmId"); 
		ТаблицаЗначений.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный)); 
		ТаблицаЗначений.Колонки.Добавить("Скидка", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
		ТаблицаЗначений.Колонки.Добавить("ЦенаСоСкидкой", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
		//+ ИнфоСофт Стояк Ю.К. 07.10.2024 УА #84967
		ТаблицаЗначений.Колонки.Добавить("ВыгружатьСкидку"); 
		//- ИнфоСофт Стояк Ю.К. 07.10.2024 УА #84967
		
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		
		ТаблицаЗначений.Колонки.Добавить("НоменклатураOzon"); 
		ТаблицаЗначений.Колонки.Добавить("ProductId");
		ТаблицаЗначений.Колонки.Добавить("OfferId");
		ТаблицаЗначений.Колонки.Добавить("Цена");
		ТаблицаЗначений.Колонки.Добавить("ЦенаСоСкидкой");
		ТаблицаЗначений.Колонки.Добавить("ЦенаМинимальная");
		
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
	    
	    ТаблицаЗначений.Колонки.Добавить("НоменклатураЯМ"); 
		ТаблицаЗначений.Колонки.Добавить("shopSku");
		ТаблицаЗначений.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
		ТаблицаЗначений.Колонки.Добавить("ЦенаСоСкидкой", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
		
	КонецЕсли;
    
    Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
				
		ТаблицаЗначений.Колонки.Добавить("НоменклатураСбер"); 
		ТаблицаЗначений.Колонки.Добавить("offerID");
		ТаблицаЗначений.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
			
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
	
		ТаблицаЗначений.Колонки.Добавить("ВариацияAli"); 
		ТаблицаЗначений.Колонки.Добавить("product_id", ОбщегоНазначения.ОписаниеТипаСтрока(30));
		ТаблицаЗначений.Колонки.Добавить("КодВариации", ОбщегоНазначения.ОписаниеТипаСтрока(30));
		ТаблицаЗначений.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
		ТаблицаЗначений.Колонки.Добавить("ЦенаСоСкидкой", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
		
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
	
		ТаблицаЗначений.Колонки.Добавить("РазмерЛамода"); 
		ТаблицаЗначений.Колонки.Добавить("SellerSKU",     ОбщегоНазначения.ОписаниеТипаСтрока(50));
		ТаблицаЗначений.Колонки.Добавить("Цена",          ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
		ТаблицаЗначений.Колонки.Добавить("ЦенаСоСкидкой", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
		
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901
Процедура ВыгрузитьЦены(Маркетплейс, Профиль, ТаблицаВыгрузки) Экспорт

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		ИС_WB_Сервер.ВыгрузитьЦены(Профиль, ТаблицаВыгрузки);
		Возврат;
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		ИС_Ozon_Сервер.ВыгрузитьЦены(Профиль, ТаблицаВыгрузки);
		Возврат;
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		ИС_ЯМ_Сервер.ВыгрузитьЦены(Профиль, ТаблицаВыгрузки);
		Возврат;
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		ИС_Сбер_Сервер.ВыгрузитьЦены(Профиль, ТаблицаВыгрузки);
		Возврат;
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		ИС_АЛИ_Сервер.ВыгрузитьЦены(Профиль, ТаблицаВыгрузки);
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
		ИС_Ламода_Сервер.ВыгрузитьЦены(Профиль, ТаблицаВыгрузки);
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 12.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 31.05.24 УА #66901
Функция ПроверитьПоследниеЦены(Маркетплейс, Выборка, НоваяСтрока) Экспорт
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда 
		
		Если Выборка.ЕстьПоследняяВыгруженнаяЦена И Выборка.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой 
			И Выборка.ЕстьПоследняяВыгруженнаяЦенаМинимальная
			И НоваяСтрока.Цена = Выборка.ПоследняяВыгруженнаяЦена 
			И НоваяСтрока.ЦенаСоСкидкой = Выборка.ПоследняяВыгруженнаяЦенаСоСкидкой
			И НоваяСтрока.ЦенаМинимальная = Выборка.ПоследняяВыгруженнаяЦенаМинимальная Тогда
			
			Возврат Ложь;	
			
		КонецЕсли;
		
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		
		Если Выборка.ЕстьПоследняяВыгруженнаяЦена И НоваяСтрока.Цена = Выборка.ПоследняяВыгруженнаяЦена Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Если Выборка.ЕстьПоследняяВыгруженнаяЦена И НоваяСтрока.Цена = Выборка.ПоследняяВыгруженнаяЦена
			И Выборка.ЕстьПоследняяВыгруженнаяЦенаСоСкидкой И НоваяСтрока.ЦенаСоСкидкой = Выборка.ПоследняяВыгруженнаяЦенаСоСкидкой Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 31.05.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьСписокПараметровЦен(Маркетплейс) Экспорт
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		Возврат ИС_WB_Сервер.ПолучитьСписокПараметровЦен();
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Возврат ИС_Ozon_Сервер.ПолучитьСписокПараметровЦен();
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Возврат ИС_ЯМ_Сервер.ПолучитьСписокПараметровЦен();
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		Возврат ИС_Сбер_Сервер.ПолучитьСписокПараметровЦен();
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Возврат ИС_АЛИ_Сервер.ПолучитьСписокПараметровЦен();
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
		Возврат ИС_Ламода_Сервер.МассивНастроекЦен();
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьСтруктуруПараметровЦен(Маркетплейс) Экспорт
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		Возврат ИС_WB_Сервер.ПолучитьСтруктуруПараметровЦен();
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Возврат ИС_Ozon_Сервер.ПолучитьСтруктуруПараметровЦен();
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Возврат ИС_ЯМ_Сервер.ПолучитьСтруктуруПараметровЦен();
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		Возврат ИС_Сбер_Сервер.ПолучитьСтруктуруПараметровЦен();
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Возврат ИС_АЛИ_Сервер.ПолучитьСтруктуруПараметровЦен();
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	ОбщийМодуль = ИС_МП_Сервер.ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ПолучитьСтруктуруПараметровЦен();
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901   
Процедура ПолучитьРеквизитыЦен(Профиль, Объект) Экспорт
	
	МассивМаркетплейсов = ИС_MP_Сервер.ПолучитьМаркетплейсы();
	
	Для Каждого ТекМаркетплейс Из МассивМаркетплейсов Цикл 
		
		Маркетплейс = ИС_MP_Сервер.ПолучитьНаименованиеМаркетплейса(ТекМаркетплейс); 
		
		МассивНастроек = ИС_МП_УправлениеЦенами.ПолучитьСписокПараметровЦен(ТекМаркетплейс);
		
		СтруктураНастроекПрофиля = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, ТекМаркетплейс, МассивНастроек);
		
		Для Каждого Элемент Из СтруктураНастроекПрофиля Цикл
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, Маркетплейс + Элемент.Ключ) Тогда 
				Объект[Маркетплейс + Элемент.Ключ] = СтруктураНастроекПрофиля[Элемент.Ключ];
			КонецЕсли;	
			
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 26.04.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ЗаписатьРеквизитыЦен(Профиль, Объект) Экспорт
	
	МассивМаркетплейсов = ИС_MP_Сервер.ПолучитьМаркетплейсы();
	
	Для Каждого ТекМаркетплейс Из МассивМаркетплейсов Цикл 
		
		Маркетплейс = ИС_MP_Сервер.ПолучитьНаименованиеМаркетплейса(ТекМаркетплейс);
		
		СтруктураНастроек = ИС_МП_УправлениеЦенами.ПолучитьСтруктуруПараметровЦен(ТекМаркетплейс);
		
		Для Каждого Элемент Из СтруктураНастроек Цикл
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, Маркетплейс + Элемент.Ключ) Тогда 
				СтруктураНастроек[Элемент.Ключ] = Объект[Маркетплейс + Элемент.Ключ];
			КонецЕсли;	
			
		КонецЦикла;

		ИС_MP_Сервер.ЗаписатьЗначениеНастроек(Профиль, ТекМаркетплейс, СтруктураНастроек);
	
	КонецЦикла;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

//+ ИнфоСофт Мурсалимов Д.Р. 15.08.24 УА #81483
Функция РассчитатьЦеныНаборов(Профиль, ПеречислениеМП, ВыборкаЦен) Экспорт
		
	Результат = Новый Структура;
	
	МассивПараметров = ПолучитьСписокПараметровЦен(ПеречислениеМП);
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивПараметров);
	
	СтруктураЦен = ПолучитьСтруктуруПараметровЦен(ПеречислениеМП);
	
	ЗаполнитьЗначенияСвойств(СтруктураЦен, Результат);
	
	Если ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		
		ЦенаНабора 			= РассчитатьЦенуНабора(ВыборкаЦен, СтруктураЦен.ВидЦены, "Цена");
		ЦенаНабораСоСкидкой = РассчитатьЦенуНабора(ВыборкаЦен, СтруктураЦен.ВидЦеныСоСкидкой, "ЦенаСоСкидкой");
		
		//+ ИнфоСофт Заварин К.В. 03.09.24 УА #72696
		ЦенаНабораFBO 		= РассчитатьЦенуНабора(ВыборкаЦен, СтруктураЦен.ВидЦеныFBO, "ЦенаFBO");
		//- ИнфоСофт Заварин К.В. 03.09.24 УА #72696 
		
		Результат.Вставить("Цена", 				ЦенаНабора);
		Результат.Вставить("ЦенаСоСкидкой", 	ЦенаНабораСоСкидкой);
		
		//+ ИнфоСофт Заварин К.В. 03.09.24 УА #72696
		Результат.Вставить("ЦенаFBO", 			ЦенаНабораFBO);
		//- ИнфоСофт Заварин К.В. 03.09.24 УА #72696	
		
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда

		ЦенаНабора 				= РассчитатьЦенуНабора(ВыборкаЦен, СтруктураЦен.ВидЦены, "Цена");
		ЦенаНабораСоСкидкой 	= РассчитатьЦенуНабора(ВыборкаЦен, СтруктураЦен.ВидЦеныСоСкидкой, "ЦенаСоСкидкой");
		ЦенаНабораМинимальная 	= РассчитатьЦенуНабора(ВыборкаЦен, СтруктураЦен.ВидЦеныМинимальный, "ЦенаМинимальная");
		
		Результат.Вставить("Цена", 				ЦенаНабора);
		Результат.Вставить("ЦенаСоСкидкой", 	ЦенаНабораСоСкидкой);
		Результат.Вставить("ЦенаМинимальная", 	ЦенаНабораМинимальная);	
		
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		
		ЦенаНабора 				= РассчитатьЦенуНабора(ВыборкаЦен, СтруктураЦен.ВидЦены, "Цена");
		ЦенаНабораСоСкидкой 	= РассчитатьЦенуНабора(ВыборкаЦен, СтруктураЦен.ВидЦеныСоСкидкой, "ЦенаСоСкидкой");	
		
		Результат.Вставить("Цена", 				ЦенаНабора);
		Результат.Вставить("ЦенаСоСкидкой", 	ЦенаНабораСоСкидкой);
		
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		
		ЦенаНабора 				= РассчитатьЦенуНабора(ВыборкаЦен, СтруктураЦен.ВидЦены, "Цена");
		
		Результат.Вставить("Цена", 				ЦенаНабора);
		
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		
		ЦенаНабора 				= РассчитатьЦенуНабора(ВыборкаЦен, СтруктураЦен.ВидЦены, "Цена");
		ЦенаНабораСоСкидкой 	= РассчитатьЦенуНабора(ВыборкаЦен, СтруктураЦен.ВидЦеныСоСкидкой, "ЦенаСоСкидкой");
		
		Результат.Вставить("Цена", ЦенаНабора);
		Результат.Вставить("ЦенаСоСкидкой", ЦенаНабораСоСкидкой); 	
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	ИначеЕсли ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
		
		ЦенаНабора 				= РассчитатьЦенуНабора(ВыборкаЦен, СтруктураЦен.ВидЦены,          "Цена");
		ЦенаНабораСоСкидкой 	= РассчитатьЦенуНабора(ВыборкаЦен, СтруктураЦен.ВидЦеныСоСкидкой, "ЦенаСоСкидкой");
		
		Результат.Вставить("Цена",          ЦенаНабора);
		Результат.Вставить("ЦенаСоСкидкой", ЦенаНабораСоСкидкой);
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 15.08.24 УА #81483

//+ ИнфоСофт Мурсалимов Д.Р. 16.08.24 УА #81483
Функция РассчитатьЦенуНабора(ВыборкаЦен, ВидЦены, ЦенаПоВидуЦен)

	Валюта = Неопределено;
	ИС_МП_УправлениеЗаказами.ОбработатьВалютуXML(Валюта, "643");
	
	Результат = 0;
	
	Цена = ВыборкаЦен[ЦенаПоВидуЦен];
	
	ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
	ПараметрыКомплектующих.Номенклатура   			= ВыборкаЦен.Номенклатура;
	ПараметрыКомплектующих.НоменклатураНабора   	= ВыборкаЦен.Номенклатура;
	ПараметрыКомплектующих.ХарактеристикаНабора 	= ВыборкаЦен.Характеристика;				
	ПараметрыКомплектующих.КоличествоУпаковок		= 1;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Дата",  		ТекущаяДатаСеанса());
	ДополнительныеПараметры.Вставить("Валюта",		Валюта);
	ДополнительныеПараметры.Вставить("Цена",		Цена);
	ДополнительныеПараметры.Вставить("ВидЦены",		ВидЦены);
	
	//ПодобранныеТовары = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
	ПодобранныеТовары = НаборыВызовСервера.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
	
	ЦенаНабора = 0;
	
	Для Каждого Элемент Из ПодобранныеТовары Цикл		
		ЦенаНабора = Элемент.Цена * Элемент.КоличествоУпаковок + ЦенаНабора;		
	КонецЦикла; 
	
	Если ЦенаНабора > 0 Тогда
		Результат = ЦенаНабора;  
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 16.08.24 УА #81483

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
