
//+ ИнфоСофт Ивонин К.А. 19.12.22 УА #52439
Процедура ЗаписатьСообщениеСИзменениями(Путь) Экспорт

	Сообщение = Новый СообщениеПользователю;	
	Сообщение.Текст = "Начало выгрузки в узел " + Строка(ЭтотОбъект);	
	Сообщение.Сообщить();
	
	// Сформировать имя временного файла.	
	ИмяФайла = Путь + "/Message" + СокрЛП(ПланыОбмена.ИС_WB_ПланОбмена.ЭтотУзел().Код) + "_" + СокрЛП(Ссылка.Код) + ".xml";
		
	ЗаписьXML = Новый ЗаписьXML;	
	ЗаписьXML.ОткрытьФайл(ИмяФайла);	
	ЗаписьXML.ЗаписатьОбъявлениеXML();	
		
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();	
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Ссылка);	
	Сообщение = Новый СообщениеПользователю;	
	Сообщение.Текст = "Номер сообщения: " + ЗаписьСообщения.НомерСообщения;	
	Сообщение.Сообщить();	
	
	// Получить выборку измененных данных	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель,ЗаписьСообщения.НомерСообщения);
	
	Пока ВыборкаИзменений.Следующий() Цикл					
		ЗаписатьXML(ЗаписьXML, ВыборкаИзменений.Получить());	
	КонецЦикла;
		
	ЗаписьСообщения.ЗакончитьЗапись();
	
	ЗаписьXML.Закрыть();
		
	Сообщение = Новый СообщениеПользователю;	
	Сообщение.Текст = "Выгрузка завершена";	
	Сообщение.Сообщить();

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.12.22 УА #52439  

//+ ИнфоСофт Ивонин К.А. 19.12.22 УА #52439
Процедура ПрочитатьСообщениеСИзменениями(Путь) Экспорт

	Каталог = КаталогВременныхФайлов();
		
	ИмяФайла = Путь + "/" + "Message" + СокрЛП(Ссылка.Код) + "_" + СокрЛП(ПланыОбмена.ИС_WB_ПланОбмена.ЭтотУзел().Код) + ".xml";
	
	Файл = Новый Файл(ИмяФайла);
	
	Если Не Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
			
	// Попытаться открыть файл.	
	ЧтениеXML = Новый ЧтениеXML;
	
	Попытка		
		ЧтениеXML.ОткрытьФайл(ИмяФайла);				
	Исключение
		
		Сообщение = Новый СообщениеПользователю;		
		Сообщение.Текст = "Невозможно открыть файл обмена данными.";		
		Сообщение.Сообщить();				
		Возврат;
		
	КонецПопытки;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Начало загрузки из " + Строка(ЭтотОбъект);
	Сообщение.Сообщить();
	Сообщение = Новый СообщениеПользователю;	
	Сообщение.Текст = "Считывается файл " + ИмяФайла;	
	Сообщение.Сообщить();
		
	// Загрузить из найденного файла
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
		
	ЧтениеСообщения.НачатьЧтение(ЧтениеXML);

	// Сообщение предназначено не для этого узла.
	Если ЧтениеСообщения.Отправитель <> Ссылка Тогда		
		ВызватьИсключение "Неверный узел";			
	КонецЕсли;	
	
	// Удаляем регистрацию изменений для узла отправителя сообщения	
	ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
	
	Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
				
		Данные = ПрочитатьXML(ЧтениеXML);
			
		// Не переносим изменение, полученное в главный из неглавного, если есть регистрация изменения.	
		Если Не ЧтениеСообщения.Отправитель.Главный И ПланыОбмена.ИзменениеЗарегистрировано(ЧтениеСообщения.Отправитель, Данные) Тогда
	
			Сообщение = Новый СообщениеПользователю;	
			Сообщение.Текст = " - Изменения отклонены";	
			Сообщение.Сообщить();
			Продолжить;
				
		КонецЕсли;
		
		// Записать полученные данные.	
		Данные.ОбменДанными.Отправитель = ЧтениеСообщения.Отправитель;
		Данные.ОбменДанными.Загрузка = Истина;	
		Данные.Записать();
	
	КонецЦикла;
	
	ЧтениеСообщения.ЗакончитьЧтение();	
	ЧтениеXML.Закрыть();
	УдалитьФайлы(ИмяФайла);
		
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Загрузка завершена";	
	Сообщение.Сообщить();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.12.22 УА #52439