#Область ОбработчикиСобытий

//+ ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97272
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		
		Префикс = ТекЗапись.Префикс; 
		
		Для Сч = 1 По СтрДлина(Префикс) Цикл
			Код = КодСимвола(Префикс, Сч);
			Если Код > 1039 И Код < 1103 Тогда
				ОбщегоНазначения.СообщитьПользователю("Недопустимо использовать русские символы в префиксе коробки!");
				Отказ = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;  
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97272

#КонецОбласти