
#Область СлужебныйПрограммныйИнтерфейс

#Область FBS

//+ ИнфоСофт Ивонин К.А. 13.08.23 УА #61542
// order/search
Функция ПолучитьСписокОтправлений(Профиль, ПараметрыЗапроса, Data) Экспорт
    
    ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
	
	ПараметрыЗапроса.АдресРесурса = "/api/market/v1/orderService/order/search";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
	
	Data.dateFrom = ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(Data.dateFrom, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата);
	
	Если Data.dateTo = Неопределено Тогда
		Data.Удалить("dateTo");
	Иначе 
		Data.dateTo = ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(Data.dateTo, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата);	
	КонецЕсли;
	
	Если Data.statuses.Количество() = 0 Тогда
		Data.Удалить("statuses");
	КонецЕсли;
		
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("meta", Новый Структура);	
	ТелоЗапроса.Вставить("data", Data); 
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			Возврат РазобратьHTTPОтвет(РезультатЗапроса.Ответ);					
		Иначе
			
			Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
				РезультатЗапроса.КодОтвета, РезультатЗапроса.Ответ);			
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.08.23 УА #61542

//+ ИнфоСофт Ивонин К.А. 13.08.23 УА #61542
// order/get
Функция ПолучитьОтправления(Профиль, ПараметрыЗапроса, Data) Экспорт

	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		
	ПараметрыЗапроса.АдресРесурса = "/api/market/v1/orderService/order/get";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
		
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("meta", Новый Структура);	
	ТелоЗапроса.Вставить("data", Data); 
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			Возврат РазобратьHTTPОтвет(РезультатЗапроса.Ответ);					
		Иначе
			
			Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
				РезультатЗапроса.КодОтвета, РезультатЗапроса.Ответ);			
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.08.23 УА #61542

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
// order/confirm
Функция ПодтвердитьЛотыВОтрпавлении(Профиль, ПараметрыЗапроса, Data) Экспорт

	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		
	ПараметрыЗапроса.АдресРесурса = "/api/market/v1/orderService/order/confirm";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
		
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("meta", Новый Структура);	
	ТелоЗапроса.Вставить("data", Data); 
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			Возврат РазобратьHTTPОтвет(РезультатЗапроса.Ответ);					
		Иначе
			
			Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
				РезультатЗапроса.КодОтвета, РезультатЗапроса.Ответ);			
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
// order/packing
Функция ПодтвердитьКомплектацию(Профиль, ПараметрыЗапроса, Data) Экспорт

	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		
	ПараметрыЗапроса.АдресРесурса = "/api/market/v1/orderService/order/packing";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
		
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("meta", Новый Структура);	
	ТелоЗапроса.Вставить("data", Data); 
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			Возврат РазобратьHTTPОтвет(РезультатЗапроса.Ответ);					
		Иначе
			
			Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
				РезультатЗапроса.КодОтвета, РезультатЗапроса.Ответ);			
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
// order/reject
Функция ОтменитьЛотыВОтрпавлении(Профиль, ПараметрыЗапроса, Data) Экспорт

	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		
	ПараметрыЗапроса.АдресРесурса = "/api/market/v1/orderService/order/reject";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
		
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("meta", Новый Структура);	
	ТелоЗапроса.Вставить("data", Data); 
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			Возврат РазобратьHTTPОтвет(РезультатЗапроса.Ответ);					
		Иначе
			
			Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
				РезультатЗапроса.КодОтвета, РезультатЗапроса.Ответ);			
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
// order/shipping
Функция ПодтвердитьОтгрузку(Профиль, ПараметрыЗапроса, Data) Экспорт

	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		
	ПараметрыЗапроса.АдресРесурса = "/api/market/v1/orderService/order/shipping";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
		
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("meta", Новый Структура);	
	ТелоЗапроса.Вставить("data", Data); 
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			Возврат РазобратьHTTPОтвет(РезультатЗапроса.Ответ);					
		Иначе
			
			Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
				РезультатЗапроса.КодОтвета, РезультатЗапроса.Ответ);			
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
// sticker/print
Функция ПолучитьЭтикетки(Профиль, ПараметрыЗапроса, Data) Экспорт

	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		
	ПараметрыЗапроса.АдресРесурса = "/api/market/v1/orderService/sticker/print";
	ПараметрыЗапроса.ФорматОтвета = "ДвоичныеДанные";
		
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("meta", Новый Структура);	
	ТелоЗапроса.Вставить("data", Data); 
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
		
			// >_< тут даже заголовкам доверять нельзя ='(
			Если Лев(РезультатЗапроса.Ответ, 2) = "7B" Тогда
				Возврат РазобратьHTTPОтвет(РезультатЗапроса.Ответ);
			Иначе
				Возврат РезультатЗапроса.Ответ;
			КонецЕсли;
								
		Иначе
			
			Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
				РезультатЗапроса.КодОтвета, РезультатЗапроса.Ответ);			
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;	

КонецФункции //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

#КонецОбласти

#Область ЦеныИОстатки

//+ ИнфоСофт Ивонин К.А. 08.03.24 УА #66733
// stock/update
Функция ВыгрузитьОстатки(Профиль, ПараметрыЗапроса, Data) Экспорт

	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		
	ПараметрыЗапроса.АдресРесурса = "/api/merchantIntegration/v1/offerService/stock/update";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
		
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("meta", Новый Структура);	
	ТелоЗапроса.Вставить("data", Data); 
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			Возврат РазобратьHTTPОтвет(РезультатЗапроса.Ответ);					
		Иначе
			
			Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
				РезультатЗапроса.КодОтвета, РезультатЗапроса.Ответ);			
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 08.03.24 УА #66733

//+ ИнфоСофт Ивонин К.А. 08.03.24 УА #66733
// manualPrice/save
Функция ВыгрузитьЦены(Профиль, ПараметрыЗапроса, Data) Экспорт

	ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса);
		
	ПараметрыЗапроса.АдресРесурса = "/api/merchantIntegration/v1/offerService/manualPrice/save";
	ПараметрыЗапроса.ФорматОтвета = "Строка";
		
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("meta", Новый Структура);	
	ТелоЗапроса.Вставить("data", Data); 
	
	ПараметрыЗапроса.ТелоСтрока = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ТелоЗапроса);
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьPOSTЗапрос(ПараметрыЗапроса);
	
	ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_МетодыHTTP.POST, ПараметрыЗапроса, РезультатЗапроса);
	
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
			Возврат РазобратьHTTPОтвет(РезультатЗапроса.Ответ);					
		Иначе
			
			Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
				РезультатЗапроса.КодОтвета, РезультатЗапроса.Ответ);			
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Возврат Неопределено;
		
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 08.03.24 УА #66733

#КонецОбласти

//+ ИнфоСофт Ивонин К.А. 22.08.23 УА #55166
Функция ПолучитьСтруктуруЗапросаСпискаОтправлений() Экспорт
    
    Результат = Новый Структура;
    
    Результат.Вставить("token", "");
    Результат.Вставить("dateFrom", Дата(1, 1, 1));
    Результат.Вставить("dateTo", Дата(1, 1, 1));
    Результат.Вставить("count", 1);
    Результат.Вставить("statuses", Новый Массив);

	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 22.08.23 УА #55166

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
Процедура ЗаполнитьЗаголовкиHTTP(ПараметрыЗапроса)
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type", "application/json");	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 13.08.23 УА #61542
Функция РазобратьHTTPОтвет(Ответ)

	JSON = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьОбъектJSON(Ответ);
						
	Попытка
	
		Если ТипЗнч(JSON) = Тип("Структура") Тогда
			
			Если JSON.Свойство("success") Тогда
			
				Если JSON.success = 1 Тогда
				
					Возврат JSON.data;
				
				ИначеЕсли JSON.success = 0 Тогда
					
					Текст = СтрШаблон("Произошла ошибка запроса: %1 (%2)", JSON.error.message, JSON.error.code);
					ОбщегоНазначения.СообщитьПользователю(Текст);
					Возврат Неопределено;		
				
				КонецЕсли;
			
			КонецЕсли;

		КонецЕсли;
		
	Исключение
	КонецПопытки;

	Текст = СтрШаблон("Получен нераспознанный ответ от сервера: %1", Ответ);
	ОбщегоНазначения.СообщитьПользователю(Текст);
	Возврат Неопределено;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.08.23 УА #61542

//+ ИнфоСофт Ивонин К.А. 13.08.23 УА #61542
Процедура ЗаписатьДанныеОтладки(Профиль, Метод, ПараметрыЗапроса, РезультатЗапроса)
       
	Если Не Профиль.РежимОтладки Тогда
		Возврат;
	КонецЕсли;
	
	ИС_MP_Сервер.ЗаписатьДанныеОтладки(Профиль, Перечисления.ИС_МП_Маркетплейсы.Сбер, Метод, ПараметрыЗапроса, РезультатЗапроса);	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.08.23 УА #61542

#КонецОбласти
