
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Имя") Тогда
		Поле = Параметры.Имя;
	КонецЕсли;
	
	Если Параметры.Свойство("Справочник") Тогда
		Справочник = Параметры.Справочник;
	КонецЕсли;
	
	Если Параметры.Свойство("МаксимальноеКоличество") Тогда
		МаксимальноеКоличество = Параметры.МаксимальноеКоличество;
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоЧисло") Тогда
		ЭтоЧисло = Параметры.ЭтоЧисло;
	КонецЕсли;

	Если Параметры.Свойство("Профиль") Тогда
		
		Если Параметры.Профиль.Пустая() Тогда 
			
			ОбщегоНазначения.СообщитьПользователю("Не был выбран Профиль, авто подбор не доступен!");
			АвтоПодборДоступен = Ложь;
			
		Иначе
			Профиль = Параметры.Профиль;
			АвтоПодборДоступен = Истина;
		КонецЕсли;	
		
	КонецЕсли;
	
	Если Параметры.Свойство("АвтоПодбор") Тогда
    	АвтоПодборДоступен = Параметры.АвтоПодбор;
	КонецЕсли;

	Если Параметры.Свойство("Категория") Тогда
		Категория = Параметры.Категория;
	КонецЕсли; 
	
	Если Параметры.Свойство("Значение") Тогда
	
		Для Каждого Элемент Из Параметры.Значение Цикл
			НоваяСтрока = СписокВыбора.Добавить();
			НоваяСтрока.Значение = Элемент.Значение;
		КонецЦикла;
	
	КонецЕсли;
	
	Если Справочник = "" Тогда
		АвтоПодборДоступен = Ложь;
	Иначе
	
		СписокЗначений = ИС_WB_Сервер.ПолучитьЗначенияХарактеристики(Профиль, Справочник);
		Если СписокЗначений <> Неопределено Тогда
			Элементы.СписокВыбораЗначение.РежимВыбораИзСписка = Истина;
			Элементы.СписокВыбораЗначение.СписокВыбора.ЗагрузитьЗначения(СписокЗначений.ВыгрузитьЗначения()); 
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаКлиенте
Процедура СписокВыбораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если СписокВыбора.Количество() >= МаксимальноеКоличество Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Достигнуто максимальное количество элементов для данного поля!");	
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
// Отключен обработчик в версии API 3.0, текстовый поиск доступен только для ТНВЭД.
// Соответственно все остальные возвращаются фиксированным списком при создании формы.
&НаКлиенте
Процедура СписокВыбораЗначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    
    Если Не ЗначениеЗаполнено(Справочник) Тогда
    	Возврат;
    КонецЕсли;
    
    Если Справочник = "colors" Или Справочник = "seasons" Тогда
    	Возврат;
    КонецЕсли;
    
	Если АвтоПодборДоступен Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьСписокПодбора(Профиль, Категория, Справочник, Текст);
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаКлиенте
Процедура ВыборЗавершение(Команда)

	Если СписокВыбора.Количество() = 0 Тогда
		ОповеститьОВыборе(Новый СписокЗначений);
	Иначе
	
		СписокЗначений = Новый СписокЗначений;
		
		Для Каждого Строка Из СписокВыбора Цикл
			СписокЗначений.Добавить(Строка.Значение);
		КонецЦикла;
	
		ОповеститьОВыборе(СписокЗначений);
		
	КонецЕсли;	
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаКлиенте
Процедура Отмена(Команда)
	ОповеститьОВыборе(Неопределено);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 11.10.21 УА #38646
&НаСервереБезКонтекста
Функция ПолучитьСписокПодбора(Профиль, Категория, Справочник, Текст)    
    Возврат ИС_WB_Сервер.ПолучитьЗначенияХарактеристики(Профиль, Справочник, Текст, Категория);	
КонецФункции //- ИнфоСофт Ивонин К.А. 11.10.21 УА #38646

#КонецОбласти
